{
    "id": "eea3393dd4e44cc0b14d3b33c3616d305472da22",
    "meta": {
        "filename": "dod-2015_RDTE_2015_AIRFORCE_V1_RDTE_JustificationBook_Air_Force_PB_2015.zzz_unzipped_RDTE_JustificationBook_Air_Force_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602788F"
        },
        "ProgramElementTitle": {
            "val": "Dominant Information Sciences and Methods"
        },
        "R1LineNumber": {
            "val": "12"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "94.292"
            },
            "CurrentYear": {
                "val": "138.145"
            },
            "BudgetYearOne": {
                "val": "147.789"
            },
            "BudgetYearOneBase": {
                "val": "147.789"
            },
            "BudgetYearTwo": {
                "val": "167.051"
            },
            "BudgetYearThree": {
                "val": "165.701"
            },
            "BudgetYearFour": {
                "val": "161.231"
            },
            "BudgetYearFive": {
                "val": "166.402"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program develops enterprise-centric information technology for the Air Force. Advances in enterprise-centric information technologies are required to increase warfighter readiness and effectiveness by providing the right information, at the right time, in the right format, anytime, anywhere in the world. The Connectivity and Protection Tech project provides the technologies for multi-level, secure, seamless networks; advanced communications processors; anti-jam and low probability of intercept techniques, as well as technologies that deter any adversary from attacking computer systems while allowing access to, presence on, manipulation of, and operational effects on adversary computer systems. This project also develops the technology base for the next generation of ultra-wide-bandwidth, multi-channeled, air- and space-based communications networks. The Information Management and Computational Tech project provides advances in information management and dissemination technologies to ensure the delivery of high-quality, timely, secure information to the warfighter, and develop technologies to produce both advanced on-demand computational processing and computer architectures with greater capacity and sophistication for addressing dynamic mission objectives under constraints imposed by Air Force systems.  The Information Decision Making Tech project develops the technology to support the commander and staff's ability to command all viable options to achieve desired effects across the full spectrum of operations. The Operational Awareness Tech project develops technologies that improve their capability to generate, process, manage, fuse, exploit, interpret, and disseminate timely and accurate information. The Research Site Support project provides the Rome Research Site infrastructure at Rome, NY and provides for the continued operations of all Rome Research Site properties, buildings, and services necessary for the research mission.  This program has been coordinated through the the Department of Defense (DoD) Science and Technology (S&T) Executive Committee process to harmonize efforts and eliminate duplication. This program is in Budget Activity 2, since it develops and demonstrates the technical feasibility and military utility of evolutionary and revolutionary technologies."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "104.362"
                },
                "CurrentYear": {
                    "val": "138.161"
                },
                "BudgetYearOne": {
                    "val": "147.826"
                },
                "BudgetYearOneBase": {
                    "val": "147.826"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "94.292"
                },
                "CurrentYear": {
                    "val": "138.145"
                },
                "BudgetYearOne": {
                    "val": "147.789"
                },
                "BudgetYearOneBase": {
                    "val": "147.789"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-10.070"
                },
                "CurrentYear": {
                    "val": "-0.016"
                },
                "BudgetYearOne": {
                    "val": "-0.037"
                },
                "BudgetYearOneBase": {
                    "val": "-0.037"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.225"
                    },
                    "CurrentYear": {
                        "val": "-0.016"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.239"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-8.606"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.037"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.037"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Decrease in FY13 Other Adjustments was due to Sequestration."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "625315"
                    },
                    "ProjectTitle": {
                        "val": "Connectivity and Protection Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "36.908"
                        },
                        "CurrentYear": {
                            "val": "57.455"
                        },
                        "BudgetYearOne": {
                            "val": "65.715"
                        },
                        "BudgetYearOneBase": {
                            "val": "65.715"
                        },
                        "BudgetYearTwo": {
                            "val": "73.824"
                        },
                        "BudgetYearThree": {
                            "val": "73.388"
                        },
                        "BudgetYearFour": {
                            "val": "69.697"
                        },
                        "BudgetYearFive": {
                            "val": "75.486"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Air Force requires technologies that enable assured, worldwide communications among all elements of the force.  These communication technologies will provide en-route and deployed reachback communications for distributed collaborative military operations. This project provides the technologies for secure, self-configuring, self-healing, seamless networks; advanced communications processors; anti-jam and low probability of intercept communications techniques; agile, dynamic policy based network management capabilities; and modular, programmable, low-cost software radios.  This project also develops both the technology base for ultra-wide bandwidth, multi-channeled air- and space-based communications networks on and between platforms.  In addition, the Air Force requires technologies to deliver a full range of options in cyberspace on par with air and space dominance in each of the areas of cyber attack, cyber defense, and cyber support to achieve the strategic capability of cyber dominance.  This project provides the technologies required to successfully deter any adversary from attacking computer systems anytime, anywhere by ensuring the Air Force's ability to: access, maintain presence on, and deliver effects to adversary systems;  detect, defend, and respond to attacks on friendly computer systems as well as provide forensic analysis concerning those attack attempts; and provide cyber situational awareness to Air Force commanders."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Connectivity Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop improved, survivable, higher bandwidth communications, networking, and signal processing technologies to provide secure, adaptive, covert, anti-jam, and assured global battlespace connectivity tailored to anti-access and area-denial environments and contested operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.774"
                                            },
                                            "Text": {
                                                "val": "Developed advanced networking technologies for distributed military operations in an airborne environment. Conducted both development of secure video distribution over tactical internets on demand and design of distributed, cross-layer protocols for cognitive radio ad hoc networks with decentralized control. Completed the investigation of spatial multiplex Multiple-Input and Multiple-Output (MIMO) techniques to increase channel capacity and the development of a cognitive cooperation protocol for wireless networks."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "25.824"
                                            },
                                            "Text": {
                                                "val": "Continue development of advanced networking technologies for distributed military operations in an airborne environment. Continue both development of secure video distribution over tactical internets on demand and design of distributed, cross-layer protocols for cognitive radio ad hoc networks with decentralized control. Initiate the development of a modular airborne network bridge for the creation of an air-air\/air-ground secure tactical intranet. Initiate the development of wideband, long-range, rapidly deployable aerial backbone network for command, control, intelligence, surveillance, and reconnissaince (C2ISR) dissemination. Initiate research in support of the development of a protected, wide-band satellite communication architecture."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.247"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.247"
                                            },
                                            "Text": {
                                                "val": "Continue development of advanced networking technologies for distributed military operations in an airborne environment. Continue both development of secure video distribution over tactical internets on demand and design of distributed, cross-layer protocols for cognitive radio ad hoc networks with decentralized control. Continue the development of a modular airborne network bridge for the creation of an air-air\/air-ground secure tactical intranet. Continue the development of wideband, long range, rapidly deployable aerial backbone network for command, control, intelligence, surveillance, and reconnaissance (C2ISR) dissemination. Continue research in support of the development of a protected, wide-band satellite communication architecture."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cyber Defense Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop cyber defense and supporting technologies to detect, defend, and respond to attacks on computer systems as well as provide forensic analysis concerning the attacks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.286"
                                            },
                                            "Text": {
                                                "val": "Developed technology to assure operations of our networked forces (a trusted execution environment) in high threat, contested cyber environments by demonstrating a trusted cyber delivery vehicle\/platform to support nearly all types cyber operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.313"
                                            },
                                            "Text": {
                                                "val": "Continue development of technology to assure operations within a cyber-contested environment by focusing on mission assurance capabilities and avoidance techniques through demonstration of agility and survivability techniques that move faster than the adversary.  Continue development of technology to assure operations of our networked forces (a trusted execution environment) in high threat, contested cyber environments by demonstrating a trusted cyber delivery vehicle\/platform to support nearly all types of cyber operations. Complete development of advanced data assurance and threat mitigation technologies. Initiate development of technologies to keep pace with rapidly changing communications networks\/devices and deliver a full range of cyber effects to support cyber missions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "21.298"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "21.298"
                                            },
                                            "Text": {
                                                "val": "Continue development of technology to assure operations within a cyber-contested environment through the maturation of mission assurance technologies and beginning development of mission aware applications and infrastructure that focus defensive initiatives on assuring mission success as opposed to focusing on network components.  Complete prototype mission survival\/recovery framework for operating Air Force missions. Continue development of technologies to keep pace with rapidly changing communications networks\/devices and deliver a full range of cyber effects to support cyber missions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cyber Offense Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop offensive cyber operations technologies to access, maintain presence on, and deliver effects to adversary systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.428"
                                            },
                                            "Text": {
                                                "val": "Completed development of information system access methods and development of propagation techniques. Developed stealth and persistence technologies. Conducted investigation into anti-reverse engineering methods.  Developed methods for increased cyber situational awareness and understanding of the battlefield, and developed methods for covert data exchange.  Completed development of technology to deliver effects in concert with cyber platforms.  Developed a publish\/subscribe architecture for exchange and exfiltration of information while operating within adversary information systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.896"
                                            },
                                            "Text": {
                                                "val": "Continue development of stealth and persistence technologies. Continue investigation into anti-reverse engineering methods.  Continue development of methods for increased cyber situational awareness and understanding of the battlefield, and continue the development of methods for covert data exchange. Complete development of a publish\/subscribe command and control  architecture for exchanging information.  Initiate the development of a common operating platform for Air Force operational cyber missions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.172"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.172"
                                            },
                                            "Text": {
                                                "val": "Continue development of stealth and persistence technologies. Continue investigation into anti-reverse engineering methods. Continue development of methods for increased cyber situational awareness and understanding of the battlefield, and continue the development of methods for covert data exchange. Continue the development of a common operating platform for Air Force operational cyber missions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Survivability Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop methods and technologies for controlled operation of information systems during attacks and fault conditions, minimizing vulnerabilities of cyber attacks, and guaranteeing the accuracy and correctness of data and codes."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.420"
                                            },
                                            "Text": {
                                                "val": "Developed methods and technologies for controlled operation of information systems during attacks and fault conditions, minimizing vulnerabilities of cyber attacks, and guaranteeing the accuracy and correctness of data and codes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.422"
                                            },
                                            "Text": {
                                                "val": "Complete development of defensive cyber technologies to increase system survivability while under a cyber attack.  Complete challenge problem in-house and university research investigations for development of cyber domain capabilities supporting Air Force information systems including research in assured cyber operations in complex networks. Complete investigation into secure processing by using hardware techniques and logic reconfiguration to drastically reduce major vulnerabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.402"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.402"
                                            },
                                            "Text": {
                                                "val": "Continue development of defensive cyber technologies to increase system survivability while under a cyber attack. Develop technologies for trusted embedded systems for use within the DoD's most critical information systems. Securely operate within heterogeneous private, public and hybrid environments.  Continue research into trust enhanced platform that utilizes virtualization to provide resilient operations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cyber Technologies for Spectrum Warfare"
                                    },
                                    "Description": {
                                        "val": "Develop technologies combining electronic warfare, signals intelligence (SIGINT), communications, and cyber technologies that provide synergistic access, exploitation, and effects across air and cyber domains in congested and contested environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.596"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.596"
                                            },
                                            "Text": {
                                                "val": "Initiate development of active and passive methods to locate, acquire, and process data and signals of interest."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "625316"
                    },
                    "ProjectTitle": {
                        "val": "Info Mgt and Computational Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "24.415"
                        },
                        "CurrentYear": {
                            "val": "25.862"
                        },
                        "BudgetYearOne": {
                            "val": "27.511"
                        },
                        "BudgetYearOneBase": {
                            "val": "27.511"
                        },
                        "BudgetYearTwo": {
                            "val": "32.087"
                        },
                        "BudgetYearThree": {
                            "val": "34.843"
                        },
                        "BudgetYearFour": {
                            "val": "33.067"
                        },
                        "BudgetYearFive": {
                            "val": "32.137"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Air Force requires the capability to maximize the value, sharing, management, and use of its information and information assets in achieving its mission objectives as the importance of information grows in the current net-centric environment.  Technology development in this project must be capable of taking advantage of future net-centric environments including new structured and ad hoc processes in response to rapidly changing warfare challenges.  Advances in robust information management focus on quality of service and flow of information within the enterprise, information transformation and brokering, secure information sharing across and among domains, and collaboration of workflow within the enterprise.  Technologies addressed in this project include the ability to globally share, discover, and access information across organizational, functional, and coalition boundaries and between and among domains, the timely delivery of information to tactical assets, the tailoring and prioritization of  information based on mission needs and importance, and the scaling, robustness, and collaboration features required of the Air Force net-centric information management environment.  In addition, the Air Force requires the development of superior, intelligent, on-demand computing to enable information superiority.  Technology development in this project focuses on producing: computer architectures with greater capacity and sophistication for addressing constrained, dynamic mission objectives; \"game-changing\" computing power to the warfighter; disruptive computing power at the tactical edge and for federated grid services; and interactive and real-time computing improving the usability of high-performance computing to the Air Force.  It includes technologies in computational sciences and engineering, computer architectures, and software intensive systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Dissemination Technologies"
                                    },
                                    "Description": {
                                        "val": "Investigate and develop technologies for decision quality information dissemination services via publish, subscribe, and query across the Global Information Grid (GIG) to enterprise and tactical assets and coalition partners."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.519"
                                            },
                                            "Text": {
                                                "val": "Developed tools and safeguards required to quickly and reliably transfer information from a higher classification security-domain to a lower classification security-domain, as well as to coalition partners. Initiated research into mission responsive data systems by mapping mission requirements to information flows."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.259"
                                            },
                                            "Text": {
                                                "val": "Demonstrate a multi-faceted approach to design, develop, and demonstrate a wide range of capabilities intended to protect information services and make them resilient to adverse conditions including cyber attack. Continue research into scalable mission responsive data systems by mapping mission requirements to information flows.  Continue development and design of cloud-based information management services for provisioning sufficient computational power for high demand semantic processing of large data sets within mission timeline constraints. Initiate development of responsive autonomous control for tactical sensor control."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.716"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.716"
                                            },
                                            "Text": {
                                                "val": "Continue research into scalable mission responsive data systems by mapping mission requirements to information flows. Continue development and design of cloud-based information management services for provisioning sufficient computational power for high demand semantic processing of large data sets within mission timeline constraints. Continue development of responsive autonomous control for tactical sensor control."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Processing Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop automatic and dynamically reconfigurable, affordable, scalable, distributed petaflop processing technologies for real-time global information systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.306"
                                            },
                                            "Text": {
                                                "val": "Developed advanced computing techniques, enabling superior information processing for Air Force warfighters through in-house and university research. Completed development of tools to analyze code and dynamic execution profiles and extract threads suitable for multi-core computation. Developed petaflops embedded processing on-demand and multi-core computing by demonstrating increased control of power of fabricated prototype. Completed study of quantum cores as the foundational building blocks for a multi-core quantum processor."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.058"
                                            },
                                            "Text": {
                                                "val": "Continue development of advanced computing techniques, enabling superior information processing for Air Force warfighters through in-house research. Continue development of petaflops embedded processing on-demand and multi-core computing by demonstrating increased control of power of fabricated prototype. Demonstrate a context and content-aware trusted router and a secure processor with hardware roots of trust. Demonstrate affordable, high performance, interactive and massively parallel computing architectures for intelligent and timely decision making for increased warfighter awareness."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.029"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.029"
                                            },
                                            "Text": {
                                                "val": "Continue development of advanced computing techniques, enabling superior information processing for Air Force warfighters through in-house research. Continue development of petaflops embedded processing on-demand and multi-core computing by demonstrating increased control of power of fabricated prototype. Initiate research to develop computational systems that adapt and evolve their dynamic context based on prior experiences."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cross Domain Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop secure cross domain discovery services for access to services outside of existing domain. Develop the tools to allow collaboration of workflows required by the Air Force net-centric information management environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.323"
                                            },
                                            "Text": {
                                                "val": "Developed an automated security annotation framework that provides safeguarding mechanisms for the Air Force enterprise.  Developed novel information management techniques as applied to all security-domains through in-house and university research leading to enhanced information flow across the net-centric assets of the Global Information Grid (GIG)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.865"
                                            },
                                            "Text": {
                                                "val": "Continue development of an automated security annotation framework that provides safeguarding mechanisms for the Air Force enterprise. Continue development of novel information management techniques as applied to all security-domains through in-house and university research leading to enhanced information flow across the net-centric assets of the GIG. Enable Voice-Over-Internet Protocol (VOIP) and video tele-confrence (VTC) content filters for allowing real time domain voice and video communications across coalition partners. Initiate development and demonstration of multi-level security trust, speed, and cost advancements for global network operations access\/connectivity."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.302"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.302"
                                            },
                                            "Text": {
                                                "val": "Continue development of an automated security annotation framework that provides safeguarding mechanisms for the Air Force enterprise. Continue development of novel information management techniques as applied to all security-domains through in-house and university research leading to enhanced information flow across the net-centric assets of the GIG. Deliver a suite of new U.S.\/coalition collaboration services producing four new cross-domain capabilities: voice\/video; full motion video streaming; automated content inspection; and global trusted remote management. Continue development and demonstration of multi-level security trust, speed, and cost advancements for global network operations access\/connectivity."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Architectural Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop the architectural mechanisms that form the basis for predictable software and high assurance systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.267"
                                            },
                                            "Text": {
                                                "val": "Completed development of a trusted, automated cyber defense capability to reduce response time down to milliseconds vice hours.  Developed the tools, techniques, standards, and technologies required to build highly complex software-intensive systems. Completed development of a co-design of a multi-core Tagged Secure Processor, a Zero-Kernel Operating System, and Application Development Environment inherently resistant to malicious software and inherently compliant with multiple independent levels of security (MILS) systems. Completed design of a hybrid complementary metal-oxide-semiconductor (CMOS)\/memristor logic unit that is compact and efficient for encryption algorithm implementation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.680"
                                            },
                                            "Text": {
                                                "val": "Continue the development of the tools, techniques, standards, and technologies required to build highly complex software-intensive systems. Continue research to reduce power draw of embedded systems to enable sufficient performance to achieve autonomy and\/or more on board processing. Complete design of foundations for trustworthy computing systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.464"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.464"
                                            },
                                            "Text": {
                                                "val": "Continue the development of the tools, techniques, standards, and technologies required to build highly complex software-intensive systems. Complete research to reduce power draw of embedded systems to enable sufficient performance to achieve autonomy and\/or more on board processing. Initiate research to develop and demonstrate a processor with design features that permits the maintaining of control of embedded computing systems in a contested environment."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "625317"
                    },
                    "ProjectTitle": {
                        "val": "Information Decision Making Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "14.254"
                        },
                        "CurrentYear": {
                            "val": "15.775"
                        },
                        "BudgetYearOne": {
                            "val": "13.191"
                        },
                        "BudgetYearOneBase": {
                            "val": "13.191"
                        },
                        "BudgetYearTwo": {
                            "val": "20.554"
                        },
                        "BudgetYearThree": {
                            "val": "15.049"
                        },
                        "BudgetYearFour": {
                            "val": "14.969"
                        },
                        "BudgetYearFive": {
                            "val": "14.323"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Air Force requires advances in technologies enabling the effective execution of military objectives that will vastly improve the ability to support the commander and staff's ability to command all viable options to achieve desired effects across the full spectrum of operations (air, space, and cyberspace) at all levels of war (strategic, operational, and tactical) and during all phases of conflict.  Technology development in this project includes anticipatory decision support and course of action development, planning, scheduling and assessment, and the real-time effective portrayal of complex data sets."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Campaign Planning Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop advanced monitoring, planning, and assessment technologies  enabling aerospace commanders to develop effects-based campaigns."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.219"
                                            },
                                            "Text": {
                                                "val": "Developed decision theory and initiated the development of a capability for autonomous adaptive re-planning in a real-time simulation environment using a case-based planning system. Investigated full-spectrum, quantitative analysis techniques that aid operational assessor's ability to link actions to effects to desired objectives.  Initiated development of robust autonomous control algorithms for heterogeneous and distributed assets capable of learning in dynamic environments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.886"
                                            },
                                            "Text": {
                                                "val": "Continue development of decision theory and continue the development of a capability for autonomous adaptive re-planning in a real-time simulation environment using a case-based planning system. Initiate development of evaluation services to determine operational planning feasibility. Complete investigation of full-spectrum, quantitative analysis techniques that aid operational assessor's ability to link actions to effects to desired objectives. Continue development of robust autonomous control algorithms for heterogeneous and distributed assets capable of learning in dynamic environments.  Initiate research and development in cooperative agency and group transfer learning."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.220"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.220"
                                            },
                                            "Text": {
                                                "val": "Continue development of decision theory and continue the development of a capability for autonomous adaptive re-planning in a real-time simulation environment using a case-based planning system. Continue development of evaluation services to determine operational planning feasibility. Continue development of robust autonomous control algorithms for heterogeneous and distributed assets capable of learning in dynamic environments. Continue research and development in cooperative agency and group transfer learning."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Command and Control System Technologies"
                                    },
                                    "Description": {
                                        "val": "Investigate, analyze, and develop technologies for planning, execution, and automatic rapid reconfiguration of distributed intelligent and integrated command and control (C2) information systems to achieve the commander's intent throughout varying crisis levels."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.035"
                                            },
                                            "Text": {
                                                "val": "Completed development of capabilities to be more agile within a net-centric enabled environment by developing models of cyber network attacks to enable better operation of cyber assets with air and space assets. Conducted in-house and university development of planning, decision-making, and course of action (COA) tools supporting the commander's ability to exercise a wide range of command and execution options for Air Force forces.  Developed techniques for visualizing cyber situational awareness, appropriately selecting cyber assets to achieve desired effects and assuring Operations Center functionality while under cyber attack."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.889"
                                            },
                                            "Text": {
                                                "val": "Continue in-house and university development of planning, decision making, and COA tools supporting the commander's ability to exercise a wide range of command and execution options for Air Force assets. Continue development of techniques for visualizing cyber situational awareness, appropriately selecting cyber assets to achieve desired effects and assuring Operations Center functionality while under cyber attack. Initiate research and development of algorithm automated decision aids for obtaining a comprehensive situational awareness and timely assessments of executing operations within and across the air, space and cyber domains to achieve desired effects. Initiate research for the orchestration of the dynamic employment of multiple moving target defense components, configurations and services across the information enterprise to ensure the mission."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.971"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.971"
                                            },
                                            "Text": {
                                                "val": "Complete development of planning, decision making, and COA tools supporting the commander's ability to exercise a wide range of command and execution options for Air Force assets. Continue development of techniques for visualizing cyber situational awareness, and assuring Operations Center functionality while under cyber attack. Complete development of techniques for appropriately selecting cyber assets to achieve desired effects. Continue research and development of automated decision aids for obtaining timely assessments of executing operations within and across the air, space and cyber domains. Continue research for the orchestration of the dynamic employment of multuiple moving target defense components, configurations and services across the information enterprise to ensure the mission."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "625318"
                    },
                    "ProjectTitle": {
                        "val": "Operational Awareness Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "18.715"
                        },
                        "CurrentYear": {
                            "val": "20.604"
                        },
                        "BudgetYearOne": {
                            "val": "20.650"
                        },
                        "BudgetYearOneBase": {
                            "val": "20.650"
                        },
                        "BudgetYearTwo": {
                            "val": "19.275"
                        },
                        "BudgetYearThree": {
                            "val": "20.525"
                        },
                        "BudgetYearFour": {
                            "val": "22.248"
                        },
                        "BudgetYearFive": {
                            "val": "22.774"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Air Force requires technologies that improve and automate the capability to generate, process, manage, fuse, exploit, interpret, and disseminate timely and accurate information.  This project provides not only a network-centric, collaborative intelligence analysis capability that enables the fusion of multi-intelligence and sensor sources to provide timely situational awareness, understanding, and anticipation of the threats in the battlespace, but also the advanced, novel exploitation technologies needed to intercept, collect, locate, and process both covert and overt raw data from intelligence and sensor sources.  It leads the research, discovery, and development of technology that enables the fusion of multi-intelligence sources to provide accurate object tracking and identification (ID), situational awareness, understanding, and anticipation of the threats in the battlespace (air, ground, space, and cyber).  It also leads in the development of advanced exploitation technologies to maximize the intelligence gained from our adversaries in the areas of spectral detection and geolocation, signal recognition and analysis, and the data tagging, tracking, and tracing via the insertion of secure, imperceptible signal embedding for future fusion and understanding of the information."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Multi-Source Fusion Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop higher-level fusion and the enabling text information\/knowledge base technologies to achieve situational awareness and understanding at all command levels for dynamic planning, assessment, and execution processes."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.488"
                                            },
                                            "Text": {
                                                "val": "Completed development and implementation of techniques to increase the scalability of tracking algorithms from 10's to 1000's of ground targets in a large rural-urban environment.  Developed techniques for performing indications and warnings, pattern recognition, and information fusion for information exploitation. Completed development of techniques and algorithms to improve analysis of multi-sensor data for mining data across multi-intelligence (INT) repositories for behavioral patterns to identify terrorist networks, track movement, process moving-target indication data from airborne sensors, and automatically classify airborne targets including remotely piloted aircraft (RPA). Conducted in-house and university research dealing with fusion using multi-source intelligence and sensor feeds to advance the Air Force capability to anticipate the variety of threats from the ground, air, and cyber domains. Developed software to aid the analyst in determining the entity's behavior, including direction, speed, maneuvers, and operation of equipment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.429"
                                            },
                                            "Text": {
                                                "val": "Develop additional capabilities to take advantage of processing (as a service) and storage (as a service) features of cloud-based computing for advanced analytics against radar and optical data. Deliver baseline activity-based intelligence tools. Complete development and implementation of techniques to increase the scalability of tracking algorithms from 10's to 1000's of ground targets in a large rural-urban environment. Continue development of techniques for performing indications and warnings, pattern recognition, and information fusion for information exploitation. Complete development of techniques and algorithms to improve analysis of multi-sensor data for mining data across multi-INT repositories for behavioral patterns to identify terrorist networks, track movement, process moving-target indication data from airborne sensors, and automatically classify airborne targets including RPA. Continue in-house and university research dealing with fusion of multi-source intelligence and sensor feeds to advance the Air Force capability to anticipate the variety of threats from the ground, air, and cyber domains. Continue developing software to aid the analyst in determining the entity's behavior, including direction, speed, maneuvers, and operation of equipment. Continue text analysis multi-source\/document data association and resolution techniques. Consolidate and associate data across disparate information sources. Continue research into machine learning to improve Planning and Direction, Collection, Processing and Exploitation, Analysis and Production, and Dissemination (PCPAD)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.841"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.841"
                                            },
                                            "Text": {
                                                "val": "Continue development of techniques for performing indications and warnings, pattern recognition, and information fusion for information exploitation. Continue in-house and university research dealing with the information fusion using multi-source intelligence and sensor feeds to advance the Air Force capability to anticipate the variety of threats from the ground, air, and cyber domains. Continue research into machine learning to improve PCPAD. Demonstrate tool developments in a contested scenario. Complete development of text analysis capabilities enabling analysts to efficiently extract\/consolidate information from massive amounts of textual data; ID enemy entity-relation networks from that infomation; and develop\/ maintain an understanding of the networks over time. Continue to develop activity-based intelligence capabilities for characterizing and locating activities and transactions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Exploitation Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop digital information exploitation technologies for electronic communications and special signals intelligence, imagery, and measurement signatures to increase accuracy, correlation, and timeliness of the information."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.593"
                                            },
                                            "Text": {
                                                "val": "Completed the development, test, and evaluation of real-time, tactical information exploitation software using laboratory tools and operational data. Developed a wide variety of exploitation methods to enhance signals exploitation of modern emerging signals expected from contested environments and increase situational awareness. Conducted in-house and university research in advanced exploitation techniques that maximize the Air Force's ability to gather, process, and display information from multi-INT sources identifying threats to warfighters across the physical and cyber domains."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.652"
                                            },
                                            "Text": {
                                                "val": "Continue development of a wide variety of exploitation methods to enhance signals exploitation of modern emerging signals expected from contested environments and increase situational awareness. Continue development of multi-domain raw signal exploitation techniques. Continue in-house and university research in advanced exploitation techniques that maximize the Air Force's ability to gather, process, fuse, and display information from multi-intelligence sources identifying threats to warfighters across the physical and cyber domains."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.529"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.529"
                                            },
                                            "Text": {
                                                "val": "Continue development of a wide variety of exploitation methods to enhance signals exploitation of modern emerging signals expected from contested environments. Develop real-time audio processing technology to improve the extraction, analysis and reporting of tactical information. Continue development of multi-domain raw signal exploitation techniques. Continue in-house and university research in advanced exploitation techniques that maximize the Air Force's ability to gather, process, fuse, and display information from multi-intelligence sources identifying threats to warfighters across the physical and cyber domains."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Next Generation Command Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop modeling and simulation technologies for the next generation of planning, assessment, and execution environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.634"
                                            },
                                            "Text": {
                                                "val": "Completed development of tools for the analyst to identify the optimum set of leverage points to meet commander's objectives. Completed the identification of degree to which the adversary can achieve hypothesized COAs based on predicted goals. Completed development of an integrated set of possible combinations of adversary COAs and adversarial intentions based on the adversary's abilities and capabilities to perform activities associated with various domains."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.523"
                                            },
                                            "Text": {
                                                "val": "Initiate research into advanced analytical capabilities that integrate kinetic and non-kinetic options with world knowledge to determine the effects those options will have on the environment, adversary and the general populace. Increase targeting capabilities to include the full range of options available to increase the depth and breadth of the analysis and reduce the overall time to perform analyses and generate targeting options."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.280"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.280"
                                            },
                                            "Text": {
                                                "val": "Continue research into advanced analytical capabilities that integrate kinetic and non-kinetic options with world knowledge to determine the effects those options will have on the environment, adversary and the general populace.  Continue to add targeting capabilities to increase the full range of options available. Continue to assess target folder integration techniques of developed kinetic and non-kinetic tools."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "62OMMS"
                    },
                    "ProjectTitle": {
                        "val": "Research Site Support"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "18.449"
                        },
                        "BudgetYearOne": {
                            "val": "20.722"
                        },
                        "BudgetYearOneBase": {
                            "val": "20.722"
                        },
                        "BudgetYearTwo": {
                            "val": "21.311"
                        },
                        "BudgetYearThree": {
                            "val": "21.896"
                        },
                        "BudgetYearFour": {
                            "val": "21.250"
                        },
                        "BudgetYearFive": {
                            "val": "21.682"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Air Force Research Laboratory Information Directorate leads the discovery, development and implementation of information science and technology to drive transformation within the Air Force and across the DoD. The focus of the work is to provide the warfighter with the required technology-based capabilities to defend the Nation by unleashing the power of innovative information science and technology to anticipate, find, fix, track, target, engage, and assess anything, anytime, anywhere. Since the site is a single-purpose location not located on a military installation, the Information Directorate has unique requirements for supporting its S&T mission.  As the host unit, the directorate is responsible to provide the Rome Research Site infrastructure at Rome, NY and provide for the continued operations of all Rome Research Site properties, buildings, and services necessary for the research mission.  Operations include: logistics and communication services, utilities, maintenance of facilities and structures, safety and security of the workforce and visiting researchers, and ensures compliance with the laws, regulations and directives that pertain to site operations.  These services are host unit responsibilities and are necessary to provide a safe and effective environment for the Research Site's workforce and mission."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Rome Research Infrastructure"
                                    },
                                    "Description": {
                                        "val": "Provide the necessary services and support including, but not limited to: fire inspections, refuse collection, water, electricity, steam, heat, custodial, and grounds maintenance services to the Research Site. Provide the necessary support for the maintenance and repair of Research Site facilities (buildings and other structures), vehicle and equipment lease and security\/safety inspections and services as necessary for compliance and safety\/security of personnel and research assets.  Provide the Research Site with long haul communications (NETWORX (CONUS)), trunk connectivity and wireless communications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.449"
                                            },
                                            "Text": {
                                                "val": "Provide civilian payroll and non-pay costs for installation operations in support of the Rome Research Site property and all on-site personnel. Provide facilities, facility operations, facility sustainment,  support equipment,  contracts and associated costs to plan, manage and execute the following functions: fire prevention, disaster preparedness, plant operation and purchase of commodity, refuse collection, pavement clearance of snow and ice, grounds maintenance including landscaping, real property special inspections, pest control and custodial services.  Provide Real Property Management & Engineering Services, including: (1) Facility Management and Administration and (2) Installation Engineering Services. Facility Management includes public works management costs, contract management, material procurement, facility data management, furnishings management costs, and real estate management. Installation Engineering Services includes annual inspection of facilities, master planning, overhead of planning and design, overhead of construction management, and non-Sustainment and Restoration Modernization (SRM) service calls.  Provide basic installation communication services, including long haul trunk and telecommunications services.  Provide site vehicle lease under GSA for logistics, security, and mission support."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.722"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.722"
                                            },
                                            "Text": {
                                                "val": "Provide civilian payroll and non-pay costs for installation operations in support of the Rome Research Site property and all onsite personnel. Provide facilities, facility operations, facility sustainment, support equipment, contracts and associated costs to plan, manage and execute the following functions: fire prevention, disaster preparedness, plant operation and purchase of commodity, refuse collection, pavement clearance of snow and ice, grounds maintenance including landscaping, real property special inspections, pest control and custodial services. Provide Real Property Management & Engineering Services, including: (1) Facility Management and Administration and (2) Installation Engineering Services. Facility Management includes public works management costs, contract management, material procurement, facility data management, furnishings management costs, and real estate management. Installation Engineering Services includes annual inspection of facilities, master planning, overhead of planning and design, overhead of construction management, and non-Sustainment and Restoration Modernization (SRM) service calls. Provide basic installation communication services, including long haul trunk and telecommunications services. Provide site vehicle lease under GSA for logistics, security, and mission support."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}