{
    "id": "f1547c2183f174b00ed2d2620e782d02c7304370",
    "meta": {
        "filename": "dod-2015_RDTE_2015_OSD_RDTE_JustificationBook_Office_of_Secretary_Of_Defense_PB_2015.zzz_unzipped_RDTE_JustificationBook_Office_of_Secretary_Of_Defense_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603680D8Z"
        },
        "ProgramElementTitle": {
            "val": "Defense Wide Manufacturing Science and Technology Program"
        },
        "R1LineNumber": {
            "val": "52"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "49.026"
            },
            "PriorYear": {
                "val": "49.532"
            },
            "CurrentYear": {
                "val": "59.014"
            },
            "BudgetYearOne": {
                "val": "91.095"
            },
            "BudgetYearOneBase": {
                "val": "91.095"
            },
            "BudgetYearTwo": {
                "val": "62.640"
            },
            "BudgetYearThree": {
                "val": "58.361"
            },
            "BudgetYearFour": {
                "val": "50.538"
            },
            "BudgetYearFive": {
                "val": "23.927"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Defense-wide Manufacturing Science and Technology (DMS&T), established within the Manufacturing Technology Program directed in Title 10 USC Section 2521, provides the Department with a comprehensive manufacturing program to achieve the strategic goals of focused technology, improved acquisition across the life cycles, and cost-effective logistics.  By designing for manufacturability early in development, anticipated results will have an impact on increasing reliability and decreasing the life cycle burden of weapon systems. The mission to anticipate and close gaps in defense manufacturing capabilities and drive significant system life cycle affordability benefits makes DMS&T an increasingly important leveraging tool in the current budget environment.\n\t\t\t\nDMS&T will: 1) address manufacturing enterprise game-changing initiatives that are beyond the scope of any one Military Department or Defense Agency or platform and, 2) establish and mature cross-cutting manufacturing processes required for transitioning emerging technologies which impact the time lines, affordability, and productivity of acquisition programs and shorten the deployment cycle times.\n\t\t\t\nThe DMS&T program is fundamental to a coordinated development process.  Concurrent development of manufacturing processes with the S&T development enables the use of emerging technologies.  Key technical areas for investment for DMS&T include Advanced Electronics and Optics Manufacturing, Advanced Materials Manufacturing, and Enterprise and Emerging Manufacturing.  Advanced Electronics and Optics addresses advanced manufacturing technologies for a wide range of applications such as sensors, radars, power generation, switches, and optics for defense applications.  Advanced Materials addresses advanced manufacturing technologies for a wide range of materials such as composites, metals, ceramics, nanomaterials, metamaterials, and low observables.  Enterprise and Emerging Manufacturing addresses advanced manufacturing technologies and enterprise business practices for defense applications.  Key focus areas include the industrial information infrastructure, advanced design\/qualification\/cost tools, supply network integration technologies and management practices, direct digital (or additive) manufacturing, machining; robotics, assembly, and joining.\n\nThe total sequestration reduction executed as a result of the FY 2013 DoD appropriation act was -$.4.438, of which -$3.430 was applied to FY 2012 and -$1.008 was applied to FY 2013.  Sequestration of these amounts impacted the ability of the OSD Defense-wide ManTech program to execute DoD and Administration priorities for Advanced Manufacturing by  investing in fewer manufacturing processes and improved materials, which are intended to drive in affordability for reduction of system life-cycle costs of major weapons systems."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "21.966"
                },
                "CurrentYear": {
                    "val": "34.041"
                },
                "BudgetYearOne": {
                    "val": "22.539"
                },
                "BudgetYearOneBase": {
                    "val": "22.539"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "49.532"
                },
                "CurrentYear": {
                    "val": "59.014"
                },
                "BudgetYearOne": {
                    "val": "91.095"
                },
                "BudgetYearOneBase": {
                    "val": "91.095"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "27.566"
                },
                "CurrentYear": {
                    "val": "24.973"
                },
                "BudgetYearOne": {
                    "val": "68.556"
                },
                "BudgetYearOneBase": {
                    "val": "68.556"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-1.008"
                    },
                    "CurrentYear": {
                        "val": "-0.027"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "-0.069"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "30.000"
                    },
                    "CurrentYear": {
                        "val": "25.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.022"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.335"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Innovation Manufacturing Institutes (IMI)"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "71.250"
                                },
                                "BudgetYearOneBase": {
                                    "val": "71.250"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Reduction"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-2.690"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.690"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Travel efficiencies savings"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.004"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.004"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Adjustments for Innovation Manufacturing Institute (IMI) program priorities of the Administration and the Department of Defense:\n 1) FY 2013 to FY 2014 +$12.000 \n 2) FY 2014 to FY 2015 +$59.250\n 3) FY 2015 to FY 2019 decreases annually, with no funds programmed after FY 2019 when all IMIs are expected to be financially self-sustaining\n\n-$4.438 Sequestration total rescission executed as a result of the FY 2013 DoD appropriation act.  Of this amount, -$3.430 was applied to FY 2012 and -$1.008 was applied to FY 2013.  Sequestration of these amounts impacted the ability of the OSD Defense-wide ManTech program to execute DoD and Administration priorities for Advanced Manufacturing by  investing in fewer manufacturing processes and improved materials, which are intended to drive in affordability for reduction of system life-cycle costs of major weapons systems."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P680"
                    },
                    "ProjectTitle": {
                        "val": "Manufacturing Science and Technology Program"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "49.026"
                        },
                        "PriorYear": {
                            "val": "49.532"
                        },
                        "CurrentYear": {
                            "val": "59.014"
                        },
                        "BudgetYearOne": {
                            "val": "91.095"
                        },
                        "BudgetYearOneBase": {
                            "val": "91.095"
                        },
                        "BudgetYearTwo": {
                            "val": "62.640"
                        },
                        "BudgetYearThree": {
                            "val": "58.361"
                        },
                        "BudgetYearFour": {
                            "val": "50.538"
                        },
                        "BudgetYearFive": {
                            "val": "23.927"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The DMS&T program has a two-pronged approach: 1) technology initiatives and 2) specific single projects.  Technology initiatives, in collaboration with the Joint Defense Manufacturing Technology Panel (JDMTP) and industry, identify and develop investment strategies to advance the manufacturing processes needed to support the specific technology.  Above-the-shop-floor investments focus on new manufacturing processes that have potential to significantly improve manufacturing efficiencies. Single specific projects address investment opportunities not associated with selected technology initiatives and enable the program to respond to urgent, compelling manufacturing needs and provide seed funding to more high risk-high payoff technologies.\n \t\t\t\nData calls are launched through two methods to identify technology initiatives and single specific issues requiring investment.  One method is through the JDMTP.  The JDMTP is comprised of the ManTech Directors from the Services, Defense Logistics Agency, and Office of Secretary of Defense (OSD).  The call is distributed through the ManTech Directors to the four JDMTP sub panels: Metals Processing and Fabrication Subpanel, Composites Processing and Fabrication Subpanel, Electronics Processing and Fabrication Subpanel and Advanced Manufacturing Enterprise Subpanel. Potential candidates are evaluated by the JDMTP based on criteria set forth in the call and announcements and down-selected for further development prior to final selection.  The other method is through Broad Agency Announcements to industry.  Priority is given to investments that support affordability and producibility of critical enabling manufacturing technologies that cut across multiple platforms.  Investments also balance defense priorities in specialty materials, electronics, propulsion and power, and manufacturing processes including \"above the shop floor\" (lean and business technologies facilitating interoperable manufacturing).  Final projects are selected by the OSD ManTech Director, considering input from the JDMTP and Director of Manufacturing, and as approved by Deputy Assistant Secretary of Defense, Manufacturing and Industrial Base Policy (MIBP).  Technology initiatives and projects are executed at the Component level."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Industrial Base Innovation Fund (IBIF)"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "28.939"
                                        },
                                        "Text": {
                                            "val": "Program investments were executed in manufacturing technology that address defense industrial base shortfalls (especially those related to more urgent production requirements); diminishing defense manufacturing sources and material shortages; a sustainable defense design team base; model-based engineering and integrated computational materials engineering; or new, innovative technologies being developed through public-private partnerships such as the National Advanced Manufacturing Partnership, Connecting American Manufacturing, and the National Digital Engineering and Manufacturing Consortium. In addition, these programs all had a clear transition path with implementation on a current platform or one undergoing acquisition targeted to be within 2-3 years of project completion.  The following areas of investment were executed to enable a diverse suite of advanced manufacturing production improvements\n\n- Innovation Manufacturing Institutes (IMI) (previously Advanced Manufacturing Innovation Institutes) (see program  descriptions addressed above): \n  1) IMI for 3D printing:  The institute accomplished a first-year, start-up phase consisting of establishing over 80 industry, academic, and non-profit members, creating a balanced governance structure to engage industry and government stakeholders, development of performance metrics, a project call process, an operating plan, the hiring of full-time staff, and completed renovations of the headquarters, the Innovation Factory.  A Call for Projects resulted in six applied research projects, engaging over 35 member organizations on project teams.  The Additive Manufacturing technology roadmap was developed using results generated from a series of workshops with members.  A  Second Project Call was launched with anticipated awards totaling $9 million (government share).  Plans for education and workforce training and outreach were developed, and initiatives were launched in these areas.  The IMI for 3D printing began the development of a new public and private (members-only) collaborative website for secure exchange of relevant information on projects, member organization capabilities, and developments in the additive manufacturing industry.\n\n  2) IMIs for digital manufacturing and design, and for lightweight metals:  Provided resources for initial staffing of each Institute, permitting timely standup of the Institutes to facilitate growth in membership and customer interest.  Awarded initial cooperative agreements. The Technology Advisory Boards of these Institutes were established along with operating procedures on governance, intellectual property protection, and membership. Began cross-institute project teaming with the 3D printing IMI, and began engagement with organic (depot) manufacturing communities within DoD. Executed the initial Project Calls and awarded first round of projects, typically $1M in government funds matched 1:1 or better by industry. Contracts were awarded in the following core areas for each Institute: \n  IMI for digital manufacturing and design: advanced manufacturing enterprise, intelligent machines, and advanced analysis; \n  IMI for lightweight metals: applications of new\/novel metals and alloys, primary metal manufacturing processes, secondary manufacturing processes, and development of products exploiting lightweight and modern metals.\n\nOther projects executed (space limitation precludes project details below, but further descriptions are available):\n\nAutomated Non-Destructive Evaluation (NDE) Analysis of Composite Ultrasonic Inspection Data for Manufacturing Quality Control\nCarbon Nanotube Cables\nConnecting American Manufacturing\nCurved Transparent Ceramics\nLaser Assisted Consolidation of Composites\nMulti-function Periscope\nOn Tool Inspection of Automated Fiber Placement"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "25.000"
                                        },
                                        "Text": {
                                            "val": "Projects to be executed (space limitation precludes project details below, but further descriptions are available):\nAffordable Radar\nLarge Affordable Substrates\nOn Tool Inspection of Automated Fiber Placement\nSolid Rocket Motor Digital Factory"
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Electronics Manufacturing - Advanced RF Packaging"
                                    },
                                    "Description": {
                                        "val": "This effort applies an existing radar system already in production to satisfy a low-cost, open-architecture radar requirement for the Littoral Combat Ship (LCS) program. This program will reduce the cost of the current radar system by $1M per ship set, and will fit into the existing TRS-3D top side and below decks available footprint. The open architecture configuration will allow upgrades for new technologies over the lifetime of the program as well as offer lower cost via the potential for open competition for the radar’s building blocks.  Radar manufacturing and support capability will be transferred from a foreign company to a domestic company and facility.  Transmit\/Receive (T\/R) module packaging cost will be reduced through near-hermetic, commercial Monolithic Microwave Integrated Circuit (MMIC) packaging and automated Surface Mount Technology (SMT) assembly techniques, reducing touch labor costs.  Model Based Enterprise (MBE) concepts will be integrated to ensure supportability and technology refresh via an Intelligent Technical Data Package.  The commercial packaging effort for T\/R module components as a part of this program will have a direct impact on the Volume Search Radar (VSR) on CVN-79 – creating a $1M\/hull cost savings for the Navy.  This effort will provide the Navy with the first truly open architecture radar solution that will be able to accommodate different Monolithic Microwave Integrated Circuit (MMIC) technologies, Line Replaceable Unit (LRU) technologies, processor, and power supplies from multiple vendors.  The system will use fiber optics to connect the above-deck equipment (antenna) with the below-deck equipment (signal processing and control) which will allow greater flexibility in location of below-deck equipment (allowing a lower center of gravity and thus improved ship stability)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.950"
                                            },
                                            "Text": {
                                                "val": "Developed the S-band Open-architecture Component Knowledge and Event Tester (SOCKET) Graphical User Interface (GUI), interface to test equipment, Intelligent Technical Data Package (ITDP) interface, data logging & LRU test scripts, and training & simulator software.  Completed the SOCKET Critical Design Review.  Completed SOCKET integration and testing, and a SOCKET string test.  Wrote SOCKET test reports and the user manual.  Completed the SOCKET LRU based verification system and delivered the SOCKET hardware and software to the Navy. \n\nCompleted gallium nitride (GaN) component supplier evaluation and selection for the Transmit\/Receive (T\/R) module.  Completed PowerBook T\/R module Preliminary Design Review (PDR), Critical Design Review (CDR).  Built, tested, and qualified the PowerBook module.  Conducted System Engineering training.  Completed land-based radar integration and testing. Initiated the sub-array string testing. Completed the String Test Verification Demonstration.    Delivered the final Intelligent Technical Data Package (ITDP).  Completed the transfer of radar system production from the offshore COTS manufacturer to the domestic manufacturer.  Completed the Radar Producibility Analysis and Final Project Report."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Electronics Manufacturing - Chip Scale Atomic Clock"
                                    },
                                    "Description": {
                                        "val": "Command, Control, Communications, Computers, Intelligence, Surveillance, and Reconnaissance (C4ISR) systems require precise timekeeping even if the Global Positioning System (GPS) is unavailable. The size, weight, power, and cost components of conventional atomic clocks are too high for tactical applications. Chip Scale Atomic Clock (CSAC) provides improved long-term frequency stability that gets integrated into long-term time accuracy. The focus of this project is leveraging Defense Advanced Research Projects Agency (DARPA) investments in the CSAC technology to reduce operational costs and transition beyond custom fabrication of the current CSAC.  Objectives include improving the existing batch manufacturing processes such as atomic cell filling, cell sealing, physics package assembly, and sub-system testing to reduce the “touch hours” required for CSAC assembly and testing. Development of a network of multiple vendors to foster competition and ensure a viable supply base is a complementary goal. Current manual assembly processes can produce CSAC in small quantities with low yield at high cost ($8,000\/unit).  The DMS&T funding enables producibility at an affordable cost ($100–$300\/unit). Successful performance enables an environment of continued operation of critical C4ISR systems, regardless of the presence or absence of global positioning system (GPS). The ability to rapidly reacquire GPS military code in a hostile Electro Magnetic Interference (EMI) environment is an additional targeted benefit."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.160"
                                            },
                                            "Text": {
                                                "val": "Completed demonstration of a batch manufacturing tool for atomic vapor cell filling.  Completed design of a vacuum sealing tool of physics packages in a batch mode.  Demonstrated the automatic assembly process of physics packages.  Improved Vertical Cavity Surface Emitting Laser (VCSEL) yield:  VCSEL unit cost was lowered from $100 to less than $20.  Completed redesign of physics package for high-volume producibility at a low unit cost.  Completed cost analyses independently by the vendors, verified unit cost of less than $300.  Delivered Phase I prototypes to CERDEC for independent government testing.  The Technology Transition Agreement was signed with Product Director, Positioning, Navigation and Timing (PD PNT) for potential transition to Positioning, Navigation and Timing (PNT) Family of systems which include the PNT mobile, PNT Hub and PNT Embedded products."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Electronics Manufacturing - Large Affordable Substrates"
                                    },
                                    "Description": {
                                        "val": "High performance infrared (IR) focal plane arrays (FPAs) are grown on Cadmium Zinc Telluride (CZT) substrates that are currently only available in relatively small wafer sizes. This effort will leverage prior and concurrent Department of Defense (DoD) investments to enable a domestic source to manufacture larger CZT substrates. The results will be reduced cost and assured availability of CZT substrates that will enable affordable, high performance ground and air IR sensor systems with rapid wide area search, long range ID, and dual band multispectral aided target detection capability against difficult targets while on-the-move.  Large, affordable CZT substrates from a domestic source will initially transition on FPAs for the 3rd Gen forward-looking infrared imaging systems (FLIR) Engine Engineering Manufacturing Development program, to be followed by multiple transitions to space, strategic, and tactical systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.520"
                                            },
                                            "Text": {
                                                "val": "Completed installation of the furnace for boule and substrate manufacturing. Evaluated the potential growth of boules of increasing size.  Improved uniformity and reduce precipitates size in boule. Evaluated critical substrate factors that are part of the final substrate specification, such as parallelism, total thickness variation, chipping, scratches, etc.  Initiated a Low Rate Production status. Conducted a final demonstration of the product. Obtained a TRL6\/MRL7 level. Participated in a 3rd Gen Forward Looking Infrared Radar Development and Demonstration build."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Electronics Manufacturing - Sensor Hardening"
                                    },
                                    "Description": {
                                        "val": "The F-35 Joint Strike Fighter (JSF) has the requirement to minimize low and high powered laser effects on mission accomplishment.  Current F-35 Electro-Optical Targeting System (EOTS) and Electro-Optical Distributed Aperture System (EODAS) focal plane arrays (FPAs) suffer manufacturing yield and cost issues.  This effort will leverage prior and concurrent DoD investments in laser protection technology to make manufacturing improvements that incorporate laser protection technology into the FPA’s Read-Out Integrated Circuits (ROICs) while concurrently reducing ROIC defects (improving yield) and minimizing the total cost to F-35 to meet this requirement.  The goal is to increase the Transition Readiness Level\/Manufacturing Readiness Level to TRL\/MRL 6 (demonstrate\/produce prototype system or subsystem in a relevant environment) and to transition laser-hardened FPAs in time for the F-35 Block 5 Upgrade.  These technologies are applicable not just for F-35, but to any Medium Wavelength Infrared detector, including those on tactical and reconnaissance sensor systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.780"
                                            },
                                            "Text": {
                                                "val": "Concluded FPA production scale-up activities to achieve a TRL6\/MRL6 level. Made available a Hardened EOTS FPA and a Hardened EODAS FPA. Concluded system engineering studies on targeting and warning systems. Continued life cycle testing. Initiated additional thermal cycle testing of dewars. Began a second version of the ROIC\/detector hybridization effort. Conducted another Manufacturing Readiness Assessment. Completed the ROIC fabrication. Finished the FPA build. Conducted laser susceptibility testing at Wright-Patterson Air Force Base.  Conducted transitional activities in preparation for the F-35 Block 5 Upgrade decision point in FY 2015."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Materials Manufacturing - Advanced Body Armor"
                                    },
                                    "Description": {
                                        "val": "While current body armor is effective, it is too heavy for some threats, environments, and operations.  Even a 10% reduction in system weight would significantly increase warfighter acceptance, mobility, agility, and endurance.  This effort will leverage prior DoD investments to mature three complimentary manufacturing technologies that will reduce body armor weight by 10%-15% while improving ballistic performance and flexibility.  Cost will be reduced 5%-10% and cycle time will be reduced by 10X-20X.  The project will mature three manufacturing technologies for lighter weight armor from a capability to produce the technologies in a laboratory to a capability to produce them in an environment representative of a production facility.  The three technologies are: 1) Dissimilar Material Assembly Technology to integrate ceramic, polymer adhesives, composites, and other organic and inorganic constituents into a unified body armor system. 2) Co-consolidation processing, to reduce cost and cycle time for the production of composite material enabling 10% lighter armor while maintaining ballistic performance. 3) Multi-scale modification of ballistic ceramics and associated processes, which will include new additive processes and metallic substrates to improve ballistic integrity and manage adverse shock events due to ballistic impact."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.300"
                                            },
                                            "Text": {
                                                "val": "Technology down-select completed (including composite, ceramic, adhesive, and encapsulation sub-processes).  Demonstrated 10% lighter (5.5 pounds for size medium) Enhanced Small Arms Protective Insert side plate.  Conducted interlayer materials bonding and assembly.  Developed evaluation parameters and complete ballistic and related testing.  Processed down select and integration.  Enabled Low Rate Initial Production process development."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Materials Manufacturing - Field Assisted Sintering Technology (FAST)"
                                    },
                                    "Description": {
                                        "val": "This effort addresses limitations of conventional sintering processes.  Conventional sintering takes from hours to days in a sintering oven, and the beneficial characteristics of nano-structured materials are lost when the material is sintered.  FAST has the potential to dramatically reduce cycle time and manufacturing costs while maintaining the beneficial characteristics of nano-structured materials.  The FAST process passes a pulsed direct current through the part while it is pressed in a die, and the combination of rapid heating and compressive loading results in fine grained, fully dense materials in short processing times that are not possible with conventional sintering processes.  Many parts that are made with a powder press and sinter process are candidates for FAST, but this project will focus on ceramic body and vehicle armor, tungsten kinetic energy penetrators, infrared windows, heat sinks for electromagnetic propulsion cooling, and hypersonic and high temperature for enhanced performance jet propulsion."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.468"
                                            },
                                            "Text": {
                                                "val": "Extend Area Protection & Survivability Warhead Testing.  Fabrication of automated sample handling system, implementation\/testing of automation, optimization of automation system, document process efficiency\/cost savings."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.501"
                                            },
                                            "Text": {
                                                "val": "Investigate manufacturing technology improvements in FAST to enable ceramic body and vehicle armor, tungsten kinetic energy penetrators, infrared windows, heat sinks for electromagnetic propulsion cooling, and hypersonic and high temperature for enhanced performance jet propulsion."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Electronics and Optics"
                                    },
                                    "Description": {
                                        "val": "Advanced Electronics is a series of efforts addressing advanced manufacturing technologies for a wide range of applications such as sensors, radars, power generation, switches, and optics for defense applications.  These efforts provide significant productivity and efficiency gains in the defense manufacturing base.  These manufacturing technologies accelerate delivery of technical capabilities to impact current warfighting operations, and manufacturing technologies to reduce the cost, acquisition time and risk of our major defense acquisition programs.\n\nSilicon Carbide (SiC) High Efficiency Power Switches: Another emerging manufacturing technology undergoing development is for Silicon Carbide High Efficiency Power Switches to enable a new class of power electronics that allows flexible new architectures at higher voltages, higher frequencies, less volume \/ weight, higher temperatures, higher efficiency (reduced fuel consumption), and better power quality for Program Executive Office Ground Combat Systems and the Air and Missile Defense Radar Radar Power Conversion Module.\n\nMini Short Wave Infrared (SWIR) Cameras and ManTech for SWIR Imagers: Thermoelectric Cooler (TEC)-less SWIR imagers are being developed that are smaller, use less power, have a lower cost than currently available SWIR imagers, and offer improved functionality over sensors presently in use.  These new SWIR imagers will be used by warfighters including SOF to see target designation lasers during day and night, to identify friend or foe at long range at night, and to operate with covert lasers.  Applications include several night vision and targeting system programs with the Army, Navy, Air Force, and SOCOM.\n\nManufacturability of Vertical Cavity Surface Emitting Lasers (VCSELs): One emerging manufacturing technology undergoing development focuses on the manufacturability of VCSELs. This effort will allow the enhanced use of high-power laser diode technologies by reducing their operational cost, increasing their reliability and yield, and improving their large array scalability without substantially increasing the processing and packaging requirements. Will apply a modern factory approach of a fab-less front-end with specialized in-house process steps, allowing more flexibility for DoD procurement cycles and leveraging installed, previously-invested capital. This project is expected to benefit numerous programs, including: PUMA, RAVEN, TigerShark, Anubis, Spectre-FINDER, Speckles, TigerMoth, WAAS, PAWS, IPODS, AngelFire, MAV-OBAT, nLoss, LOS-short, CLRF, JETS, IDNST, TLDS, Big Safari, OEF, OIF,  STINGER , and ARGUS.\n\nFuture efforts will focus on advances in fuel cells, radars, conformal sensors, and solder free electronics.\n\nOrganic Light Emitting Diode (OLED) Microdisplays: Many applications of microdisplays require extremely high brightness and contrast in order to see sensor imagery in challenging high brightness environments. Existing technologies are limited by low contrast, bulky and complex packaging, and high power consumption. Recently developed methods of direct patterning and Silicon On Insulator (SOI) allow color OLED displays to have large color gamuts and very long lifetimes at high luminances. Direct pattern color OLED on SOI has been successfully demonstrated; however, proliferation is limited due to high costs and manufacturing deficiencies.  This project will transition this techology from MRL5 to MRL8, improving the manufacturing capability to produce an\nultra-high resolution, high brightness, high contrast, full color micro-display at a low unit cost. \n\nImproved Focal Plane Array Production for Thermal Hyperspectral Applications Using III-IV Antimony Based Technology: This effort will mature the use of III-V material technologies in long wave infrared (LWIR) focal plane arrays (FPAs) used for hyperspectral imaging in numerous tri- service applications.  Improved devices will have size, weight, and power advantages, and reduced logistics costs.  Production readiness will be demonstrated by integrating with an Army owned sensor asset provided by Project Manager-Airborne Reconnaissance and Exploitation Systems (PM ARES).\n\nIncreased Thickness for Large Sheet EFG Sapphire Production: Develop a process to grow a single crystal of EFG sapphire with dimensions to meet critical weapon needs.  Demonstrate finished thickness capabilities and leverage success of bubble reduction task in the design of the thicker die."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.569"
                                            },
                                            "Text": {
                                                "val": "SiC High Efficiency Power Switches. Focused on improvements in SiC starting materials.  Continued efforts to increase SiC wafer size to 6”.  Reduced substrate defects, including micropipe density, to improve device yield.  Began power device fabrication using 6” substrates.\n\nMini SWIR Cameras and ManTech for SWIR Imagers:   Developed robust 4” wafer processes to reduce breakage and increase yield.  Improved backside processing costs.\n\nManufacturability of VCSELs: Initiated hermetic design efforts, creating hermetic packaging for VCSEL arrays. Developed a “hermetic by design” VCSEL chip process technology by processing direct passivation schemes directly onto the wafer to extend the operating life and shelf-life. Began to standardize the package at the sub-mount and heat-sink level. This is required for ease of insertion to replace edge-emitting products in use by the marketplace and will increase packaging throughput of high power arrays."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.467"
                                            },
                                            "Text": {
                                                "val": "SiC High Efficiency Power Switches: Develop manufacturing technologies to increase throughput and decrease cost of SiC power devices through enhanced material growth and high-yield device fabrication processes. Continue power device fabrication using 6” substrates.\n\nMini SWIR Cameras and ManTech for SWIR Imagers: Continue efforts to improve wafer level processing to improve yields and reduce costs.  Improve hybridization yields and costs; develop a high throughput, self aligning process.  Reduce packaging costs with automation of die bonding and wire bonding.  Plan for sensor packaging and camera calibration tasks.\n\nManufacturability of VCSELs: Continuing hermetic design and standardized packaging efforts. Explore low-cost standard packaging alternatives for high-volume system insertion opportunities. Develop low-cost wafer level packages compatible with Pick-n-Place and Surface Mount Technology PCB-stuffing assembly lines, using multilayer ceramics and PCB technology to remain consistent with wafer-scale packaging.  Evaluate cooling technologies to determine the most cost-effective, manufacturable techniques.\n\nOrganic Light Emitting Diode Microdisplays: Identify the manufacturing processes for direct patterning (alignment of precision shadow mask to 0.5 um accuracy; linear source-based OLED deposition for improved uniformity) and Silicon on Insulator (SOI) (backplane redesign for high dynamic range; optimize the SOI device structure for improved display uniformity). Identify the substrates, packaging, and OLED manufacturing materials. Design and order direct patterning manufacturing equipment. Initiate the design of the SOI backplane. Receive\/install the direct pattern equipment for manufacturing. Begin a producibility assessment. Identify cost drivers. \n\nImproved Focal Plane Array Production for Thermal Hyperspectral Applications Using III-IV Antimony Based Technology: Produce one lot of format 256x256\/30um pitch devices.  Obtain contractor reports on FPA test results from the lot.\n\nIncreased Thickness for Large Sheet EFG Sapphire Production: Design setups with bubble reducing dies of sufficient width and thickness to grow a 13.7” x 0.61” and 13.7” x 0.65” inch cross sections. The new setup shall be of sufficient volume to grow a 13.7” x 0.65” x 24.2” crystal. Design\/redesign any components of the setup and hot-zone affected by the dimensions of the die and crystals to be grown."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.826"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.826"
                                            },
                                            "Text": {
                                                "val": "SiC High Efficiency Power Switches: Continue work on 150 mm diameter 4HN-SiC substrate (wafer) material demonstration task.  Continue 150 mm diameter epi-layer material demonstration task, including warm-wall SiC growth reactor development and hot wall SiC growth reactor development.\n\nMini SWIR Cameras and ManTech for SWIR Imagers: Continue wafer growth, wafer scale processing, backside processing, hybridization, sensor packaging, and camera calibration efforts.\n\nManufacturability of VCSELs: Wafer-level package exploration using multilayer ceramics and PCB technology.  Low-cost die level package using same- compatible with Pick-n-place & SMT PCB-stuffing assembly lines.  Implement lower thermal impedance packaging (thinner, higher conductivity heat spreaders).  Down-select lower thermal resistance, thinner, lighter heat pipes and micro-channel coolers.\n\nOrganic Light Emitting Diode Microdisplays: Develop the manufacturing processes for direct patterning (alignment pattern of shadow mask to wafer; linear source process established; directly patterned R,G, and B process developed) and SOI Backplane (tape out completed; backplane fabricated). Demonstrate critical manufacturing processes (direct patterning: 0.5 um accuracy demonstrated, linear source process uniformity demonstrated; SOI: high dynamic range demonstrated, display uniformity demonstrated). Continue the producibility assessment and the analysis of the cost drivers. Establish a direct patterning prototype manufacturing system. Qualify the SOI process at the foundry.      \n\nImproved Focal Plane Array Production for Thermal Hyperspectral Applications Using III-IV Antimony Based Technology: Produce four lots, format 512x512\/20um pitch.  Obtain contractor reports on FPA test results, initial yield capability and cost for each lot.  Obtain independent verification testing on FPAs.  Plan for integration of FPA to camera in preparation for field test.\n\nIncreased Thickness for Large Sheet EFG Sapphire Production: Conduct experimental growth runs to develop a best known method to produce the EFG crystal defined above. These experiments will involve adjustments to the setup and hot zone in order to achieve the proper growth conditions for the crystal, such as temperature gradients, growth speed and control parameters."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Materials Manufacturing"
                                    },
                                    "Description": {
                                        "val": "Advanced Materials Manufacturing is a series of efforts addressing advanced manufacturing technologies for a wide range of materials such as composites, metals, ceramics, nanomaterials, metamaterials, and low observables.  These efforts will provide significant productivity and efficiency gains in the defense manufacturing base.  These manufacturing technologies will accelerate delivery of technical capabilities to impact current warfighting operations, and manufacturing technologies to reduce the cost, acquisition time and risk of our major defense acquisition programs.\n\nAdvanced materials manufacturing technologies undergoing development include materials for ballistic survivability and materials for rapid fabrication of structural components.\nCold Spray Deposition: The objective for Cold Spray Deposition is to create a proven repair process and original equipment manufacturer applied corrosion\/wear prevention treatment for magnesium gearbox housings and parts on numerous platforms. Inability to repair is causing significant readiness, sustainment, and safety issues (20% of the fleet is affected at any given time). Working with the original equipment manufacturer to transition the process to industry to treat new parts and to maintain, repair, and overhaul condemned gearboxes in storage.\n\n\nNet-Shaped Field Assisted Sintering Technology (FAST): FAST will set the processing limits and qualify the process for the production of two ultra high temperature materials components that require full density materials with nano tailored microstructures that are not achievable via other processes.  This technology addresses near net shaped, thin walled axial rocket nozzle inserts (flute shaped) made from W (Tungsten) and TaC alloys and sharp leading edges with attachment features made from Hf-based ceramics.  This effort will mature the manufacturing readiness of conventional FAST while reducing costs and providing faster delivery times.\n\nFastener Fill: The F-35 Fastener Fill project will address the challenges incurred in the manual fastener fill installation process, which can take as long as 2 minutes per fastener and provides no indication of installation quality other than feel.  With over 40,000 fasteners per aircraft for F-35, this is a significant manufacturing issue.  In addition, excess materials must be manually skived to meet flushness requirements. The project objective is to refine the contractor’s prototype Rapid Intelligent Fastener Fill System which is an automated combination melt, compress, and skive tool capable of installing fastener fill material in less than 15 seconds per fastener. Automated and Rapid Boot Installation Process: This process will reduce the labor-intensive nature of boot installation procedures, which are not suitable for full-rate production and represent 40% of the cost in component finishing. A risk assessment analysis has identified the following areas to be targeted: (1) automation of the hand-cut\/trimmed, multi-piece boot installations; (2) automation of additional trimming, bonding, and pasting activities currently performed manually; (3) improved quality of technician skill\/training; and (4) reduction of the waste incurred in cutting\/darting boots.\n\nHigh Precision Air Vehicle Manufacturing:  The most advanced air vehicles for military applications require unprecedented levels of precision structural fabrication to meet production goals and mission requirements.  Precision fabrication simplifies assembly, reduces rework and enables improved weapon system cost and performance.  Furthermore, they simplify aircraft sustainment and maintenance by increasing the interchangeability of components.\n\nDimensions from Day One: Demonstrate a methodology that accurately predicts and accounts for the numerous geometric, tooling and material factors impacting finished composite parts; this will enable the correct upfront process and tooling decisions to yield first article parts meeting the dimensional requirements on “day one”.\n\nLarge Scale Encapsulate Ceramics for Medium and Large Caliber Threat Defeat: This project will mature a novel lighter weight solution for passive armor protection from medium and large caliber threats.  Automate the hot press process to manufacture thick ceramic tiles.  Improve the dimensional controls for the finished ceramics.  Improve the current assembly\/multi-component operations for existing target panels with more efficient processes or a single cast approach using steel instead of titanium.  Develop a rapid low cost coating operation for the ceramic tiles to prevent reaction with the steel during the casting process.  \n\n\n\nCast Eglin Steel: This effort will establish Cast Eglin steel chemistry specs to maximize strength and ductility for maximum protection and effectiveness for Hard and Deeply Buried Target (HDBT) targets. Will create a primary casting process for a single piece cast underbody protection system and bomb bodies. Developing cast-in pockets, slopes, and curves in order to meet geometric and blast requirements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.527"
                                            },
                                            "Text": {
                                                "val": "Cold Spray: Worked with the original equipment manufacturer to transition the process to industry to treat new parts and to maintain, repair, and overhaul condemned gearboxes in storage. Processed validation & repair demonstration.\n\nNet-shaped FAST: Completed high temperature bend strength with grain size analysis and melting point estimations. Down-selected for the carbide dispersoid and conducted a more detailed processing study. Fabricated a large billet in the large FAST unit for enough material to conduce a detailed thermal-mechanical behavior analysis. Developed an understanding between processing conditions and morphology, mechanical and thermal properties and Non-Destructive Evaluation results.  Started fabrication of prototype and scale-up to near net shape nozzle and segmented leading edge.  Fastener Fill: Developed automation plan, solicited RFP’s, and selected best proposals. Modified Rapid Intelligent Fastener Fill System current applications to include hard-to-reach areas such as inlet ducts and QC verification to ensure the fill dot has been installed and skived per requirements.\n\nAutomated and Rapid Boot Installation: This process reduced the labor-intensive nature of boot installation procedures, which were not suitable for full-rate production and represented 40% of the cost in component finishing. A risk assessment analysis has identified the following areas to be targeted: (1) automation of the hand-cut\/trimmed, multi-piece boot installations; (2) automation of additional trimming, bonding, and application activities currently performed manually; (3) improved quality of technician skill\/training; and (4) reduction of the waste incurred in cutting\/darting boots.\n\nCast Eglin Steel: Established Eglin steel chemistry specifications to maximize strength and ductility for maximum protection, and maximum effectiveness for hard and deeply buried targets. Created a primary casting process for the single piece cast underbody protection system, and bomb bodies. Employed an integrated computational casting process model to simulate the net-shape casting process to mitigate potential processing problems. Developed blast testing models.  Transitioned underbody planning from M88 to GCV.  Integrated PM GCV into project team."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.262"
                                            },
                                            "Text": {
                                                "val": "Cold Spray: Original equipment manufacturer demonstration and qualification of the UH-60 Sump Housing. System prove-out analysis and engineering validations are scheduled. Automated manufacturing cell to be assembled and tested for production use.\n\nNet-shaped FAST:  Complete validation and durability testing then proceed with a nozzle and leading edge component demonstration.  The team will document process efficiency, and then identify cost reductions and savings; then support transition to industry.\n\nFastener Fill: Concurrent evaluation at Northrop Grumman Palmdale F-35 center fuselage manufacturing line for qualification and testing of selected application tooling to develop process procedures that includes first article acceptance. Preliminary designs for tooling support will be decided for implementation with refinement enhancements to improve ergonomic and material optimization.\n\nAutomated and Rapid Boot Installation: Identify and implement improvements to the adhesive and physical placement applications for the various boot configurations. Contract awards to be made to supporting contractors developing the tools and methods.  \n\nDimensions from Day One: Develop overall methodology and  necessary material database information. Review and identify materials not addressed in current predictive software. Test materials for processing properties (resin shrinkage, coefficient of thermal expansion, etc.)\n\nLarge Scale Encapsulate Ceramics for Medium and Large Caliber Threat Defeat: Perform casting process modeling and residual stress modeling.  This will include the following Analysis of Alternatives (AOA). Encapsulation of large hot pressed SiC ceramic tiles into: (1) a large cast steel metallic structure; (2)machined steel heavy metal assembly; (3) cast pocketed steel heavy metal assembly; (4) a braided preformed structure  to be infused with resin; (5) a large machined Ti metallic structure. Establish affordable casting parameters for large cast encapsulated tile panels with geometries required for upgrade of current and future combat vehicles requiring protection from medium and large caliber threats. \n\nField Assisted Sintering of Armor & Anti-Armor Components: Mature FAST manufacturing process for DoD components.  Finish ongoing modeling and simulation (M&S) on subscale SAPI die.  Redesign subscale SAPI die set from M&S results; design multi cavity die for near-net-shaped penetrators; sintering trials & optimization; sinter subscale SAPI and penetrator prototypes; complete final project documentation, report, & close out. Primary metric for armor materials will be cycle time as FAST can significantly reduce this (> 60%). Primary metric for advanced penetrators will be cost. It is anticipated that the near-net-shaped nature of FAST can reduce machining costs by 90% and hence overall item cost (> 20%).  \n\nCast Eglin Steel: Validated cast process that ensures cast in pockets, slopes, and curves in order to meet geometric and blast requirements that also facilitate ease of next higher level assembly. Conducted additional blast tests.  Continued design work and preparations for casting underbody and a full vehicle hull.  Began working with US Navy on Eglin steel components for testing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.807"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.807"
                                            },
                                            "Text": {
                                                "val": "High Precision Air Vehicle Manufacturing:  Implement development of precision manufacturing methods for current and next generation aircraft by addressing the accumulated efforts to control the impact due to materials, tooling, environment, personnel, manufacturing and assembly.\n\nFastener Fill: Establish approved procedural support for production implementation. Develop First Article Acceptance delta updates based on the changes implemented.\n\nAutomated and Rapid Boot Installation: Decisions for production implementation to be made from contractor submittals with supporting process documentation. Lockheed Martin and stakeholders to review and approve for implementation. First Article delta updates to be performed.\n\nDimensions from Day One: Explore and develop predictive capability methodology training and user-friendly improvements. Evaluate Methodology prediction and comparison to “as built” hardware of simple, and average to complex configurations. \n\nLarge Scale Encapsulate Ceramics for Medium and Large Caliber Threat Defeat: Scale up casting process, develop more automated process for the SiC tiles and conduct manufacturing trials.\n\nCast Eglin Steel: Conduct additional blast tests.  Cast and heat treat full scale GCV underbody and full vehicle hull.  Continue working with US Navy to develop USMC ground vehicle and other applications.  Continue integrating bomb casings into USAF munitions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enterprise and Emerging Manufacturing"
                                    },
                                    "Description": {
                                        "val": "Enterprise and Emerging Manufacturing is a series of efforts addressing advanced manufacturing technologies and enterprise business practices for defense applications.  Key focus areas include direct digital (or additive) manufacturing, advanced manufacturing enterprise, machining, robotics, assembly, and joining.  These manufacturing technologies and enterprise business practices will accelerate delivery of technical capabilities to impact current warfighting operations, and manufacturing technologies to reduce the cost, acquisition time and risk of our major defense acquisition programs.\n\nWith our adversaries forced to innovate rapidly to survive, it's become increasingly important for the U.S. military to improve its own agility and flexibility. The focus is to find a solution to overcome a burdensome acquisition cycle requiring a great amount of cost, time, security, and storage space. Through the use of secure satellite data links or a local parts database, warfighters can access CAD designs for replacement parts, allowing them to repair equipment without the need to establish supply chains or wait for shipments. It allows operators to modify a part's design based on its performance in the field.\n\nEmerging manufacturing technologies undergoing development include:  Large-scale, challenge for advanced, interoperable machine tool applications, and methods for exchange of 3D official technical data throughout the supply chain and between government and contractors.\n\n\nMTConnect Challenge: Focuses on developing enterprise manufacturing solutions (tools) using newly developed MTConnect interoperable protocol, for use on machining platforms and manufacturing enterprise communication development. MTConnect is an open communication standard that provides the capability to pass data from enterprise components to higher level systems for further processing using the XML based standard.\n\nFramework for Assessing Cost and Technology (FACT): Producibility analysis tools will be matured so that component performance, manufacturing processing techniques and cost can be simultaneously considered to achieve an optimum design solution.  Current producibility analysis tools do not reuse and connect existing design, manufacturing and cost models. Sustainment and Maintenance will be impacted by maturing advanced sustainability analyses operating within FACT to reduce sustainment costs associated with spare parts acquisition and weapon system maintenance.  The technology will enable correct selection of a manufacturing process to minimize cost given the estimated spare part lot sizes. Block Upgrades or Recapitalization using FACT will be critical for performing analyses associated with integrating new requirements into an existing platform to highlight the manufacturing and lifecycle costs associated with the necessary changes to the weapon system in order to meet new operational requirements.\n\n40mm M433 Warhead Producibility: This effort will improve anti-personnel lethality at the squad level, increasing grenadier first shot effectiveness against personnel targets.  Optimization of production process prior to transition to Full Rate Production will enable avoidance of significantly high cartridge unit costs.  New manufacturing process\/techniques will be established to embed discrete fragments into over molded warhead bodies, replacing deep drawn pre-formed manufacturing techniques. Low Velocity 40mm M433 High Explosive Dual Purpose (HEDP) Grenades do not meet lethality requirement stated in FM 23-31.  The grenadier, an integral part of the squad, lacks lethality from the M433 HEDP grenade. The M433 HEDP lethality is restricted by the warhead manufacturing process and design. A new warhead design and manufacturing process is required to achieve lethality requirements and to increase lethality overmatch of the squad.  Currently the M433 HEDP warhead is a deep drawn body with pre-formed fragments.  The deep drawn warhead body, although cost effective, produces inconsistent fragment sizes, weights, and patterns which reduces warhead lethality.\n\nLoading ALIMX-101 into 500 LB General Purpose Bombs: A promising new Insensitive Munitions, IM,  explosive has been selected for implementation into the 500 LB General Purpose Bomb used by the Navy and Air Force so an efficient manufacturing process needs to be developed early in the acquisition cycle in order to avoid costly delays in fielding the new IM-compliant system."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.319"
                                            },
                                            "Text": {
                                                "val": "MT Connect Challenge:  Developed and designed requirements and all public release information concerning challenge offering and objectives.   Awarded prizes for Challenge 1 that sought ambitious yet achievable ideas that harness innovation and manufacturing intelligence breakthroughs. \n\nFramework for Assessing Cost and Technology (FACT):  Initiated development of tools that enable trade-off analysis between manufacturing processes and structural performance to minimize the cost for lower quantity lot sizes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.784"
                                            },
                                            "Text": {
                                                "val": "MT Connect Challenge: Review submissions for accuracy, credibility, effectiveness, and potential savings data. Complete an evaluation and assessment of the competing offerings for Challenge 2 and determine the winning entries. The 2014 MT Conference will present finalists and attendees will vote for the 3 award winners.\nFramework for Assessing Cost and Technology (FACT): Evaluate and model current data to 3D annotated baseline technical data for insertion to a PLM-to-PLM information data exchange format. It is anticipated that benefits associated with updating design specifications to accommodate welding and machining processes will begin for the LTV in the 2Q-FY15, with the benefits for the M777 spare parts project to be realized starting in the 3Q-FY15.\n\n40mm M433 Warhead Improvement Fabrication & Producibility: Develop optimized injection molding and discrete fragment insertion tooling and processes.  Optimize mold stages to decrease time to load parts, over-mold parts & transition to follow on stages.  Potential Return on Investment (ROI) = 8.5:1; cost savings $24.5M, when calculated over identical production quantities from 2016 to 2022 ($17.00 per round cost reduction).\n\nLoading ALIMX-101 into 500 LB General Purpose Bombs: Develop and optimize  loading rates for each material, fill height levels and tolerances, cooling parameters for each material, and X-ray inspection criteria of loaded bomb. Using ARDEC’s pilot-scale processing facility is typical process development for many programs (155mm artillery, mortars, grenades, etc.) because it is more cost effective and efficient than evaluation at a load plant."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.212"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.212"
                                            },
                                            "Text": {
                                                "val": "Framework for Assessing Cost and Technology (FACT): Reduce the time required to perform tradeoff analyses for new system production planning (such as for the Amphibious Combat Vehicle). This will improve the integrated nature of the components, reducing the risk of underperformance and\/or becoming too costly.\n\n40mm M433 Warhead Improvement Fabrication & Producibility: Develop fragment insertion methods & equipment to reduce time to fill mold with fragments & settle\/align fragments.  Develop mold clamping system to enable mold stage transitions at reduced cycle times. \n\nLoading ALIMX-101 into 500 LB General Purpose Bombs:  Transition processing parameters for loading to McAlester Army Ammunition plant.  Load study using ARDEC-developed processes."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Innovation Manufacturing Institutes (IMI)  (previously Advanced Manufacturing Innovation Institutes)"
                                    },
                                    "Description": {
                                        "val": "Technical innovation and leadership in manufacturing are essential to sustaining the foundations of economic prosperity to enable our military to maintain technological advantage and global dominance. To support these goals, Institutes for Manufacturing Innovation (IMI) will serve as regional hubs to accelerate technological innovation into commercial application and concurrently develop the educational competencies and production processes via shared public-private sectors.   Collaborative execution and funding by the Departments of Defense (DoD), Energy (DoE), and Commerce (DoC), the National Aeronautics and Space Administration (NASA), and the National Science Foundation (NSF) to support the establishment of the IMIs will spur industry cost-share for manufacturing innovation and quickly develop a pathway for technology-focused regional hubs for collaboration among government, industry, and academia that will meet critical government and Warfighter needs.  The concept of these institutes is highlighted in the President’s Council of Advisors on Science and Technology (PCAST) report titled “Capturing Domestic Competitive Advantage in Advanced Manufacturing,” published in July 2012.\n\nIMI for 3D printing: The focus of the 3D printing IMI is to accelerate additive manufacturing technologies to the U.S. manufacturing sector and increase domestic manufacturing competitiveness by: 1) Fostering a highly collaborative infrastructure for the open exchange of additive manufacturing information and research 2) Facilitating the development, evaluation, and deployment of efficient and flexible additive manufacturing technologies 3) Engaging with educational institutions and companies to supply education and training in additive manufacturing technologies to create an adaptive, leading workforce, 4) Serving as a national institute with regional and national impact on additive manufacturing capabilities, 5) Linking and integrating US companies with existing public, private or not-for-profit industrial and economic development resources, and business incubators, with an emphasis on assisting small- and medium-sized enterprises and early-stage companies (start-ups). The 3D printing IMI was established in 2012.\n\nIMI for digital manufacturing and design: Advanced design and manufacturing tools that are digitally integrated and networked with supply chains can lead to 'factories of the future,' forming an agile U.S. industrial base with significant speed to market advantage. A national institute focusing on the development of model-based design methodologies, virtual manufacturing tools, and sensor and robotics-based manufacturing networks will accelerate innovation in manufacturing, increasing U.S. competitiveness. The digital manufacturing and design IMI will provide the proving ground to link promising information technologies, tools, standards, models, sensors, controls, practices and skills, and then transition these capabilities to the industrial base for full-scale application.  For example, proving and progressing intelligent electro-mechanical design and manufacturing capabilities from laboratory to prototype factory environments would improve production efficiencies and costs. The focus is the smart and comprehensive use of the ‘digital thread’ throughout design, production and support.\n\nIMI for lightweight metals: Advanced lightweight metals possess properties comparable to traditional materials while enabling much lighter components and products. A national institute will scale-up research to accelerate market expansion by applying integrated computational of materials and manufacturing approach.  New structural alloys face tremendous barriers to application due to lack of design guides and certifications as well as cost and scale-up challenges. The goal is to develop an advanced lightweight-metal U.S. supplier base, and to enable DoD to realize significant fuel reduction, increased payloads, and greater speed and agility of manned, unmanned, and soldier systems as well as benefits for commercial applications and energy savings. \n\nTwo additional IMIs will be established in FY 2015, focusing investments in the key technical areas of Advanced Electronics and Optics Manufacturing, Advanced Materials Manufacturing, and Enterprise and Emerging Manufacturing.\n\nEach Institute is projected to be financially self-sustaining within a five year period of performance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "All FY 2013 efforts for the first three IMIs were funded using Industrial Base Innovation Fund resources, addressed in the Congressional Add description below."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.000"
                                            },
                                            "Text": {
                                                "val": "IMIs for digital manufacturing and design, and for lightweight metals: Build on positive results of the first round of Research and Development projects awarded in FY 2013 by transitioning capability to the organic and commercial industrial base.   Grow the membership of each Institute to realize self-sustainment in five years.  Initiate revenue streams from membership dues.  Attain reputation as mature IMIs.   Demonstrate the IMI network by establishing complementary relationships and developing projects in which the DoD institutes’ technologies are shown to be integrative in nature with the other IMIs under the National Network of Manufacturing Institutes.  Brief the Institutes at a number of venues to build the customer base for the Institutes’ tools and broaden the membership networks. \n\nAward second and third round of project contracts in the following key core areas for each Institute: \n  IMI for digital manufacturing and design: advanced manufacturing enterprise, intelligent machines, and advanced analysis; \n  IMI for lightweight metals: applications of new\/novel metals and alloys, primary metal manufacturing processes, secondary manufacturing processes, and development of products exploiting lightweight and modern metals.\n  IMI for 3D printing:  There are currently no resources for this IMI in FY 2014."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "71.250"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "71.250"
                                            },
                                            "Text": {
                                                "val": "The 3D printing IMI will continue membership growth and membership engagement.  A third call for projects will be launched based on an updated technology roadmap developed from the technical strategy workshops held in 2014.  The IMI will competitively review and award additional applied research projects totaling up to $5-10 million of highest potential for industry and government shared benefit.  A challenge or series of challenges\/prizes will be launched surrounding additive manufacturing topics to draw in industry impact.  A sustainability plan will be completed including projected revenue streams such as “fee for service” research for industry and government agencies and membership fees.  The IMI will conduct further technology strategy workshops on a continuing basis to gather member input and continue to refine the Additive Manufacturing National Roadmap.  Technology transitions and technology dissemination will continue to institute members and to the general public.  Additional workforce development activities will take place.  The online portal and knowledge base will be further developed to allow for continued membership engagement and collaboration.  Small businesses will continue to be engaged with use of the Innovation Factory facility, and training activities will be developed.  Institute economic development activities and institute performance metrics will be measured.\n\nIMIs for digital manufacturing and design, and for lightweight metals: Expand the membership of both Institutes and promote inter-institute cross-membership and collaboration across the IMI network. Develop and expand upon the commercialization and utilization of FY 2013 and FY 2014 projects. Analyze US and Global industrial base in partnership with other government agencies, to build upon the institute portfolio and address critical requirements.  Award fourth round of project contracts in the key core areas for each Institute, which are:\n    IMI for digital manufacturing and design:  advanced manufacturing enterprise, intelligent machines, and advanced analysis.\n    IMI for lightweight metals:  applications of new\/novel metals and alloys, primary metal manufacturing processes, secondary manufacturing processes, and development of products exploiting lightweight and modern metals."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "(BA3) 0603680F"
                                    },
                                    "Title": {
                                        "val": "Air Force ManTech"
                                    },
                                    "Funding": {
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "(BA7)  0708045A"
                                    },
                                    "Title": {
                                        "val": "Army ManTech"
                                    },
                                    "Funding": {
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "(BA7) 0708011N"
                                    },
                                    "Title": {
                                        "val": "Navy ManTech"
                                    },
                                    "Funding": {
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "(BA7) 0708011S"
                                    },
                                    "Title": {
                                        "val": "DLA ManTech"
                                    },
                                    "Funding": {
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable for this item. Outyear data for \"Other Program Funding\" is contained within the Service budgets."
                        },
                        "PerformanceMetrics": {
                            "val": "The majority of project performance metrics are specific to each effort and include measures identified in the project plans.  The metrics include items such as target dates from project work break down schedules, production measures, production goals, production numbers and demonstration goals and dates. In addition, generic performance metrics applicable to the Defense-Wide Manufacturing, Science and Technology (DMS&T) program includes attainment of previous administration goal, \"Speed technology transition focused on warfighting needs\".  The metrics for this objective and the objective of DMS&T is to transition 30% of completing demonstrations program per year.  Due to the relatively new time frame of the DMS&T program, transition rates for completed efforts for this new project are not available yet."
                        }
                    }
                }
            ]
        }
    }
}