{
    "id": "008f9d61ee38fff8908b3d89be3cfb7e3d46e7ea",
    "meta": {
        "filename": "dod-2015_RDTE_2015_DARPA_RDTE_JustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2015.zzz_unzipped_RDTE_JustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602715E"
        },
        "ProgramElementTitle": {
            "val": "MATERIALS AND BIOLOGICAL TECHNOLOGY"
        },
        "R1LineNumber": {
            "val": "21"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "158.175"
            },
            "CurrentYear": {
                "val": "166.654"
            },
            "BudgetYearOne": {
                "val": "160.389"
            },
            "BudgetYearOneBase": {
                "val": "160.389"
            },
            "BudgetYearTwo": {
                "val": "200.725"
            },
            "BudgetYearThree": {
                "val": "219.944"
            },
            "BudgetYearFour": {
                "val": "236.197"
            },
            "BudgetYearFive": {
                "val": "257.703"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element is budgeted in the Applied Research Budget Activity because its objective is to develop material, biological and energy technologies that make possible a wide range of new military capabilities.\n\nThe major goal of the Materials Processing Technology project is to develop novel materials, materials processing and manufacturing techniques, mathematical models and fabrication strategies for advanced structural and functional materials and components that will lower the cost, increase the performance, and\/or enable new missions for military platforms and systems.  Included in this project are efforts across a wide range of materials including: structural materials and devices, functional materials and devices, and materials that enable new propulsion concepts for land, sea, and space vehicles and low distortion optical lenses.\n\nThe Biologically Based Materials and Devices project acknowledges the growing and pervasive influence of the biological sciences on the development of new materials, devices and processes, as well as the commensurate influence of materials, physics and chemistry on new approaches to biology and biochemistry.  Contained in this project are thrusts in the application of biomimetic materials and devices for Defense, the development of biochemical materials to maintain performance, the use of biology's unique fabrication capabilities to produce structures that cannot be made any other way, the development of manufacturing tools that use biological components and processes for material synthesis, the development of new cognitive therapeutics, understanding the complexity in biological systems, and exploration of neuroscience technologies."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "166.067"
                },
                "CurrentYear": {
                    "val": "166.654"
                },
                "BudgetYearOne": {
                    "val": "179.383"
                },
                "BudgetYearOneBase": {
                    "val": "179.383"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "158.175"
                },
                "CurrentYear": {
                    "val": "166.654"
                },
                "BudgetYearOne": {
                    "val": "160.389"
                },
                "BudgetYearOneBase": {
                    "val": "160.389"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-7.892"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-18.994"
                },
                "BudgetYearOneBase": {
                    "val": "-18.994"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.231"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "-5.724"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "9.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-6.173"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-4.764"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-18.994"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-18.994"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2013:  Decrease reflects Congressional reductions for Sections 3001 & 3004, sequestration adjustments, reprogrammings, and the SBIR\/STTR transfer offset by Congressional  adds.\nFY 2015:  Decrease reflects the completion of 6.2 efforts in the Structural Materials and Coatings thrust. Demonstration efforts for this thrust area will continue in PE 0603766E, Project NET-02."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "MBT-01"
                    },
                    "ProjectTitle": {
                        "val": "MATERIALS PROCESSING TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "122.658"
                        },
                        "CurrentYear": {
                            "val": "125.144"
                        },
                        "BudgetYearOne": {
                            "val": "81.413"
                        },
                        "BudgetYearOneBase": {
                            "val": "81.413"
                        },
                        "BudgetYearTwo": {
                            "val": "101.018"
                        },
                        "BudgetYearThree": {
                            "val": "110.634"
                        },
                        "BudgetYearFour": {
                            "val": "124.077"
                        },
                        "BudgetYearFive": {
                            "val": "127.453"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The major goal of the Materials Processing Technology project is to develop novel materials, materials processing techniques, mathematical models and fabrication strategies for advanced structural and functional materials and components that will lower the cost, increase the performance, and\/or enable new missions for military platforms and systems.  Included in this project are efforts across a wide range of materials including structural materials and devices, functional materials and devices, low distortion optical lenses, and materials that enable new propulsion concepts for land, sea, and space vehicles."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "BioFuels"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "9.000"
                                        },
                                        "Text": {
                                            "val": "This effort will transition BioFuels technology developed under PE 0602715E."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Materials Processing and Manufacturing"
                                    },
                                    "Description": {
                                        "val": "The Materials Processing and Manufacturing thrust is exploring new manufacturing and processing approaches that will dramatically lower the cost and decrease the time required to fabricate DoD systems.  It will also develop approaches that yield new materials and materials capabilities that cannot be made through conventional processing approaches as well as address efficient, low-volume manufacturing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.750"
                                            },
                                            "Text": {
                                                "val": "-  Continued development on the path to carbon fiber with 100% improvement in strength and 50% improvement in stiffness over today's state-of-the-art high-performance structure carbon fibers, and demonstrated fiber production at manufacturing scale. \n-  Developed and demonstrated rapid, robust manufacture processes with an end goal of 20% increase in key material properties, 50% reduction of cost over baseline, and 50% reduction in time over baseline. \n-  Established impartial manufacturing centers of expertise that provide capability to non-traditional suppliers for demonstration, testing, and qualification of new manufacturing technologies; assisted in transition to the supply chain; provided access to potential customers; and facilitated training.\n-  Performed virtual manufacturing system exercises that pass design, manufacture, and verification of a specific part through the entire chain.\n-  Demonstrated rapid qualification and certification methodologies that empirically optimize part qualification and employed probabilistic models for variability analysis and risk, with an end goal of 50% reduction in certification time and cost."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "24.300"
                                            },
                                            "Text": {
                                                "val": "-  Validate predictive capability of process models on material properties and microstructure as well as component performance, quality level, and manufacturing effectiveness.\n-  Develop new probabilistic models and uncertainty quantification methodologies for rapid qualification.\n-  Develop and demonstrate manufacturing assessment tools for select new manufacturing technologies.\n-  Establish limits on lot size for additive manufacture of selected components that provide a 50% reduction in cost and time over standard fabrication baselines.\n-  Establish a library of process models and manufacturing data to support model use and improvement."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "21.784"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "21.784"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate integrated, physics-based, location-specific computational tools that predict the thermal history, residual stress, residual distortion, and microstructure of In718 alloys produced by direct metal laser sintering (DMLS).\n-  Implement in-process quality assurance (IPQA) sensors and technology capable of capturing DMLS processing data, and initiate development of optimized capture of real time data at appropriate resolutions to forecast article quality.\n-  Demonstrate operational phenomenological metallurgical models that link electron beam direct manufacturing (EBDM) process parameters to microstructure and material properties for location-specific prediction of ultimate tensile strength throughout a built structure.\n-  Demonstrate automated X-Y-Z wire position control system based on real-time, fast rate, solid-state backscattered electron sensor system.\n-  Simulate high fidelity probabilistic process window (including tails) for bonded composite structures using Monte Carlo techniques and a priori knowledge of process variables.\n-  Complete verified 2D and 3D bonded composite pi-joint structure models.\n-  Establish interoperable process-material model assessment framework, and curate and standardize a data management system to capture and store data from materials and manufacturing research."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multifunctional Materials and Structures"
                                    },
                                    "Description": {
                                        "val": "The Multifunctional Materials and Structures thrust is developing materials, materials processing, and structures that are explicitly tailored for multiple functions and\/or unique mechanical properties.  Development efforts under this thrust include reactive structures that can serve as both structure and explosive for lightweight munitions, novel materials and surfaces that are designed to adapt structural or functional properties to environmental and\/or tactical threat conditions, and new thin film material deposition processes to improve the performance of surface dominated properties (friction, wear, and membrane permeability).  Additionally, this project will develop new computational tools that link material properties to physics across multiple length scales (from molecule to part) in order to provide the ability to model and exploit complexity, such as hierarchy and strongly correlated effects, in structural and functional materials.  Examples of DoD applications that will benefit from these material developments include lower weight and higher performance aircraft, turbines with enhanced efficiency, erosion-resistant rotor blades, and high-temperature materials for operation in hypersonic environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated a lightweight desalination system that exploits a newly developed anti-fouling coating on an ultrafiltration membrane to achieve 75gph potable output from seawater with an overall power consumption of less than or equal to 10 W\/gph.\n-  Established techniques to deliver a high flux of gas-phase reactants to a surface at ambient pressure and temperature and demonstrated enhanced mobility of reactant molecules on a surface layer for material growth without bulk substrate heating. \n-  Explored phenomena such as surface plasmon resonances to enable site-specific nucleation and growth of high-temperature coatings at room temperature.\n-  Conducted small scale experiments that demonstrated the potential for maintaining a blast output enhancement of at least 4x while cutting explosive payload by 50% using reactive material structures.\n-  Characterized computationally the load and strain rate effects on modulus of reactive cases as a function of microstructure, case thickness, and load path. \n-  Verified that amorphous metal reactive structure composition and morphology can sustain loads in excess of 100,000 psi and at strain rates >10^3\/sec. \n-  Optimized fiber weave enforcement 3D architectures to sustain tensile, compressive, and hoop loads to > 100,000 psi and at strain rates > 10^3\/sec. \n-  Optimized composition, architecture, and impedance of fiber reinforcement weave and reactive matrix to \"extrude\" reactive constituents through reinforcement weave and produce activated, micron reactive particles."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "22.665"
                                            },
                                            "Text": {
                                                "val": "-  Integrate flux, mobility and reactivity process components to validate low-temperature deposition of DoD-relevant thin film coatings that currently require high bulk temperature.\n-  Quantify temporal and spatial stability of reactive species at ambient temperature for a DoD-relevant thin film coating in an integrated deposition system.\n-  Initiate comprehensive local control approach to thin film synthesis. \n-  Integrate fiber-reinforced reactive matrix and high-stiffness amorphous metals into reactive case structure and characterize dynamic mechanical response. \n-  Demonstrate ability to survive penetration into reinforced concrete with a minimal amount of strain deformation. \n-  Demonstrate survivability of impact into reinforced concrete at ballistic velocities.\n-  Demonstrate scalability to low-rate manufacturing scales while maintaining blast enhancement of survivable materials over inert cased charge."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.366"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.366"
                                            },
                                            "Text": {
                                                "val": "-  Experimentally validate computational models of low temperature diamond thin film growth.\n-  Integrate in situ characterization techniques for real-time qualitative and quantitative analysis of growth processes. \n-  Demonstrate deposition of diamond thin film challenge material on diamond single crystal or Si wafer at low temperature.\n-  Reduce non-diamond carbon content to improve film quality and properties by adjusting process component parameters\/integration strategy."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Materials for Force Protection"
                                    },
                                    "Description": {
                                        "val": "The Materials for Force Protection thrust is developing novel materials and materials systems that will greatly enhance performance against ballistic and blast threats including explosively formed projectiles (EFP) and shaped charges across the full spectrum of warfighter environments.  Included in this thrust are novel topological concepts as well as entirely new structural designs that will afford enhanced protection and functionality, at reduced weight and\/or cost."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "25.573"
                                            },
                                            "Text": {
                                                "val": "-  Scaled up transparent armor solution with multi-hit performance capability at weights equivalent to that of opaque armor. \n-  Demonstrated the ability to produce transparent armor in military relevant sizes while maintaining optical and ballistic performance characteristics.\n-  Initiated development of capability to accurately account for and track load paths during an underbody blast event and provide material properties and energy management mechanisms to meet survivability objectives.\n-  Continued to identify and evaluate promising new armor concepts from non-traditional organizations both for military personnel and vehicles.\n-  Performed validation testing of optimized advanced armor solutions that exploit the high-performance characteristics of low-cost materials using unique combinations of material composition and topology.\n-  Developed and demonstrated the high-risk manufacturing methods to transition the advanced armor technologies from laboratory scale into large-scale manufacturing and quality control processes that provide a marinized armor solution.\n-  Initiated effort to identify critical parameters that will permit scaling of subscale ballistic modeling and testing into the regime of military relevance. \n-  Established and used mechanics-based models and simulations to guide the design, development, and fabrication of ballistic armor.\n-  Continued integration of ballistic and blast energy management mechanisms into material systems and incorporated into candidate armor material systems for optimization against specific threats."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "26.159"
                                            },
                                            "Text": {
                                                "val": "-  Integrate material properties and energy management mechanisms into ballistic armor materials optimized for single threat defeat in each regime (bullet, frag, EFP) to meet survivability objectives.\n-  Demonstrate at least 50% enhancement in opaque vehicle ballistic armor performance in each regime (bullet, frag, EFP) for single threats over state-of-the-art fielded designs.\n-  Conduct study, based on single threat results, to establish feasibility of achieving 2x enhancement in opaque vehicle ballistic armor performance for multiple threats.\n-  Continue to identify and evaluate promising new armor concepts from non-traditional organizations both for military personnel and vehicles.\n-  Demonstrate >2x enhancement in energy absorption capability of candidate tactical vehicle materials over currently employed materials. \n-  Determine feasibility to reduce effects of localized dynamic loading in an underbody blast event by 50% over state-of-the-art. \n-  Determine feasibility to reduce effects of global impulse in an underbody blast event by 50% over state-of-the-art."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "22.649"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "22.649"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate at least 50% enhancement in opaque vehicle ballistic armor performance for combined bullet-frag threats over state-of-the-art fielded designs. \n-  Demonstrate capability, based on small arms threat results, to achieve at least 50% enhancement in opaque vehicle ballistic armor performance to defeat bullets from heavier weapons.\n-  Develop capability, based on results of feasibility study, to achieve 2x enhancement in opaque vehicle ballistic armor performance for multiple threats in an integrated armor design.\n-  Incorporate the best promising new armor concepts from non-traditional organizations into integrated ballistic armor design and demonstrate performance.\n- Develop and demonstrate ability of monohull design to spread impulsive load from enhanced (>2x impulsive load) underbody blast and prevent breach at equivalent weight to current underbody structures.\n- Integrate energy absorbing materials and components into passive hierarchical energy absorbing systems characteristic of various vehicle weight classes and demonstrate capability to reduce by >2x the combined effects of local and global impulse in underbody blast events. \n- Demonstrate capability to reduce by >2x the combined effects of local and global impulse in active counter impulse systems characteristic of various vehicle weight classes in underbody blast events.\n- Demonstrate capability to reduce by >4x the effects of both local and global impulse by combining hierarchical passive energy absorbing and active counter impulse systems into integrated systems characteristic of various vehicle weight classes in underbody blast events."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Functional Materials and Devices"
                                    },
                                    "Description": {
                                        "val": "The Functional Materials and Devices thrust will address problems with high-performance functional optical materials and components development.  Improved materials require deliberate control at the scale of the relevant phenomena.  This thrust will leverage the advanced fabrication capabilities currently available, coupled with design of optical materials and component structure, to drive functional materials to high performance for soldier-centric DoD applications by design.  Novel optical materials exploiting three-dimensional degrees of freedom to increase wavefront control, and flexible transparent displays are examples of materials in which design of structure at the scale of the critical phenomena can have significant impact on their performance.  To provide organic information, surveillance, and reconnaissance to the warfighter that greatly enhances awareness, security, and survivability, the capability for wearable (i.e., ultra-low size, weight, and power) systems with specific functionality will be developed.  These functions include holistic sensor integration, immersive telepresence, foveated imaging, remote reconnaissance and piloting, targeting assistance, and supplementary data overlay.  This thrust will also explore newly emerging areas where structure may play an important role."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.013"
                                            },
                                            "Text": {
                                                "val": "-  Investigated processes for integrating nano-polarizers with rigid gas permeable contact lenses.\n-  Initiated user testing of zoom contact lens.\n-  Evaluated current state-of-the-art-low profile heads-up display components.\n-  Fabricated wide field of view compact camera components with low size, weight, and power.\n-  Developed software design components supporting the joint optimization of optical and algorithms degrees of freedom.\n-  Investigated alternative algorithms for computer-enhanced vision."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.985"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate and conduct user testing of hands-free zoom capability.\n-  Demonstrate and conduct user testing of integrated head-mounted display with eye tracking.\n-  Assemble and test wide field of view compact camera.\n-  Demonstrate integrated software environment for image collection and processing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.000"
                                            },
                                            "Text": {
                                                "val": "-  Design soldier-wearable full-sphere, high-resolution visible and infrared camera array platform with integrated supplemental sensors.\n-  Continue development of immersive displays with rapid head and eye tracking, 3D augmented audio, and advanced wearable sensor interfaces.\n-  Demonstrate expanded situational awareness enhancements in training, reconnaissance, live mission, and after-action review.\n-  Demonstrate an optimized collaborative interface for rapid information dissemination to coordinate unit operations in combat."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Manufacturable Gradient Index Optics (M-GRIN)"
                                    },
                                    "Description": {
                                        "val": "The Manufacturable Gradient Index Optics (M-GRIN) program seeks to advance the development of GRIN lenses from a Technology Readiness Level (TRL) 3 to a Manufacturing Readiness Level (MRL) 6.  The program will expand the application of gradient index optics (GRIN) by providing compact, lightweight, and cost-effective lenses with controlled dispersion and aberrations that will replace large assemblies of conventional lenses.  The ability to create entirely new optical materials and surfaces creates the potential for new or significantly improved military optical applications, such as solar concentrators, portable designators, highly efficient fiber optics, and imaging systems.  The program also seeks to extend GRIN manufacturing technologies to glass, ceramic, and other inorganic materials in order to allow for small, lightweight, customized optical elements for mid-wave and long-wave infrared (MWIR and LWIR) applications.  A key component of the program is to develop new design tools that enable optics designers to incorporate dynamic material properties, fabrication methods, and manufacturing tolerances.  The integration of new materials, design tools, and manufacturing processes will enable previously unattainable 3-D optical designs to be manufactured.  This new manufacturing paradigm will enable flexible production of GRIN optics in quantities of one unit to thousands of units."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.223"
                                            },
                                            "Text": {
                                                "val": "-  Designed and fabricated tunable lens from variable refractive index polymers.\n-  Developed and demonstrated fusion of multiple layers of optical ceramic into preforms (visible and IR-transparent).\n-  Designed, built, and measured prototype IR chalcogenide lens using previously developed GRIN lens design tools and metrology methods.\n-  Demonstrated initial GRIN design tools add-on modules to allow GRIN design for commercially available optical design software intended for advanced users; modules incorporate specific manufacturing constraints and tolerances to allow for realistic designs.\n-  Designed and fabricated a GRIN-based optical system to retrofit an existing or new platform with less weight and\/or fewer optical elements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.800"
                                            },
                                            "Text": {
                                                "val": "-  Advance MRL yields and rapid redevelopment cycles.\n-  Demonstrate rapid redevelopment\/prototype manufacturing capability by producing multiple GRIN lenses from the same manufacturing process.\n-  Use prototype designs to demonstrate breadth of improved DoD-relevant parameters\/properties (wide field-of-view, f-number, bandwidth, etc.) in manufactured optical components.\n-  Expand IR metrology of program materials.\n-  Characterize thermal properties of M-GRIN materials and mitigate effect on optical performance.\n-  Expand design tools to add 3D and arbitrary gradients as well as improve computational efficiency."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.814"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.814"
                                            },
                                            "Text": {
                                                "val": "-  Complete GRIN lens production scale-up and demonstrate process control as measured against target yield and cost, to enable sustainable manufacturing.\n-  Demonstrate intermediate volume capability through repeatable production of several small lots.\n-  Upgrade design tools and expand potential user pool from advanced to mid-level optical designers, through upgrades and improvements of the GRIN design modules, to provide user-friendly interface for customers."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Structural Materials and Coatings"
                                    },
                                    "Description": {
                                        "val": "The Structural Materials and Coatings thrust is exploring and developing new materials that will provide enhanced structural and\/or surface properties for DoD applications.  Included are approaches that avoid corrosion through engineered material, provide superior strength at greatly reduced material density, provide the basis for a new generation of structural composite and submarine propeller materials, and enable prolonged lifetimes for DoD systems and components. \n\nThe goal of the Hybrid Multi Material Rotor Full-Scale Demonstration (HyDem) program, an outgrowth of the Structural Materials and Coatings effort's Hybrid Multi Material Rotor (HMMR) program, is to dramatically improve U.S. Navy submarine superiority.  The HyDem program will design, manufacture, and supply the Navy with a novel component for integration into a new construction Virginia Class Submarine.  The Navy will evaluate this component in sea trials.  If successful, it is envisioned that the Navy will integrate this design change into the future development of the Virginia Class and Ohio Replacement Submarines, and possibly back-fit previously constructed Virginia Class Submarines.  Beginning in FY2015 this program will be funded from PE 0603766E, Project NET-02, Maritime Systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.201"
                                            },
                                            "Text": {
                                                "val": "-  Completed Coupling Software Environment (CSE) development to enable strong coupling of the hybrid multi-material rotor (HMMR) domain codes required for time-accurate performance predictions of multi-material rotors. \n-  Manufactured and evaluated complex structural test specimens demonstrating ability to design robust products with multi-material technology.\n-  Developed a design for a scaled multi-material propeller or rotor for testing on a large-scale vehicle.\n-  Designed and fabricated representative articles for large-scale propeller or rotor blades for mechanical evaluations.\n-  Developed manufacturing process plans for large-scale vehicle propeller or rotor blades."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.500"
                                            },
                                            "Text": {
                                                "val": "-  Complete concept design, demonstrating the ability to scale from 1\/4-scale HMMR to full-scale component. \n-  Complete preliminary design, demonstrating that the design accommodates stated performance parameters. \n-  Perform shock test of scaled components.\n-  Develop manufacturing process plans for full-scale components.\n-  Deliver large-scale rotor to the Navy for in-water testing and assessment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Reconfigurable Structures"
                                    },
                                    "Description": {
                                        "val": "In the Reconfigurable Structures thrust, new combinations of advanced materials, devices, and structural architectures are being developed to allow military platforms to move, morph, or change shape for optimal adaptation to changing mission requirements and unpredictable environments.  This includes the demonstration of new materials and devices that will enable the military to function more effectively in the urban theater of operations.  Another focus is to build synthetic versions of biological systems that exhibit strong reversible adhesion via van der Waals forces, magnets, or microspines to scale vertical surfaces without using ropes or ladders.  In addition, this thrust will develop a principled, scientific basis for improved robotic ground mobility, manipulation, and autonomy, and leverage these results to develop and demonstrate innovative robot design tools, fabrication methods, and control methodologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.598"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated that a soldier with operationally relevant equipment (250lb upper limit) can robustly climb 25-foot walls built from diverse materials using gecko nanoadhesive.\n-  Transitioned additional Z-MAN prototype sets of gecko nanoadhesive to the services.\n-  Designed backing tile and microwedge materials, modeled physical characteristics of materials and fabrication processes, and developed processing techniques and tooling capabilities to demonstrate low-volume manufacturing capability of gecko nanoadhesive.\n-  Applied novel design tools to reduce design time of robots to include user-guided evolution of structures and controller, and automated morphological design processes. \n-  Applied fabrication methods to produce robot components at substantial (> 50% lower) cost savings, to include printing and assembly by folding of a walking robot, and fabrication of a soft pneumatically actuated robot. \n-  Demonstrated new control algorithms on real robots, including mobility efficiency improvements of at least 2x, prevention of rollover by reasoning about vehicle dynamics, and a touch-sensitive arm to reach through a cluttered workspace.\n-  Built and demonstrated robots with higher-performance mobility, including biped robots that can walk on previously inaccessible rough terrain, and robots that locomote at speeds at least twice as fast as current platforms.\n-  Developed high efficiency actuators, e.g., mechanical power factor correctors; mechanical, hydraulic, and electrical approaches for lightweight, high-power, variable-ratio transmissions; and switching modulation for hydraulic actuators, stepper motors, and purely mechanical systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.735"
                                            },
                                            "Text": {
                                                "val": "-  Complete design of actuation system for a humanoid robot, including bench-top testing of high-risk components and\/or subsystems.\n-  Demonstrate actuation of a humanoid robot that increases its energy efficiency by 20x, using the same kinematic structure, energy source, computing, and low-level control software.\n-  Demonstrate advanced energy-efficiency improvement actuation approaches by quantitative analysis and\/or simulation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.800"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.800"
                                            },
                                            "Text": {
                                                "val": "-  Validate advanced energy-efficiency improvement actuation approaches by experimentation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Alternate Power Sources"
                                    },
                                    "Description": {
                                        "val": "The Alternate Power Sources thrust evaluated materials and technologies that could utilize alternative power sources with the potential to provide significant strategic and tactical advantages to the DoD.  A consistent DoD need continues to be greater efficiency in a portable form factor.  For example, portable photovoltaic (PV) technologies could meet this need using low-cost manufacturing approaches."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.300"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated portable PV devices that produce at least 80% of their specified electrical output after the equivalent of one year of sunlight and after exposure to environmental hazards such as punctures, humidity, and temperature extremes.\n-  Demonstrated portable PV devices that function at greater than or equal to 16% power conversion efficiency.\n-  Designed portable PV devices that allow for greater than or equal to $4 per Watt manufacturing.\n-  Demonstrated PV devices that have density of less than or equal to 1500 grams per square meter."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MBT-02"
                    },
                    "ProjectTitle": {
                        "val": "BIOLOGICALLY BASED MATERIALS AND DEVICES"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "35.517"
                        },
                        "CurrentYear": {
                            "val": "41.510"
                        },
                        "BudgetYearOne": {
                            "val": "78.976"
                        },
                        "BudgetYearOneBase": {
                            "val": "78.976"
                        },
                        "BudgetYearTwo": {
                            "val": "99.707"
                        },
                        "BudgetYearThree": {
                            "val": "109.310"
                        },
                        "BudgetYearFour": {
                            "val": "112.120"
                        },
                        "BudgetYearFive": {
                            "val": "130.250"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project acknowledges the growing and pervasive influence of the biological sciences on the development of new DoD capabilities.  This influence extends throughout the development of new materials, devices, and processes and relies on the integration of biological breakthroughs with those in engineering and the physical sciences.  Contained in this project are thrusts in the application of biomimetic materials and devices for Defense, the use of biology's unique fabrication capabilities to produce structures that cannot be made any other way, the application of materials in biological applications, and the development of manufacturing tools that use biological components and processes for materials synthesis.  This project also includes major efforts aimed at integrating biological and digital sensing methodologies and maintaining human combat performance despite the extraordinary stressors of combat.  Finally, this thrust will develop new cognitive therapeutics, investigate the role of complexity in biological systems, and explore neuroscience technologies."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Neuroscience Technologies"
                                    },
                                    "Description": {
                                        "val": "The Neuroscience Technologies thrust leverages recent advances in neurophysiology, neuro-imaging, cognitive science, molecular biology, and modeling of complex systems to sustain and protect the cognitive functioning of the warfighter faced with challenging operational conditions.  Warfighters experience a wide variety of operational stressors, both mental and physical, that degrade critical cognitive functions such as memory, learning, and decision making.  These stressors also degrade the warfighter's ability to multitask, leading to decreased ability to respond quickly and effectively.  Currently, the long-term impact of these stressors on the brain is unknown, both at the molecular and behavioral level.  This thrust area will create modern neuroscientific techniques to develop quantitative models of this impact and explore mechanisms to protect, maintain, complement, or restore physical and cognitive functioning during and after exposure to operational stressors.  In addition, new approaches for using physiological and neural signals to make human-machine systems more time efficient and less workload intense will be identified, developed, and evaluated.  This thrust area will have far-reaching implications for both current and future military operations, with the potential to protect and improve physical and cognitive performance at the individual and group level both prior to and during deployment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.000"
                                            },
                                            "Text": {
                                                "val": "-  Integrated human data on stress genes to determine human stress-related gene networks for targeting interventions. \n-  Translated genes and networks identified in animals to humans using high throughput molecular data from population-based studies.\n-  Determined biomarkers of alertness in active duty personnel with psychological health problems\/traumatic brain injury.\n-  Correlated clinical and psychological profiles of patients with post-traumatic stress disorder to neural networks, neurochemicals and behavior for biomarker identification.\n-  Identified objective measures of physical and cognitive states through the application of integrated analytics and advanced computational techniques."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.917"
                                            },
                                            "Text": {
                                                "val": "-  Determine genetic, epigenetic, and proteomic changes underlying vulnerability to poor decision making in humans. \n-  Develop tools and metrics for evaluating individual and group performance during close quarters combat training and other operationally relevant training scenarios.\n-  Exploit advances in complexity theory and predictive models of the brain and investigate new modeling methods to develop tools and techniques that can characterize and improve cognitive performance under stress at both the individual and group level."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.000"
                                            },
                                            "Text": {
                                                "val": "-  Exploit new data and recent advances in functional imaging, neurophysiology recording, molecular and neural imaging, cognitive science, and biology in conjunction with emerging solutions in neurally enabled human-machine interface technologies to characterize dynamics of human cognitive functions such as memory, learning, and decision making. \n-  Initiate development of a unifying cross layer system model of the brain characterizing functions, dynamics, molecular and anatomical structure of the brain and their inter-relationships.\n-  Exploit recent advances in computational analysis, systems identification, data intensive computing, and statistical inference methods to develop computational tools and collaborative research platform for rapid analysis, validation, and integration of computational models of the brain.\n-  Initiate development of a new hierarchical framework for modeling and simulating structure, function and emergent behavior in complex biological systems and bionetworks.\n-  Create engineered intestinal biomes that respond to changes in critical neurotransmitter concentrations that control sense of well-being and satiety as well as those that influence intestinal health and nutrient uptake."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "BioDesign"
                                    },
                                    "Description": {
                                        "val": "BioDesign will employ system engineering methods in combination with biotechnology and synthetic chemical technology to create novel beneficial attributes.  BioDesign mitigates the unpredictability of natural evolutionary advancement primarily by advanced genetic engineering and molecular biology technologies to produce the intended biological effect.  This thrust area includes designed molecular responses that increase resistance to cellular death signals and improved computational methods for prediction of function based solely on sequence and structure of proteins produced by synthetic biological systems.  Development of technologies to genetically tag and\/or lock synthesized molecules would provide methods for prevention of manipulation (\"tamper proof\" synthetic biological systems).  This thrust will also develop new high-throughput technologies for monitoring the function of cellular machinery at the molecular level and the response(s) of that machinery to physical, chemical, or biological threats.  While conventional approaches typically require decades of research, new high-throughput approaches will permit rapid assessment of the impact of known or unknown threats on identified biomolecules and cell function."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.824"
                                            },
                                            "Text": {
                                                "val": "-  Developed novel genomic memory security technologies to sense environmental conditions and record them for future readout in the genome. \n-  Developed novel genomic circuits to identify microorganisms that were passed through the gut of live animals to test virulence.\n-  Developed lock-key device to permit research with protected or proprietary microorganisms only under authorized conditions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.438"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate functionality of genomic security technologies in two or more different commercially relevant microbes used for production of biocommodities. \n-  Evaluate high-throughput methods that have the potential to map intracellular proteins.\n-  Develop a path to detect intracellular components and events that are present in quantities ranging from fifty to thirty million copies per cell.\n-  Develop a plan to detect intracellular molecules with masses ranging from fifty to two hundred thousand Daltons. \n-  Initiate development of high throughput analytical equipment to measure the concentration of >1000 proteins simultaneously."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.354"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.354"
                                            },
                                            "Text": {
                                                "val": "-  Utilize high throughput approaches to characterize intracellular components and mechanistic interactions that reveal the effects of challenge compounds on intracellular machinery. \n-  Demonstrate high throughput methods using cells of human origin. \n-  Demonstrate the ability to identify intracellular components and events that occur hours after the application of a challenge compound. \n-  Demonstrate the ability to localize relevant molecules and events to one intracellular compartment (membrane, nucleus, or cytoplasm) upon the application of a challenge compound. \n-  Reconstruct and confirm greater than 20 percent of the molecules and mechanistic events that comprise the canonical mechanism of action for a demonstration compound which has been applied to cells.\n-  Initiate development of platform technologies to characterize molecular responses between members of a complex microbiome. \n-  Create algorithms to model the laws of communication within complex multi-cellular communities with the objective to predict how a community responds to new conditions\/threats.\n-  Initiate development of high-throughput arrayed microbiome-based technologies to identify novel secondary-metabolite antibiotics against pathogenic bacteria that have evolved multi-drug resistance."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Living Foundries"
                                    },
                                    "Description": {
                                        "val": "The goal of the Living Foundries program is to create a revolutionary, biologically-based manufacturing platform to provide new materials, capabilities, and manufacturing paradigms for the DoD and the Nation.  With its ability to perform complex chemistries, be flexibly programmed through DNA code, scale, adapt to changing environments and self-repair, biology represents one of the most powerful manufacturing platforms known.  However, the DoD's ability to harness this platform is rudimentary.  Living Foundries seeks to develop the foundational technological infrastructure to transform biology into an engineering practice, speeding the biological design-build-test-learn cycle and expanding the complexity of systems that can be engineered.  The program will enable the rapid and scalable development of previously unattainable technologies and products (i.e., those that cannot be accessed using known, synthetic mechanisms), leveraging biology to solve challenges associated with production of new materials (e.g., fluoropolymers, enzymes, lubricants, coatings and materials for harsh environments), novel functions (e.g., self-repairing and self-regenerating systems), biological reporting systems, and therapeutics to enable new solutions and enhancements to military needs and capabilities.  Ultimately, Living Foundries aims to provide game-changing manufacturing paradigms for the DoD, enabling distributed, adaptable, on-demand production of critical and high-value materials, devices, and capabilities in the field or on base.  Such a capability will decrease the DoD's dependence on tenuous material supply chains vulnerable to political change, targeted attack, or environmental accident.\n\nResearch thrusts will focus on the development and demonstration of open technology platforms, or bioproduction pipelines, that integrate the tools and capabilities developed in PE 0601101E, TRS-01 to prove out capabilities for rapid (months vs. years) design and construction of new bio-production systems for novel materials.  The result will be an integrated, modular infrastructure across the areas of design, fabrication, debugging, analysis, optimization, and validation -- spanning the entire development life-cycle and enabling the ability to rapidly assess and improve designs.  Integrated processes developed in this program will translate into significant performance improvements and cost savings for the production of advanced materials, biological reporting systems, and therapeutics.  These technologies will ultimately result in on-demand, customizable, and distributed production of strategic materials and systems.  Key to success will be tight coupling of computational design, fabrication of systems, debugging using multiple characterization data types, analysis, and further development such that iterative design and experimentation will be accurate, efficient and controlled.  Demonstration platforms will be challenged to build a variety of DoD-relevant, novel molecules and chemical building blocks with complex functionalities, such as synthesis of advanced, functional chemicals, materials precursors, and polymers (e.g., those tolerant of harsh environments)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.310"
                                            },
                                            "Text": {
                                                "val": "-  Initiated integration of fundamental tools and capabilities developed in PE 0601101E, TRS-01 to speed the design, build, and test loop of biological manufacturing, and start bio-foundries development. \n-  Demonstrated ability to speed the design, engineering and production of multiple new bioproducts by >7.5X (from years to months).\n-  Began development and refinement of tools and capabilities to translate designs across multiple platforms and biological systems; demonstrated ability to port a refactored gene cluster across multiple organisms while retaining function.\n-  Began to standardize fabrication, characterization, and test processes on a common infrastructure to enable modularity and flexibility for design and construction of new systems.\n-  Began development of new computational algorithms to perform quality control and evaluate screening data to automatically inform the redesign and optimization of novel biological production systems.\n-  Began initial demonstrations of ability to design, build and test materials production pathways that are difficult or impossible to synthesize using known mechanisms. \n-  Validated the concept of computational design and construction for a novel bio-synthetic pathway for acetaminophen, which was not previously obtainable through biosynthesis."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.155"
                                            },
                                            "Text": {
                                                "val": "-  Continue standardization, integration, and automation of the fundamental tools and capabilities developed in PE 0601101E, TRS-01 into a readily adoptable and adaptable biomanufacturing platform.\n-  Begin to integrate data streams (using previously developed computation algorithms and software) from fabrication, quality control and characterization tools to provide a comprehensive debugging capability and to enable forward design.\n-  Begin to demonstrate, test, and evaluate the extent of design-build-test cycle compression using integrated platforms to engineer new bioproduction systems.\n-  Initiate development of rapid design and prototyping infrastructure pipelines, including initial system integration and process optimization.\n-  Begin testing the ability of integrated infrastructure pipelines to demonstrate rapid, improved prototyping of DoD-relevant molecules."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "28.122"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "28.122"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate the ability of each infrastructure pipeline to rapidly generate DoD-relevant molecules.\n-  Expand the capabilities of the rapid design and prototyping infrastructure to target molecules and chemical building blocks that are currently inaccessible using traditional synthesis mechanisms.\n-  Complete proof-of-concept demonstrations of component technologies developed under PE 0601101E, TRS-01 that accelerate the design-build-test cycle.\n-  Expand access and experimental scale to promote the production capabilities of rapid design and prototyping facilities infrastructure.\n-  Begin establishing the efficacy of the integrated design-build-test-debug feedback cycle for forward design and rapid optimization of novel, currently inaccessible molecules via the prototyping facility's established processes."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SAEBR (Surprise Avoidance in Engineering Biology Research)"
                                    },
                                    "Description": {
                                        "val": "There is a national security need to assess and address the capabilities enabled by enhanced engineering biology technologies, and to protect the tools used for the facile engineering of biological systems.  The Surprise Avoidance in Engineering Biology Research (SAEBR) program will enlist leading experts across the engineering biology field to assess potentially surprising\/unanticipated applications enabled by newly designed tools, technologies, and methodologies as well as their potential for misuse.\n\nApplied research in this area will focus on understanding how current tools and technologies may be safeguarded against potential misuse."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.500"
                                            },
                                            "Text": {
                                                "val": "-  Begin evaluating how emerging engineering biology technologies can be safeguarded against misuse.\n-  Begin identifying molecular signatures that can distinguish \"natural\" organisms from synthetic strains."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Adaptive Immunomodulation-Based Therapeutics"
                                    },
                                    "Description": {
                                        "val": "The Adaptive Immunomodulation-Based Therapeutics program will develop platform technologies that can interrogate and define the biological pathways leading to an immune response  with the goal of developing and demonstrating new therapeutic interventions.  One approach to achieve this capability will require the development of new tools to stimulate and measure responses of the nervous system in order to map the bioelectric code that controls the immune response as well as other critical organ functions.  This program will also develop capabilities for serial measurements of metabolic state to identify correlates for health and early detection of disease.  An additional approach involves characterizing the host response in patients with severe infections, and translating this response into a quantitative framework that can be used to guide modulation of the immune response.  A further line of effort will pursue a detailed understanding of infectious diseases circulating in a community, with an aim to build capacity for the response to a crisis through managing current infectious disease challenges.  The effort will employ sophisticated laboratory testing to evaluate the evolution of pathogens.  Test beds in communities will be developed to evaluate the predictive algorithms by tracking infections in a community; influenza is an example of an infection that will be monitored.  Advances made under the Adaptive Immunomodulation-Based Therapeutics program will improve our response capability against severe infectious diseases and biological threats and offer new avenues for treating disease with no available drugs, such as multiple drug resistant organisms.  The ultimate goals for the Adaptive Immunomodulation-Based Therapeutics program are to enable an autonomous and continuous sense and response capability to regulate the human immune response and to develop decision support tools that help manage infectious diseases in a community.  It is anticipated that these capabilities will ultimately provide enhanced protection against injury, enable life-saving rescue from hyper-immune activity, and stimulate advances in regenerative medicine."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "-  Correlate proteome levels and ratios with phenotype data to identify new biomarkers for human performance, injury, and infection. \n-  Characterize the host response to severe infections, particularly severe respiratory infections and synthesize this information into a useable format, so that it can guide clinical interventions.  \n-  Develop capabilities to characterize the neural-immune interface, including real-time measurement of biomarkers and identification of novel, druggable targets for neural-immune modulation.\n-  Develop test beds to evaluate the spread of infectious diseases in a community, with an initial focus on influenza and drug-resistant bacterial infections.  \n-  Develop model and decision support tools that help to manage these infections in a community."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Blood Pharming"
                                    },
                                    "Description": {
                                        "val": "The Blood Pharming program developed an automated culture and packaging system that yields transfusable levels of universal donor red blood cells (RBCs) from progenitor cell sources.  The program produced 100 units of universal donor (Type O negative) RBCs per week for eight weeks in an automated closed culture system using a renewing progenitor population, and demonstrated a two hundred million-fold expansion of progenitor cell populations to mature RBCs.  The program capitalized on advances in cell differentiation, expansion, and bioreactor technology developed early in the program.  The Blood Pharming effort provides a safe donorless blood supply that is the functional equivalent of fresh donor cells, satisfying a large battlefield demand and reducing the logistical burden of donated blood in theater."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.214"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated fully integrated prototype instrument for medium-scale commercialized in vitro blood production.\n-  Established protocols to ensure protection of blood supply and to enable rapid response in emergency scenarios.\n-  Expanded value of in vitro blood product by enabling modification of red blood cells for therapeutic benefit.\n-  Developed and transferred methods to enhance expansion of red blood cell precursors for continuous cell production in bioreactor-based culture.\n-  Demonstrated successful grafting of modified progenitor cells into animal with subsequent establishment of robust in vivo production of modified mature red cells."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Maintaining Combat Performance"
                                    },
                                    "Description": {
                                        "val": "The Maintaining Combat Performance thrust utilized breakthroughs in biology and physiology to sustain the peak physical and cognitive performance of warfighters operating in extreme conditions.  Today, warfighters must accomplish their missions despite extraordinary physiologic stress.  Examples of these stressors include temperature extremes (-20 degrees F to 125 degrees F), oxygen deficiency at high altitude, personal loads in excess of 100 lbs., dehydration, psychological stress, and even performance of life-sustaining maneuvers following combat injury.  Not only must troops maintain optimum physical performance, but also peak cognitive performance.  This includes the entire spectrum from personal navigation and target recognition, to complex command control decisions and intelligence synthesis.  The Maintaining Combat Performance thrust leveraged breakthroughs in diverse scientific fields in order to mitigate the effects of physiological stress on warfighter performance in harsh combat environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.169"
                                            },
                                            "Text": {
                                                "val": "-  Developed an inhaled nitric oxide gas derivative (ENO) that improves O2 delivery and physical performance at altitude, and developed portable delivery system.\n-  Demonstrated with large animal studies (sheep, swine) that lead compound ENO stabilized physiologic status and improved oxygen utilization under high altitude simulation.\n-  Improved cerebral oxygenation in human subjects in hypoxic conditions (12% O2) with the treatment of inhaled ENO. \n-  Completed field study of combined aminophylline and methazolamide therapy that showed improvement in blood oxygen saturation in human subjects."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                }
            ]
        }
    }
}