{
    "id": "0119a761c4a1f8c34148d90cbcbfcca621efa4a3",
    "meta": {
        "filename": "dod-2015_RDTE_2015_ARMY_BA2_RDTE_JustificationBook_Army_PB_2015.zzz_unzipped_RDTE_JustificationBook_Army_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602618A"
        },
        "ProgramElementTitle": {
            "val": "BALLISTICS TECHNOLOGY"
        },
        "R1LineNumber": {
            "val": "14"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "55.113"
            },
            "CurrentYear": {
                "val": "75.263"
            },
            "BudgetYearOne": {
                "val": "85.597"
            },
            "BudgetYearOneBase": {
                "val": "85.597"
            },
            "BudgetYearTwo": {
                "val": "93.967"
            },
            "BudgetYearThree": {
                "val": "88.749"
            },
            "BudgetYearFour": {
                "val": "90.980"
            },
            "BudgetYearFive": {
                "val": "91.977"
            }
        },
        "ProgramElementNote": {
            "val": "FY13 decreases attributed to General Congressional reductions (-130 thousand); SBIR\/STTR transfers (-733 thousand); and Sequestration Reductions (-4.847 million)\nFY 14 adjustment attributed to Congressional Add funding (7.0 million) and FFRDC reductions (-37 thousand)\nFY15 increases for Active Protection Technologies, Warrior Injury Assessment Manikin, Survivability\/Lethality Analyses, and Disruptive Energetics."
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) investigates and evaluates materials and technologies, and designs and develops methodologies and models required to enable enhanced lethality and survivability.  Project H80 focuses on applied research of lightweight armors and protective structures for the Soldier and vehicles; kinetic energy active protection; crew and components protection from ballistic shock and mine-blast; insensitive propellants\/munitions formulations; novel multi-function warhead concepts; affordable precision munitions design; and techniques, methodologies, and models to analyze combat effectiveness, and identify vulnerabilities of current and emerging technologies; and developing a demonstrator with associated methods and tools for injury prediction of vehicle occupants during under-body blast events.      \n\nWork in this PE makes extensive use of high performance computing and experimental validation and builds on research transitioned from PE 0601102A (Defense Research Sciences)\/Project H42 (Materials and Mechanics) and Project H43 (Ballistics); and utilizes emerging materials from PE 0602105A (Materials Technology) and applies it to specific Army platforms and the individual Soldier applications.  \n\nThe work in this PE complements and is fully coordinated with efforts in PE 0602120A (Sensors and Electronic Survivability), PE 0602303A (Missile Technology), PE 0602601A (Combat Vehicle and Automotive Technology), PE 0602624A (Weapons and Munitions Technology), PE 0602705A (Electronics and Electronic Devices), PE 0602716A (Human Factors Engineering), PE 0602786A (Warfighter Technology), PE 0603125A (Combating Terrorism-Technology Development), PE 0603001A (Warfighter Advanced Technology), PE 0603004A (Weapons and Munitions Advanced Technology), PE 0603005A (Combat Vehicle Advanced Technology), PE 0603313A (Missile and Rocket Advanced Technology), and PE 0708045A (Manufacturing Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy. \n\nWork in this PE is performed by the U.S. Army Research Laboratory (ARL), Aberdeen Proving Ground, MD."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "60.823"
                },
                "CurrentYear": {
                    "val": "68.300"
                },
                "BudgetYearOne": {
                    "val": "68.298"
                },
                "BudgetYearOneBase": {
                    "val": "68.298"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "55.113"
                },
                "CurrentYear": {
                    "val": "75.263"
                },
                "BudgetYearOne": {
                    "val": "85.597"
                },
                "BudgetYearOneBase": {
                    "val": "85.597"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-5.710"
                },
                "CurrentYear": {
                    "val": "6.963"
                },
                "BudgetYearOne": {
                    "val": "17.299"
                },
                "BudgetYearOneBase": {
                    "val": "17.299"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.130"
                    },
                    "CurrentYear": {
                        "val": "-0.037"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "7.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.733"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "17.299"
                                },
                                "BudgetYearOneBase": {
                                    "val": "17.299"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Sequestration"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-4.847"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "H80"
                    },
                    "ProjectTitle": {
                        "val": "Survivability And Lethality Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "55.113"
                        },
                        "CurrentYear": {
                            "val": "68.263"
                        },
                        "BudgetYearOne": {
                            "val": "85.597"
                        },
                        "BudgetYearOneBase": {
                            "val": "85.597"
                        },
                        "BudgetYearTwo": {
                            "val": "93.967"
                        },
                        "BudgetYearThree": {
                            "val": "88.749"
                        },
                        "BudgetYearFour": {
                            "val": "90.980"
                        },
                        "BudgetYearFive": {
                            "val": "91.977"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project investigates, designs and develops materials,methods and models that provide Soldier protection by enhancing survivability and lethality.  Specific technology and research thrusts include: lightweight armors and protective structures; crew and component protection from ballistic shock and\/or mine-blast; insensitive high energy propellants\/munitions to increase lethality and reduce propellant\/munitions vulnerability to attack; novel kinetic energy (KE) penetrator concepts to maintain\/improve lethality; novel multi-function warhead concepts to enable defeat of a full-spectrum of targets (anti-armor, bunker, helicopter, troops); and techniques, methodologies and models to analyze combat effectiveness and identify vulnerabilities of current and emerging technologies; and developing a demonstrator and associated methods and analysis tools for injury prediction (due to underbody blast).   \n\nThis project sustains Army science and technology efforts supporting the Ground, Lethality and Soldier portfolios.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the U.S. Army Research Laboratory (ARL), Aberdeen Proving Ground, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Structural Armor"
                                    },
                                    "Description": {
                                        "val": "This effort conducts applied research to design advanced lightweight structural armor technologies, such as ceramic, metallic, transparent, and electromagnetic, for transition to current and future tactical as well as combat vehicle designers.  The goal is to provide designs that reduce weight while improving ballistic protection and affording multifunctional capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.478"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Optimized weight and validated FY12 encapsulated and laminated ceramic armor technologies for future vehicle platforms; and used high performance computing (HPC) modeling and simulation tools coupled with experiments to validate emerging passive material concepts and investigated threat defeat mechanisms that provide higher mass efficiency against more aggressive KE threats expected to proliferate during the next decade.  In FY14 this work moved to Multi-Threat Armor Formulation and Designs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mine Blast Protection"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and designs tools, techniques, and technologies for protection against mine\/improvised explosive device (IED) blast threats, ballistic shock mitigation, and fuel\/ammunition fires to enable survivability of current and future platforms and the dismounted Soldier."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.209"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conducted characterization and model development of vehicular hull structural welds while providing further refinement of soil models for incorporation into simulations of full scale blast events; and continued investigations of novel energy absorbing seat materials, restraints and structural designs with refined simulations for system design optimization by U.S. Army Tank and Automotive Research, Development and Engineering Center (TARDEC) in PE 0603005A.  In FY14 this work moved to Underbody Blast & Occupant Protection."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Underbody Blast & Occupant Protection"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and designs tools, techniques, and technologies for protection against mine\/IED blast threats, ballistic shock mitigation, and fuel\/ammunition fires to enable survivability of current and future platforms."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.188"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Introduce advanced modeling tools developed under the Ballistic and Blast Loading Highly Scalable Software Institute to develop strongly hardened hull designs; and mature long-stroke technology and multi-directional seating mechanisms to further enhance interior protection along with an appropriate sensor suite for pre-activation of active seat or exterior hull mechanisms."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.750"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.750"
                                            },
                                            "Text": {
                                                "val": "Will continue to develop experimental and modeling approaches to identify relevant physical parameters affecting the loading from buried blast and penetrator threats; develop experimental tools to track complex occupant motion during a blast event and validate associated numerical models; and develop and validate momentum transfer concepts to absorb energy from underbody threats through a combination of materials development and structural design research."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Low Cost Hyper-Accuracy Munition Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort designs advanced components\/subsystems to enable a broad spectrum of future affordable direct and indirect fire precision munitions. The focus is on a multidisciplinary approach to munition systems design by coupling physics-based models of interior ballistics, launch dynamics, flight mechanics, and high-gravitational force guidance, navigation, and control (GN&C) technologies. The goal is smaller, cheaper and lighter munition components enabling low-collateral-damage precision munitions for future asymmetric operations in military operations on urban terrain (MOUT)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.706"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Experimentally validated highly maneuverable direct and indirect fire munitions concepts to extend range and increase terminal effects by continuing applied research of components for novel actuation concepts, low cost guidance technologies, smart structures; and developed models to computationally support munitions designs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.788"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Implement new optimal terminal homing guidance laws and flight control algorithms in simulation code; conduct parametric studies across a range of attack angles to quantify resulting control effectiveness to more cost effectively and accurately hit targets; and perform lab, wind tunnel and soft launch experiments to investigate lifting surface control mechanisms and lateral & axial thrusters especially at high angles of attack."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.148"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.148"
                                            },
                                            "Text": {
                                                "val": "Will advance individual component guidance technologies and simulation capability by evaluating, at bench level, candidate actuator technologies, guided spin-stabilized munition technologies, and flow control technologies; and assess concepts using multiple technologies for guided munitions in global positioning system (GPS) denied environments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Disruptive Energetics and Propulsion Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort investigates, evaluates, selects, and models propulsion and energetic materials and technologies to validate novel energetic materials concepts (such as nano-structural and insensitive) that exploit managed energy release required for improving the effectiveness and reducing the vulnerability of future gun\/missile systems and warheads.  This effort builds on disruptive energetic materials discovery efforts in PE 0601102A (Defense Research Sciences)\/project H43 (Ballistics) to synthesize new materials with energy content up to ten times that of Research Department Explosive (RDX)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.629"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Employed validated multi-scale models to conceive new energetic material compounds; designed and improved affordable propellant coatings to manage temperature sensitivity and enhance insensitive munitions qualities; and developed and applied advanced, reacting-flow, multiphase, computational fluid dynamics methods incorporating advanced bi-propellant (liquids and solids) chemistry for future missile applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.475"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Synthesize two new energetic compounds (binder and explosive) that exhibit increased energy compared to current carbon, hydrogen, nitrogen and oxygen (CHNO) compounds; experimentally quantify their performance with a small scale technique that cost effectively requires only grams (compared to current kilogram technique); and evaluate propellant improvements for small arms ammunition."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.177"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.177"
                                            },
                                            "Text": {
                                                "val": "Will explore and exploit innovative methods for efficient synthesis and scale-up of disruptive energetic materials; develop novel energetic ingredients using chemical and high pressure synthesis methods; use these ingredients in new formulations for transition to weapons applications with significantly improved performance; develop multi-phase explosive and initiation concepts to maximize energy transfer to target;  develop and validate numerical model of muzzle flow field in small caliber weapon systems to enable control of overpressure; and validate propulsion models and methods to enable 6 to 10 times solid propellant burn-rate\/regression-rate enhancement using nitrate ester and novel propellant ingredients."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Lethal and Scalable Effects Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort identifies and models preferred options to reduce energy\/mass required to defeat emerging armor threats and to provide multi-purpose capabilities for revolutionary future lethality. In addition, this effort investigates technology options for scaling warhead lethality to enhance urban Warfighting capabilities including control of collateral damage."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.328"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Advanced FY12 scalable lethality concepts that defeat a range of threats with a single munition; and developed small and medium caliber penetrator technologies and concepts to improve the performance of armor-piercing rounds against heavy body armors, lightweight vehicle armors, and against high-obliquity urban targets."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.012"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct proof of principle experiments for man portable weapons that validate capability to perforate wall targets including double reinforced concrete and adobe; experimentally investigate and quantify performance improvements of chemical energy weapons when nano-crystalline materials (e.g., copper and tungsten) are used; conceptualize variations in novel penetrator deployment schemes and conduct laboratory experiments to understand how deployment variations affect lethality performance; and incorporate an optimized multi-component\/jacketed shearing composite penetrator into a large caliber cartridge to examine its lethality."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.238"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.238"
                                            },
                                            "Text": {
                                                "val": "Will develop small caliber soldier-portable mechanisms to defeat combatants in high-risk urban scenarios; validate robust kinetic energy penetrator concept with reduced mass while maintaining armor defeat capabilities to reduce life-cycle costs and enable defeat of future threats; and validate modeling and simulation capabilities to assess novel lethality concepts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Survivability\/Lethality Analyses"
                                    },
                                    "Description": {
                                        "val": "This effort devises state-of-the-art survivability\/lethality\/vulnerability methodologies to dynamically model the interaction of conventional ballistic threats against future weapon systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.700"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Improved vulnerability analysis methodologies for injury criteria and injury assessment to address crew protection and survivability for mine blast threats; and prepared for FY14 validation and verification of the Modular Unix-based Vulnerability Estimation Suite (MUVES) 3 ballistic vulnerability and lethality code."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.041"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop new methodologies to characterize Personnel Protective Equipment armor back face deformation and assess the associated injury incapacitation probabilities for soldiers; and perform improvements to tools, techniques, and methodologies for ballistic survivability\/lethality analysis to ensure analysis tools are relevant and credible for developmental and modernized Army systems; and conduct validation and verification of the MUVES 3 ballistic vulnerability and lethality code."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.566"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.566"
                                            },
                                            "Text": {
                                                "val": "Will develop new methodologies to characterize behind helmet blunt trauma and assess the associated injury incapacitation probabilities for soldiers; develop predictive ammunition vulnerability methodologies (vulnerability to unintended ammunition detonation due to incoming round); perform improvements to tools, techniques, and methodologies for ballistic survivability\/lethality analysis to ensure analysis tools are relevant and credible for developmental and modernized Army systems; and conduct validation and verification of  ballistic vulnerability and lethality codes."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi-Threat Armor Formulations and Designs"
                                    },
                                    "Description": {
                                        "val": "This effort devises and matures multi-threat hybrid armor technologies incorporating both active and passive mechanisms for ground vehicle systems that are effective against future conventional weapons and evolving improvised threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.814"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Determined physics mechanisms to explore potential efficiencies against very large improvised threats and investigate fusion of best mechanisms with known technologies for conventional threat defeat; validated and exercised algorithms that capture the multi-physics aspects of the determined mechanisms and begin transition to U.S. Army TARDEC (PE 0602601A\/Project C05) technologies for defeat of very large improvised threats; and began development of high-resolution anatomic computational model for the human legs and spine that accurately predicts critical injury mechanisms that may result from vehicular underbelly blast and other accelerative loading utilizing emerging data from the anthropomorphic Test Device (Warrior Injury Assessment Manikin, WIAMan) development effort."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.071"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop ceramic laminate technology, large improvised threat protection, second generation multi-threat protection and support transition to the U.S. Army TARDEC (PE 0602601A\/project C05);  and use modeling and simulation coupled with experimentation to explore encapsulated ceramic mechanisms capable of defeating more advanced KE threats and begin exploration and concept development of novel adaptive protection."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.975"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.975"
                                            },
                                            "Text": {
                                                "val": "Will continue to investigate ceramic laminate characteristics to identify\/gain iterative improvements for protection during future threat\/armor engagement processes; investigate concepts for defeat of very large shaped charge threats, including developing an understanding of how various defeat mechanisms interact as threat size increases; explore novel explosive reactive armor mechanisms for defeat of advanced threats; develop new approaches for advanced  kinetic energy (KE) multi-hit defeat for vehicle sides and front; validate protection capabilities against both explosively formed penetrators (EFPs) and rocket propelled grenades (RPGs) by utilizing multiple defeat mechanisms in a single system; develop new mechanisms to enable defeat of both KE and chemical energy (CE) threats in a single system; and support transitions to the  U.S. Army TARDEC (PE 0602601A\/project C05 and PE 0603005A\/project 441)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ballistic and Blast Protection for Dismounted Soldiers"
                                    },
                                    "Description": {
                                        "val": "This effort develops unique physics based models to understand the deflection and stress wave interactions with the human during the complex target interactions between threats and personal protective equipment (PPE).  Use of this knowledge framework to develop low technology readiness level (TRL) PPE concepts that are informed by the human effects during impact and blast events."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.108"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop techniques for understanding the response of biologic materials at high rates of loading that cause severe deformation and failure; and explore low TRL concepts for PPE that are based on computational simulations of the interaction of humans with the dynamic threat\/PPE impact."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.259"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.259"
                                            },
                                            "Text": {
                                                "val": "Will develop an objective blunt trauma test methodology for helmets using a combination of experimental and modeling approaches, exploring relationships to injury mechanisms; and explore the use of covers and surface coatings on ceramic performance for monolithic and flexible body armor concepts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Penetrator Lethality Applied Research"
                                    },
                                    "Description": {
                                        "val": "This effort evaluates effects of velocity and novel penetrator designs for future lethality applications across the spectrum of targets to include vehicles, buildings, and personnel."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.249"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Determined penetration efficiency of full scale novel penetrators; performed modeling and simulation to define a guided projectile with novel lethal mechanisms and conducted experiments that validate concept projectile(s) can withstand launch environment; conducted lethality analysis (probability of kill given a hit) of novel concepts across the velocity spectrum; and investigated light weight composite sabot technology for rifled barreled guns."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.847"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct lethality analysis (probability of kill given a target hit) across the velocity spectrum for novel penetrator concepts; conceptualize variations in novel penetrator deployment schemes and conduct laboratory experiments to understand how deployment variations affect lethality performance; and incorporate an optimized multi-component\/jacketed shearing composite penetrator into a large caliber cartridge to examine its lethality."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier Lethality Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on development of advanced lethal mechanisms, improved accuracy approaches, and leverages state-of-the-art materials to enable a single small arms cartridge for defeat of hard and soft targets and enable the defeat of combatants in defilade out to 2km."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.994"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigate alternate approaches to increase long range precision and improve probability of incapacitation for sniper and small arms applications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.484"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.484"
                                            },
                                            "Text": {
                                                "val": "Will pursue novel concepts to enable significant increases in impact velocities, reduced muzzle pressures, and increased accuracy in small caliber systems; and develop understanding of alternate approaches to achieve long range precision for 50 caliber man-portable systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Warrior Injury Assessment Manikin (WIAMan)"
                                    },
                                    "Description": {
                                        "val": "This work develops an improved demonstrator blast test manikin, data acquisition system, and injury prediction methods and tools that incorporate new medical research and which provides an improved capability to measure and predict skeletal injuries for vehicle occupants during under-body blast events.  (Prior to FY14, this effort was described under the Survivability\/Lethality Analyses.)"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.239"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete technical data package for the design concept for a first generation, WIAMan demonstrator; begin fabrication of the first generation WIAMan demonstrator and initiate manufacturing and component testing; develop new methods for injury prediction and spin-out knowledge to benefit on-going Live Fire Test & Evaluation programs; and define concept for WIAMan data acquisition system."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.500"
                                            },
                                            "Text": {
                                                "val": "Will initiate validation and verification testing of the first generation WIAMan demonstrator; design and initiate development of the WIAMan data acquisition system; transfer knowledge and tools for use in Live Fire Test & Evaluation and other under-body blast survivability efforts; and conduct research to establish human tolerance to the under-body blast loading environment and development of human injury probability curves; and transfer of responsibilities and funding (PE 0602787A\/project 869) from U.S. Army Medical Research and Materiel Command (MRMC) to U.S. ARL effective FY15."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Vulnerability Assessment of Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on independently reviewing developmental technologies in the context of current and emerging threats, identifying tradeoffs that may not have been considered by the technologies' proponents, developing risk reduction and mitigation strategies and promoting the development of technologies that are \"threat ready\" when they evolve into a formal program of record or are fast-tracked to the field.  State-of-the-art vulnerability assessment methodology and tools will be applied across a broad spectrum of threats in order to determine vulnerabilities.  This effort includes investigating, designing and developing methods and tools and the oversight and coordination required to execute this research across the Army enterprise. \nThis work complements and is be coordinated with PE 63125A\/project DF5."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.500"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Design and conduct experiments on developmental communications technologies (Multiple-Input and Multiple-Output (MIMO), Dynamic Spectrum Access, and Ultra-Wideband) to identify potential technology vulnerabilities through brute force and smart jamming approaches, spoofing, malicious code, and device discovery exploitation; determine mitigation options to address demonstrated technology vulnerabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.500"
                                            },
                                            "Text": {
                                                "val": "Will select developmental (current and emerging) technologies; identify spectrum of threats for technologies identified and select high-priority threats for investigation; design, develop and mature assessment methods and tools; design and conduct experiments that will demonstrate technology vulnerabilites; and identify mitigation stratgies for any vunlerabilities discovered.  Technology selection will be influenced by highest priority\/highest potential payoff technologies taking in to account intelligence research, such as that performed at the National Ground Intelligence Center (e.g. high priority threat\/capabilities, threat horizon, characterization of contested environment, etc.); and design assessments with environments and factors that may be used to demonstrate vulnerabilities (electronic warfare, cyber security, survivability, lethality and system of systems).  Candidates and technologies to investigate include Command, Control, Communications, Computers, Intelligence, Surveillance and Reconnaissance (C4ISR) and Network Modernization, Active Protection Systems, unmanned ground vehicle\/unmanned aerial vehicle technologies, hostile fire detection technologies, digital radio frequency memory (DRFM) for countermeasures\/counter-countermeasures, or optics technologies that might benefit from reduction of optical augmentation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Active Protection Modeling and Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort supports the development of Active Protection System (APS) technologies and common architecture to reduce vehicle weight while significantly increasing protection against current and emerging advanced threats by reducing reliance on armor through other means such as sensing, warning, and active countermeasures.  The APS common architecture will provide adaptable APS solutions that can be integrated across Army vehicle platforms as required.  This research includes the development of new modeling and simulation capabilities along with supporting experimental and theoretical approaches to enable active protective systems.  This effort includes integrated information (e.g., battlefield geography, threat launch detection and tracking) and intelligence to inform protection optimization, requiring collaboration across multiple Army organizations.  This effort complements and is coordinated with Program Elements, PE 0602601A\/project C05, PE 0603004A\/project 232, PE 0603005A\/project 221, PE 0603270A\/project K16, and PE 0603313A\/project 263."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "Will explore threat independent hybrid\/adaptive mechanisms; develop and validate initial computational model to examine interactions of sensors and defeat mechanisms against ballistic threats; and develop active protection concepts, including counter measures, threat warning capabilities, and dynamic threat maps."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "HB1"
                    },
                    "ProjectTitle": {
                        "val": "SURVIVABILITY AND LETHALITY TECHNOLOGIES (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "7.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "These are Congressional Interest Items"
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "Description": {
                                        "val": "This is a Congressional Interest Item"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Program Increase"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}