{
    "id": "0231cdb06eea0d94280e798456c87e884c3e55e6",
    "meta": {
        "filename": "dod-2015_RDTE_2015_ARMY_BA2_RDTE_JustificationBook_Army_PB_2015.zzz_unzipped_RDTE_JustificationBook_Army_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602784A"
        },
        "ProgramElementTitle": {
            "val": "MILITARY ENGINEERING TECHNOLOGY"
        },
        "R1LineNumber": {
            "val": "25"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "71.553"
            },
            "CurrentYear": {
                "val": "70.027"
            },
            "BudgetYearOne": {
                "val": "63.311"
            },
            "BudgetYearOneBase": {
                "val": "63.311"
            },
            "BudgetYearTwo": {
                "val": "62.757"
            },
            "BudgetYearThree": {
                "val": "66.845"
            },
            "BudgetYearFour": {
                "val": "69.813"
            },
            "BudgetYearFive": {
                "val": "74.823"
            }
        },
        "ProgramElementNote": {
            "val": "FY15 funding realigned to support higher Army priorities."
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) investigates, evaluates, and advances technologies, techniques and tools for depiction and representation of the physical and human environment for use in military planning and operations; for characterizing geospatial, atmospheric and weather conditions and impacts on systems and military missions; for conducting mobility, counter-mobility, survivability and force protection; and for enabling secure, sustainable, energy efficient facilities.  Research focuses on special requirements for battlefield visualization, tactical decision aids, weather intelligence products, and capabilities to exploit space assets.  Project 855 conducts geospatial research and development supporting a standard sharable geospatial foundation enabling a common operating environment across mission and command systems. Project H71 supports the materiel development, testing, and operations communities in evaluating the impacts of weather and atmospheric obscurants on military materiel and operations. Project T40 advances technologies for adaptive and expedient force protection across the range of military operations (includes Deployable Force Protection).  This project also designs and evaluates software and hardware to identify and mitigate positive and negative ground obstacles; characterizes austere navigation environments and designs\/evaluates materiel solutions including rapidly emplacable bridging, ground stabilization and breakwater structures; and builds and uses modeling and simulation tools to advance understanding of the interactions of weapons\/munitions and novel defeat methodologies with buildings, shelters, bunkers, berms and bridges.  Project T41 investigates and evaluates application of technologies to enable garrison\/post commanders to plan, monitor and operate facilities more efficiently, cost-effectively, securely and sustainably; and creates tools (including advanced models and simulation) that provide a framework for making trades and decisions, and also supports research to evaluate non-combat population characteristics and status from social and cultural perspectives to achieve mission objectives.  Project T42 develops and validates models and simulations to understand the impacts of the physical environment on the performance of forces, ground and air vehicles, and sensors; as well as the impact of natural and man-made changes in the environment on military operations.  Project T45 investigates and evaluates materials, components and systems that have potential to reduce energy losses in buildings and shelters; and potential to detect and mitigate consequences of contaminants such as bacteria and molds in air handling equipment and building materials.  \n \nThe cited work is consistent with the Assistant Secretary of Defense, Research Engineering Science and Technology priority focus areas and the Army Modernization Strategy.  \n\nResearch is transitioned to PE 0603734A (Military Engineering Advanced Technology) and PE 0603125A (Combating Terrorism, Technology Development).  \n\nWork in this PE is led, managed or performed by the U.S. Army Engineer Research and Development Center, Vicksburg, MS, and the Army Research Laboratory, Aberdeen Proving Ground, MD. Deployable force protection activities are coordinated with research, development and engineering centers and laboratories across the US Army, Navy and Air Force."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "70.693"
                },
                "CurrentYear": {
                    "val": "70.064"
                },
                "BudgetYearOne": {
                    "val": "73.011"
                },
                "BudgetYearOneBase": {
                    "val": "73.011"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "71.553"
                },
                "CurrentYear": {
                    "val": "70.027"
                },
                "BudgetYearOne": {
                    "val": "63.311"
                },
                "BudgetYearOneBase": {
                    "val": "63.311"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.860"
                },
                "CurrentYear": {
                    "val": "-0.037"
                },
                "BudgetYearOne": {
                    "val": "-9.700"
                },
                "BudgetYearOneBase": {
                    "val": "-9.700"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.177"
                    },
                    "CurrentYear": {
                        "val": "-0.037"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "7.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.659"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-9.700"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-9.700"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments 1"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-5.304"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "855"
                    },
                    "ProjectTitle": {
                        "val": "Topographical, Image Intel & Space"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "14.094"
                        },
                        "CurrentYear": {
                            "val": "17.738"
                        },
                        "BudgetYearOne": {
                            "val": "15.478"
                        },
                        "BudgetYearOneBase": {
                            "val": "15.478"
                        },
                        "BudgetYearTwo": {
                            "val": "16.203"
                        },
                        "BudgetYearThree": {
                            "val": "17.635"
                        },
                        "BudgetYearFour": {
                            "val": "18.445"
                        },
                        "BudgetYearFive": {
                            "val": "18.595"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item"
                        },
                        "ProjectMissionDescription": {
                            "val": "This project investigates and advances capabilities for collection, processing, and creation of data and information depicting physical and human terrain, environmental conditions, and relationships in time and space; for digital map creation, transmission, and dissemination; and for map-based analytics for planning, decision making and execution.  This project uses non-traditional methods that exploit existing open source text, multi-media and cartographic materials addressing social, cultural and economic geography to advance the capability to produce and transmit high fidelity digital maps depicting the physical terrain, human terrain and environmental conditions. This project also develops software tools and methods for map-based analytics that allow deeper insights into the effects of the physical terrain, human terrain and environmental conditions on military operations, to include tactics and effects upon equipment and Soldier's performance.  This project explores and advances components and methods that optimize the utility of the Army Geospatial Enterprise (AGE) to the total Army which provides map and geospatial data, information, and software services to the total force.\n\nWork in this project supports the Army S&T Command, Control, Communications and Intelligence (C3I) Portfolio.\n\nWork in this project complements efforts in PE 0602784A, Project H71.  \n\nThe cited work is consistent with the Assistant Secretary of Defense, Research Engineering Science and Technology priority focus areas and the Army Modernization Strategy.  \n\nThe work in this project is performed by the U.S. Army Engineer Research and Development Center, Vicksburg, MS."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Terrain Analysis for Signal and Sensor Phenomenology"
                                    },
                                    "Description": {
                                        "val": "This effort develops means to collect, process, and visualize very high-fidelity data and information to capture the dynamic effects of the physical and human terrain impacting military ground operations.  The research focuses on tactical, rather than national or commercial, remote sensing of physical terrain to achieve the fidelity required for current and future operations.  Research includes methods for radical, effective sensor systems and materials to 'tag' features, items and people of interest; these capabilities are based upon novel and emerging light detection and ranging (LiDAR) sensor systems and an array of other sensor systems for intermittent and persistent optimal data collection, object identification, and classification for ground operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.533"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Evolved an Army Geospatial Enterprise capability supporting mission and battle command functions and processes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.869"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigated LiDAR detectable, engineered optical materials to perform adversary tagging, physical location, disturbance, and tracking for area and point operations; investigated uncertainties associated with bio-affected sensors and sensing modalities (i.e., time-varying, and terrain-varying conditions) to enhance capabilities for target of interest identification in high clutter environments; developed geospatial display layers for digital maps that depict sensor performance and associated sensor uncertainties. Conduct research and experiments to develop standoff detection and early warning capability of threats to critical infrastructure in extreme environments using innovative fiber optic sensing technology."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.647"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.647"
                                            },
                                            "Text": {
                                                "val": "Will develop advanced collection and processing strategies for the exploitation and visualization of high-fidelity, persistent remote sensing technologies (e.g., LiDAR, Hyperspectral imaging) for the generation of geospatial foundation data, rapid detection of change, dynamic terrain characterization, object identification and tracking to support ground operations, surveillance, and force protection."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Imagery and GeoData Sciences"
                                    },
                                    "Description": {
                                        "val": "This effort advances map creation and content through both conventional and non-traditional methods. This research exploits existing open source text, leverages multi-media and cartographic materials, and investigates data collection methods to ingest geospatial data directly from soldiers (i.e., crowd sourcing) to characterize parameters of social, cultural and economic geography. Results of this research augment existing conventional geospatial datasets by providing the rich context of the human dimension which offers a holistic view of the operational environment for the Warfighters."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.835"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Applied and evaluated non-traditional mapping methods to representative data holdings for Afghanistan and Pacific Command (PACOM) for verification and improvements; designed and evaluated utility of socio-cultural Wiki in unclassified and secret modes to take advantage of existing open source materials addressing social, cultural and economic geography."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.976"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue development of remote sensing capabilities to support multi-agency efforts in remote illicit crop monitoring; develop and integrate cultural mapping into military geospatial narratives; develop visualization and analysis tools for user generated content and volunteered geographic information to support ongoing collaboration with partner Commands."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.438"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.438"
                                            },
                                            "Text": {
                                                "val": "Will develop methods to process and quantify relationships in typically non-exploitable data (i.e., social media and open source data) of a highly qualitative and unstructured nature. Efforts will add novel context to conventional quantitative data sources and information, thereby providing increased awareness and surveillance of both the human and physical dimensions. Will develop automated workflows to provision high-resolution imagery and geodata to mobile, dismounted devices for mission command platforms in mounted and mobile computing environments. Will develop open geospatial techniques to process and transform massive datasets rapidly and accurately into usable knowledge that will be sharable across the Army Geospatial Enterprise enabling a common situational understanding through a standard, shareable geospatial foundation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Geospatial Reasoning"
                                    },
                                    "Description": {
                                        "val": "This effort develops and evaluates software analysis tools and methods to provide impact and context of the effects of the physical terrain, human terrain and environmental conditions on military operations.  This analysis examines and models these effects upon unit tactics, equipment and Soldiers' performance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.141"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed and implemented a web presence, compliant with Defense Information Systems Agency, and enterprise for open analytics supporting Army, USMC and Combatant Command (COCOM) Mission Partners addressing the span of counter-insurgency (COIN) and capacity building missions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.263"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Design and develop the framework for a common scalable architecture to deploy geospatial, geo-environmental, and social-cultural data, in the form of analytics and tools, through the Army Geospatial Enterprise. Develop geospatial operational risk zone analytics based on insurgent activity, terrain attributes, mission, and environmental influences; incorporate real-time feedback on integrated sensor performance and effectiveness for enhanced mission planning."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.958"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.958"
                                            },
                                            "Text": {
                                                "val": "Will develop methods for super-resolution data processing (i.e., imagery, Light Detection and Ranging, Hyperspectral, multispectral), and algorithms to exploit this data. This research will be specific to challenges faced by small units in urban environments that can be addressed through high-fidelity geospatial data. Will initiate development for a geo-environmental framework to analyze and predict weather, model and observe terrestrial and environmental data, and geospatial information into a risk-based ensemble system to support predictive battlespace preparation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Geospatial and Temporal Information Structure and Framework"
                                    },
                                    "Description": {
                                        "val": "This effort designs and evaluates geospatial data and information architecture to ensure content and representation of data and actionable geospatial information for operational decision making. Research advances here allow for the automatic inference and correlation between events and objects (i.e. people, places) through space and time from massive datasets. Success in meeting these objectives advances the Army's ability to network the force to achieve information dominance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.585"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed a more structured analysis and decision framework capable of describing causal relationships and the effects of operational decisions in security and sustainment operations; developed new feature extraction methodologies and techniques that combine multi-source high-resolution imagery with elevation data to address tactical data gaps; evolved and transitioned an Army Geospatial Enterprise capability supporting mission and battle command functions and processes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.630"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct research to integrate geo-environmental and socio-cultural information at the tactical edge; generate geospatial information that defines aggregate constructs of spatial and structural data key to Civil Military Operations (CMO); identify and build relational networks to define the interactive complexity between geospatial structures and actor\/event and outcome dynamics. Initiate design for a data and query model, and system architecture capable of ingesting, processing, storing, and searching high volume and velocity multi-modal, multi-scale geospatial data."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.435"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.435"
                                            },
                                            "Text": {
                                                "val": "Will develop algorithms and methods to automatically create narratives in a geospatial format by inferring connections, relating events, times, locations, and actors, this effort will facilitate the existing laborious and manual process of correlating such objects, and serves to automate the discovery of information in a geospatial context. Will investigate the unique capability to characterize sub-national populations, environmental degradation, and risks to security in complex operational environments based on accessible pre-conflict data"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H71"
                    },
                    "ProjectTitle": {
                        "val": "Meteorological Research For Battle Command"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.784"
                        },
                        "CurrentYear": {
                            "val": "6.358"
                        },
                        "BudgetYearOne": {
                            "val": "6.459"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.459"
                        },
                        "BudgetYearTwo": {
                            "val": "6.492"
                        },
                        "BudgetYearThree": {
                            "val": "6.498"
                        },
                        "BudgetYearFour": {
                            "val": "6.609"
                        },
                        "BudgetYearFive": {
                            "val": "6.661"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops tactical weather and atmospheric effects\/impacts algorithms for their integration into battlefield information products.  Efforts include high-resolution, local assessments and forecasts of meteorological conditions in near real time including effects of urban and mountainous terrain; analytical tools to assess the impact of the atmosphere to optimize system performance and operations planning and advanced atmospheric sensing applications to characterize and mitigate wind and turbulence in complex terrain.  It provides detailed model applications for various effects of the atmosphere on electro-optical and acoustic target detection, location, and identification.  This project develops both physics-based decision aids and rule-based decision support systems for assessing the impacts of weather\/atmosphere across a spectrum of friendly and threat weapons systems, sensors, platforms, and operations.  Information can be applied to mission planning and execution, battlefield visualization, reconnaissance surveillance and target acquisition, route planning to maximize stealth and efficiency, web enabled tactical decision aids, and also modeling of environmental impacts for combat simulations and war games.  \n\nThis project supports the Army S&T Command, Control, Communications and Intelligence (C3I) Portfolio.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nThis work transitions technologies to the Department of Defense weather and operations modeling community, the US Air Force Weather Agency to improve their operational weather support to the Army PM-MaTIC (PM-Meteorological and Target Identification Capabilities) and Marine Corps Systems Command (MCSC) for field artillery systems, the Project Manager, Distributed Common Ground System-Army (DCGS-A), the Joint Improvised Explosive Device (IED) Defeat Organization, the Program Executive Office Aviation, and Tactical Airspace Integration System (TIAS).\n\nWork in this project is performed by the U.S. Army Research Laboratory located at Adelphi, MD and White Sands Missile Range, NM."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Atmospheric Modeling"
                                    },
                                    "Description": {
                                        "val": "This effort develops high resolution, short-range forecasting and high resolution atmospheric modeling capabilities for mountainous, urban and forest complex terrain."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.316"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Verified the improved Atmospheric Boundary Layer Environment (ABLE) model against measurements to quantify its performance and accuracy in extreme terrain applications; developed the best set of physics parameterizations and nest configurations for sub-kilometer Weather Research and Forecasting (WRF) model-based Weather Running Estimate-Nowcast (WRE-N) to improve the spatial detail and accuracy of the ABLE complex terrain model and reduce the latency of perishable environmental data used in actionable weather impact decision aids; and developed modeling and post-processing techniques to enhance meteorological accuracy for artillery applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.528"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigate and verify ABLE modeled microscale wind, temperature, and moisture dynamics for more realistic and accurate prediction of turbulence, jets, convective eddies and gusts; investigate and verify the sub-kilometer WRE-N (with tailored four dimensional (4-D) data assimilation) for complex terrain and implement version to supply data for actionable weather impact decision aids; and evaluate modeling post-processing methods for enhancement of meteorological accuracy for artillery applications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.564"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.564"
                                            },
                                            "Text": {
                                                "val": "Will continue development of the microscale (local) weather prediction model (ABLE) and mature the capability to implement this model in the mesoscale WRE-N model to provide and increase the reliability of microscale (local) weather forecasts; develop new techniques for using data from traditional and non-traditional weather sources (i.e. surface observations, radar, LIDAR) to produce more accurate forecast model grids of Soldier-focused parameters (e.g. wind direction for improved plume dispersion in urban domains); and implement ABLE model capability for artillery target area domains."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Atmospheric Diagnostics"
                                    },
                                    "Description": {
                                        "val": "This effort develops diagnostic technologies and methods to improve the acquisition of environmental data such as temperature, humidity, wind speed and direction for use in decision aids that enhance and protect autonomous and semi-autonomous systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.753"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigated electro-optic\/acoustic atmospheric remote sensing techniques for the improved detection of adverse environmental conditions affecting Army operations for force protection and improved target detection, localization, and classification; evaluated the utility of next generation (dual-band) infrared polarimetric imaging systems for use on the battlefield for increased target detection, classification, and identification; collected and analyzed signatures from international infrasound events\/experiments for improved situational awareness and force protection for Military Intelligence and Army Operations; and developed web services and mobile applications to enhance and share weather impact and Atmospheric Impacts Routing (AIR) weather information to Army air system and ground systems and personnel."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.938"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigate and evaluate electromagnetic, intelligent optical and acoustic remote sensing techniques and sensor performance models for the detection of adverse environmental conditions, individual targets and local and regional events to support Army Operations and Military Intelligence; develop anomaly image quality metrics for detecting areas of interest within optical images; investigate and evaluate a prototype dynamic passive optics aperture system for its ability to reduce short exposure turbulence blur as it captures images; and investigate mobile handheld technology applications that determine atmospheric impacts on Soldiers and autonomous systems to enhance mission effectiveness at the lowest echelons."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.974"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.974"
                                            },
                                            "Text": {
                                                "val": "Will develop the Micro-meso Scale Array (MSA) at White Sands Missile Range, NM to collect highly-detailed meteorological field measurements for precise atmospheric characterization and weather forecast model verification; will determine the performance effectiveness of dual-band (midwave infrared (MWIR) and long wavelength IR (LWIR)) thermal polarimetric imagers to discriminate camouflage under varying environmental conditions; conduct experiments to determine vulnerabilities of various camouflage materials when simultaneously exposed to dual-band thermal polarimetry; develop elevation and location correction algorithms to more accurately detect and track Unmanned Aircraft Systems (UASs) by acoustic arrays; and develop elevation correction due  to atmospheric propagation for UAS tracking by acoustic arrays."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Atmospheric Prediction for Local Areas"
                                    },
                                    "Description": {
                                        "val": "This effort designs and evaluates software models and sensors to improve local characterization and prediction of atmospheric conditions in urban and complex terrain by directly integrating boundary layer meteorological (MET) measurements into high resolution models and decision aids and verifies these improvements with field measurements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.715"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed microscale and fine resolution mesoscale model capabilities for analysis and short term forecasting for target areas to enhance mission performance; and developed initial application of ensemble model probabilistic forecast grids for weather Nowcasts and decision support tools."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.892"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigate techniques for integrating forecast grids into weather impacts decision support tools (DSTs); and research, develop, and verify impact enhancements to DSTs to improve the characterization of local atmospheric impacts and support source identification of aerosol particles."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.921"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.921"
                                            },
                                            "Text": {
                                                "val": "Will research tactical network capabilities to identify the most efficient methods to transmit\/receive weather data for mobile weather decision aid applications; mature techniques and algorithms for integrating forecast grids into weather DSTs and implement initial capabilities in those systems; continue research\nof underlying methodologies to develop and transition a DST that quantifies and displays friendly versus enemy system\/operations performance due to weather-related impacts; develop a DST to exploit anomaly image quality metrics for detecting areas of interest within optical images; and research how weather affects human behavior and begin development of a threat personnel biometeorological impacts and insurgent\/terrorist activities prediction system.  This system will correlate existing or predicted weather conditions with possible insurgent\/terrorist activities, such as improvised explosive device (IED) emplacement."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "T40"
                    },
                    "ProjectTitle": {
                        "val": "Mob\/Wpns Eff Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "31.288"
                        },
                        "CurrentYear": {
                            "val": "31.197"
                        },
                        "BudgetYearOne": {
                            "val": "27.107"
                        },
                        "BudgetYearOneBase": {
                            "val": "27.107"
                        },
                        "BudgetYearTwo": {
                            "val": "26.659"
                        },
                        "BudgetYearThree": {
                            "val": "28.272"
                        },
                        "BudgetYearFour": {
                            "val": "29.959"
                        },
                        "BudgetYearFive": {
                            "val": "34.655"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item"
                        },
                        "ProjectMissionDescription": {
                            "val": "This project investigates, evaluates, and creates technologies for adaptive and expedient force protection across the range of military operations; for force projection and maneuver, including austere port entry and overcoming battlespace gaps (such as cliffs, ravines, mudflats, shallow rivers, and other natural obstacles) through prediction, definition, avoidance, or defeat of the gaps; for scalable weapons effects; and for high-resolution representation of near-surface terrain and environment for use with sensor models for things such as target detection and unmanned ground systems (UGS) navigation.  This research further provides physics-based representations of ground vehicle mobility, obstacle and barrier placement, survivability, and weapons effects in complex and urban terrain modeling and simulation.  Work in this project increases the survivability of critical assets from conventional, unconventional, and emerging weapons attacks and enables  maneuver support of deployed forces, while reducing their logistical footprint. This project supports Deployable force protection (DFP) efforts for overcoming critical capability gaps for protecting troops operating at smaller bases that are remote or integrated in with local communities.      \n\nWork in this project supports the Army S&T Ground, and Command, Control, Communications and Intelligence (C3I), and Soldier Portfolios.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the US Army Engineer Research and Development Center, Vicksburg, MS. Deployable force protection activities are coordinated with research, development and engineering centers and laboratories across the US Army, Navy and Air Force."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Adaptive Protection"
                                    },
                                    "Description": {
                                        "val": "This effort develops new analytical techniques, advanced materials, and integrated protection systems to support the protection of critical assets on the battlefield."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.109"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Provided force protection and assessment technologies for structures located in contingency-based environments for 300 to 6000 person camps; designed comprehensive model of improvised explosive device (IED) detonation in soils to accurately predict blast pressure and fragmentation of IEDs on ground vehicle systems over a wide range of operational environments; began effort to defeat complex attacks (multiple weapons and multiple hits) for enhanced 360 degree hemispherical protection of fixed, semi-mobile\/mobile forces in a theater of operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.546"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop capability to plan and construct a protected Combat Outpost (COP) or Patrol Base (PB) in 30 days with integrated protective construction, sensing and active defense capabilities; develop a baseline COP construction handbook and decision support tools for planning of overall basing architecture that integrates force protection and basing functions; develop planning tools for the complete lifecycle of the COP; complete development of modeling and simulation capabilities for comprehensive mine and improvised explosive device (IED) blast loads for vehicle occupant threats."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.500"
                                            },
                                            "Text": {
                                                "val": "Will provide ability to determine vulnerability of critical facilities and assess degradation to operational capability; will develop protective measures that use indigenous materials and on-site production capability; will provide integrated protection planning tools that include pre-deployment, construction, operations, and relocation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Austere Entry and Maneuver"
                                    },
                                    "Description": {
                                        "val": "This effort investigates, designs, and creates tools and technologies that address theater access, tactical logistics resupply, and tactical maneuver of small units"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.910"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Created physics-based, multi-scale wave, current, and water-depth forecasting capability; created algorithms to predict the impact of the environment on the transport of military equipment and personnel into austere entry points; investigated use of new sensor systems to measure current and sub-surface conditions that directly affect operations for determining throughput capability at austere entry points given the infrastructure."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.618"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop the capability to numerically simulate complex, impulsive, fixed and moving infrasonic sources for regional assessment of strategic targets; create a high-performance computational testbed (CTB) for dismounted operations including simulations of potential offloading platforms as well as soldiers in the 9-man squad; provide a rapid remote port assessment capability for improving Force Projection in expeditionary environments; provide improved bridging materiel solutions for spanning gaps (wet or dry) that can impede critical operations; develop advanced force projection technologies for landing zones and port construction in areas of Anti-Access\/Area Denied."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.900"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.900"
                                            },
                                            "Text": {
                                                "val": "Will provide the ability to rapidly and remotely assess the conditions of potential airfields and ports to support operational movement and maneuver in austere\/denied locations using space-based\/underwater operational remote sensors. Will develop simulation capability to enable rapid remote assessment of real-time structural capacity of infrastructure (airfields, ports, roads), river, estuary, and near shore."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Scalable Weapons Effects"
                                    },
                                    "Description": {
                                        "val": "This effort provides a prediction capability for effects from scalable, selectable, and adaptive weapons that can destroy target function and\/or neutralize attributes while limiting damage to surrounding structures\/personnel."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.856"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Created an integrated modeling and simulation capability to predict the penetration and damage effects from threat weapons that enables the capability to perform design analysis of new weapon systems for attack of deep buried hardened structures and assessment of current and future force protection technologies. This work is performed in collaboration with PE 0602618A\/H80, PE 0602105A\/H84, PE 0602624A\/H18\/AH28, PE0603004A\/232, PE 06022303A\/214."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Environmental Impacts on Sensor Performance"
                                    },
                                    "Description": {
                                        "val": "This effort investigates, designs, and creates physics-based, multiscale numerical models of the geo-environment and synthetic environments representing geo-environment impacts on various sensor modalities and systems.  These enable such things as development of sensors and sensor algorithms for object or target detection, for sensor-target pairing, and for intelligent autonomous navigation and tactical behaviors in unmanned ground systems.  This effort further investigates, designs, and creates non-line-of-sight and beyond- line-of-sight sensing in remote areas, including optimizing coupling of sensors to soil for understanding surface and subsurface activities. This effort supports persistent surveillance and detection capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.806"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed advance target detection of non-line-of-sight sensor system in soil resulting in reduced installation time as well as improved detection for persistent surveillance capabilities in dense vegetation and turbulent maritime environments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Provide system performance optimization of linear sensors for austere deployment environments; develop a sensor model response for tracking of human and vehicular stimuli with 3-dimensional seismic source models; develop high fidelity excitation models of these linear sensors; quantify coupling scenarios for unique geo-environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.479"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.479"
                                            },
                                            "Text": {
                                                "val": "Will validate three-dimensional source models of human and vehicular traffic in complex environments to determine transduction mechanisms of linear sensors; and will develop physics-based model of linear sensor excitation by high-fidelity viscoelastic and discrete element methods."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Deployable Force Protection"
                                    },
                                    "Description": {
                                        "val": "This effort researches, designs, and creates rapidly deployable detection, assessment, passive protection and active defensive technology-enabled capabilities to meet critical capability gaps for troops operating remotely at smaller bases or integrated with local communities. The needs at these smaller bases (less than 300 persons, not all U.S. troops) are unique based on constraints in transportability, manpower, organic resources, lack of hardening of structures, resupply, and training for example. Moreover, lack of interoperability and scalability consume manpower and take away from time needed to perform missions. Threats include bases being overrun by hostiles; direct fire; rockets, artillery and mortars; and improvised explosive devices. Force protection challenges at these remote, smaller bases include providing increased standoff detection, blast and ballistic protection, and kinetic technologies subject to the constraints mentioned above. This work is coordinated with PE 0603784A\/T08, PE 0603125A\/DF5, PE 0603313A\/G03 and PE 0602786A. Work is performed by Army, Navy and Air Force labs and centers."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.611"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed significantly improved materials and system designs for rapidly erectable, or constructed, personnel protective systems to decrease logistics (e.g., weight, set up time), increased transportability, and increased protection levels for the next-generation systems; researched and developed low-logistics, on-demand structural components for exterior and interior protection of existing structures; integrated and evaluated capabilities to detect, particularly via non-line-of-sight, accurately locate, and suppress hostiles across a range of environments; identified extensions for integrated simulation tool and decision support tools for identifying system improvements; continued research on previously selected technologies for improved detection and assessment of threat, passive protection against enemy threats, and active defense to improve design and performance based on user assessment and feedback."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.900"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete research and development on selected materials and system designs for rapidly erectable or constructed personnel protective systems to decrease logistics (e.g., weight, set up time), increase transportability, and increase protection levels for the next-generation systems; develop non-lethal stand-off enforcement technologies and conduct analysis to assess suitability for employment at small base entry control points; develop second-generation, low-logistics structural components for exterior and interior protection of indigenous structures; research and development on promising technologies and systems approaches that detect, assess, and accurately locate threats in non-line-of sight and complex environments and will decrease size, weight, and power requirements. User assessment and feedback gathered from deployable force protection experiments are used to improve technical performance, logistics, and user factors associated with deployable force protection for the activities described above."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Materials Modeling"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and leverages physics-based computational models and laboratory experiments to understand the relationships between the chemical and micro-structural composition of material and performance characteristics when used in protecting facilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.996"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Created initial integrated modeling capability for the investigation, design, and advancement of experimental materials and properties for achievement of improved strength and durability at the nano-composite scale (1 to 100nm). This work is coordinated with ongoing activities in PE 0602720A\/835, Nanotechnology - Environmental Effects."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.133"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Creating a first version of a computational testbed to simulate materials at the nanometer scale using a combination of the Discrete Element Method coupled with continuum analyses."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.228"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.228"
                                            },
                                            "Text": {
                                                "val": "Will develop and enhance the fidelity and efficiency of multi-scale predictive design tools to incorporate materials by design principles for development of enhanced protective structures; will develop and integrate novel multiscale reinforced cementicious materials and components of protective structures; will develop additive manufacturing methodologies to facilitate and optimize multi-scale reinforcement augmentation to tailor performance, facilitate manufacture and construction and accelerate transition of this technology to the warfighter."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "T41"
                    },
                    "ProjectTitle": {
                        "val": "Mil Facilities Eng Tec"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.812"
                        },
                        "CurrentYear": {
                            "val": "6.363"
                        },
                        "BudgetYearOne": {
                            "val": "5.642"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.642"
                        },
                        "BudgetYearTwo": {
                            "val": "4.880"
                        },
                        "BudgetYearThree": {
                            "val": "5.843"
                        },
                        "BudgetYearFour": {
                            "val": "5.969"
                        },
                        "BudgetYearFive": {
                            "val": "6.013"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item"
                        },
                        "ProjectMissionDescription": {
                            "val": "This project investigates and evaluates technologies and techniques to ensure sustainable, cost efficient and effective facilities and to achieve resilient and sustainable installation and base operations.  The project focuses on facilities and operations technologies directly supporting training, readiness, force projection, force protection, homeland security, and forward base operations.  Facility enhancement technologies contribute to cost reductions in the Army facility life cycle process (infrastructure planning, assessment, design, construction, revitalization, sustainment, and disposal), and the supporting installation operations.  This work improves the ability of installations to support forces to meet transformation goals, improves designs for close battle training facilities, and enhances security of Soldiers, families, and civilians.  Technologies evolving from this work include integrated planning and design tools for US facilities and forward bases, models predicting water dispersed contaminant effects on facilities and occupants; sustainable facility and base management; collaborative decision support tools; and advanced materials.  In addition, technologies from this work will support analysis of socio-cultural and facility issues in forward base operations, including urban environments.  \n\nWork in this project supports the Army S&T Innovation Enablers (formerly Enduring Technologies) and Command, Control, Communications and Intelligence (C3I) Portfolios.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the US Army Engineer Research and Development Center, Vicksburg, MS."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Adaptive and Resilient Installations"
                                    },
                                    "Description": {
                                        "val": "This effort develops sustainable, cost efficient and effective facilities; and provides technologies and techniques for achieving resilient and sustainable installation and base operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.051"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed and validated algorithms and models that represent the complex adaptive systems for energy, water, waste, and protection impacting forward operating base operations; developed interface component models for water, solid waste, and green house gas and integrated them into the net-zero energy (NZE) framework to produce a capability for Installation and regional scale analysis and optimization."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.405"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop and  integrate sustainment, restoration and modernization decision models to support planning and analysis of high performance buildings; develop and validate adaptive system algorithms and relationships, and models for power, water, waste and protection to reflect the dynamics at forward operating bases."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.095"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.095"
                                            },
                                            "Text": {
                                                "val": "Will complete sustainment, restoration and modernization decision models that provide installation managers with information necessary to identify actionable operations and investment opportunities to lower energy usage while maintaining mission functionality, thereby reducing facility lifecycle costs; will complete integrated modeling capability building on the Net Zero Energy Framework to support Installation planning for energy, water, and waste resource optimization."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Social\/Cultural Behavior"
                                    },
                                    "Description": {
                                        "val": "This effort provides technologies which support analysis of socio-cultural and facility issues in forward base operations, including urban environments.  Technology development efforts will include means to identify dynamic signatures, or indicators, in the socio-cultural realm to assist in estimating or predicting behavioral response to operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.761"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Provided computer-aided analysis and reasoning tools and ability to model, simulate and forecast socio-cultural issues and needs; predict the perceptions and actions and reactions of indigenous population groups in relation to on-going or planned military operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.958"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop analytical models that advise the commander on likely socio-cultural consequences of planned military courses of action impacting indigenous population; provide the commander a computer aided methodology to identify insights into socio-cultural issues, needs, and likely perceptions to planned unit actions and tasks in the commander's area of responsibility."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.547"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.547"
                                            },
                                            "Text": {
                                                "val": "Will investigate the unique capability to characterize sub-national populations, environmental degradation, and risks to security in complex operational environments based on accessible pre-conflict data; will investigate monitoring tools and decision models reflecting effects of changing conditions on the operating environment for Brigade-level operators and mission planners; will identify levers of change impacting urban security operating environments to provide timely answers to Commanders on whether the effects of actions support the desired strategy."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "T42"
                    },
                    "ProjectTitle": {
                        "val": "Terrestrial Science Applied Research"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.665"
                        },
                        "CurrentYear": {
                            "val": "5.138"
                        },
                        "BudgetYearOne": {
                            "val": "5.204"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.204"
                        },
                        "BudgetYearTwo": {
                            "val": "5.185"
                        },
                        "BudgetYearThree": {
                            "val": "5.172"
                        },
                        "BudgetYearFour": {
                            "val": "5.362"
                        },
                        "BudgetYearFive": {
                            "val": "5.403"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item"
                        },
                        "ProjectMissionDescription": {
                            "val": "This project investigates and advances technologies to characterize and respond to impacts of the terrestrial environment on the performance of emerging and deployed Army systems, as well as the impact of natural and man-made changes in the environment on all phases of unified land operations.  Research efforts model the dynamics of electromagnetic, acoustic, and seismic propagation in response to changing terrain state and complex terrain features and geometry and their depiction in geospatial information and mission command systems.  Numerical modeling of terrain properties as impacted by weather supports intelligence preparation of the battlefield products including mobility estimates and intelligence, surveillance and reconnaissance planning. This effort integrates terrain knowledge and weather forecast in a mission context to provide geospatial information and mission command delivered solutions to the Soldier.  The understanding gained and products developed improve the ability to predict signature (emitter) behavior and sensor performance in complex operational environments, and support materiel development, sensor performance products for tactical decision-making, and visualization for mission command.\n\nWork in this project supports the Army S&T Command, Control, Communications and Intelligence (C3I) Portfolio.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the US Army Engineer Research and Development Center, Vicksburg, MS."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Analysis for Signal & Signature Phenomenology"
                                    },
                                    "Description": {
                                        "val": "This effort investigates the dynamics of electromagnetic, acoustic, and seismic signatures in response to changing terrain state and complex terrain features and geometry. Research results improve sensor employment tactics, techniques, and procedures and numerical modeling of terrain properties for tactical advantage and geospatial tactical decision aids."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.887"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed a sensor to provide the passive, standoff capability to remotely assess soil state as a function of land use\/condition providing measures of bulk density, mineralogy and soil texture applicable to mobility, targeting, and cultural assessments; investigated combined terrain-atmosphere modeling and image analysis techniques to remotely establish aircraft landing potential in denied areas."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.429"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop and integrate into the sensor mission planning tool Environmental Awareness for Sensor and Emitter Employment (EASEE) terrain and weather influences and model predictions for radar and radio frequency modalities; develop and integrate functionality for providing multi-modal propagation predictions for multiple moving platforms; develop an automated remote sensing capability to provide tactical commanders a repeatable assessment of mountainous snowpack extent and snowpack total water storage to inform mission planning decision making social-cultural mission impacts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.756"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.756"
                                            },
                                            "Text": {
                                                "val": "Will research and develop a framework to significantly improve geospatial tools that inform mission command systems and the common operational picture by quantifying and displaying risk and uncertainties inherent in data quality of terrestrial properties (soils, vegetation, landscape, structures), weather influences (rapid dynamic changes), and information collection modalities (seismic, acoustic, radio frequency, electro-optical propagation); investigate potential uses of full waveform Light Detection and Ranging (LiDAR) backscatter remote sensing of terrestrial surfaces for remote classification of terrestrial material properties and characterization for geospatial applications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Geospatial Reasoning"
                                    },
                                    "Description": {
                                        "val": "This effort integrates terrain knowledge and the dynamic effects of weather and mission to provide geospatial reasoning solutions to the Soldier.  The understanding gained and products developed improve the ability to predict signature (emitter) behavior and sensor performance in complex operational environments, and support materiel development, sensor performance products for tactical decision-making, and visualization for mission command."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.778"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed mission planning tools for combat outpost applications incorporating infrared, visible, and radar multi-modal terrain signature models incorporating weather impacts;  developed and evaluated methods for enhanced bio-sensing surveillance capability applying sensor-vegetation characterization and quantification for bio-affected sensor performance mission planning."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.709"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop decision support tool for combat outpost applications optimizing human and physical terrain surveillance by matching sensor modalities to mission, terrain complexity, and predict weather effects; investigate and develop components of a sensor coverage and management framework for integrating ground and air surveillance assets based upon site specific terrain and weather conditions; investigate sensor modalities and develop software to perform rapid, stand-off assessments of austere entry locations by remotely assessing terrain condition (soil physical properties) and integrating weather effects."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.448"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.448"
                                            },
                                            "Text": {
                                                "val": "Will research and establish an Environmental Intelligence modeling framework supporting broad Army mission utility including trainers, Soldiers, planners and materiel developers, with real world operational environment terrestrial and climate modeling integral to training scenarios, mission planning, and materiel performance, through geospatial tools depicting terrain and climate influences in a unit's operational environment, landscape and climate impacts to stability operations (land use, water resources), courses of action (COA) development, and capability development analysis of alternatives (AoA)."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "T45"
                    },
                    "ProjectTitle": {
                        "val": "Energy Tec Apl Mil Fac"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.919"
                        },
                        "CurrentYear": {
                            "val": "3.233"
                        },
                        "BudgetYearOne": {
                            "val": "3.421"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.421"
                        },
                        "BudgetYearTwo": {
                            "val": "3.338"
                        },
                        "BudgetYearThree": {
                            "val": "3.425"
                        },
                        "BudgetYearFour": {
                            "val": "3.469"
                        },
                        "BudgetYearFive": {
                            "val": "3.496"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item"
                        },
                        "ProjectMissionDescription": {
                            "val": "This project investigates and evaluates technologies necessary for secure, efficient, sustainable military installations, and contingency bases, emphasizing facility systems protection in response to evolving needs. Technologies and processes are also applied to the Army's industrial base to maintain its cost-effective readiness for munitions production, training, and in the theater of operations to reduce logistical footprint.  This effort provides technologies to protect facility indoor air quality from contaminants such as mold, bacteria and viruses in work and living spaces as well as develops methods to optimize sustainable operations and maintenance to minimize lifecycle costs. In addition, technologies from this work provide a better understanding of critical infrastructure interdependencies to support sustainable and flexible facility operations and evolving mission requirements.  \n\nWork in this project supports the Army S&T Innovation Enablers (formerly Enduring Technologies) Portfolio.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the US Army Engineer Research and Development Center, Vicksburg, MS."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Adaptive and Resilient Installations"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and develops technologies necessary for energy efficiency and sustainable military installations, emphasizing energy and utility systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.919"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Validated thermal models and long term thermal performance prediction of phase change materials and emerging materials for mitigation of energy losses in building envelopes; provided to installation planners an operational user assessment decision support tool capability for integrated energy analysis and optimization in support of Net Zero Energy Installations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.233"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop and begin integration of sustainment, restoration and modernization decision models that maximize effectiveness of facility retrofits, specifically for energy performance; validate multi-dimensional models and algorithms using emerging building envelope materials to reduce energy losses and transition innovative concepts for application of advanced technology to meet mandated energy reduction goals."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.421"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.421"
                                            },
                                            "Text": {
                                                "val": "Will develop sustainment, restoration and modernization decision models that provide installation managers with information necessary to identify actionable operations and investment opportunities to lower energy usage while maintaining mission functionality, thereby reducing facility lifecycle costs; will investigate use of  indigenous materials for forward operating bases and contingency bases; will investigate smart and multifunctional materials and systems that increase strength, durability, resilience and EM shielding for buildings and hard shelter envelopes."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "T53"
                    },
                    "ProjectTitle": {
                        "val": "Military Engineering Applied Research (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.991"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item"
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding for Military Engineering applied research."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Congressional Program Increase"
                                    },
                                    "Description": {
                                        "val": "This is a Congressional Interest Item."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.991"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed tools to allow for rapid evaluation of Force Projection and Protection platforms operating in an Anti-Access Area Denied environment."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}