{
    "id": "028e3b184e8ca5fe384a28569101f27cefc6bce8",
    "meta": {
        "filename": "dod-2015_RDTE_2015_NAVY_BA1_3_RDTE_JustificationBook_Navy_PB_2015.zzz_unzipped_RDTE_JustificationBook_Navy_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602123N"
        },
        "ProgramElementTitle": {
            "val": "Force Protection Applied Res"
        },
        "R1LineNumber": {
            "val": "5"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "188.995"
            },
            "CurrentYear": {
                "val": "170.288"
            },
            "BudgetYearOne": {
                "val": "139.496"
            },
            "BudgetYearOneBase": {
                "val": "139.496"
            },
            "BudgetYearTwo": {
                "val": "128.363"
            },
            "BudgetYearThree": {
                "val": "128.717"
            },
            "BudgetYearFour": {
                "val": "125.230"
            },
            "BudgetYearFive": {
                "val": "125.512"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "FY 2013 funding associated with Future Naval Capability (FNC) efforts are transferring to a new Program Element titled Future Naval Capabilities Applied Research (PE 0602750N).  This is to enhance the visibility of the FNC Program by providing an easily navigable overview of all 6.2 FNC investments in a single location."
        },
        "ProgramElementMissionDescription": {
            "val": "The efforts described in this program element (PE) are based on investment directions as defined in the Naval S&T Strategic Plan approved by the S&T Corporate Board (Sep 2011).  This strategy is based on needs and capabilities from Navy and Marine Corps guidance and input from the Naval Research Enterprise (NRE) stakeholders (including the Naval enterprises, the combatant commands, the Chief of Naval Operations (CNO), and Headquarters Marine Corps).  It provides the vision and key objectives for the essential science and technology efforts that will enable the continued supremacy of U.S. Naval forces in the 21st century.  The Strategy focuses and aligns Naval S&T with Naval missions and future capability needs that address the complex challenges presented by both rising peer competitors and irregular\/asymmetric warfare.\n\nThis PE addresses applied research associated with providing the capability of Platform and Force Protection for the U.S. Navy.  It supports the development of technologies associated with all naval platforms (surface, subsurface, terrestrial, and air) and the protection of those platforms.  The goal is to provide the ability to win or avoid engagements with other platforms or weapons and, in the event of engagement, to resist and control damage while preserving operational capability.  Within the Naval Transformational Roadmap, this investment directly supports the Theater Air and Missile Defense transformational capability required by Sea Shield and the Ship to Objective Maneuver key transformational capability.  This is accomplished by improvements in platform offensive performance, stealth, and self defense.  \n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "143.301"
                },
                "CurrentYear": {
                    "val": "145.307"
                },
                "BudgetYearOne": {
                    "val": "147.814"
                },
                "BudgetYearOneBase": {
                    "val": "147.814"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "188.995"
                },
                "CurrentYear": {
                    "val": "170.288"
                },
                "BudgetYearOne": {
                    "val": "139.496"
                },
                "BudgetYearOneBase": {
                    "val": "139.496"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "45.694"
                },
                "CurrentYear": {
                    "val": "24.981"
                },
                "BudgetYearOne": {
                    "val": "-8.318"
                },
                "BudgetYearOneBase": {
                    "val": "-8.318"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.019"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "25.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.450"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-4.224"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-8.240"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-8.240"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.001"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.078"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.078"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-16.531"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional Add Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "66.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Not applicable.\n\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0000"
                    },
                    "ProjectTitle": {
                        "val": "Force Protection Applied Res"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "128.494"
                        },
                        "CurrentYear": {
                            "val": "145.288"
                        },
                        "BudgetYearOne": {
                            "val": "139.496"
                        },
                        "BudgetYearOneBase": {
                            "val": "139.496"
                        },
                        "BudgetYearTwo": {
                            "val": "128.363"
                        },
                        "BudgetYearThree": {
                            "val": "128.717"
                        },
                        "BudgetYearFour": {
                            "val": "125.230"
                        },
                        "BudgetYearFive": {
                            "val": "125.512"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project addresses applied research associated with providing the capability of Platform and Force Protection for the U.S. Navy.  It supports the development of technologies associated with all naval platforms (surface, subsurface, terrestrial, and air) and the protection of those platforms.  The goal is to provide the ability to win or avoid engagements with other platforms or weapons and, in the event of engagement, to resist and control damage while preserving operational capability.  Within the Naval Transformational Roadmap, this investment directly supports the Theater Air and Missile Defense transformational capability required by Sea Shield and the Ship to Objective Maneuver key transformational capability by virtue of improvements in platform offensive performance, stealth, and self defense."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "AIRCRAFT TECHNOLOGY"
                                    },
                                    "Description": {
                                        "val": "The Aircraft Technology activity develops technologies for reduced observables technology and enhanced capability of naval aviation aircraft platforms in terms of mission effectiveness, platform range, responsiveness, survivability, observability, readiness, safety and life cycle cost. It also develops new Naval air vehicle concepts and high impact, scaleable naval air vehicle technologies, such as - autonomous air vehicle command and control, helicopter and tiltrotor rotor systems, aerodynamics, propulsion systems, materials, structures and flight controls for future and legacy air vehicles. This activity directly supports the Naval Aviation Enterprise Science and Technology Objectives and the Naval Science and Technology Strategic Plan, principally in the Autonomy and Unmanned Systems, Platform Design and Survivability, Power and Energy and Total Ownership Cost Focus Areas, Sea-Based Aviation was designated as a National Naval Responsibility (SBA NNR) in FY 2011 and will refocus investments beginning in FY 2014 in areas that are Naval unique or dominated by Naval requirements. \n\nVariable Cycle Advanced Technology (VCAT) will identify and mature critical, relevant variable\/adaptive cycle propulsion system technologies for the next generation carrier-based TACAIR\/ISR systems. Autonomous Aerial Cargo\/Utility System (AACUS) will develop advanced autonomous capabilities to enable rapid resupply of distributed forces in the short term. The SBA NNR Structures and Materials program will develop the next generation structural capability and material response science for aircraft technology in fixed and rotary wing, manned and unmanned airframe technology to achieve reduced weight, increased durability, strength, streamlined manufacturability, reduced life-cycle cost and maintenance\/readiness gaps improvements. Program payoffs include increased availability\/readiness, reduced sustainment requirements, fatigue\/loads life enhancement, reduced weight and improved range, and advanced prognostics design tools. \n\nBeginning in FY 2014, applied research efforts will begin under the Sea-Based Aviation National Naval Responsibility (SBA NNR) Propulsion thrust area as well, resulting in the funding increase in FY 2014.  \n\nThese efforts addresses unique attributes to propulsion and power technologies for Naval Aviation, as well as those having higher importance to Naval Aviation and some that are more pervasive to all of military aviation. Related basic research efforts are addressed under 0601153N.\n\nThe funding decrease from FY 2014 to FY 2015 is due to the AACUS funding decreasing significantly as the effort is nearing completion."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "46.372"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Complete effort to develop a portable system for stand-off detection of explosives and other illicit materials, including trace residues.\n- Initiate development of rotorcraft\/VTOL systems automated launch and recovery technology.\n- Initiate mixed-mode mechanical\/environmental failure prediction research.\n- Initiate advanced composite durability technology.\n- Initiate material degradation risk prediction and operational environment-driven materials selection methods.\n- Initiate demonstration of initial core software, sensor, air vehicle, and capability applications for Autonomous Aerial Cargo\/Utility System (AACUS). \n- Initiate the advanced technology demonstration portion of the Variable Cycle Advanced Technology (VCAT) Program. Critical technology development efforts will begin with major engine manufactures and system contractors to develop\/mature the highest priority, long-lead propulsion system technologies, including variable\/adaptive cycle engine components, for next generation carrier-based TACAIR\/ISR systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "60.655"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2013, less those noted as completed above.\n- Complete VCAT Application Studies systems analysis efforts and the majority of Phase I variable cycle engine\/propulsion subsystem technology development efforts.\n- Complete experiments on user interaction methods\/decision tools for future deck operations with mixed manned and autonomous air systems.\n- Complete efforts on autonomy for low-altitude persistence by small UAVs.\n- Complete effort to demonstrate the solution processing of an inorganic nanowire based photovoltaic device that operates in the infrared region.\n- Initiate new efforts on high confidence\/Safe Autonomous Control in naval environments and on supervisory control of decentralized heterogeneous UAS.\n- Initiate SBA NNR related projects in Virtual Ship\/Aircraft Dynamic Interface, Manned\/Unmanned Handling Qualities and Control, Automated Deck Operations, High Lift Aerodynamics and Vertical\/Short Takeoff and Landing (V\/STOL) Operations.\n- Initiate applied research efforts under the Sea-Based Aviation National Naval Responsibility Propulsion thrust area."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "53.048"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "53.048"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2014, less those noted as completed above.\n- Continue VCAT Phase I variable cycle engine\/propulsion subsystem technology development efforts through completion.\n- Continue to explore and evaluate future aircraft concepts and their associated enabling technologies.\n- Continue development of survivability\/reduced observables technology. Metrics are classified.\n- Initiate new efforts on safe-perception based autonomous control in complex naval environments and on autonomy to support combined unmanned and manned air systems\/units.\n- Initiate airplane launch and recovery component and subsystem technology developments to enable medium size long endurance, long range UAVs to be lauched and recovered on short deck ships."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FLEET FORCE PROTECTION AND DEFENSE AGAINST UNDERSEA THREATS"
                                    },
                                    "Description": {
                                        "val": "Fleet Force Protection and Defense against Undersea Threats efforts include applied research for complementary sensor and processing technologies for platform protection.  Current small platforms (both surface and airborne) have little to no situational awareness (SA) or self-protection against air, surface, and asymmetric threats.  A goal of this activity is to provide these platforms with effective self-protection.  The technology areas specific to platform protection will develop individual, multispectral electro-optical (EO), infrared (IR), radio frequency (RF), electro-magnetic (EM), visual and acoustic or chemical sensors\/biosensors and associated processing.  To defend platforms from current and advanced threats in at-sea littoral environments and in port, these technologies must improve multispectral detection and distribution of specific threat information. \n\nThe funding decrease from FY 2014 to FY 2015 is due to re-scoping\/re-phasing of various efforts in this R-2 Activity.  This re-scoping was done to re-prioritize S&T investments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.183"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Sensors & Associated Processing: \n- Continued efforts in biomimetic sonar systems for operation in air and aquatic environments based on bat echolocation neurophysiology and information processing algorithms. \n- Continued efforts in biomimetic signal processing: panoramic periscope for submarines and temporal pattern recognition for Systems for Security Breaching Noise Detection. \n- Continued efforts in bioinspired quiet, efficient and maneuverable self-propelled line array using high-lift propulsors based on insect biomechanics. \n- Continued studies to develop catalytic activity profile of bioactive coatings against chemical agents. \n- Continued design and initiated fabrication of coatings to degrade both, chemical and biological agents. \n- Continued efforts to design microfabricated system for 3-color fluorescence measurements using integrated waveguides. \n- Continued effort to develop new, highly selective, preferential oxidation catalysts for the generation of power from the reformate gas purification process. \n- Continued effort to develop aspheric gradient index optics"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.408"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Sensors & Associated Processing\n- Continue all efforts of FY 2013, less those noted as completed above."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.627"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.627"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Sensors & Associated Processing: \n- Continue all efforts of FY 2014. \n- Complete development of distributed environmental microsensors for analyte dectection."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MISSILE DEFENSE (MD)"
                                    },
                                    "Description": {
                                        "val": "This activity describes Missile Defense S&T projects.\n\nThe funding decrease from FY 2014 to FY 2015 is due to re-scoping\/re-phasing of various efforts in this R-2 Activity.  This re-scoping was done to re-prioritize S&T investments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.703"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued missile defense related efforts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.186"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2013"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "ADVANCED ENERGETICS"
                                    },
                                    "Description": {
                                        "val": "Advanced Energetics efforts address technology development to provide substantial improvements in energetic material systems and subsystems, primarily in terms of performance, but also addressing safety, reliability, and affordability concerns.  Goals include: advanced energetic materials for warheads, propellants, and reactive material based subsystems for both defensive and offensive applications.  Efforts include: development of new fuels, oxidizers, explosive ingredients and formulations; and reliable simulation tools and diagnostics to develop and design superior-performance, and\/or reduced-vulnerability systems tailored to specific warfighter missions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.668"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued Advanced Energetics research in development and evaluation of advanced explosive\/propellant\/reactive ingredients and formulations for the next generation higher performing systems. \n- Continued proof-of-concept efforts to develop insensitive explosives, propellants, and munitions without compromising performance. \n- Continued Advanced Energetics research in development and diagnostics of novel energy conversion concepts. \n- Continued non-traditional energy conversion studies with columbic and cluster material investigations. \n- Continued Advanced Energetics research in technology development for the next generation reactive material warhead concepts(formulations, material properties, target interaction, lethality models, and experiments) for highly reactive materials, high density reactive materials and novel reactive structural materials. \n- Continued Advanced Energetics research in development of advanced directed hydro-reactive material warhead concepts to enhance performance of undersea warheads. \n- Continued proof of concept efforts to develop insensitive explosives, propellants, and munitions without compromising performance. This work involves development of high quality, small particle energetic ingredients, novel processing techniques, and advanced energy conversion concepts; and involves both theoretical and experimental efforts.\n- Continued Advanced Energetics research in advanced multiphase blast concepts employing dense metalized explosives to enhance performance of air and underwater blast warheads. \n- Continued Advanced Energetics research in development and diagnostics of novel energy conversion concepts to enhance performance, more efficiently exploit available energy, and more effectively couple energy to target for air, surface, and underwater warhead application \n- Continued research in technology development for the next generation reactive material warhead concepts formulations, material properties, and energy release experiments) for highly reactive materials, high density reactive materials and novel reactive structural materials. Transition application specific target interaction, lethality modeling and ordnance specific experiments and demonstrations to Electromagnetic Rail Gun, PE 0603114N. \n- Continued development of novel energy conversion concepts to enhance performance, more efficiently exploit available energy, and more effectively couple energy to target. Limit efforts to analytical and laboratory scale proof of concept experimental efforts. \n- Continued development and evaluation of energetic ingredients and formulations for next generation higher performance applications. Conclude scale-up development and testing. - Initiated processing optimization studies for MTX-1 (1-[(2E)-3-(1H-tetrazol-5-yl)triaz-2-en-1-ylidene] methanediamine), an additive to percussion primers. \n- Continued the processing optimization design of material compositions for Reactive Material explosive fragment applications. \n- Continued optimization and refinement studies of Poly NitratoOxetane (3-PNO) process for solid rocket motor propellants. \n- Continued the development of a reliable chemical scale-up and material specification process techniques. \n- Continued ultra-high density reactive material investigations (13 - 15 grams\/cc) for the next generation reactive material warhead material (formulations, material properties, target interaction, letality models, and experiments)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.187"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2013.\n- Complete Studies on Poly NitratoOxetane (3-PNO).\n- Initiate process research and development of Ammonium Nitrotetrazolate-2N-oxide (AONT).\n- Initiate process optimization of Ammonium Tetrakis (3,5-Dinitro-1,2,4-Triazolyl)Borate (ATDTB)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.052"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.052"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2014, less those noted as complete above.\n- Complete Studies on MTX-1 (1-[(2E)-3-(1H-tetrazol-5-yl)triaz-2-en-1-ylidene] methanediamine), an additive to percussion primers. \n- Complete Advanced Energetics research in development of advanced directed hydro-reactive material warhead concepts to enhance performance of undersea warheads. \n- Complete process optimization of Ammonium Tetrakis (3,5-Dinitro-1,2,4-Triazolyl)Borate (ATDTB). \n- Initiate research on new caged nitramines\n- Initiate process research and development of 1,1'-Diamino4,4',5'5'-Tetranitro-2,2'-Biimidiazole (DATNBI)\n- Initiate process research and development of 1-Fluoro-4,5-Dinitroimidazole."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SURFACE SHIP & SUBMARINE HULL MECHANICAL & ELECTRICAL (HM&E)"
                                    },
                                    "Description": {
                                        "val": "Efforts include: signature reduction, hull life assurance, hydromechanics, distributed control for automated survivability (includes damage control), and advanced naval power systems. Signature reduction addresses electromagnetic, infrared, and acoustic signature tailoring, both topside and underwater. Hull life assurance addresses development of new structural system approaches for surface ships and submarines, including the management of weapons effects to control structural damage and the improvement of structural materials. Hydromechanics addresses hydrodynamic technologies, including the signature aspects of the hull-propulsor interaction and maneuvering. Distributed intelligence for automated survivability addresses both the basic technology of automating machinery control systems, as well as, distributed control of systems utilizing autonomy for mission context based reconfiguration. Unmanned Sea Surface Vehicle applied research includes short-term motion forecasting for recovery of USSVs on a host ship in higher sea states and determination of slamming loads on high-speed planing hulls for structural weight reduction.   Advanced naval power systems efforts address electrical and auxiliary system and component technology to provide improvement in energy and power density, operating efficiency and recoverability from casualties. Advanced Naval Power efforts include: developing technologies to improve warfighting capability with more energy efficient systems; reducing the time & cost to certify alternative fuels, and mitigate adverse alternative fuel impacts on Naval platforms and equipment; developing sustainable biomass models to support alternative fuel availability to Naval forces; utilizing the Electric Ship Research and Development Consortium (ESRDC) efforts to develop modeling and simulation tools to provide critical design & operational capabilities for the all-electric ship program, accelerate development and demonstration of technologies, reduce risk of new technology insertion and address the national shortage of electrical power engineers. Efforts for ONR Science Advisors are also funded in this R-2 Activity. Long Endurance UUV technologies will deliver to the Office of Naval Research modular fuel cell systems for UUVs, including practical systems demonstrations, and a path forward for future developments. It will also keep the US Navy at the forefront of advanced electric propulsion technologies. \n\n\nThe funding increase from FY 2014 to FY 2015 is due to the increase in the Applied Research Challenge and an increase in Counter-IED effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "70.668"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Survivable Platforms - Reduced Signatures \n - Continued advanced numerical acoustic codes (and gridding methods for those codes) for submarines. \n- Continued mmWave Signatures measurement to identify key signature characteristics. \n- Continued Alternating Current (AC) propagation experiments. \n- Continued the next generation Infrared Electro-Optic Visual (IR\/EO\/VIS) model for surface ships by development of mitigation strategy supporting low observable infrared platforms, development of supporting physics, and prototype measurement techniques. \n- Continued development of quiet control surface design tool based on control surface flow noise studies. \n- Continued IR and radar detectability prediction capability. \n- Continued surface ship super-conductive degaussing with laboratory demonstration loop for Electromagnetic (EM) field accuracy measurements and control methods. \n- Continued testing on Advanced Electric Ship Demonstrator (AESD) to assess energy propagation and acoustic radiation mechanisms and to develop mitigation concepts for surface ships. \n- Continued IR assessment of two advanced treatments. \n- Continued first of a series of IR validation experiments and critical sensitivity analysis. \n- Continued Improved Corrosion Related Magnetic (CRM) Field Prediction Model to design compensation systems to reduce ship's CRM signature. \n- Continued assessment of ship biostatic Radar Cross Section (RCS). \n- Continued large-scale tests on AESD to develop signature prediction and design tools for surface ship incorporating a variety of propulsion technologies including external podded propulsion. \n- Continued experimental effort to characterize electric drive motor signature mechanisms and verify modeling and simulation approaches for signature prediction. \n- Continued development of modeling methods and noise control concepts for modular\/reconfigurable submarine architectures. \n- Continued investigation into hull treatment concepts for acoustic signature\/vibration control for surface ships. \n- Continued development of advanced RF metamaterials for platform signature control. \n- Continued development of signature modeling approaches for electric actuation and alternate electric drive system architectures. \n- Continued development of Low probability Intercept (LPI) technologies for surface ship emissions including communication, navigation, electronic warfare, and combat systems. \n- Continued advanced EM modeling tools development and validation. \n- Continued next generation deckhouse integration technology development. \n- Continued modeling of hydroacoustics of turbulence-propulsor interaction.\n- Continued joint effort with UK\/MoD on adhesively joined aluminum in lieu of welding of marine structures and thus reduce cost. \n- Continued joint effort with NLRN on adhesive joined composite to metals in lieu of bolting of marine structures and thus reduce cost for topside structures. \n- Continued efforts on shock mitigation and shock diversion for ship hulls to reduce cost of machinery mounts and equipments, based on successful results from the ERC helmets for protection against TBI. \n\nSurvivable Platforms - Hull Life Assurance \n- Initiated efforts on combinations of highly rate-sensitive materials through experiment and modeling for extreme hyper velocity threat conditions.\n- Continued development of global surface wave measurement capability for ship models. \n- Continued Dynamic Behavior of Composite Ship Structures (DYCOSS) (joint effort with Dutch Navy). \n- Continued development of structural analysis codes describing failure mechanism of sandwich composites. \n- Continued Explosion Resistant Coatings (ERC) effort, providing US input to trilateral agreement with UK and Australia. \n- Continued composite and composite-metal hull performance characterization and testing including structural loading, thermal stress and signatures. \n- Continued effort on an advanced class of polymers as a follow-on to current ERC for application against advanced threats. \n- Continued Payload Implosion and Platform Damage Avoidance efforts. \n- Continued development of reliability-based recoverability methods for assessing damaged ship structures.\n- Continued development of advanced analytical, numerical and experimental methods in support of platform signature reduction. \n- Continued effort on exploitation of polymers for the deflection and dissipation of shock wave impact on ship and submarine hull structures. \n\nSurvivable Platforms - Distributed Intelligence for Automated Survivability \n- Continued development of modeling and simulation methods for robust design and virtual testing of integration of shipboard auxiliary systems including their control systems. \n- Continued research into advanced HM&E system reconfiguration approaches, including agent-based control systems and algorithms, and model-based reasoning. \n- Continued demonstration of Genetic Algorithm(s) for determining optimal distributed system control strategy. \n- Continued development of Survivability Analysis Algorithms Operable on a Total Ship Modeling Environment. \n- Continued the transition of the small scale hardware-in-the-loop demonstrator to the academic community for challenge problem formulation. \n- Continued demonstration of the developed model based reasoning control algorithms on full scale hardware test beds. \n\nAdvanced Platforms - Advanced Platform Concepts and Designs: \n- Continued validation of asymmetric hull forms with experimental data. \n- Continued development of analytical models to further define submarine modular hull concepts. \n- Continued development of reliability based design and structural analysis code development. \n- Continued development design tools for integrated antenna and composite topside. \n- Continued circulation control analysis for three-dimensional flow effects. \n- Continued aperstructures microwave communication system. \n- Continued concept for Ultra High Frequency (UHF)\/Very High Frequency (VHF) aperstructures opportunistic array (Advanced Hull-form Inshore Demonstrator - AHFID). \n- Continued development of methods for determining reliability and vulnerability of aluminum ship structures. \n- Continued large scale demonstration efforts of advanced mitigation technologies. \n- Initiate large scale demonstration efforts of advanced mitigation technologies. \n\nAdvanced Platforms - Hydromechanics: \n- Continued experimental database\/computational tools development for extreme submarine maneuvers (e.g., crashback). \n- Continued the validation of circulation control and advanced control surfaces with experiments.\n- Continued to investigate improved maneuvering simulation capability for submarines. \n- Continued validation of Reynolds Average Navier-Stokes (RANS) code for advanced waterjet propulsor performance predictions. \n- Continued development of two-phase flow waterjet concept, Detached Eddy Simulation (DES) method for crashback prediction and numerical prediction method(s) of waterjet cavitation. \n- Continued modeling of turbulent flow interaction with propeller Leading Edge (LE) and Trailing Edge (TE) and modeling and simulation of rough-wall boundary layer noise. \n- Continued development of podded propulsor design\/analysis tools. \n- Continued prediction and validation of damaged stability and capsize. \n- Continued non-body-of-revolution tool development for advanced submarine configurations. \n- Continued the multi-platform interaction analysis and tool development. \n- Continued modeling of performance of composite propellers in extreme maneuvers. \n\nAdvanced Naval Power Systems: \n- Continued demonstration of dynamic stability of an advanced intelligent, reconfigurable, solid-state-based, zonal-electrical power system that reconfigures within 10 milliseconds. \n- Continued designing software for the system manager for the Universal Control Architecture (UCA). \n- Continued development of thermal management technology for shipboard power distribution. \n- Continued investigation of potential applications of silicon-carbide in future high voltage and high power applications. \n- Continued improvements in electrical component and device technology allowing a reduction in motor propulsion and motor controllers weight and volume. \n- Continued development of technologies to support dynamic reconfiguration of shipboard systems under conditions of stressing scenarios and\/or system degradation. \n- Continued multi-year program to directly convert thermal energy to electricity. Such a capability would allow elimination of the steam cycle on an electric warship. \n- Continued studies of alternative cooling systems for future shipboard radar systems. \n- Continued control surface actuator project focused on the technologies needed to define the design space for control surface actuators supporting submarines. \n- Continued development of automated HVAC system architectures for future Naval platforms. \n- Continued development of common universal stator design to accommodate varying rotor topologies to improve affordability of motor design and development. \n- Continued ship service fuel cell development. \n- Continued development of shipboard waste heat driven chiller systems. \n- Continued program to develop and demonstrate 3 - 50 kW class solid oxide fuel cell onboard mobile power generation capabilities having compatibility with future logistics fuels to enable rapid recharge of batteries and direct power for C4ISR equipment. \n- Continued analytical model and reduced scale component development of power conversion technologies for multi-function motor drives, bi-directional power conversion modules, and power management controllers focusing on closing technology gaps associated with Alternative Integrated Power System (IPS) Architectures. \n- Continued studies of advanced heating, ventilation, and air-conditioning architectures, including studies of alternative (nonvapor-compression) refrigeration systems and concepts for waste heat reuse, to enhance ship cooling and provide thermal energy storage. \n- Continued research into the development of fuel chemistries, materials, and energy conversion technologies for optimal performance in Naval power systems. \n- Continued energy programs in support of SECNAV Energy Goals including biofuels, ship energy efficiencies and unmanned vehicle power systems. \n- Continued effort to develop energy storage and conversion devices (e.g., batteries, capacitors, fuel cells) that are critical to many military missions. \n- Continued effort to develop SIC power device with fast switching and ability to parallel devices for higher current.\n- Continued development of robotic Hull BUG and coating technologies to reduce hull biofouling over current Navy operating conditions which will reduce drag and provide significant power\/fuel\/cost savings.\n- Continued development of fuel cell components needed to make robust, compact, lightweight fuel cell systems for use in unmanned vehicles\n- Continued development of low cost, light weight, flexible solar cells\n\nSurface Ship & Submarine HM&E Applied Research: \n- Continued to increase emphasis of the Science Advisor engagement within the joint S&T community across DOD, which will focus on addressing the operational and strategic needs of the Fleet. \n- Increase emphasis of the Science Advisor engagement within the joint S&T community across DOD, which will focus on addressing the operational and strategic needs of the Fleet. \n- Continued applied research into short-term motion forecasting for recovery in higher sea states.\n- Continued applied research into determination of slamming loads on high-speed planing hulls for structural weight reduction.\n\nCounter Improvised Explosive Devices\n- Initiated efforts to expand counter-improvised explosive devices (C-IED) enhancement to support urgent operational needs.  These included:\n- Initiated research to analyze and understand enemy threat organizations and networks (both cultural networks and IT networks)\n- Initiated research in directed energy weapons with the goal of reducing size, weight, and power requirements for systems in the detection and neutralization of IEDs.\n-  Initiated research in the mitigation of CIED effects (blast, blunt trauma, ballistics) on personnel."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "73.524"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Survivable Platforms - Reduced Signatures \n- Continue all efforts of FY 2013. \n\nSurvivable Platforms - Hull Life Assurance \n- Continue all efforts of FY 2013. \n- Complete development of reliability-based recoverability methods for assessing damaged ship structures. \n\nSurvivable Platforms - Distributed Intelligence for Automated Survivability \n- Continue all efforts of FY 2013. \n\nAdvanced Platforms - Advanced Platform Concepts and Designs \n- Continue all efforts of FY 2013. \n\nAdvanced Platforms - Hydromechanics \n- Continue all efforts of FY 2013. \n\nAdvanced Naval Power Systems \n- Continue all efforts of FY 2013. \n- Complete effort to develop energy storage and conversion devices (e.g., batteries, capacitors, fuel cells) that are critical to many military misssions.\n- Complete effort to develop SIC power device with fast switching and ability to parallel devices for higher current.\n\nSurface Ship & Submarine HM&E Applied Research \n- Continue all efforts of FY 2013.\n- Initiate efforts to implement the results from hybrid composite blisters \/appendages and their effect on ship drag resistance and fuel saving performance, motion and stability in ship models to verify computations and adapt shapes of appendages.\n- Initiate the ONR Applied Research Challenge (ARC) to stimulate new, high-risk applied research projects in areas not currently addressed by the current ONR core applied research programs.\n  \nAdvanced ASW Surveillance\n-Initiate development of Long Endurance UUV technologies.\n \nCounter Improvised Explosive Devices\n- Started research in Route Reconnaissance and Clearance methodologies to provide standoff detection, neutralization, and marking of buried and surface laid, on and off route, pressure plate, command wire and radio frequency initiated explosive obstacles using directed energy and mechanical means on autonomous or semi autonomous platforms."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "75.302"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "75.302"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Survivable Platforms - Reduced Signatures: \n- Continue all efforts of FY 2014. \n- Continued utilization of condition-based maintenance systems for platform underwater signature assessment.\n- Continued development of advanced analytical, numerical and experimental methods in support of platform acoustic signature reduction.\n- Continued development of a prediction and monitoring of a surface ship propulsion system for underwater acoustic signatures.\n- Continued development of global optimization of damped structures.\n\nSurvivable Platforms - Hull Life Assurance: \n- Continue all efforts of FY 2014, less those noted as completed above. \n- Continue development of lightweight low-cost protection system for specific platforms for protection against specific large threats for the Explosion Resistant Coatings (ERC).\n- Continue development of lightweight protection system for vehicles (MTVR) for protection against specific small arms and IEDs for the Explosion Resistant Coatings (ERC) program.\n- Continue Ship modifications using blisters for application to DDG51 Flight III to gain larger displacement for AMDR and at the same time achieve higher fuel efficiency.\n\nSurvivable Platforms - Distributed Intelligence for Automated Survivability: \n- Continue all efforts of FY 2014.\n \nAdvanced Platforms - Advanced Platform Concepts and Designs: \n- Continue all efforts of FY 2014. \n\nAdvanced Platforms - Hydromechanics: \n- Continue all efforts of FY 2014. \n- Complete waterjet efforts, including two-phase waterjet development and RANS code development and validation efforts.\n- Initiate cavitation erosion modeling on compliant surface.\n\nAdvanced Naval Power Systems: \n- Continue all efforts of FY 2014, less those noted as completed above. \n\nSurface Ship & Submarine HM&E Applied Research: \n- Continue all efforts of FY 2014. \n\nCounter Improvised Explosive Devices\n- Continue all other efforts of FY 2014.\n- Complete effort to develop transparent armor using flawless glass.\n- Complete effort on the studies of antennas for high powered microwaves and radio frequency applications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "NAVAL RESEARCH ENTERPRISE"
                                    },
                                    "Description": {
                                        "val": "The Naval Research Enterprise (NRE) encompasses the Independent Applied Research (IAR) efforts focused on solving a wide range of Naval Science and Technology (S&T) fleet issues utilizing unique Naval Warfare Center (WC) laboratory capabilities. Efforts under this activity address the full spectrum of the DON S&T Strategic Plan technology using focus areas which engage Naval aviation, sea surface, undersea, space, weapons, communication, information, and human systems. The IAR Program provides participating WCs with in-house funding for applied research to support the execution of their assigned missions by; \n-Developing and maintaining a cadre of active researchers who can distill and extend results from worldwide research and apply them to solve Naval problems.\n-Promoting the hiring and development of talented new scientists and engineers (S&E) with the insurance of proper mentoring with senior personnel\n-Encouraging collaboration with universities, private industry, and other Navy and Department of Defense laboratories. \n\nFunded projects are chosen through rigorous internal competition by each WC's selection committee and typically last two to three years.  IAR projects are generally designed to promote investment in high-risk\/high-payoff research and also allow young S&Es to manage Navy relevant research projects. A limited number of successful efforts developed under the In-House Laboratory Independent Research (ILIR) basic research Program Element 0601152N are matured and further developed under the IAR program with the goal of transitioning these technologies to the warfighter. \n\nThe IAR R2 activity was stood up in FY 2013 as the Naval Research Enterprise (NRE) to consolidate all NRE related IAR investments. Projects funded in this R2 Activity are intended to be approximately 2-3 years in length.  Based on historical trends approximately 30% of these projects will turn over each year."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.900"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued research for Unmanned Sensor Network Concepts for Counter-Surveillance and Explosive Hazard Detection by investigating autonomy with imperfect perception, sensor and signal processing techniques supporting autonomy and battlefield sensing missions, and Human-Machine Interaction (HMI). \n- Continued research for Advanced Search and Tracking routines through the utilization and modification of advanced algorithms such as Maximum Likelihood Probabilistic Data Association Tracker (ML-PDA) and Moving-Source Matched Field Processing (MFP). \n- Continued research for sensors and ultra-low\/self-powered sensors for remote applications addressing sub-threshold hydrophones, undersea wireless networks, and communication networks. \n- Continued research for advanced energetic materials with significantly enhanced explosive yields (over HMX) while improving insensitivity characteristics such as shock and thermal stabilities. \n- Continued research for reduced drag on surface ship hull designs utilizing advanced computational analysis and hydrodynamic model testing addressing scaling effects due to non-dimensional parameters such as the Froude number.\n- Completed research for the Mitigation of Acute and Chronic spinal pain in Naval Aircrew project by determining the efficacy of interventions to reduce neck and low back pain severity and incidence in a randomized controlled series of trials with U.S. Navy aircrew. \n- Completed research for Mid- to Long-Wavelength Infrared Optical Emitter Sources for Chemicals and Explosives Detection through the development of a high-performance long-wavelength infrared tunable laser that would enable a significant increase in standoff detection. \n- Completed research for Viscoelastic Materials Study for the Mitigation of Blast-Related Brain Injury where the investigation of viscoelastic polymers are identified for use as a helmet liner to protect the warfighter from exposure to blast pressure and reduce the incidence of blast-related Traumatic Brain Injury (TBI). \n- Completed research for the Development of a Solid Propellant Burning Rate Model to optimize the performance of Navy missiles by addressing: surface decomposition of propellant ingredients, gas-phase diffusion rates, reaction kinetics, particle-size, and the effects of pressure and initial temperature. \n- Initiated research for the repair and repair process of Navy aircraft and ship alloys such as titanium and high-strength low-alloy steels. \n- Initiated research for warfighter performance predictions utilizing cognitive information and other human factors to enhance training experience and outcome. \n- Initiated research for highly accurate autonomous unmanned undersea vehicles (UUV) communication and navigation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.328"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Complete research for Unmanned Sensor Network Concepts for Counter-Surveillance and Explosive Hazard Detection by investigating autonomy with imperfect perception, sensor and signal processing techniques supporting autonomy and battlefield sensing missions, and Human-Machine Interaction (HMI). \n- Complete research for Advanced Search and Tracking routines through the utilization and modification of advanced algorithms such as Maximum Likelihood Probabilistic Data Association Tracker (ML-PDA) and Moving-Source Matched Field Processing (MFP). \n- Complete research for sensors and ultra-low\/self-powered sensors for remote applications addressing sub-threshold hydrophones, undersea wireless networks, and communication networks. \n- Complete research for advanced energetic materials with significantly enhanced explosive yields (over HMX) while improving insensitivity characteristics such as shock and thermal stabilities. \n- Complete research for reduced drag on surface ship hull designs utilizing advanced computational analysis and hydrodynamic model testing addressing scaling effects due to non-dimensional parameters such as the Froude number.\n- Initiate FY 2014 ILIR projects."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.467"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.467"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Complete research for the repair and repair process of Navy aircraft and ship alloys such as titanium and high-strength low-alloy steels. \n- Complete research for warfighter performance predictions utilizing cognitive information and other human factors to enhance training experience and outcome. \n- Complete research for highly accurate autonomous unmanned undersea vehicles (UUV) communication and navigation. \n- Complete research on the effects of CMAS (Sand Dust) in Ceramic Matrix Composites (CMCs) to characterize CMAS and CMAS\/salt effects in gas-turbine grade engine environments.\n- Complete researchon the development and characterization of exploding ink.\n- Complete research on advanced submarine air purification.\n- Complete research on large-eddy simulations of advanced propulsion technology for UAV weapon systems.\n- Complete research on a metamaterial-based buoyant cable antenna with non-uniform loading.\n- Complete research of a bioluminescence system for submerged vehicles. \n- Continue research for the repair and repair process of Navy aircraft and ship alloys such as titanium, high-strength low-alloy steels, composites, and metamaterials. \n- Continue research for highly accurate autonomous unmanned undersea vehicles (UUV) communication and navigation. \n- Inititate FY 2015 projects."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "This PE supports the development of technologies associated with all naval platforms (surface, subsurface, terrestrial and air) and the protection of those platforms.  Each PE Activity has unique goals and metrics, some of which include classified quantitative measurements.  Overall metric goals are focused on achieving sufficient improvement in component or system capability such that the 6.2 applied research projects meet the need of or produce a demand for inclusion in advanced technology that may lead to incorporation into acquisition programs or industry products available to acquisition programs.  Efforts funded in this PE also include energy programs in support of SECNAV energy goals and efforts in support of the Ohio Replacement program."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "9999"
                    },
                    "ProjectTitle": {
                        "val": "Congressional Adds"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "60.501"
                        },
                        "CurrentYear": {
                            "val": "25.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "85.501"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Items not included in other Projects."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Alternative Energy Research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "36.483"
                                        },
                                        "Text": {
                                            "val": "FY13 Accomplishments include:\n-Successful testing of Ion Tiger hydrogen powered fuel cell, and setting of UAV airborne endurance records of 48 hour using liquid hydrogen fuel.  \n-Successful evaluation of the Micro Auto-Gasification System (MAGS) waste management unit at MARFORPAC HQ and BALIKATAN joint Marine Corps - Philippine Military exercise.\n-Successful evaluation of General Motors Equinox Fuel Cell Electric Vehicles (FCEVs) for non-tactical vehicle use at Naval Facilities.\n-Continued heat exchanger material corrosion evaluation and continued process control evaluations for Ocean Thermal Energy Conversion (OTEC) systems.\n-Continued development of sophisticated hydrodynamic tools for design of high performance, high efficiency hull forms for naval ships and craft.\n-Continued evaluation of grid frequency control techniques using grid frequency response and battery state-of-charge algorithms and 1MW, 250kW-Hr advanced, fast response Lithium-Titanate battery system to demonstrate 40% reduction in frequency variability. \n-Initiation of evaluation of external power operations using General Motors Equinox Fuel Cell Electric Vehicles (FCEVs) with off-board power (OBP) capability at Camp Pendleton.  \n-Initiation of evaluation of plasma flow control to improve wind turbine efficiency."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "25.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Materials Research and Technology"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "12.009"
                                        },
                                        "Text": {
                                            "val": "ONR Special Notice 13-SN-0020 to solicit research solutions for the two topics identified above was published on 17 Jun 2013.  White papers are due on 25 Jul 2013, white paper feedback will be provided by 12 Sep 2013, and full proposals are due on 17 Oct 2013."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Power Generation and Storage Research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "12.009"
                                        },
                                        "Text": {
                                            "val": "ONR intends to issue a Special Notice in the summer of 2013 to solicit research solutions in the areas of battery safety and power generation.  ONR anticipates that white papers will be submitted in FY13 and that full proposals, proposal selection and award will be completed by June 2014.  Funds that are applied to on-going efforts are expected to be obligated in late FY13 or early (Q1) FY14."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Congressional Interest Items not included in other Projects."
                        }
                    }
                }
            ]
        }
    }
}