{
    "id": "03cf025a1200a28aa66b0852dacc612520d99aee",
    "meta": {
        "filename": "dod-2015_RDTE_2015_NAVY_BA4_RDTE_JustificationBook_Navy_PB_2015.zzz_unzipped_RDTE_JustificationBook_Navy_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603582N"
        },
        "ProgramElementTitle": {
            "val": "Combat System Integration"
        },
        "R1LineNumber": {
            "val": "48"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "329.953"
            },
            "PriorYear": {
                "val": "45.131"
            },
            "CurrentYear": {
                "val": "4.396"
            },
            "BudgetYearOne": {
                "val": "20.881"
            },
            "BudgetYearOneBase": {
                "val": "20.881"
            },
            "BudgetYearTwo": {
                "val": "33.195"
            },
            "BudgetYearThree": {
                "val": "32.355"
            },
            "BudgetYearFour": {
                "val": "29.196"
            },
            "BudgetYearFive": {
                "val": "29.814"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Chief of Naval Operations (CNO) created the Navy's Strike Force Interoperability (SFI) Program in 1998 in response to critical shortfalls in the introduction of integrated and interoperable system of systems to deploying Strike Forces.   Naval Sea Systems Command (NAVSEA) acts as management lead for Joint System Command (SYSCOM) system certification policy and guidance and certifies platforms for interoperability within the platform and throughout the enterprise, in accordance with Commander, US Fleet Forces Command\/Commander, Pacific Fleet (COMUSFLTFORCOM\/COMPACFLT) Inst. 4720.3B (OCT 2008), C5ISR Modernization Policy.  COMUSFLTFORCOM\/COMPACFLT Inst. 4720.3B also requires that NAVSEA act as administrative agent for COMNAVNETWARCOM Command and Control, Communications, Computers, and Combat Systems Integration Modernization Process (C5IMP) and execution agent for Navy Command and Control, Communications, Computers, and Combat Systems Integration (C5I) Modernization Conferences (NCMC).  This program conducts Interoperability Assessments that are required to certify Aircraft Carriers, Amphibious Assault Ships, and Surface Combatants in accordance with the Naval Warfare System Certification Policy (NWSCP), NAVSEAINST 9410.2A, NAVAIR 5230.20, SPAWAR 5234.1.\n\nThe SFI Program ensures overall strike force interoperability is characterized and assessed. NAVSEA is assigned central United States Navy (USN) responsibility for interoperability, directing the development of policy and architecture for Strike Force warfare systems engineering and implementation of a common warfare systems engineering process. There are three priorities within the Strike Force Interoperability Program:  1) Support Fleet As-Is state which includes Navigation System Certification (NAVCERT), Interoperability Capabilities & Limitations, and Interoperability Tactical Information Coordinator Technical Aids (TIC TECHAIDs); 2) Ship system modernization (non-HME) including warfighting capability & other C5I upgrades. This includes C5IMP Baseline Management and Non-Aegis Combat System Integration Testing; and 3) Ship Warfare System Certification & Force Level Assessments. This includes Warfare Systems Certification, Interoperability Certification, Force Level Interoperability Analysis, Assessments, and reports recommending force level interoperability improvements to the program offices for implementation at the systems level. \n\nIn addition to these core efforts, this program also aims to improve the efficiency of testing processes through the Automated Test and Re-test (ATRT) program and engages in efforts designed to ensure the U.S. Navy is interoperable with Joint and Coalition forces through the Maritime Theater Missile Defense (MTMD).\n\nProject 0164 Combat System Integration:\n\nThis project consist of five key pillars executed within the SFI program, beginning in FY13: 1) Command & Control, Communications, Computer, Combat Systems, and Intelligence Modernization Process (C5IMP) and Fleet Readiness. The C5IMP validates the introduction of new systems into the Fleet and ensures system maturity prior to installation, thereby reducing risk and enhancing readiness and effectiveness of deploying ships and strike groups; 2) Warfare Systems Certification, which is essential to validating the maturity and operational performance of warfare systems prior to fleet delivery and deployment; 3) Navigation Certification (NAVCERT) and Electronic Charting and Display System - Navy (ECDIS-N) certification, which certifies ship electronic charting capability and certifies the accurate transmission of navigation data to combat and weapons systems; 4) Combat Systems Integration Testing (CSIT), formerly known as Warfare Systems Integration and Interoperability Testing (WSI2T), which is essential in the identification of critical integration and interoperability issues.  CSIT also provides Objective Quality Evidence (OQE) for warfare system certification decisions for installation and deployment; and 5) Interoperability Certification and Assessment, the independent assessment of Strike Group Warfare Systems operational performance.  Interoperability Assessments examine force level engagement threads, aircraft control, air battle-space management, and operational displays.  Assessments of deploying ships in Strike Force configurations are accomplished through the utilization of the Navy's Distributed Engineering Plant (DEP), which is the cornerstone for the Distributed Integration & Interoperability Assessment Capability (DIIAC) Concept.  It is a U.S. Fleet Forces Command and Commander In Chief, U.S Pacific Fleet (COMPACFLT) requirement that all Strike Forces undergo Interoperability Assessment testing in the DEP prior to deployment.  Interoperability Certification results are used to develop fleet tactical tools (Capabilities & Limitations (C&L) and Tactical Information Coordinator Technical Aids (TIC TECHAIDs)), which ensure that operators understand the interoperability capabilities and limitations of their combat systems.      \n\nProject 3312 Maritime Theater Missile Defense Forum (MTMD):\n\nThis project funds participation in the Maritime Missile Defense Projects Framework Memorandum of Understanding of 2004 (as amended in 2009).  Known as the Maritime Theater Missile Defense (MTMD) forum, it promotes interoperability with the Navies of nine participating nations (Australia, Canada, France, Germany, Italy, Netherlands, Spain, United Kingdom and the United States).  This project funds participation in several Project Arrangements and includes maritime contribution to the NATO Active Layered Theater Ballistic Missile Defense (ALTBMD) project, now known as NATO Ballistic Missile Defense (BMD). Engineering analysis and recommendations from MTMD activities are provided to European, Pacific and Central Combatant Commands to influence present day operations.  Specifically, the MTMD Forum is addressing challenges with \"Maritime Allied Air Defense in Support of Ballistic Missile Defense Operations\" that face the Combatant Commanders during present day operations.\n\nThe MTMD forum provides protection against the proliferation of short, medium and long-range Ballistic Missile (BM) and Advanced Anti-Ship Cruise Missile (ASCM) threats through the creation of an interoperable sea-based Integrated Air and Missile Defense (IAMD)capability among coalition nations.  This includes protection across the full spectrum of these threats through the enhanced utilization of existing sea-based systems to protect against current threats while progressively improving and developing systems and system-of- systems to effectively counter evolving threats. \n\nMTMD supports USN participation in several MTMD related Project Arrangements and Working Groups including:\n(1)  Battle Management Command, Control, Communications, Computers, and Intelligence (BMC4I) to define and develop architectures as well as to perform engineering to address coalition capability gaps.\n(2)  Modeling & Simulation (M&S) to establish and maintain a maritime coalition M&S testbed and to perform legacy and future systems simulation testing.\n(3)  Coalition Distributed Engineering Plant (CDEP) to establish and maintain a maritime coalition Hardware-in-the-Loop Testbed and to conduct CDEP testing.\n(4)  Open Architecture (OA) to develop Interface Standards and Data Models.\n(5)  Test Planning and Execution (TPEX) to develop Test Plans, oversee exercise participation and conduct post event data analysis and reporting.\n(6)  Operational Requirements (OR) to develop a Coalition Maritime Missile Defense Operational Concept Document and to identify operational constraints and tactical constructs surrounding coalition maritime missile defense activities.\n\nProject 9B88 Automated Test and Retest (ATRT):\n\nThe Navy, through Automated Test and Re-Test (ATRT) is developing an automated test\/analysis capability, which is applicable at phases within system development and integration which provides reproducible and quantitative evaluation of system performance with reduced levels of effort and schedule in order to support one of the Navy's priority initiatives of reduction of Total Ownership Cost (TOC). Funding will provide additional work towards ongoing testing and analysis efforts within the  Combat Systems Integration Testing (CSIT), formerly known as Warfare Systems Integration and Interoperability Testing (WSI2T), AEGIS Combat System Advanced Capability Build (ACB) 12, Antisubmarine Warfare Integrated Common Processor\/Acoustic Rapid Commercial Off The Shelf (COTS) Insertion, the Littoral Combat Ship (LCS) Mission Module development and other major acquisition programs.  In addition, funding will support the development of standards, specifications, and guidance to facilitate NAVSEA-affiliated programs' adoption of this TOC-reducing discipline and technology.\n\nPer Congressional direction, starting in FY14, the ATRT project moves to Program Element 0603597N under Project Unit 9B88C: \"Automated Test and Re-Test - Congressional\"."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "56.551"
                },
                "CurrentYear": {
                    "val": "36.570"
                },
                "BudgetYearOne": {
                    "val": "41.949"
                },
                "BudgetYearOneBase": {
                    "val": "41.949"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "45.131"
                },
                "CurrentYear": {
                    "val": "4.396"
                },
                "BudgetYearOne": {
                    "val": "20.881"
                },
                "BudgetYearOneBase": {
                    "val": "20.881"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-11.420"
                },
                "CurrentYear": {
                    "val": "-32.174"
                },
                "BudgetYearOne": {
                    "val": "-21.068"
                },
                "BudgetYearOneBase": {
                    "val": "-21.068"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.069"
                    }
                },
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-22.100"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "CurrentYear": {
                        "val": "-10.005"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.691"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-20.641"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-20.641"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.427"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.427"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-4.729"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional Directed Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-6.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "1. FY13 reflects congressionally mandated sequestration reduction, FY13 Small Business Innovative Research Assessments and Division G, Section 3001 and 3004 reductions.\n2. FY14 decrease in funding resulted from Congressional reductions and transfer of ATRT.\n3. FY15 decrease in funding from previous President's Budget submission is due to transfer of ATRT, reductions in contracted services, Navy Warfare Center Fee Rate adjustments, and realignment of funds to match projected expenditures."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0164"
                    },
                    "ProjectTitle": {
                        "val": "Combat System Integration"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "316.943"
                        },
                        "PriorYear": {
                            "val": "33.208"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "11.528"
                        },
                        "BudgetYearOneBase": {
                            "val": "11.528"
                        },
                        "BudgetYearTwo": {
                            "val": "24.147"
                        },
                        "BudgetYearThree": {
                            "val": "23.033"
                        },
                        "BudgetYearFour": {
                            "val": "21.377"
                        },
                        "BudgetYearFive": {
                            "val": "21.825"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Project 0164: Combat System Integration: \n\nThis project funds the Strike Force Interoperability Program through the following pillars: 1) Command & Control, Communications, Computer, Combat Systems, and Intelligence Modernization Process (C5IMP) and Fleet Readiness. The C5IMP validates the introduction of new systems into the Fleet and ensures system maturity prior to installation, thereby reducing risk and enhancing readiness and effectiveness of deploying ships and strike groups; 2) Warfare Systems Certification, which is essential to validating the maturity and operational performance of warfare systems prior to fleet delivery and deployment; 3) Navigation Certification (NAVCERT) and Electronic Charting and Display System - Navy (ECDIS-N) certification, which certifies ship electronic charting capability and certifies the accurate transmission of navigation data to combat and weapons systems; 4)  Combat Systems Integration Testing (CSIT), formerly known as Warfare Systems Integration and Interoperability Testing (WSI2T), which is essential in the identification of critical integration and interoperability issues. CSIT also provides Objective Quality Evidence (OQE) for warfare system certification decisions for installation and deployment; and 5) Interoperability Certification and Assessment, the independent assessment of Strike Group Warfare Systems operational performance.  Interoperability Assessments examine force level engagement threads, aircraft control, air battle-space management, and operational displays. Assessments of deploying ships in Strike Force configurations are accomplished through the utilization of the Navy's Distributed Engineering Plant (DEP), which is the cornerstone for the Distributed Integration & Interoperability Assessment Capability (DIIAC) Concept. It is a U.S. Fleet Forces Command and Commander In Chief, U.S Pacific Fleet (COMPACFLT) requirement that all Strike Forces undergo Interoperability Assessment testing in the DEP prior to deployment.  Interoperability Certification results are used to develop fleet tactical tools (Capabilities & Limitations (C&L) and Tactical Information Coordinator Technical Aids (TIC TECHAIDs)), which ensure that operators understand the interoperability capabilities and limitations of their combat systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Navigation System Certification (NAVCERT)"
                                    },
                                    "Description": {
                                        "val": "This project funds assessments in support of NAVCERT associated with modernizations and\/or new capability upgrades.  A NAVCERT communicates to NAVSEA, Ship Program Managers (SPMs), Type Commanders (TYCOMs), and the Fleet that shipboard navigation systems are properly installed and in good physical condition and operating to specified accuracy and requirements. A NAVCERT certifies: (1) Ship electronic charting display capability ensuring safety at sea.  (2) Accurate transmission of navigation data to combat and weapons systems ensuring ordnance is delivered on target. (3) Aircraft inertial alignment system which is critical for returning aircraft. A successful NAVCERT is required for Warfare Systems Certification Decisions (WSCD), TOMAHAWK Weapons System (TTWCS) Certifications, Precision Approach Landing Systems (PALS) Certifications, and Electronic Charting and Display System-Navy (ECDIS-N) Certification.  \n\nOPNAVINST 9420.2 and NAVSEAINST 9420.4 requires that a Navigation System Certification (NAVCERT) be performed for all initial installation\/new construction, major overhaul\/modification\/repair when it is determined to impact the accuracy of navigation data, changes to the navigation baseline configuration, greater than six months ship availability, or elapsed time of more than five (5) years since previous NAVCERT to ensure safe navigation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.462"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Performed 26 NAVCERTs on cruisers, destroyers, carriers, and amphibs. Initiate update of NAVSEA Instruction 9420.4A to incorporate fleet input and lessons learned."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continuing critical NAVCERT efforts to include performing limited NAVCERTs on cruisers, destroyers, carriers and amphibs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.200"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.200"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Plans are to perform 18 NAVCERTs on cruisers, destroyers, carriers, and amphibs. Issue update of NAVSEA Instruction 9420.4A."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Command, Control, Communications, Computer, Combat Systems, and Intelligence Modernization Process (C5IMP) and Fleet Readiness (C5ISR)"
                                    },
                                    "Description": {
                                        "val": "This project funds engineering assessments of proposed C5I capability modernizations to determine maturity for installation and risk associated with installs of equipment outside of normal modernization windows. This project is required to support the fleet C5I Modernization Policy (per COMUSFLTFORCOM\/COMPACFLT Inst. 4720.3B), to manage operational risks associated with C5ISR modernization in both afloat and ashore units ensuring deploying units receive improved, interoperable, and certified warfighting capabilities in order to meet theater operational requirements. This is done by determining the maturity, through engineering analysis, of the critical linchpins needed to achieve interoperability for each proposed C5IMP capability improvement item to be installed in a ships baseline (Baseline Change), developing installation recommendations of C5I system upgrades for the Fleet Commanders, and researching and analyzing installation or operating problems. Failure to achieve required maturity can break the warfare system package installed on a ship and impact strike group capabilities. There is close coordination with the FLTCDRs and TYCOMs as well as other members of the C5IMP community to address, coordinate, and resolve C5IMP modernization issues thereby reducing risk and enhancing readiness and effectiveness of deploying ships and strike groups. Strike Group Engineers (SGEs) analyze planned C5I configurations of ships and Strike Groups; identify and analyze capability, interoperability, and modernization issues in a Strike Group context; assess impacts against requirements; and provide recommendations for resolution."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.060"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Provided C5IMP and Strike Group Engineering support for all CSGs, ARGs, and independent deployers throughout the interdeployment cycle, including preparations for deployment of 6 CSGs, 3 ARGs and 40 independent deployers during FY13. Facilitated review, assessment, and execution of C5I installations during 100 CNO availabilities in FY 13. Supported 1 Naval C5I Modernization Conference (NCMC) and 12 monthly baseline events. Risk Assessment & Mitigation: Identification and analysis of risk related to the installation of Consolidated Afloat Network and Enterprise Services (CANES) onboard 12 ships to provide decision makers with a clear understanding of the risks, benefits, and mitigations related to this installation; the CANES Program Office is now executing these key mitigation steps toward achieving interoperable installation of this system. Reviewed the MH-60R LAMPS helicopter interoperability with the AEGIS Combat System (ACS)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continuing critical C5IMP efforts to include facilitating review, assessment, and execution of C5I installations during CNO Availabilities in FY14."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Facilitate review, assessment, and execution of C5I installations during approximately 100 CNO Availabilities in FY15. Support 1 NCMC and 12 monthly baseline events."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Combat System Integration  Testing (CSIT)"
                                    },
                                    "Description": {
                                        "val": "This program funds Land-Based Test Sites to conduct integration testing for the Ship Self Defense Mark 1\/2 Integrated Combat Systems at NSWC Dahlgren, VA and at Wallops Island, VA as well as the Advanced Combat Direction System (ACDS) Block 0\/1 and FFG Combat Direction System testing at Combat Direction Systems Activity Dam Neck, VA. Combat System Testing (formerly known as SEA05H Warfare Systems Integration and Interoperability Testing (WSI2T)), is essential in the identification of critical combat systems integration issues. CST also provides Objective Quality Evidence (OQE) for warfare certification decisions to support installation and deployment approvals. OPN\/OMN funds support the maintenance and upgrade of the test labs to provide an integrated test environment similar to shipboard configurations in the Fleet."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.200"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Program Combat Systems integration planning\/conduct\/execution\/OQE reporting for the following platforms:  LHD 1, SSDS MOD 5C (LSD 50\/52) & CVN 75\/76. This effort will end in FY13."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Interoperability Certification and Assessment"
                                    },
                                    "Description": {
                                        "val": "This project funds Interoperability assessments via the Distributed Engineering Plant, the technical assessment of interoperable systems to meet mission requirements, the updating of Strike Group Capabilities and Limitations (C&L) and the updating of the Tactical Information Coordinator Technical Aids (TIC TECHAIDs).  Efforts of the project ensure NAVSEA\/PEOs are delivering mature and interoperable warfare systems at the platform and strike group level, NAVSEA provides strike force interoperability certification and assessments. This program focuses on new systems and platforms under development. Interoperability Assessments of deploying ships in Strike Force configurations is accomplished through the utilization of the Navy's Distributed Engineering Plant (DEP), which provides operational configurations for all naval combat systems located at multiple Navy land-based sites located across the country and connected via networking technology. It is a U.S. Fleet Forces Command requirement that all Strike Forces undergo Interoperability Assessment testing in the DEP prior to deployment. The DEP provides the only opportunity for comprehensive interoperability testing of combat system and C5I configuration items prior to shipboard delivery for operational use in surface combatant platforms and strike group units. Further, the DEP provides the mechanism to support the surface Navy's participation in the Joint testing environments as well as the MTMD Coalition forces interoperability testing. The Distributed Integration & Interoperability Assessment Capability (DIIAC) will leverage the existing DEP (facilities, skilled resources, live assets, and network connectivity) and ATRT applications to test and assess battle force interoperability. The result of DEP testing is fed into the development of fleet tactical tools: C&L and TIC TECHAIDs, which ensure that operators understand the interoperability capabilities and limitations of their combat systems. C&Ls are delivered for Strike Groups and their Coalition and Joint partners. TIC TECHAIDS are delivered to deploying ships prior to workups and then a final copy prior to deployment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.068"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The Distributed Engineering Plant (DEP) conducted seven test events culminating in 224 lab hours of testing. Testing included the following:\n1. DEP Common Connectivity Device (CCD)\/Gateway Terminal Emulator (GTE) comparison testing.\n2. Digital Air Control (DAC) testing and test bed validation.\n3. Aegis AMIIP Risk Mitigation Test\n4. Aegis AMIIP Interoperability Certification Test\n5. Navy Continuous Training Environment (NCTE) Proof of Concept, network engineering test\nDEP executed requisite pre-test planning, network engineering and data analysis to include development of products and deliverables. These products and deliverables include: (1) event scheduling and planning, (2) test procedure development and test planning working group meetings, (3) network maintenance, configuration management and equipment configuration list, (4) data management and analysis plan, data analysis working groups, analysis briefs and assessment final reports. DEP testing, network configuration and data analysis supports the Naval Warfare Systems Certification Policy (NWSCP) and produces Objective Quality Evidence (OQE) used in Warfare Systems Certification Installation Assessment (WSIA) and Warfare System Certification Decision (WSCD). DEP completed development to one of four Interoperability Mission Area Scenarios (IMAS) for use as a common certification scenario. DEP completed a Navy Continuous Training Environment (NCTE) Proof of Concept test to explore feasibility of connecting DEP to the NCTE network therefore potentially creating a land based test bed for LCS, DDG-1000 and elements of CVN-78. DEP conducted connectivity and stability analysis of Multi-TDL-J communications during Ballistic Missile Defense (BMD) Exercise 13-2. Conducted interoperability assessments of LCS-1 and AEGIS AMIIP Baselines. DEP provided connectivity and support of a Cross Domain Solution leading to a completion of MTMD CDEP PA-2 interoperability events. Provided C&L documents for 65 Strike Groups comprised of 237 ships and 110 Naval Air Squadrons (covering F\/A-18s, E-2Cs, MH-60s, EA-6Bs and P-3s). Conducted analysis of force level engagement threads, aircraft control, air battlespace management, and operational displays, focusing on deploying Strike Groups and new systems and platforms under development. TIC TECHAIDs delivered for 35 SG ships, 15 ARG ships, 45 independent deploying ships, and 10 Land Based Sites."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continuing critical Interoperability Certification and Assessment efforts to include limited interoperability assessments of SSDS AMIIP baselines and AEGIS Baseline 9. Conduct research and provide limited updates to Interoperability C&L documents on the C&L website for 65 strike groups comprised of 237 ships, 110 Naval Air Squadrons (covering F\/A 18s, E-2Cs, MH-60s, EA-6Bs and P-3s). Limited deliveries of TIC TECHAIDS for SG ships, ARG ships, and independent deploying ships."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.552"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.552"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct one DEP test event to support the Interoperability Assessment for certification of SSDS Baseline 10, including planning, execution, and reconstruction with data analysis. Conduct 2 Interoperability Certification assessments (SSDS baseline 10.09.00, & AEGIS baseline 9) to provide OQE for Warfare Systems Certification. Conduct research and provide updated Interoperability C&L documents on the C&L website for 65 strike groups comprised of 237 ships, 110 Naval Air Squadrons (covering F\/A 18s, E-2Cs, MH-60s, EA-6Bs and P-3s). TIC TECHAIDS will be delivered for 35 SG ships, 15 ARG ships, and 40 independent deploying ships."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Warfare Systems Certification"
                                    },
                                    "Description": {
                                        "val": "This project funds the conduct of Warfare Systems Certification against set criteria.  This includes providing operational risk assessments, using Objective Quality Evidence (OQE), to ensure installation readiness and deployment readiness of warfare systems and Navy surface platforms.  As directed by COMUSFLTFORCOM\/COMPACFLT Inst. 4720.3B, C5ISR Modernization Policy, and in accordance with NAVSEAINST 9410.2, Naval Warfare System Certification Policy (NWSCP), NAVSEA will perform these assessments based on OQE obtained through testimony of subordinate activities and\/or independent testing. NAVSEA engineering analyses are developed and staffed for criteria not met. NAVSEA accomplishes these efforts through Warfare Systems Certification Readiness Reviews (WSCRR), Warfare Systems Installation Assessment (WSIA), and Warfare Systems Certification Decisions (WSCD) to support the installation and deployment of warfare systems in Navy surface platforms. The purpose of the WSCRR is to review and approve the Warfare System Certification Plan (WSCP), monitor warfare systems against the WSCP and monitor satisfaction of established criteria to facilitate a WSIA and WSCD. The purpose of the WSIA is to provide the Fleet with an early assessment of risk and characterization of the warfare systems maturity and readiness to support sail-away and any shipboard test and training events for New Construction (NC) phase, Refueling Complex Overhaul (RCOH) or lead ships that are test platforms for major modernization effort and\/or an assessment to support an authorization for installation of the warfare system(s) for in-service platforms. This allows the Fleet to make informed installation, testing\/exercise, and training decisions. The purpose of the WSCD is to provide warfare systems certification including an assessment of risk and characterization of the warfare systems maturity and readiness to support deployment. A NAVSEA certification decision message is released following the WSCD. An operational risk assessment characterizing warfare systems maturity and readiness to support the subject ship's deployment is developed from OQE gathered from 20 different criteria for each decision point meeting\/panel.  This pillar also ensures that aggregate deficiencies and workarounds do not render the operator ineffective by conducting an analysis of all work-arounds documented in Techniques & Procedures (TTPs), Capabilities & Limitations (C&L), and Trouble Reports (TR)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.418"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conducted 152 Warfare Systems Certification Events (WSCRRs, WSIAs, and WSCDs), involving CG 47, DDG 51\/1000, CVN 68\/78, LHA 1\/6, LHD 1, LPD 17, LSD 41\/49 and LCS Ship Class and amphibious assault ships. Funding provided supported the development and implementation of processes to support the increase in necessary criteria identified in the update NWSCP from 17 to 20 to include: review and adjudication of Warfare Systems trouble reports; review of Tactics, Techniques and Procedures (TTP) and workarounds to assess the aggregate workload of the operators to meet mission requirements; develop method to test the stressful endurance of warfare systems; Develop an Integrated Product Data Management (iPDM) Tool for a unified data environment, classified to secret level."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continuing critical Warfare System Certification efforts to include supporting limited Warfare Systems Certification Events for above ship classes."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.776"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.776"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Support approximately 64 Warfare Systems Certification Events for above ship classes. Update the NWSCP and implement revised Naval Warfare Systems Certification Policy."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPN 2960"
                                    },
                                    "Title": {
                                        "val": "(ICSTD\/DEP): Integrated Combat System Test Division\/Distributed Engineering Plant"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "5.240"
                                        },
                                        "CurrentYear": {
                                            "val": "4.963"
                                        },
                                        "BudgetYearOne": {
                                            "val": "4.016"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "4.016"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "9.031"
                                        },
                                        "BudgetYearThree": {
                                            "val": "9.230"
                                        },
                                        "BudgetYearFour": {
                                            "val": "9.389"
                                        },
                                        "BudgetYearFive": {
                                            "val": "9.588"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "RDTEN funding under this line supports independent certification of the integration of major capability upgrades acquired by Program Executive Offices (PEOs) into host Navy Platforms and Strike Forces.  The RDTEN engineering and certification activities at field sites do not involve direct procurement of equipment or engineering services, and hence no acquisition strategy is required.  The major capability upgrades evaluated under this program fall under their associated PEOs' acquisition strategies."
                        },
                        "PerformanceMetrics": {
                            "val": "Quarterly Program Reviews and Baseline Assessments"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3312"
                    },
                    "ProjectTitle": {
                        "val": "MTMD-Maritime Theater Missile Defense Forum"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "3.135"
                        },
                        "PriorYear": {
                            "val": "3.952"
                        },
                        "CurrentYear": {
                            "val": "4.396"
                        },
                        "BudgetYearOne": {
                            "val": "9.353"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.353"
                        },
                        "BudgetYearTwo": {
                            "val": "9.048"
                        },
                        "BudgetYearThree": {
                            "val": "9.322"
                        },
                        "BudgetYearFour": {
                            "val": "7.819"
                        },
                        "BudgetYearFive": {
                            "val": "7.989"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project funds participation in the Maritime Missile Defense Projects Framework Memorandum of Understanding of 2004 (as amended in 2009).  Known as the Maritime Theater Missile Defense (MTMD) forum, it promotes interoperability with the Navies of nine participating nations (Australia, Canada, France, Germany, Italy, Netherlands, Spain, United Kingdom and the United States).  This project funds participation in several Project Arrangements and includes maritime contribution to the NATO Active Layered Theater Ballistic Missile Defense (ALTBMD) project, now known as NATO Ballistic Missile Defense (BMD). Engineering analysis and recommendations from MTMD activities are provided to European, Pacific and Central Combatant Commands to influence present day operations.  Specifically, the MTMD Forum is addressing challenges with \"Maritime Allied Air Defense in Support of Ballistic Missile Defense Operations\" that face the Combatant Commanders during present day operations.\n\nThe MTMD forum provides protection against the proliferation of short, medium and long-range Ballistic Missile (BM) and Advanced Anti-Ship Cruise Missile (ASCM) threats through the creation of an interoperable sea-based Integrated Air and Missile Defense (IAMD)capability among coalition nations.  This includes protection across the full spectrum of these threats through the enhanced utilization of existing sea-based systems to protect against current threats while progressively improving and developing systems and system-of- systems to effectively counter evolving threats. \n\nMTMD supports USN participation in several MTMD related Project Arrangements and Working Groups including:\n(1)  Battle Management Command, Control, Communications, Computers, and Intelligence (BMC4I) to define and develop architectures as well as to perform engineering to address coalition capability gaps.\n(2)  Modeling & Simulation (M&S) to establish and maintain a maritime coalition M&S testbed and to perform legacy and future systems simulation testing.\n(3)  Coalition Distributed Engineering Plant (CDEP) to establish and maintain a maritime coalition Hardware-in-the-Loop Testbed and to conduct CDEP testing.\n(4)  Open Architecture (OA) to develop Interface Standards and Data Models.\n(5)  Test Planning and Execution (TPEX) to develop Test Plans, oversee exercise participation and conduct post event data analysis and reporting.\n(6)  Operational Requirements (OR) to develop a Coalition Maritime Missile Defense Operational Concept Document and to identify operational constraints and tactical constructs surrounding coalition maritime missile defense activities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Maritime Theater Missile Defense Forum (MTMD)"
                                    },
                                    "Description": {
                                        "val": "This project funds participation in the MTMD forum to promote interoperability with participating coalition nations.  This project funds participation in the Modeling and Simulation (M&S), Battle Management, Command, Control, Communications, Computers and Intelligence (BMC4I), Coalition Distributed Engineering Plant (CDEP), Test Planning and Execution (TPEX), Open Architecture (OA), and Operational Requirements (OR)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.952"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "(1)  BMC4I:  Completed version 1.0 of MTMD Target Architecture No. 1, updated the Coalition Capability and Interoperability Report and completed version 1.0 of the System Tactical Data Link Interoperability Report.  Conducted limited test operations at the Integrated Warfare Systems Laboratory and provided risk assessments in support of Combatant Commander requests for allied air defense in support of present-day ballistic missile defense missions.\n(2) M&S completed Polaris Air Defense Model tuning to enable Navy participation in Joint Project Optic Windmill, a hardware-in-the-loop, modeling & simulation and tactical BMD exercise in June 2013.  Completed the MTMD M&S testbed and conducted risk reduction and run-for-record M&S tests of the MTMD Baseline Architecture.\n(3) CDEP project completed the multi-national hardware-in-the-loop testbed and conducted a test readiness review, risk reduction tests and the run-for-record hardware-in-the-loop tests of the MTMD Baseline Architecture, and established the Single Encryption Enclave for data sharing among the nations and projects within the MTMD Forum.  \n(4) The Open Architecture Radar Interface Standard (OARIS) was completed and submitted to the Object Management Group, an international standards body for review and approval.  \n(5)  TPEX conducted Rapid Arrow 2012 at-sea demonstrations and conducted initial post-test analysis, Joint Warrior 152 Test Readiness Review #1, Rim of the Pacific Exercise (RIMPAC) 2014 Initial Planning and delivered the Master Test Plan Version 3.0.\n(6) Operational Requirements working group completed an update to the MTMD Operational Concept Document, provided fleet operational guidance to the M&S and CDEP tests, and provided operators to participate in Joint Project Optic Windmill for operational events.\n(7)  Completed the Project Arrangement for Next Generation Infrared Search and Track, which included industry surveys and cost estimates for prototype development.  Cost estimates were considered prohibitive in the current state of declining defense budgets of all the nations and it was agreed to not start a new project for prototype development (prototype development was not funded in previous budget exhibits)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.396"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "(1)  BMC4I will provide architecture inputs to M&S, CDEP, and TPEX to finalize test architectures consistent with Target Architecture No. 1. BMC4I will develop initial information exchange requirements between systems and nations to enable mission threads. \n(2) M&S will update system models and the M&S testbed to meet Target Architecture No. 1 requirements. M&S will conduct analysis of Baseline Architecture tests completed in FY13 and provide results and recommendations to support at-sea demonstration risk reduction activities.  \n(3) CDEP will update the hardware-in-the-loop testbed to meet Target Architecture No. 1 requirements and conduct data analysis of Baseline Architecture tests completed in FY13. CDEP will deliver Version 1 of the Integrated Capabilities & Limitations document Version 1 (Baseline Architecture).\n(4) Development of the Force Level Open Architecture Technical Standard will commence. This standard will be developed to establish minimum requirements for a multinational data model to improve interoperability among the nations.\n(5)  TPEX will continue planning and range preparations for the major at-sea demonstrations during Joint Warrior 152 in 2015 and RIMPAC 2016. An update to the Master Test Plan will be delivered following the Test Readiness Review in March 2014. Targets will be configured for the 2015 test events.  Test architectures will be developed and negotiated with NATO BMD and the Missile Defense Agency.  Risk Reduction analysis and tests will be completed.\n(6) Operational Requirements working group will continue to provide fleet inputs and operator oversight to test and evaluation events, support Force-Level function development\/maturation, support training development for test events and coordinate development of tactics, techniques and procedures.  Operational framework guidance will be provided for the development of MTMD multi-national, Force-Level mission planning."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.353"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.353"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "(1)  BMC4I will continue engineering analysis and multi-national interoperability gap assessment and will develop Target Architecture No. 2.  BMC4I will evaluate Recommended Point Solutions and provide final recommendations for the implementation in correcting coalition interoperability gaps.  BMC4I will finalize information exchange requirements in preparation for at-sea demonstrations.\n(2)  M&S will complete analysis of Target Architecture No. 1 M&S tests and provide assessments and recommendations to improve information exchange requirements identified by BMC4I.\n(3)  CDEP will complete analysis of Target Architecture No. 2 hardware-in-the-loop tests and provide assessments and recommendations to improve information exchanges required to conduct the at-sea demonstrations.  CDEP will provide the final architecture risk assessment and Version 2 of the Capabilities & Limitations document to support the at-sea demonstrations.\n(4)  Open Architecture will continue development of the Force Level Open Architecture Technical Standard.  Inputs from M&S and CDEP test results will be used to improve the details of the standard.\n(5)  TPEX will finalize preparations for and conduct MTMD participation as part of Joint Warrior 152.    This 2015 At-Sea Demonstration will include live tracking events and a combination of live and simulated engagements.  Integrated Air Defense and Ballistic Missile Defense test scenarios among the nations will be conducted. This will be the first multi-national maritime test of it's kind ever conducted.  Planning for RIMPAC 2016 will continue and will include target configuration\/procurement.\n(6)  Operational Requirements working group will continue to provide fleet inputs and operator oversight to test and evaluation events.  The Operational Concept Document will be updated as will final tactics, techniques and procedures in support of the at-sea demonstrations in 2015 and 2016."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0605853N"
                                    },
                                    "Title": {
                                        "val": "PU 0149 INTERNATIONAL COOP MANAGEMENT, TECHNICAL AND INTL SUPT"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "1.771"
                                        },
                                        "CurrentYear": {
                                            "val": "2.500"
                                        },
                                        "BudgetYearOne": {
                                            "val": "2.563"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "2.563"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "2.627"
                                        },
                                        "BudgetYearThree": {
                                            "val": "2.692"
                                        },
                                        "BudgetYearFour": {
                                            "val": "2.760"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603790N"
                                    },
                                    "Title": {
                                        "val": "PU 2293 NATO RESEARCH & DEVELOPMENT"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.500"
                                        },
                                        "CurrentYear": {
                                            "val": "0.500"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Quarterly Program Reviews and Baseline Assessments"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "9B88"
                    },
                    "ProjectTitle": {
                        "val": "Automated Test and Re-Test"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "9.875"
                        },
                        "PriorYear": {
                            "val": "7.971"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "17.846"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The use of these funds by Navy, through Automated Test and Re-Test (ATRT), will further develop an automated test\/analysis capability, which is applicable at phases within system development, integration, and certification which provides reproducible and quantitative evaluation of system performance with reduced levels of effort and schedule in order to support one of the Navy's priority initiatives of reduction of Total Ownership Cost (TOC). Funding will provide additional work towards ongoing testing and analysis efforts within the Integrated Combat System Test Facility (ICSTF), AEGIS Combat System Advanced Capability Build (ACB) 16, Submarine Federated Tactical System and Virginia Class Submarines, the Littoral Combat Ship (LCS) Mission Module\/ Combat Management System development and other major acquisition programs. In addition, funding will support the development of standards, specifications, and guidance to facilitate NAVSEA-affiliated programs' adoption of this TOC-reducing discipline and technology. \n\nPer Congressional direction, starting in FY14 and through the outyears, the ATRT project moves to Program Element 0603597N under Project Unit 9B88C: \"Automated Test and Re-Test - Congressional\"."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Automated Test and Re-Test"
                                    },
                                    "Description": {
                                        "val": "The use of these funds by Navy, through Automated Test and Re-Test (ATRT), will further develop an automated test\/analysis capability, which is applicable at phases within system development, integration, and certification which provides reproducible and quantitative evaluation of system performance with reduced levels of effort and schedule in order to support one of the Navy's priority initiatives of reduction of Total Ownership Cost (TOC). Funding will provide additional work towards ongoing testing and analysis efforts within the Integrated Combat System Test Facility (ICSTF), AEGIS Combat System Advanced Capability Build (ACB) 16, Submarine Federated Tactical System and Virginia Class Submarines, the Littoral Combat Ship (LCS) Mission Module\/ Combat Management System development and other major acquisition programs. In addition, funding will support the development of standards, specifications, and guidance to facilitate NAVSEA-affiliated programs' adoption of this TOC-reducing discipline and technology."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.971"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The ATRT program will be concluding (8) FY12 ATRT pilot implementation projects throughout NAVSEA-affiliated PEOs. Because of Sequestration, there are only (2) FY13 efforts in process for award for PEO IWS and PEO LCS to execute. The ATRT program has continued to facilitate the development of standards, specifications, and guidance for the use of ATRT tools and processes. With the recent engagement of other SYSCOMs in ATRT, a community of practice is being developed across the system commands to further engage programs about the automated testing disciplines established and in development."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Per Congressional direction, starting in FY14 and through the outyears, the ATRT project moves to Program Element 0603597N under Project Unit 9B88C: \"Automated Test and Re-Test - Congressional\".\n\nFY14 plans stated under the new Program Element."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Per Congressional direction, starting in FY14 and through the outyears, the ATRT project moves to Program Element 0603597N under Project Unit 9B88C: \"Automated Test and Re-Test - Congressional\".\n\nFY15 plans stated under the new Program Element."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Program Strategy for the ATRT program includes the following:\n- Investigation of applicable similarities to industry standards, specifications, and processes that are relevant to ATRT program to recognize best practices and leverage opportunities\n- Development of standards and specifications for ATRT tools\/processes\n- Funding and execution of ATRT startup projects within acquisition programs per submission of proposals and Business Case Analyses (BCA)\n- Development of training and outreach efforts to promote awareness of automated testing and analysis body of knowledge and available tools\/processes\n- Setup and maintain an ATRT portal for the collection and dissemination of body of knowledge\n- Produce Contract Language Guidebook for ATRT"
                        },
                        "PerformanceMetrics": {
                            "val": "Progress towards meeting the objectives of the ATRT efforts will be monitored via the following:\n- Progress Briefs at Quarterly ATRT Stakeholders Meetings\n- Bi- Monthly ATRT Program Reviews\n- Return on Investment Metrics based on work hours for test process execution - before and after automation\n- Return on Investment Metrics based on work hours for test process execution - before and after automation"
                        }
                    }
                }
            ]
        }
    }
}