{
    "id": "0540d71c8ab7ec60d2a836ab014324141d0699d0",
    "meta": {
        "filename": "dod-2015_RDTE_2015_DTRA_RDTE_JustificationBook_Defense_Threat_Reduction_Agency_PB_2015.zzz_unzipped_RDTE_JustificationBook_Defense_Threat_Reduction_Agency_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Defense Threat Reduction Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602718BR"
        },
        "ProgramElementTitle": {
            "val": "WMD Defeat Technologies"
        },
        "R1LineNumber": {
            "val": "23"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Defense Threat Reduction Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "374.382"
            },
            "PriorYear": {
                "val": "158.844"
            },
            "CurrentYear": {
                "val": "156.111"
            },
            "BudgetYearOne": {
                "val": "151.737"
            },
            "BudgetYearOneBase": {
                "val": "151.737"
            },
            "BudgetYearTwo": {
                "val": "154.537"
            },
            "BudgetYearThree": {
                "val": "157.318"
            },
            "BudgetYearFour": {
                "val": "160.215"
            },
            "BudgetYearFive": {
                "val": "163.683"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "*RR Project title change from Test Infrastructure starting in FY 2015"
        },
        "ProgramElementMissionDescription": {
            "val": "The mission of the Defense Threat Reduction Agency (DTRA) is to safeguard the United States and its Allies from Global Weapons of Mass Destruction (WMD) threats by integrating, synchronizing, and providing responsive expertise, technologies, and capabilities unequalled by our adversaries.  This mission directly reflects several national and Department of Defense (DoD) level guidance\/vision documents to include the National Security Strategy, Unified Command Plan, National Strategy to Combat WMD, Counterproliferation Interdiction, National Strategy for Combating Terrorism, National Military Strategy, Global Development of Forces, Global Employment of Forces, National Military Strategy for Combating WMD, National Military Strategic Plan for the War on Terrorism, Joint Strategic Capabilities Plan (including the Nuclear Annex), and Nuclear Posture Review.  To achieve this mission, DTRA has identified principal objectives along with strategies and tasks to ensure the objectives are met.  These objectives are: \n1)\tEnsure a safe, secure, and effective nuclear deterrent;\n2)\tAnticipate emerging WMD threats;\n3)\tProvide Combating WMD situational awareness;\n4)\tAssess infrastructure and personnel vulnerabilities;\n5)\tPrevent proliferation and use of WMD;\n6)\tDefend against WMD threats;\n7)\tDefeat WMD threats;\n8)\tRecover from WMD consequences;\n9)\tSynchronize countering WMD activities. \n \nA focused and strong threat reduction technology base is critical to meeting these objectives and ultimately achieving DTRA's mission.  This technology base is closely tied with the operational support programs that make up DTRA’s combat support mission.  DTRA has taken the steps to develop this technology base and provide a foundation for transformational activities within the WMD arena.\n\nActivities funded by Program Element 0602718BR implement a wide set of National Security Presidential Directive (NSPD) 17 and emerging Presidential Policy Directive (PPD) guidance for prevention of proliferation of WMD and WMD terrorism.  Projects support strengthening nonproliferation, through the development of the Arms Control Enterprise System (ACES) and Arms Control inspection training and operational capabilities.  Through development of new sensor systems, sensor networks, counterforce and fundamental CWMD research, these programs contribute to securing and interdicting WMD, WMD delivery systems and related materials.  Finally, programs in this area fund development and operational support of the DTRA Technical Reachback analysis center, which supports United States (U.S.) and Allied Forces, interagency and civil authorities with 24\/7 Chemical, Biological, Radiological, Nuclear, and High-yield Explosives (CBRNE) event analysis support.\n\nProject RA (Information Science and Applications) develops innovative technologies and modeling and simulation (M&S) capabilities; collaborative net-centric CBRNE modeling access and support capabilities between DoD and key interagency and international partners;  and provides Technical Reachback support to create decision advantage for the U.S. and our Allies through improved situational understanding across the complete CWMD mission space.\n\nProject RE (Counter Terrorism-Technologies) provides research and development support to Joint U.S. Military Forces, specifically U.S. Special Operations Command (USSOCOM) in the areas of Explosive Ordnance Disposal (EOD) Device Defeat and counter-WMD technologies for warfighters.\n\nProject RF (Detection and Forensics Technologies) develops technologies, systems and procedures for post detonation nuclear forensics, and to detect, identify, track, tag, locate, monitor and interdict strategic and improvised nuclear and radiological weapons, components, materials, or infrastructure in support of Department of Defense (DoD) requirements for combating terrorism, counterproliferation and nonproliferation, homeland defense, and international initiatives and agreements.  \n\nProject RG (Defeat Technologies) develops advanced technologies and weapon concepts and validates their applicability as counter WMD weapon systems.\n\nProject RI (Nuclear Survivability) provides the capability for DoD nuclear forces and their associated control and support systems and facilities in wartime to avoid, repel, or withstand attack or other hostile action, to the extent that essential functions can continue or be resumed after the onset of hostile action.  \n\nProject RL (Nuclear & Radiological Effects) develops nuclear and radiological assessment modeling tools to support military operational planning, weapon effects predictions, and strategic system design decisions.  \n\nProject RM (WMD Counterforce Technologies) provides (1) novel and enhanced weapons energetic materials and structures, full-scale testing of counter WMD weapons effects, weapons effects modeling, and weapon delivery optimization, (2) WMD sensor, surveillance and data processing technologies, and (3) the DTRA Experimentation Lab.  \n   \nProject RR (Combating WMD Test and Evaluation) provides a unique national test bed capability for simulated WMD facility characterization, weapon-target interaction, and WMD facility defeat testing to respond to operational needs by developing and maintaining test beds used by the DoD, the Services, the Combatant Commanders and other federal agencies to evaluate the implications of WMD, conventional, and other special weapon use against U.S. military or civilian systems and targets. \n\nProject RU (Fundamental Research for Combating WMD) fosters transition of early applied research into technology development.  Provides (1) strategic studies to support DoD, (2) decision support tools and analysis to support combating WMD research and development investments, and (3) early applied research for technology development."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "172.352"
                },
                "CurrentYear": {
                    "val": "175.282"
                },
                "BudgetYearOne": {
                    "val": "178.437"
                },
                "BudgetYearOneBase": {
                    "val": "178.437"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "158.844"
                },
                "CurrentYear": {
                    "val": "156.111"
                },
                "BudgetYearOne": {
                    "val": "151.737"
                },
                "BudgetYearOneBase": {
                    "val": "151.737"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-13.508"
                },
                "CurrentYear": {
                    "val": "-19.171"
                },
                "BudgetYearOne": {
                    "val": "-26.700"
                },
                "BudgetYearOneBase": {
                    "val": "-26.700"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.227"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "-12.085"
                    },
                    "CurrentYear": {
                        "val": "-19.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.196"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Realignments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "0.671"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.671"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Reductions"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-27.371"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-27.371"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "-0.171"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The decrease in FY 2013 from the previous President's Budget submission is predominately due to Congressional reductions and the Small Business Innovation Research (SBIR) transfer.  The decrease in FY 2014 from the previous President's Budget submission is predominately due to Congressional reductions.  The decrease in FY 2015 from the previous President’s Budget submission is predominantly due to reduced investment in concept studies and prototype testing of CWMD defeat technologies and from reduced investment in nuclear weapons targeting support and consequence of execution. Reduced investment impacted RF-Detection and Forensics Technologies, RG-Defeat Technologies, RI-Nuclear Survivability, RL- Nuclear and Radiological Effects, RM-WMD Counterforce Technologies, RR-Combating WMD Test and Evaluation, and RU-Fundamental Research For Combating WMD."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "RA"
                    },
                    "ProjectTitle": {
                        "val": "Information Science and Applications"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "87.202"
                        },
                        "PriorYear": {
                            "val": "24.872"
                        },
                        "CurrentYear": {
                            "val": "26.284"
                        },
                        "BudgetYearOne": {
                            "val": "29.079"
                        },
                        "BudgetYearOneBase": {
                            "val": "29.079"
                        },
                        "BudgetYearTwo": {
                            "val": "29.814"
                        },
                        "BudgetYearThree": {
                            "val": "30.033"
                        },
                        "BudgetYearFour": {
                            "val": "30.443"
                        },
                        "BudgetYearFive": {
                            "val": "30.827"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Information Science and Applications project provides (1) advanced data analytics, knowledge management, and systems engineering (SE) support across all other projects, (2) innovative counterproliferation research and development, (3) Technical Reachback support on Weapons of Mass Destruction (WMD) effects and consequences, and (4) collaborative Combating WMD analysis capabilities between Department of Defense (DoD) and key interagency and international partners through a globally accessible net-centric framework.  The advanced analytics program provides SE and research and development with requirements, technology, architecture analyses and proof-of-principle capabilities necessary for making decisions on strategic planning, research and development investments, new initiatives, cooperation, and ventures with new customers, and accomplishment of high-level, short notice special projects.  It also conducts the development, validation, and fielding of the Arms Control Enterprise System (ACES) as a part of the United States commitment under arms control treaties.  The innovative counterproliferation effort conducts research and development to investigate, identify, develop, and transition short term, high payoff technologies from Defense Threat Reduction Agency (DTRA), other government agencies, industry, academia, and international Science and Technology (S&T) partners into the respective DTRA, and other research and development programs, and to end user organizations.  The Technical Reachback effort provides 24 hour\/7 days per week information and analyses on potential impacts of WMD events to Warfighters and First Responders in consult with DTRA’s Combating Weapons of Mass Destruction (CWMD) Research and Development subject matter experts.  Net-centric modeling access and support provides a real-time accessible framework which enables the DTRA Chemical, Biological, Radiological, Nuclear, and High-yield Explosives (CBRNE) modeling and simulation codes to provide an integrated suite of CWMD decision support capabilities.  This project also provides support to international Counter-WMD science and technology cooperation by developing modifications and improvements to new technologies and information tools suitable for foreign release and cooperative efforts.\n\t\nThe increase from FY 2013 to FY 2014 is predominately due to the relative impact of Congressional reductions in FY 2013.  The increase from FY 2014 to FY 2015 is predominantly due to the net effect of reduced investment in systems engineering collaboration with external partners\/customers, slowing development and fielding of innovative technologies to the warfighter, and increased investment in advanced analytics, modeling and simulation, and hazardous effects characterization.\n "
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RA:  Information Science and Applications"
                                    },
                                    "Description": {
                                        "val": "Project RA (Information Sciences and Applications) develops innovative technologies and modeling and simulation (M&S) capabilities and provides Technical Reachback support to create decision advantage for the U.S. and our Allies through improved situational understanding across the complete CWMD mission space."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "24.872"
                                            },
                                            "Text": {
                                                "val": "- Completed requirements and gap analyses to enable research and development efforts to meet combating WMD capability gaps.  \n- Supported program and project managers by translating Agency goals and Concept of Operations into actionable products.\n- Supported STRATCOM requirements for an integrated strategic stockpile force structure planning tool.\n- Integrated first person virtual environments into the suite of CWMD Modeling and Simulation capabilities.\n- Facilitated Joint Concept Development & Experimentation (JCDE) for the CWMD Community of Interest.\n- Supported Office of the Secretary of Defense-Cost Assessment and Program Evaluation (OSD-CAPE) and OSD-Nuclear Matters Office (NM) strategic planning efforts and force analyses.\n- Deployed advanced Combating WMD (CWMD) operational virtual\/live training capabilities for Technical Support Group (TSG) and related DoD activities.\n- Began integrating DTRA Reachback WMD atmospheric transport code with 1st generation real time radiation modeling capabilities.\n- Solicited and initiated innovative research projects for developing needed new technologies and increased end-user capabilities (leveraging other DoD and United States Government resources where possible) focused on CBRNE detection, CWMD, Improvised Explosive Device (IED) detection and defeat, and\/or Special Nuclear Materials (SNM) detection.\n- Improved capability to model secondary and tertiary effects supporting optimal course of action and tactical decisions for WMD operations, including power and communication infrastructures.\n- Refined and enhanced WMD lessons learned process with international staff and across the other COCOMs, incorporating lessons learned from partner activities.\n- Developed and updated DTRA Support Plan as directed in the Defense Planning and Programming Guidance (DPPG) to further the Combating WMD mission across all theaters while balancing DTRA assets and managing risks as prioritized within the Guidance for Employment of the Force (GEF).\n- Utilized institutionalized linkage with North Atlantic Treaty Organization\/Supreme Headquarters Allied Powers, Europe (NATO\/SHAPE) and United States European Command (USEUCOM) in international research and development collaboration to further develop international research and development collaboration within the Pacific Region in accordance with the GEF. \n- Conducted strategic analyses and assessments on emerging WMD threats using various strategic research methodologies.  \n- Expanded the use of Second Track Dialogues to meet future CWMD challenges.\n- Managed the Threat Reduction Advisory Committee (TRAC).\n- Built a professional network of up-and-coming professionals (post-BS\/BA and pre-PhD) through effective management of the Bio Initiative for the Next Generation.\n- Modernized infrastructure and extended enhanced enterprise services.\n- Completed documentation and architecture design for migrated mission systems.\n- Began code-based vulnerability scanning and documentation.  Expanded capability to perform code analysis earlier in the life-cycle development as well as interfacing passive code exploitation reporting to the DTRA Computer Network Defense Service Provider (CNDSP).\n- Improved software to assist our allies in assessing vulnerability of structures to WMD.\n- Integrated common terrain translation tools into the DoD\/Department of Homeland Security (DHS)\/Department of Energy (DOE) radiation particle transport code suite, providing a direct capability of automatically ingesting scenario topographical features for physics-based particle transport computation. \n-Integrated high fidelity 3D Monte Carlo physics particle code along with high fidelity 3D deterministic based physics particle transport code to form the DoD\/DHS\/DOE single graphical user interface-based radiation particle transport scenario design tool \n- Finalized detector modeling analysis in support of the DTRA’s future radiation detector campaign. \n- Integrated Technical Reachback capabilities into the CBRNE Tactical Training System allowing for a deployable CBRNE asset with real-time simulated detector\/source instruments that reflect real-life detector\/source characteristics\n- Began to incorporate a classified weapon database along with classified weapon time profiles into models that simulate real life nuclear weapon radiation propagation.\n- Developed initial prototype of an updated digital WMD Facility, Equipment, and Munitions Identification Handbook, deployed on Defense Advanced Research Projects Agency's (DARPA) TransApps framework, and demonstrated during United States Forces Korea (USFK) exercise."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "26.284"
                                            },
                                            "Text": {
                                                "val": "- Continue to solicit innovative research projects for developing new technologies and increased end-user capabilities to support “Data to Decisions” S&T development.\n-  Provide Open Innovation and Technology Watch\/Scouting in support of “Data to Decisions” S&T development for DTRA and other government agencies.\n- Continue to conduct strategic analyses and assessments on emerging WMD threats using various strategic research methodologies.  \n- Continue to manage the Threat Reduction Advisory Committee (TRAC).\n- Continue requirements and gap analyses to enable research and development efforts to meet CWMD capability gaps.  \n- Support program and project managers by translating Agency goals and Concept of Operations into actionable products.\n- Test and continue development on next generation capabilities for “real-time” reachback supporting radiological search and visualization.\n- Continue modifications and capability improvements to vulnerability assessment software and integrated WMD toolsets to contribute to new CWMD cooperative technology efforts.\n- Continue activities to implement Full Operational Capability for Mission Domain Information Technology architecture.\n- Make improvements to the DTRA Integration, Test and Experimentation Center (DITEC).\n- Continue to provide systems engineering contractor support to numerous DTRA Research and Development programs, projects, and activities, to include nuclear detection activities, innovative new technologies, modeling and simulation activities, and research and development strategic planning efforts.\n- Continue to upgrade and manage the research and development portfolio management software tool for use across all DTRA research and development programs, projects, and activities.\n- Develop and modernize a Global Knowledge Management Capability (GKMC) software tool for OSD level and other users."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "29.079"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "29.079"
                                            },
                                            "Text": {
                                                "val": "- Create automated methods to operate DoD\/DHS\/DOE radiation particle transport code suite on the DoD high performance computational network.\n- Integrate first principle blast and nuclear fallout codes into the DoD\/DHS\/DOE radiation particle transport code suite.\n- Deploy the GKMC software tool for OSD level and other users, providing an integrated unclassified CWMD collaboration environment supporting U.S. and Allied capabilities and CWMD situational awareness.\n- Develop and deploy enhanced geospatial and synthetic population services supporting more rapid Consequence of Execution and Consequence Management predictive modeling and Reachback support.\n- Support the DTRA exploratory development and initial real-time collaborative CBRNE integrated deployment framework.\n- Implement the FY 2014 developed design for a common information science and deployment environment, supporting training, operations, and mission support of CBRNE assessment for primary, secondary, and tertiary effects.\n- Continue to conduct strategic analyses and assessments on emerging WMD threats using various strategic research methodologies.  \n- Continue to manage the Threat Reduction Advisory Committee (TRAC).\n- Continue activities in support of leveraging cloud capabilities and demonstrate prototype capabilities.\n- Demonstrate initial IT capabilities in support of achieving highly automated fusion and dissemination of comprehensive data necessary for the Agency’s mission of providing global combating weapons of mass destruction situational awareness."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "30\/0603160BR"
                                    },
                                    "Title": {
                                        "val": "Proliferation, Prevention, and Defeat"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "3.006"
                                        },
                                        "CurrentYear": {
                                            "val": "2.431"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "152\/0605502BR"
                                    },
                                    "Title": {
                                        "val": "Small Business Innovation Research"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "3.006"
                                        },
                                        "CurrentYear": {
                                            "val": "4.454"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Government and industrial performers are assessed and selected based upon a \"best fit for task\" criteria.  DoD Service Laboratories and DoE National Laboratories are common government awardees."
                        },
                        "PerformanceMetrics": {
                            "val": "Number of customer requests for data analysis compared to historical level.\nNumber of changes to investments based on systems engineering analyses.\nNumber of exercises and operations supported.\nNumber of Defense Acquisition Workforce Improvement Act certified systems engineers. \nNew capabilities delivered and transitioned to operational capabilities.\nMission Enclave RDT&E computing environment moves from development to Initial Operational Capability (IOC).\nMission Enclave moves from IOC to Full Operational Capability (FOC).\nSegment architectures for the Mission Enclave and supported mission systems.  \nIntegrated segment architectures into the DTRA Enterprise Architecture.\nDevelopment of network modeling and system-in-the-loop testing capabilities within the DTRA Integration, Test and Experimentation Center (DITEC).\nTimely delivery of updated DTRA WMD force-on-force and radiation particle transport code to the development team and external customers \nNumber of project agreements\/interactions with foreign partners and Allies."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "RE"
                    },
                    "ProjectTitle": {
                        "val": "Counter-Terrorism Technologies"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "2.409"
                        },
                        "PriorYear": {
                            "val": "2.607"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Counter-Terrorism Technologies project is an over-arching project that develops and transitions a full spectrum of new technologies to counter emergent Weapons of Mass Destruction (WMD) thus enabling warfighters to improve their ability to detect, disable, interdict, neutralize, and destroy chemical, biological, nuclear production, storage, and weaponization facilities.  (See paragraph C for other program funding.)"
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RE: Counter-Terrorism Technologies"
                                    },
                                    "Description": {
                                        "val": "Project RE provides research and development support to Joint United States Military Forces, specifically U.S. Special Operations Command (USSOCOM) in the areas of Explosive Ordnance Disposal (EOD) Device Defeat and counter-WMD technologies for warfighters."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.607"
                                            },
                                            "Text": {
                                                "val": "- Continued planned development and transitioned new counterproliferation technologies for Joint U.S. Military Forces to counter WMD, enabling warfighters to improve their ability to detect, disable, interdict, neutralize, and destroy chemical, biological, and nuclear production, storage, and weaponization facilities."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "30\/0603160BR"
                                    },
                                    "Title": {
                                        "val": "Proliferation, Prevention, and Defeat"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "106.967"
                                        },
                                        "CurrentYear": {
                                            "val": "111.658"
                                        },
                                        "BudgetYearOne": {
                                            "val": "108.630"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "108.630"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "104.129"
                                        },
                                        "BudgetYearThree": {
                                            "val": "113.606"
                                        },
                                        "BudgetYearFour": {
                                            "val": "108.229"
                                        },
                                        "BudgetYearFive": {
                                            "val": "110.239"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Number of technologies developed and delivered, and\/or proof of concept, or successful Military Utility Assessments conducted that increase the potential mission success and reduces the number of current gaps in Special Operations Forces capabilities to counter weapons of mass destruction."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "RF"
                    },
                    "ProjectTitle": {
                        "val": "Detection and Forensics Technologies"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "89.267"
                        },
                        "PriorYear": {
                            "val": "41.343"
                        },
                        "CurrentYear": {
                            "val": "36.102"
                        },
                        "BudgetYearOne": {
                            "val": "35.061"
                        },
                        "BudgetYearOneBase": {
                            "val": "35.061"
                        },
                        "BudgetYearTwo": {
                            "val": "35.548"
                        },
                        "BudgetYearThree": {
                            "val": "36.522"
                        },
                        "BudgetYearFour": {
                            "val": "37.382"
                        },
                        "BudgetYearFive": {
                            "val": "38.223"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project develops technologies, systems, and procedures to detect, identify, track, locate, monitor, and interdict strategic and improvised nuclear and radiological weapons, components, materials, or infrastructure in support of Department of Defense (DoD) requirements for combating terrorism, counterproliferation and nonproliferation, homeland defense, and international initiatives and agreements. This project researches, develops, demonstrates, and transitions advanced technologies to improve operational capabilities to detect and identify nuclear and radiological weapons.  It supports the attribution process through development, demonstration, and transition of improved post-detonation National Technical Nuclear Forensics (NTNF) operational capabilities in the areas of materials collection, debris diagnostics and materials analysis, and prompt diagnostics and device reconstruction.  Efforts under this project also support international peacekeeping and nonproliferation objectives, on-site and aerial inspections and monitoring, on-site sampling and sample transport, and on-site and off-site analysis to meet forensic, verification, monitoring and confidence-building requirements.\n\nThe decrease from FY 2013 to FY 2014 is predominately due to the redirection of the nuclear detection portfolio toward a more holistic Nuclear Threat Detection portfolio that integrates both passive and active radiation detection into a comprehensive Intelligence, Surveillance, and Reconnaissance (ISR) solution. This resulted in a decreased investment in advanced detector technology to fund increased investment in nuclear weapons effects in Project RI - Nuclear Survivability and system vulnerability and assessment capabilities in Project RL - Nuclear and Radiological Effects.  The decrease from FY 2014 to FY 2015 is predominantly due to reduced investment in concept studies and prototype testing of CWMD defeat technologies."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RF: Detection and Forensics Technologies"
                                    },
                                    "Description": {
                                        "val": "Project RF develops technologies, systems and procedures for post detonation nuclear forensics and to detect, identify, track, tag, locate, monitor and interdict strategic and improvised nuclear and radiological weapons, components, materials, or infrastructure in support of DoD requirements for combating terrorism, counterproliferation and nonproliferation, homeland defense, and international initiatives and agreements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "41.343"
                                            },
                                            "Text": {
                                                "val": "- Completed design, development, and construction of a clean room for further development and low-cost manufacturability of a best-performing helium-3 replacement material.\n- Completed research and development of new material capable of both gamma and neutron detection with high energy resolution and high discrimination for use in next generation prototype handheld and smaller radiation detectors.  \n- Improved the manufacturing readiness level by maturing technologies, designs, and production processes.\n- Completed multi-year testing and evaluation of over twenty large-area hand-held spectroscopic radioisotope identifiers to compare and select the best performing technology for further development and transition to user groups.\n- Designed, tested, produced, and delivered modular precision radiation source localization tools.\n- Completed design alternatives for a compact superconducting source in active interrogation systems, investigated the use of proton beams for standoff stimulation of fission in nuclear materials, and improved accelerator designs for enhanced capabilities with reduced weight and size.\n- Continued to exploit known all-source nuclear threat signatures, characteristics, and corresponding detection modalities while continuing to identify new all-source nuclear threat signatures, characteristics, and corresponding detection modalities; identified the proper tipping, queuing, and data fusion techniques and algorithms to enable the rapid and effective accumulation of all-source intelligence on nuclear threat scenarios. \n- Investigated alternative methods to detect fissions in nuclear materials from standoff ranges.\n- Progressively advanced the laboratory physics demonstrations of target stimulation, signature detection, and validated modeling capability. \n- Initiated research into advanced multi-modal detection algorithms.\n- Began sensor integration into fielded situational awareness software systems.\n- Started research into nanoscale radiation detection materials for small-scale high-resolution radiation detectors.\n- Incorporated radiation transport algorithms into existing operational modeling tools.\n- Developed, tested, and demonstrated prototype ground-based sensor capabilities for post-detonation prompt diagnostics (under DISCREET OCULUS).\n- Developed and demonstrated prototype advanced airborne and ground debris sample collection and integrated nuclear yield determination capabilities as part of the extended National Technical Nuclear Forensics (NTNF) Joint Capability Technology Demonstration (JCTD).\n- Developed and demonstrated upgraded technical capabilities for sample analysis, modeling to support nuclear device reconstruction, and forensics data to lower uncertainties\/increase confidence in technical nuclear forensics (TNF) conclusions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "36.102"
                                            },
                                            "Text": {
                                                "val": "- Develop, accelerate development where appropriate, demonstrate, and field (prototype) upgraded technical capabilities for prompt diagnostics (under DISCREET OCULUS and MINIKIN ECHO) and debris sample collection, sample analysis, modeling to support nuclear device reconstruction and forensics data to lower uncertainties\/increase confidence and improve timeliness of technical nuclear forensics (TNF) conclusions. Includes development of new debris collection, field analysis concepts, improved in-laboratory timelines, new signature development, improved modeling and simulation capabilities, and other supporting technologies. \n- Develop methods to rapidly determine post-event nuclear weapon yields and reaction history by investigating alternative prompt nuclear weapons effects, effects on the environment, and developing\/fielding prototype capabilities.  \n- Identify all-source nuclear threat signatures, characteristics, and corresponding detection modalities; identify the proper tipping, queuing, and data fusion techniques and algorithms to enable the rapid and effective accumulation of all-source intelligence on nuclear threat scenarios. \n- Develop and improve an advanced algorithm to increase speed and reliability of isotope identification in fielded hand-held and portable detectors.\n- Continue to collaborate with international partners to develop a photon Bremsstrahlung capability for active interrogation of Special Nuclear Material (SNM).\n- Research and develop new detector materials intended to improve the capability to detect, locate, and identify threat materials. \n- Improve the manufacturing readiness level by maturing technologies, designs, and production processes.\n- Develop and demonstrate novel and advanced neutron detection technology as an alternative to helium-3 neutron detectors."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "35.061"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "35.061"
                                            },
                                            "Text": {
                                                "val": "- Complete initial development of two neutron detection materials as alternatives to helium-3 neutron detectors\n- Complete development of room-temperature high-resolution gamma imaging detector electronics and semiconductor materials.\n- Research and develop new detector materials to improve the capability to detect, locate, and identify special nuclear materials. Improve the manufacturing readiness level by maturing technologies, designs, and production processes.\n- Execute robust and operationally relevant testing and evaluation of developmental radiation detection systems in order to determine and select the best performing technologies and techniques for further development and transition to user groups.\n- Demonstrate and field methods to remotely monitor small and wide areas. \n- Progress development of advanced 3D imaging technologies for high resolution source characterization and identification to provide new and improved capabilities to detect, locate, and identify threat materials.\n- Research, develop, test, and evaluate software tools and capabilities to locate and identify the signatures of special nuclear materials on both existing and newly developed hardware platforms.\n- Enhance algorithms to increase speed and reliability of isotope identification in fielded portable radiation detectors.\n- Begin testing, evaluation, and selection of best-performing developed software tools and algorithms to improve user capabilities and extend capabilities of existing radiation detection technologies.\n- Field an advanced detection algorithm to improve capabilities to detect, locate, and identify threat materials.\n- Continue identifying comprehensive all-source nuclear threat signatures, characteristics, and corresponding detection modalities; continue the identification and development of the proper tipping, queuing, and data fusion techniques and algorithms to enable the rapid and effective accumulation of all-source intelligence on nuclear threat scenarios.\n- Develop, accelerate development where appropriate, test, demonstrate, and field prototype ground-based sensor capabilities for post-detonation prompt diagnostics under DISCREET OCULUS.\n- Develop, test, demonstrate, and field (prototype) upgraded technical capabilities for prompt diagnostics, debris collection, sample analysis, modeling to support nuclear device reconstruction, and forensics data to decrease timeline, lower uncertainties, and increase confidence in technical nuclear forensics (TNF) conclusions."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "30\/0603160BR"
                                    },
                                    "Title": {
                                        "val": "Proliferation Prevention and Defeat"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "69.331"
                                        },
                                        "CurrentYear": {
                                            "val": "74.556"
                                        },
                                        "BudgetYearOne": {
                                            "val": "66.707"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "66.707"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "68.770"
                                        },
                                        "BudgetYearThree": {
                                            "val": "70.727"
                                        },
                                        "BudgetYearFour": {
                                            "val": "71.058"
                                        },
                                        "BudgetYearFive": {
                                            "val": "72.959"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "121\/0605000BR"
                                    },
                                    "Title": {
                                        "val": "WMD Defeat Capabilities"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "6.906"
                                        },
                                        "BudgetYearOne": {
                                            "val": "6.887"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "6.887"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "7.156"
                                        },
                                        "BudgetYearThree": {
                                            "val": "7.397"
                                        },
                                        "BudgetYearFour": {
                                            "val": "7.497"
                                        },
                                        "BudgetYearFive": {
                                            "val": "7.625"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Government and industrial performers are assessed and selected based upon a \"best fit for task\" criteria.  DoD Services, Laboratories, Department of Energy (DOE) National Laboratories are common government awardees."
                        },
                        "PerformanceMetrics": {
                            "val": "Successful development and operational acceptance of transitional detection technologies.\nSuccessful demonstration of the capability to exfiltrate data to a remote platform.\nDelivery of technical equipment prototypes to reduce their current gaps in technology, to locate, characterize and provide advanced diagnostics to defeat Weapons of Mass Destruction devices in support of a classified Chairman of the Joint Chiefs of Staff plan. \nDemonstrate high-resolution imaging, gamma spectroscopy, and gamma source location using room-temperature detector technology.\nSuccessful completion of a neutron detection system utilizing multiple Helium-3 replacement technologies.\nDelivery of a comprehensive report conclusively citing the successful utility of active interrogation techniques.\nSuccessful demonstration of the effectiveness, optimization, and utility of advanced, cutting edge algorithms that are a significant improvement over currently fielded algorithms.\nSuccessfully test, demonstrate, field, and\/or transition prototype nuclear forensics technologies\/capabilities to an operational customer.\nDown-select of new signatures, surrogate urban debris production routes, and technology requirements for field analysis capabilities.\nSuccessful demonstration of the capability to exfiltrate data to a remote platform."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "RG"
                    },
                    "ProjectTitle": {
                        "val": "Defeat Technologies"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "34.313"
                        },
                        "PriorYear": {
                            "val": "13.544"
                        },
                        "CurrentYear": {
                            "val": "15.059"
                        },
                        "BudgetYearOne": {
                            "val": "10.982"
                        },
                        "BudgetYearOneBase": {
                            "val": "10.982"
                        },
                        "BudgetYearTwo": {
                            "val": "11.769"
                        },
                        "BudgetYearThree": {
                            "val": "11.492"
                        },
                        "BudgetYearFour": {
                            "val": "11.804"
                        },
                        "BudgetYearFive": {
                            "val": "12.072"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Defeat Technologies project develops, integrates, demonstrates and transitions innovative kinetic and non-kinetic weapon capabilities to expand traditional and asymmetric options available to Combatant Commanders (CCDRs) to deny, disrupt, and defeat adversarial use of Weapons of Mass Destruction (WMD) while minimizing collateral effects from incidentally released agents.  Technology development focuses on the physical or functional defeat of (1) chemical, biological, radiological, and nuclear (CBRN) threat materials, (2) an adversary's ability to deliver the same, as well as (3) the physical and non-physical support networks enabling both.  It does so through the systematic identification and maturation of advanced technologies capable of defeating WMD agents or agent based processes, then integrating them into weapons, delivery systems or rapid WMD elimination capabilities that are most relevant to the Combatant Commands (COCOMs) WMD Defeat Concept of Operations (CONOPS) and their Area of Responsibility (AOR).  This program includes developing specific WMD agent\/agent-based process simulants, test infrastructure, and sampling capability required for effective development, testing, and evaluation (DT&E) of next-generation capabilities to ensure optimum weapon solutions are achieved based on this technology.  The program is addressing defeat of adversaries' offensive WMD programs through integration of current conventional weapons capabilities and next generation kinetic and non-kinetic solutions to provide full-spectrum asymmetric defeat options.  The program addresses requirements delineated in the Quadrennial Defense Review and Strategic Planning Guidance as codified in the Joint Capabilities Integration and Development System (JCIDS), Service requirements documents, and COCOM and Agency Priority Lists for lethal and non-lethal Combating-WMD capability.\n\nThe program places a high priority on understanding, characterizing, and validating potential weapon effects within some mathematical confidence as it relates to the unintended release of hazardous threat materials.  Our end-state is to provide COCOMs with accurate and timely WMD defeat expertise, tailored technologies, and customized solutions that provide offensive weapons and capabilities to combat WMD in any target while mitigating collateral contamination effects.  Without these capabilities our nation cannot effectively hold at risk our adversaries’ WMD capabilities thus giving them strategic advantage.\n\nThe increase from FY 2013 to FY 2014 is predominately due to the net effect of Congressional reductions in FY 2013 and increased investment in Counter-WMD (CWMD) hard target defeat weapons development in FY 2014.  The decrease from FY 2014 to FY 2015 is predominantly due to reduced investment in Next Generation CWMD Weapon Concept research and demonstration of Agent Defeat Penetrator technologies."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RG: Defeat Technologies"
                                    },
                                    "Description": {
                                        "val": "Project RG (Defeat Technologies) develops advanced technologies and weapon concepts and validates their applicability as counter WMD weapon systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.544"
                                            },
                                            "Text": {
                                                "val": "- Initiated small-scale testing in support of BLU-121\/B bomb development focusing on development of low lifecycle cost agent defeat payload fills.\n- Continued advanced testing of non-energetic WMD Defeat sub-munitions.\n- Continued testing and demonstrations of CWMD payloads.\n- Continued to explore integration of kinetic and non-kinetic capabilities into single payload for counter-WMD testing.\n- Continued testing and demonstrations of payloads capable of neutralizing large amounts of WMD agent.\n- Continued determining and cataloging the accuracy and precision of bio-aerosol sampling equipment used in counter-WMD testing.\n- Continued development of a capability to conduct full-scale agent defeat testing with acceptable accuracy and precision.\n- Conducted large-scale target testing of functional and kinetic defeat technologies.\n- Developed Next Generation AFX-757 Survivable Explosive Formulation for enhanced survivability against hard and deeply buried targets; transitioned effort to Air Force Research Laboratory\/Munitions Office (AFRL\/RW) Conventional Survivable Ordnance Package Program.\n- Continued development of robust forensic tools for an automated analysis of susceptibility of electronics to electromagnetic fields.\n- Demonstrated the capabilities of the Joint Direct Attack Munition (JDAM) tailkit Battle Damage Information (BDI) systems in ground testing to provide near-real-time munitions effectiveness estimates to the warfighter. \n- Initiated development of access denial or denial-of-use technologies for WMD targets.\n- Evaluated small new inventory weapons effectiveness against WMD threats."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.059"
                                            },
                                            "Text": {
                                                "val": "- Mature an automated system for the analysis of electronics susceptibility to electromagnetic fields.\n- Continue classified components testing.\n- Begin classified integration and component design.\n- Continue testing in support of a WMD agent defeat penetrator bomb development focusing on development of low lifecycle cost payload fills.\n- Continue development of potential WMD target access denial or denial-of-use technologies.\n- Continue developing robust forensic tools for an automated analysis of susceptibility of electronics to electromagnetic fields.\n- Continue advanced testing of non-energetic WMD Defeat sub-munitions.\n- Continue small-scale testing of CWMD payloads.\n- Continue to explore integration of kinetic and non-kinetic capabilities into single payload for CWMD testing.\n- Continue testing and demonstrations of payloads capable of neutralizing large amounts of WMD agent.\n- Continue to catalog the accuracy and precision of WMD sampling equipment used in CWMD testing.\n- Continue development of a capability to conduct full-scale agent defeat testing with acceptable accuracy and precision.\n- Conduct large-scale target testing of functional and kinetic defeat technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.982"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.982"
                                            },
                                            "Text": {
                                                "val": "- Mature classified component testing.\n- Continue classified integration and component design.\n- Continue development of access denial and denial-of-use technologies for WMD targets.\n- Continue development and integration of concepts for exploiting susceptibility of electronics to electromagnetic fields."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "30\/0603160BR"
                                    },
                                    "Title": {
                                        "val": "Proliferation, Prevention, and Defeat"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "17.034"
                                        },
                                        "CurrentYear": {
                                            "val": "21.811"
                                        },
                                        "BudgetYearOne": {
                                            "val": "19.591"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "19.591"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "22.532"
                                        },
                                        "BudgetYearThree": {
                                            "val": "23.231"
                                        },
                                        "BudgetYearFour": {
                                            "val": "23.625"
                                        },
                                        "BudgetYearFive": {
                                            "val": "24.030"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Government and industrial performers are assessed and selected based upon a “best fit for task” criteria. DoD Service Laboratories, Department of Energy (DoE) National Laboratories, and specialized university laboratories are common government awardees."
                        },
                        "PerformanceMetrics": {
                            "val": "Research and develop potential technologies and mature at least three new capabilities to counter WMD during the FYDP to Technology Readiness Level (TRL) 3\/4."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "RI"
                    },
                    "ProjectTitle": {
                        "val": "Nuclear Survivability"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "38.131"
                        },
                        "PriorYear": {
                            "val": "19.133"
                        },
                        "CurrentYear": {
                            "val": "19.649"
                        },
                        "BudgetYearOne": {
                            "val": "19.416"
                        },
                        "BudgetYearOneBase": {
                            "val": "19.416"
                        },
                        "BudgetYearTwo": {
                            "val": "19.319"
                        },
                        "BudgetYearThree": {
                            "val": "19.405"
                        },
                        "BudgetYearFour": {
                            "val": "19.807"
                        },
                        "BudgetYearFive": {
                            "val": "20.424"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Nuclear Survivability project provides enabling technologies for Department of Defense (DoD) nuclear forces and their associated control and support systems and facilities in wartime to avoid, repel, endure, or withstand attack or other hostile action, to the extent that essential functions can continue or be resumed after the onset of hostile action.  Emphasis is on ionizing radiation effects. The Nuclear Survivability project provides Radiation Hardened (RadHard) Microelectronics and Nuclear Weapons Effects (NWE) experimentation research.  Funding in this project also supports the expanding role of the Nuclear Test Personnel Review (NTPR) program into Science & Technology development for human survivability.\n\nPulsed power and laser-driven NWE simulators are available to validate nuclear survivability requirements for DoD missile and space systems, conduct radiation effects research in materials and electronics, and validate computational models.  The Nuclear Survivability Experimental Capabilities program is working with the National Nuclear Security Administration (NNSA) and the United Kingdom (UK) Atomic Weapons Establishment to jointly develop new, enabling technologies for improved NWE experimentation capabilities for x-rays, gamma rays, and neutrons.\n \nThe Nuclear Technology Analysis Support provides support for the Joint Atomic Information Exchange Group (JAIEG) and the international Weapon Effects Steering Committee (WESC) through the NWE Users’ Group.  The WESC establishes standards for United States. and UK nuclear weapons effects simulation codes and models as defined and prioritized by the nuclear community, and serves as a forum for sharing information on nuclear technologies, capability gaps, and plans.\n\nThe increase from FY 2013 to FY 2014 is predominately due to the relative net impact of Congressional reductions in FY 2013 and increased investment in nuclear weapons effects experimental capabilities.  The decrease from FY 2014 to FY 2015 is predominantly due to reduced investment in nuclear effects simulation\/experimentation capability and radiation hardened nanoelectronics."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RI: Nuclear Survivability"
                                    },
                                    "Description": {
                                        "val": "Project RI (Nuclear Survivability) provides the capability for DoD nuclear forces and their associated control and support systems and facilities in wartime to avoid, repel, endure, or withstand attack or other hostile action, to the extent that essential functions can continue or be resumed after the onset of hostile action."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.133"
                                            },
                                            "Text": {
                                                "val": "- Demonstrated initial 45nm RadHard prototype circuits to develop RadHard by design methods.\n- Developed Technology Computer-Aided Design modeling for 45nm circuit devices.\n- Characterized and mitigated radiation effects in graphene devices.\n- Implemented human radiation induced performance decrement model into operational code. \n- Initiated an investigation of advanced concepts to generate >10X the existing warm x-ray test capability to support strategic system life extension programs in collaboration with the National Nuclear Security Administration (NNSA), Sandia National Laboratory (SNL), and the Navy Research Laboratory (NRL).\n- Enhanced the test capabilities of the DTRA West Coast Facility.\n- Conducted radiation tests of Air Force Intercontinental Ballistic Missile cables and Source Generated Electromagnetic Pulse research for SNL.\n- Restored the electron-beam test capability to the Pithon Nuclear Weapons Effects (NWE) simulator.\n- Funded joint ion beam material response tests with the Navy and UK.\n- Successful use of Photonic Displacement Interferometer in joint US-UK experiments.\n- Developed Marx generator to support Initial Operational Capability of the Short Pulse Gamma Simulator.\n- Conducted solar cell vulnerability test with the Missile Defense Agency on the University of Rochester OMEGA laser."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.649"
                                            },
                                            "Text": {
                                                "val": "- RadHard-by-Design (RHBD) 45nm \/32nm technology demonstration.\n- Radiation effects on advanced technology testing and characterization.\n- Product Demonstration Vehicle (PDV) architecture and circuit layout designs for 45nm\/32nm RHBD project.\n- Complete 45nm and 32nm Hardness Assurance Methods for Testing and Assurance Projects.\n- Transition radiation effects modeling and simulation project from planar 45nm \/ 32nm Electronic Design Automation to 28nm \/ 22nm Fin-Shaped Field Effect Transistors (FinFets).\n- Continue the sustainment of the test capabilities of the DTRA West Coast Facility.\n- Establish the Short Pulsed Gamma prototype as a test capability within the West Coast Facility for hardening and validation of military systems.\n- Demonstrate strategic level direct laser blow-off impulse test capability for two-dimensional configurations to support material modeling & simulation.\n- Perform a full-scale space interceptor telescope survivability test on the National Ignition Facility (NIF) in collaboration with the MDA.\n- Demonstrate new pulsed power driven source designs for enhanced warm (>10 keV) X-ray outputs.\n- Implementation of combined radiation and burn, partial human body model in nuclear weapons effects code.\n- Initiate update of MIL-STD-188-125-1 High-Altitude Electromagnetic Pulse (HEMP) Protection For Ground-Based C4I Facilities Performing Critical, Time-Urgent Missions Part 1 Fixed Facilities.\n- Complete verification test of Modernization of Enterprise Terminals (MET) Hardened Transportable Terminal to MIL-STD-188-125-2.\n- Complete Consolidated Afloat Network and Enterprise Services (CANES) Military Standard.\n- Complete draft MIL-STD-4023 Maritime Electromagnetic Pulse (EMP) Standard for surface ships."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.416"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.416"
                                            },
                                            "Text": {
                                                "val": "- Conclude collaboration with the UK on EMP research on power grid transformers. \n- Deliver new warm x-ray (10-50 keV) test capability on the Double-Eagle and ZR simulators, in collaboration with NRL and SNL.\n- Upgrade the Short Pulse Gamma facility within the West Coast Facility for hardening and validation of satellite and stockpile subsystems and components.\n- Explore and validate new pulsed-power neutron and dust test capabilities. \n- Complete Program Manager’s Handbook for Nuclear Survivability.\n- Publish survivability standards in support of satellite systems, all air domain effects and source region EMP environment.\n- Complete 32nm Product Demonstration Vehicle.\n- Initiate a <22nm Rad Hard-by-Design (RHBD) program.\n- Initiate development of Maskless e-beam lithography."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "30\/0603160BR"
                                    },
                                    "Title": {
                                        "val": "Proliferation Prevention and Defeat"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "5.551"
                                        },
                                        "CurrentYear": {
                                            "val": "6.016"
                                        },
                                        "BudgetYearOne": {
                                            "val": "5.570"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "5.570"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "6.055"
                                        },
                                        "BudgetYearThree": {
                                            "val": "6.302"
                                        },
                                        "BudgetYearFour": {
                                            "val": "6.513"
                                        },
                                        "BudgetYearFive": {
                                            "val": "6.257"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Government and industrial performers are assessed and selected based upon a “best fit for task” criteria.  DoD Service Laboratories, Department of Energy (DOE) National Laboratories, and specialized university laboratories are common government awardees."
                        },
                        "PerformanceMetrics": {
                            "val": "Enhance the NWE Simulator Program at the West Coast Facility (WCF) that provides capability for Department of Defense (DoD) programs to validate and verify survivability of military hardware against a nuclear threat.\nDevelop cold x-ray effects capabilities that meet or exceed the current capabilities.\nDemonstrate advanced warm x-ray experimental and computational capabilities to meet emerging DoD system survivability requirements.\nSuccessfully demonstrate Short Pulse Gamma simulator to support high temporal fidelity for validation of prompt gamma nuclear weapon effects on advanced electronics.\nSuccessfully conduct nuclear weapon effects experimental campaigns to allow identification of x-ray effects phenomena."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "RL"
                    },
                    "ProjectTitle": {
                        "val": "Nuclear & Radiological Effects"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "41.674"
                        },
                        "PriorYear": {
                            "val": "25.395"
                        },
                        "CurrentYear": {
                            "val": "31.398"
                        },
                        "BudgetYearOne": {
                            "val": "32.352"
                        },
                        "BudgetYearOneBase": {
                            "val": "32.352"
                        },
                        "BudgetYearTwo": {
                            "val": "33.322"
                        },
                        "BudgetYearThree": {
                            "val": "34.250"
                        },
                        "BudgetYearFour": {
                            "val": "34.555"
                        },
                        "BudgetYearFive": {
                            "val": "35.104"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Nuclear and Radiological Effects project develops nuclear and radiological assessment modeling tools to support military operational planning, weapon effects predictions, and strategic system design decisions; consolidate validated Defense Threat Reduction Agency modeling tools into a net-centric environment for integrated functionality; predict system response to nuclear and radiological weapons producing electromagnetic, thermal, blast, shock and radiation environments - key systems include Nuclear Command and Control System, Global Information Grid, space assets, structures, humans and environment; provide detailed adversary nuclear infrastructure characterization to enhance counterforce operations and hazard effects; conduct analyses in support of nuclear and radiological Science and Technology and address the priority needs of the Combatant Commands and the Department of Defense (DoD); develop and provide electromagnetic pulse assessment capabilities to support national and military operational planning, weapon effects predictions, and national strategic systems designs; and develop foreign nuclear weapon outputs.\n\nThe increase from FY 2013 to FY 2014 is predominately due to the relative impact of Congressional reductions in FY 2013 and increased investment for nuclear weapons effects for survivability, targeting support, and consequence of execution in FY 2014.  The increase from FY 2014 to FY 2015 is predominantly due to the net effect of the cancellation of the Experimental Situational Awareness Center and a shift in priorities from weapon effects modeling to Electromagnetic Pulse (EMP) survivability and increased investment in full effects modeling."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RL: Nuclear & Radiological Effects"
                                    },
                                    "Description": {
                                        "val": "Project RL (Nuclear & Radiological Effects) develops nuclear and radiological assessment modeling tools to support military operational planning, weapon effects predictions, and strategic system design decisions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "25.395"
                                            },
                                            "Text": {
                                                "val": "- Prototyped first principles urban effects model for nuclear detonations.\n- Delivered improved High Altitude Nuclear Environments model for better modeling\/predictions of nuclear effects from space detonations.\n- Completed three dimensional models of nuclear fallout for better modeling\/predictions of fallout from ground or low-altitude detonations.\n- Started component level Electromagnetic Pulse (EMP) response model for better modeling\/predictions of effects on electronic systems.\n- Continued Effects Manual One (EM-1) development (4 chapters) to document the current state-of-the-art in Nuclear Weapons Effects (NWE) Research & Development.  \n-Continue publication of Joint Radiation Effects documentation.  \n- Continued to upgrade database of foreign nuclear weapon outputs for DoD and the Services.\n- Began new effort in first principles modeling & simulation (M&S) of nuclear fires to support targeting and consequence of execution analyses.\n- Began new effort in developing engineering level models of the response of airborne systems in nuclear dust clouds to support targeting and consequence of execution analyses.  \n- Started development of nuclear weapon environment on airborne strategic systems at low, medium, and high-altitudes to include non-steady, non-level flight to modernize M&S tools in airblast, thermal and fallout applicable areas. \n- Conducted Maritime EMP Standard Ship Test to provide improved techniques for testing Navy vessels against EMP threats.\n- Completed EMP survivability testing of the Defense Satellite Communications System (DSCS) satellite station at the Northwest Navy Satellite Communications Facility (NAVSATCOMMFAC), Chesapeake, VA.\n- Certified the new Air Force Military Satellite Communications (MILSATCOM) Atmospheric Scintillation Simulator (MASS) through simulated modem testing in support of Advanced Extremely High Frequency (AEHF) Program.\n- Supported Office of the Secretary of Defense-led table top exercises by providing subject matter expertise in support of Regional Deterrence.\n- Established a DoD-wide EMP filter testbed to investigate technology shortfalls in industry EMP power filters used to protect United States facilities and systems.\n- Conducted EMP Assessment on the National Military Command Center (NMCC).\n- Conducted EMP Assessment on the Fylingdales, United Kingdom (UK) Satellite Station jointly with the UK developed roadmaps for R&D into nuclear denotation caused fires and EMP."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "31.398"
                                            },
                                            "Text": {
                                                "val": "- Start Atmospheric Nuclear Environment Military Standard.\n- Start Communication in Disturbed Environment Military Standard.\n- Complete Verification Test of Modernization of Enterprise Terminals (MET) Hardened Transportable Terminal to MIL-STD-188-125-2.\n- Complete draft MIL-STD-4023, High Altitude Electro Magnetic Pulse (HEMP) protection for maritime assets.\n- Via the Nuclear Weapon Effects Network (NWEN), model fire start to support United States Strategic Command (USSTRATCOM) interest in Consequences of Execution, fire start experiments, and tunnel defeat.\n- Model Nuclear Infra-Red effects for global assessment of missile defense systems’ capabilities.\n- Expand to include modeling nuclear detonations at lower altitudes.\n- Update radar and IR system models.\n- Update Open cavity System Generated Electro-magnetic Pulse (SGEMP) model to support satellite systems design. \n- Modify input requirements of engineering level codes to take advantage of Redbook and Bluebook output.\n- Model the effects of urban nuclear detonations for underground tunnels (e.g., subways) in support of infrastructure assessments.   \n- Support Nuclear Weapons Effects Database System (NWEDS) functionality with expanded targets and damage calculations, enhanced reports, plot rendering, combined and multiple weapon effects and Nuclear Weapons Database.\n- Provide model for analysis of the high altitude nuclear environments, the effects of EMP and non-ideal air-blast on defense systems for an integrated net-centric application."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "32.352"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "32.352"
                                            },
                                            "Text": {
                                                "val": "- Begin transition of improved airblast, fallout, fire and Source Region Electromagnetic Pulse (SREMP) models to the DTRA net-centric environment for USSTRATCOM (and other nuclear targeting\/consequences of execution users).\n- Improve weapon outputs, environment models and Effects Manual 1 (EM-1) chapters.\n- Deliver upgraded database of foreign nuclear weapon outputs for DoD and the Services.\n- Continue development of SGEMP simulation codes by adapting physics capabilities of the Maxwell’s Equations Equivalent Circuit code (MEEC) and the Improved Concurrent Electromagnetic Particle-In-Cell (ICEPIC) high performance computing code.\n- Further develop a database with selected nuclear weapon output and effects for use in validation of nuclear weapon effects codes.\n- Continue component level EMP response model for better modeling\/predictions of effects on electronic systems.\n- Via the NWEN, continue modeling economic and social consequences of nuclear detonation effects, collateral building damage due to nuclear-induced airblast, assess nuclear dust\/debris effects on airborne systems, and model nuclear fire initiation.\n- Begin enhancement and fix current short falls of High Altitude Radiation Phenomenology (HARP) functionality for use on modern computer systems.\n- Complete transfer of contracting vehicle for continued development of nuclear weapon environment on airborne strategic systems at low, medium, and high-altitudes to include non-steady, non-level flight to modernize modeling and simulation tools in airblast, thermal, and fallout applicable areas.\n- Complete transfer of contracting vehicle for development of the Atmospheric Nuclear Environment Military Standard.\n-  Develop new magnetosphere experiments using microsatellites (CubeSats) for quantification of the artificial radiation belt formation and decay in order to define the source term for damage and degradation of space assets.    \n- Complete transfer of contracting vehicle for development of the Communication in Disturbed Environment Military Standard.\n- Complete engineering level modeling of the response of airborne systems in nuclear dust clouds, and transition the capability to nuclear hardness databases.\n- Begin implementation of first principle modeling tools for nuclear fire initiation and spread in urban and suburban environments.    \n- Publish MIL-STD-4023, HEMP Protection for Maritime Assets.\n- Publish Comprehensive Atmospheric Nuclear Environment MIL-STD.\n- Update MIL-STD-188-125-1\/2, HEMP Protection for Fixed and Transportable Facilities and Systems.\n- Perform an EMP assessment on a US Navy Warship.\n- Update MIL-HDBK-423, HEMP Protection for Fixed facilities.\n- Publish Aircraft EMP Protection Handbook.\n- Add SREMP to the EMREP Toolkit.\n- Conduct EMP Assessments on Defense Critical Infrastructure Power, specifically the power grid and telecommunications networks."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "121\/0605000BR"
                                    },
                                    "Title": {
                                        "val": "WMD Defeat Capabilities"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "5.173"
                                        },
                                        "CurrentYear": {
                                            "val": "5.995"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Government and industrial performers are assessed and selected based upon a “best fit for task” criteria.  DoD Service Laboratories, Department of Energy (DOE) National Laboratories, and specialized university laboratories are common government awardees."
                        },
                        "PerformanceMetrics": {
                            "val": "Provide DoD the ability to predict the survival and mission impact of military critical systems exposed to nuclear weapon environments within acceptability criteria defined during the model accreditation process.\nProvide performance-based, Interface MIL-STDs for nuclear weapon environments and effects for the new systems acquisition and survivability for the new triad and 21st century warfare.\nContinuously improve USSTRATCOM official strategic targeting capability to determine the consequences of execution from nuclear weapons.\nWeapon Effects Steering Committee: Coordinate and integrate nuclear weapon effects needs, capabilities and programs across the U.S. and UK defense communities."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "RM"
                    },
                    "ProjectTitle": {
                        "val": "WMD Counterforce Technologies"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "34.344"
                        },
                        "PriorYear": {
                            "val": "18.026"
                        },
                        "CurrentYear": {
                            "val": "14.444"
                        },
                        "BudgetYearOne": {
                            "val": "13.787"
                        },
                        "BudgetYearOneBase": {
                            "val": "13.787"
                        },
                        "BudgetYearTwo": {
                            "val": "13.583"
                        },
                        "BudgetYearThree": {
                            "val": "13.807"
                        },
                        "BudgetYearFour": {
                            "val": "14.133"
                        },
                        "BudgetYearFive": {
                            "val": "14.607"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Weapons of Mass Destruction (WMD) Counterforce Technologies project provides applied research to support 1) full and sub-scale testing required to investigate countering WMD weapon effects and sensor performance, 2) weapon effects modeling algorithm development, and 3) development of visualization and situational awareness tools to support the next generation Technical Reachback analysis cell.\n\nThis project provides combatant commanders the prediction capability and the attack options to engage WMD targets, to include related Hard & Deeply Buried Targets (HDBTs) as the proliferation and hardness of this class of targets increases.  The project conducts weapon effects phenomenology (WEP) tests, analyzes data, conducts high performance computer simulations, and creates\/modifies software to more accurately model cratering effects, fragmentation (both primary & secondary), internal air blast, equipment\/container damage, structural response, agent release, near miss lethality, and penetration.  These efforts will lead to advanced modeling and simulation capability in the countering WMD planning tools, to include the Integrated Munitions Effects Assessment (IMEA) planning tool used for weaponeering and the Vulnerability Assessment and Protection Option (VAPO) planning tool used for force\/structure protection.  The Advanced Energetics Program develops new novel energetic materials and weapon design technology for rapid, directed and enhanced energy release, providing new capability to defeat difficult WMD\/HDBTs. The Advanced Energetics Program develops new high energy systems well above current chemical energy levels to defeat WMD targets beyond the reach of traditional high explosive blast\/frag warhead technology.\n\nThe decrease from FY 2013 to FY 2014 is predominately due to the relative impact of Congressional reductions in FY 2013 and reduced investment in DTRA wargaming.  The decrease from FY 2014 to FY 2015 is predominantly due to reduced investment in small and medium-scale validation and parametric study experiments for advanced energetics."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RM: WMD Counterforce Technologies"
                                    },
                                    "Description": {
                                        "val": "Project RM (WMD Counterforce Technologies) provides (1) novel and enhanced weapons energetic materials and structures, full-scale testing of counter WMD weapons effects, weapons effects modeling, and weapon delivery optimization, (2) WMD sensor, surveillance and data processing technologies, and (3) the DTRA Experimentation Lab."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.026"
                                            },
                                            "Text": {
                                                "val": "- Provided modeling support for the transfer of novel energetic concepts to selected weapon systems.\n- Completed advanced energetic material formulation testing; performed in-depth fragmentation test and analysis with reactive liners in sub-scale lab tests.\n- Tested agent defeat concepts using hybrid enhanced blast explosives and novel weapon reactive case technologies.\n- Began work to develop warhead energy release tailored to target environment and to develop directed blast energy release to enhance target damage.\n- Released enhanced version of Second-order Hydrodynamic Automatic Mesh Refinement Code (SHAMRC) (blast analysis tool) that included improved post-detonation modeling of non-ideal explosives using multiple fuel types.\n- Demonstrated ability to detonate hybrid enhanced blast explosives dynamically (in flight), and with simultaneous second internal detonation.\n- Developed a new polymer for use in explosive formulations.\n- Completed a study on defeat of Aluminum by non-kinetic means.  \n- Delivered optical taggant materials and testing kits.  \n- Completed synthesis and spectroscopic evaluations of 65 novel materials for explosive materials.\n- Improved computational methods for prediction of progressive collapse.\n- Completed blast through failing walls tests and developed new model for blast through failing walls in light structures.\n- Completed testing for near miss lethality for two inventory weapons.\n- Began validation of high fidelity models for air blast in complex tunnels.\n- Started development of models for blast and fragmentation through failing blast doors.\n- Delivered fast running threat and fragility models for equipment damage due to dynamic pressure in bunker rooms. \n- Completed annual cycle of requirements collection, challenge proposals, resource allocation, and technical support through High Performance Computing (HPC).\n- Submitted one DTRA Challenge Proposal for improved quality of service in time limit, allowed job size, and job throughput on DoD high performance computers.\n- Submitted a proposal to the Department of Defense (DoD) HPC Modernization Program (HPCMP) and for a large dedicated HPC cluster for DTRA’s Counter WMD Analysis Center.\n- Supported senior Combatant Command (COCOM), Interagency, and International table top exercises to address key national\/international strategies for reducing\/combating the WMD threat.\n- Developed generalized Equipment Fragility Model.\n- Developed Dynamic Pressure Model for bunkers. \n- Delivered an initial blast and fragment propagation through failing blast doors and multi-blast doors model for integration in Integrated Munitions Effects Assessment (IMEA)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.444"
                                            },
                                            "Text": {
                                                "val": "- Develop Blast Propagation Through Failed Walls Model.\n- Update Agent Release Model for container perforated translation\/collision.\n- Optimize Finite Element Flow Solver (FEFLO) for agent defeat calculations in complex tunnels.\n- Complete General Near Miss Lethality Model.\n- Perform annual cycle of requirements collection, challenge proposals, resource allocation, and technical support through HPC.\n- Enhance one HPC production code to better leverage capabilities of DoD high performance computers for improved modeling and simulation time to response.\n- Continue model development for blast and fragment propagation through failing blast doors and multi-blast doors.\n- Continue lab and scale testing for validation of high fidelity models for penetration mechanics through ultra-high strength materials.\n- Develop test data for steel columns for near contact detonations to feed global response models for agent defeat planning and consequence of execution estimation.\n- Continue global response testing and modeling for progressive collapse analyses for consequence of execution estimation. \n- Start a new project agreement with Singapore for testing and modeling of mega columns. \n- Complete a model for blast propagation through bunker walls for inventory weapons.\n- Conduct a large scale test of hybrid enhanced blast explosives and reactive cases for defeat of biological agents using simulants.\n- Scale up synthesis of novel explosives, prepare their metalized composites and conduct field tests.\n- Develop real-time reachback requirements and gap solutions through wide area search Table Top Exercise."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.787"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.787"
                                            },
                                            "Text": {
                                                "val": "- Continue development of Hybrid Enhanced Blast Explosives (HEBX); demonstrate ability to embed detonator system and disperse along with the fuel, to initiate cloud reaction as designed.\n- Conduct a large-scale test of hybrid enhanced blast explosives and reactive cases for defeat of biological agents using simulants.\n- Continue modeling and testing support to optimize and improve reactive case technology for use in Joint Multi-Effects Warhead System (JMEWS), Tube-launched, Optically-tracked, Wireless-guided (TOW) bunker buster, and Hellfire warheads.\n- Conduct field tests to support optimization and improve effectiveness of biocidal effect fuels used in explosive formulations, innovative common data methods supporting advanced WMD effects modeling, and simulation capabilities for consequence management. \n- Conduct lab and field tests of two new high explosive formulations for use in Conventional Prompt Global Strike (CPGS) warheads; one optimized for blast\/frag warheads, one optimized for high speed penetration warheads.\n- Continue to improve hydrocodes to provide high fidelity capability to model post-detonation energy release from non-ideal detonation and other new advanced energetics systems.\n- Integrate weapons effects model for blast propagation through bunker walls for inventory weapons into planning tools.\n- Develop weapons effects debris model from bunker walls subjected to internal detonations with inventory weapons.\n- Complete testing of response of dry-agent stimulant in container undergoing perforation, translation and collision from weapons induced loads.  Deliver new Agent Release Model.\n- Begin large-scale testing for validation of high fidelity models for penetration mechanics through ultra-high strength materials.\n- Complete testing and begin model development for response of massive columns to near-contract charges.\n- Conduct testing to validate high fidelity computational methods for predicting progressive collapse analysis of steel buildings.\n- Perform annual cycle of requirements collection, challenge proposals, resource allocation, and technical support through HPC.\n- Submit proposal(s) to the DoD HPCMP to fund dedicated HPC hardware to meet unique DTRA requirements.\n- Submit proposal(s) to the HPCMP to fund software development to meet unique DTRA requirements."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "30\/0603160BR"
                                    },
                                    "Title": {
                                        "val": "Proliferation, Prevention, and Defeat"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "21.514"
                                        },
                                        "CurrentYear": {
                                            "val": "29.420"
                                        },
                                        "BudgetYearOne": {
                                            "val": "29.346"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "29.346"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "31.404"
                                        },
                                        "BudgetYearThree": {
                                            "val": "31.012"
                                        },
                                        "BudgetYearFour": {
                                            "val": "31.231"
                                        },
                                        "BudgetYearFive": {
                                            "val": "33.152"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Scheduled tests completed.\nModels being developed, completed or integrated.\nProposals submitted.\nTime required to complete assessments.\nThe DTRA Experimentation Lab is occupied by planning or execution efforts 75% of the year."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "RR"
                    },
                    "ProjectTitle": {
                        "val": "Combating WMD Test and Evaluation"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "30.150"
                        },
                        "PriorYear": {
                            "val": "10.425"
                        },
                        "CurrentYear": {
                            "val": "12.659"
                        },
                        "BudgetYearOne": {
                            "val": "11.060"
                        },
                        "BudgetYearOneBase": {
                            "val": "11.060"
                        },
                        "BudgetYearTwo": {
                            "val": "11.182"
                        },
                        "BudgetYearThree": {
                            "val": "11.809"
                        },
                        "BudgetYearFour": {
                            "val": "12.091"
                        },
                        "BudgetYearFive": {
                            "val": "12.426"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "RR Project title change from Test Infrastructure starting in FY 2015"
                        },
                        "ProjectMissionDescription": {
                            "val": "The Test Infrastructure project provides a unique national test bed capability for simulated Weapons of Mass Destruction (WMD) facility characterization, weapon-target interaction, and WMD facility defeat testing to respond to operational needs by developing and maintaining test beds used by the Department of Defense (DoD), the Services, the Combatant Commanders, and other federal agencies to evaluate the implications of WMD, conventional, and other special weapon use against United States military or civilian systems and targets.  It leverages fifty years of testing expertise to investigate weapons effects and target response across the spectrum of hostile environments that could be created by proliferate nations or terrorist organizations with access to advanced conventional weapons or WMD (nuclear, biological and chemical).  The project maintains testing infrastructure to support the testing requirements of warfighters, other government agencies, and friendly foreign countries on a cost reimbursable basis.  It creates testing strategies and a WMD Test Bed infrastructure focusing on the structural response of buildings and Hard & Deeply Buried Targets that house nuclear, biological, and chemical facilities.  It provides support for full and sub-scale tests that focus on weapon-target interaction with fixed soft and hardened facilities to include above ground facilities, cut-and-cover facilities, and deep underground tunnels.  This capability does not exist anywhere else within the DoD and supports the counterproliferation pillar of the National Strategy to Combat WMD.\n\nThe increase from FY 2013 to FY 2014 is predominately due to the net impact of Congressional reductions in FY 2013 and the realignment of test bed facilities from RT-Target Assessment Technologies in Program Element (PE) 0603160BR to RR-Test Infrastructure in PE 0602718BR to better reflect the nature of those activities.  The decrease from FY 2014 to FY 2015 is predominately due to decreased investment in test technology."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RR:  Combating WMD Test and Evaluation"
                                    },
                                    "Description": {
                                        "val": "Project RR provides a unique national test bed capability for simulated WMD facility characterization, weapon-target interaction, and WMD facility defeat testing to respond to operational needs by developing and maintaining test beds used by the DoD, the Services, the Combatant Commanders and other federal agencies to evaluate the implications of WMD, conventional, and other special weapon use against U.S. military or civilian systems and targets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.425"
                                            },
                                            "Text": {
                                                "val": "- Continued Integrated Technology Demonstration (ITD) at Nevada National Security Site (NNSS) to defeat credible and threat-based scenarios; used demonstration data to transition into several related projects\/planned events through FY 2017.\n- Continued technical and test development and demonstration of Transatlantic Collaboration Biological Resiliency Demo (TACBRD), a Department of Defense (DoD) capability to shape interagency approach to counter a wide area biological event impacting U.S. and partner nations’ key civilian\/military infrastructure.\n- Completed initial phase of testing in support of “Speed of Sound” nuclear forensic program.\n- Maintained existing test infrastructure in current configuration to support revitalized Weapons Effects Phenomenology Program supporting DTRA test programs; made improvements through funding provided by external program managers.\n- Improved existing test infrastructure and test articles or constructed new test articles to support DTRA Detection Technology Program through funding provided by external program managers.  Internal customer funding constructed two test beds for Weapons Effects Phenomenology testing; and USAF funding refurbished existing Capitol Peak Tunnel Complex and constructed additional phenomenology test beds for Massive Ordnance Penetrator (MOP) test program at SHIST, Alt SHIST, and Chestnut test beds.\n- Completed Source Physics Experiment (SPE) 3 and continued SPE 4 testing in support of Treaty Verification Technologies Program and Source Physics Experiments to support Comprehensive Test Ban Treaty Initiatives, New START Warhead Verification, and detection and verification of Biological and Chemical Weapons.\n- Continued support of WMD sensor testing at the Technical Evaluation Assessment and Monitor Site (TEAMS) to detect and prevent nuclear grade material from entering the U.S., U.S. territories, and Allied Nations through air, rail, ship, and ship ports.\n- Completed Interagency Biological Restoration Demonstration (IBRD) testing in conjunction with DoD and the Department of Homeland Security (DHS) to reduce the time and resources necessary to recover and restore wide urban areas, military installations, and critical infrastructure, following a biological incident.\n- Continued testing Chemical, Biological, Radiological, Nuclear, and High-yield Explosives (CBRNE) sensors, WMD countermeasures, remote geological sensing, and battle management systems designed for surveillance and tracking targets used for WMD activities.\n- Continued support of inter-agency and inter-department nuclear detection and forensics testing to prevent weapons grade material\/dirty bombs from entering the U.S., U.S. territories, and Allied Nations.  \n- Continued environmental remediation and compliance activities at the NNSS, White Sands Missile Range (WSMR), and Kirtland Air Force Base (KAFB) in accordance with Environmental Protection Agency (EPA) safety, and environmental guidelines.  \n- Completed Environmental remediation efforts at Dugway Proving Grounds, UT .   \n- Completed demolition of Component Test Structure 1 (CTS-1) and Large Test Structure 2 (LTS-2).\n- Maintained current inventory of infrastructure and instrumentation, extending life-cycle of these items as long as possible to ensure test beds meet customers’ advanced technology testing needs.\n- Continued to document, prioritize, and support test infrastructure requirements.\n- Turned over primary responsibility for day-to-day management of the Large Blast Thermal Simulator to WSMR.\n- Continued to support the development of portable forensic assessment capabilities for the OCONUS environment.\n- Completed the development of a suitable range on the NNSS and the first four phases of research in accelerator based detection systems.\n- Started evaluation and development of new test bed at NNSS to address emerging threats.  Continued development, construction, and transition to specific scenarios planned through FY 2020."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.659"
                                            },
                                            "Text": {
                                                "val": "- Continue Combating WMD (CWMD) testing\/demonstration at NNSS to defeat credible and threat-based scenarios; continue with transition into several related projects\/planned events through FY 2017.\n- Begin CWMD testing at WSMR prioritizing requirements to support reduced architectural and engineering design efforts and construction of future CWMD test beds.\n- Support development and demonstration of TransAtlantic Collaboration Biological Resiliency Demo (TACBRD), a DoD capability to shape interagency approach to counter a wide area biological event impacting U.S. and partner nations’ key civilian\/military infrastructure.\n- Continue research of Biological Re-aerosolization in conjunction with DoD\/DHS\/EPA to help develop precise measurement technologies for residual biological pathogens reentering air after settling.\n- Continue intergovernmental Biological Agent Defeat test program between DTRA and Defence Research and Development Canada.\n- Continue testing in support of “Speed of Sound” nuclear forensic program estimated to continue through FY 2015.\n- Maintain existing test infrastructure in current configuration to support revitalized Weapons Effects Phenomenology Program supporting DTRA test programs. Improve existing test infrastructure and test articles. \n- Conduct testing in support of Treaty Verification Technology Program and Source Physics Experiment (SPE) to support Comprehensive Test Ban Treaty (CTBT) Initiatives, New START Warhead Verification, and detection and verification of Biological and Chemical Weapons.\n- Continue support of WMD sensor testing at the Technical Evaluation Assessment and Monitor Site (TEAMS) to detect and prevent nuclear grade material from entering the U.S., U.S. territories, and Allied Nations through air, rail, and ship ports.\n- Continue testing CBRNE sensors, WMD countermeasures, remote geological sensing, and battle management systems designed for surveillance and tracking targets used for WMD activities.\n- Continue nuclear detection and forensics testing to prevent weapons grade material\/dirty bombs from entering the U.S., U.S. territories, and Allied Nations.\n- Continue environmental remediation and compliance activities at the NNSS, DPG, WSMR, and KAFB in accordance with EPA, Safety, and Environmental guidelines.  Defer major demolition and restoration efforts of major test articles while ensuring they are safely closed and sealed at minimal acceptable standards.\n- Maintain current inventory of infrastructure and instrumentation, extending life-cycle of these items as long as possible to ensure test beds meet customers’ advanced technology testing needs.\n- Document, prioritize, and support test infrastructure requirements.\n- Evaluate and determine courses of action for current usefulness of remaining existing nuclear simulators within management control of Test Support Division."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.060"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.060"
                                            },
                                            "Text": {
                                                "val": "- Continue CWMD testing\/demonstration at NNSS to defeat credible and threat-based scenarios; continue with transition into several related projects\/planned events through FY 2017.\n- Begin CWMD testing at WSMR prioritizing requirements to support reduced architectural and engineering design efforts and construction of future CWMD test beds.\n- Continue technical and testing development and demonstration of TransAtlantic Collaboration Biological Resiliency Demo (TACBRD), a DoD capability to shape interagency approach to counter a wide area biological event impacting U.S. and partner nations’ key civilian\/military infrastructure.\n- Continue testing in support of “Speed of Sound” nuclear forensic program estimated to continue through FY 2015.\n- Maintain existing test infrastructure in current configuration to support revitalized Weapons Effects Phenomenology Program supporting DTRA test programs; make improvements through funding provided by external program managers.\n- Continue testing in support of Treaty Verification Technology Program and Source Physics Experiment (SPE) to support Comprehensive Test Ban Treaty (CTBT) Initiatives, New START Warhead Verification, and detection and verification of Biological and Chemical Weapons.\n- Continue support of WMD sensor testing at the TEAMS to detect and prevent nuclear grade material from entering the U.S., U.S. territories, and Allied Nations through air, rail, and ship ports.\n- Continue testing CBRNE sensors, WMD countermeasures, remote geological sensing, and battle management systems designed for surveillance and tracking targets used for WMD activities.\n- Continue nuclear detection and forensics testing to prevent weapons grade material\/dirty bombs from entering the U.S., U.S. territories, and Allied Nations. \n- Continue environmental remediation and compliance activities at the NNSS, WSMR, and KAFB in accordance with EPA, Safety, and Environmental guidelines.  Defer major demolition and restoration efforts of major test articles while ensuring they are safely closed and sealed at minimal acceptable standards.\n- Maintain current inventory of infrastructure and instrumentation, extending life-cycle of these items as long as possible to ensure test beds meet customers’ advanced technology testing needs.\n- Document, prioritize, and support test infrastructure requirements."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "30\/0603160BR"
                                    },
                                    "Title": {
                                        "val": "Proliferation, Prevention, and Defeat"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.020"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Government and industrial performers are assessed and selected based upon a “best fit for task” criteria.  DoD Service Laboratories, Department of Energy (DOE) National Laboratories, and specialized university laboratories are common government awardees."
                        },
                        "PerformanceMetrics": {
                            "val": "Number of tests executed safely, i.e., no loss of life or limb, no unintentional significant damage of property.\nFY 2012 – No safety issues\/incidents during scheduled test events.\nFY 2013 – No safety issues\/incidents during scheduled test events.\nNumber of tests that are evaluated through the milestone review process.\n100% of all tests completed in accordance with scheduled milestones.\nNumber of tests that undergo environmental assessment consistent with existing Environmental Impact Statements.\nAll test executed undergo environmental review consistent with existing Environmental Impact Statements.\nFY 2013 - 89 Tests Completed\nFY 2014 - 76-90 Tests (projected)"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "RU"
                    },
                    "ProjectTitle": {
                        "val": "Fundamental Research for Combating WMD"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "16.892"
                        },
                        "PriorYear": {
                            "val": "3.499"
                        },
                        "CurrentYear": {
                            "val": "0.516"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Fundamental Research for Combating Weapons of Mass Destruction (CWMD) project conducts technology reviews of the Defense Threat Reduction Agency (DTRA) Basic Research Program to identify promising emerging science with potential to be matured into Counter Weapons of Mass Destruction technologies.  The advancement of technology and science into applied technology development efforts focus upon increasing the stability and utility of mid-to-long term, moderate risk but high payoff science, and emerging technologies for transition to other DTRA applied technology programs.  This effort serves as the bridge between the bench scientist and the applied technologist.\n\nThe decrease from FY 2013 to FY 2014 is predominately due to decreased investment in University Strategic Partnership (USP) activities.  The decrease from FY 2014 to FY 2015 is predominately due to the completion of University Strategic Partnership activities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RU: Fundamental Research for Combating WMD"
                                    },
                                    "Description": {
                                        "val": "Project RU (Fundamental Research for Combating WMD) provides (1) strategic studies to support DoD, (2) decision support tools and analysis to support combating WMD research and development investments, and (3) early applied research for technology development."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.499"
                                            },
                                            "Text": {
                                                "val": "- Closed out the current University Strategic Partnership (USP) contract after 10 years of activities.\n- Closed out the remainder of the eleven active research projects.\n- Awarded five one year technology transition grants\/contracts in nuclear detector technology, physical network protection from WMD, and high energy density material development."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.516"
                                            },
                                            "Text": {
                                                "val": "- Provide technical and programmatic support to DTRA’s basic research program."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "1\/0601000BR"
                                    },
                                    "Title": {
                                        "val": "DTRA Basic Research Initiative"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "40.818"
                                        },
                                        "CurrentYear": {
                                            "val": "45.837"
                                        },
                                        "BudgetYearOne": {
                                            "val": "37.778"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "37.778"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "38.436"
                                        },
                                        "BudgetYearThree": {
                                            "val": "39.119"
                                        },
                                        "BudgetYearFour": {
                                            "val": "39.824"
                                        },
                                        "BudgetYearFive": {
                                            "val": "40.500"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Government and Industrial performers are assessed and selected based upon a \"best fit for task\" criteria.  DoD Service Laboratories and Department of Energy (DOE) National Laboratories are common government awardees."
                        },
                        "PerformanceMetrics": {
                            "val": "Project performance is measured via a combination of statistics including the number of publications generated, number of students trained in sciences and engineering supporting DoD’s educational goals, number of research organizations participating, and percentage of participating universities on the US News & World Report “Best Colleges” list.\nPublication of an annual basic research technical and external programmatic review report.\nEach study\/project will commence within 3 months of customer request and results delivered within 3 months of completion."
                        }
                    }
                }
            ]
        }
    }
}