{
    "id": "05813a14ab6839f5f0821769d0228b15c428b302",
    "meta": {
        "filename": "dod-2015_RDTE_2015_ARMY_BA4_RDTE_JustificationBook_Army_PB_2015.zzz_unzipped_RDTE_JustificationBook_Army_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603807A"
        },
        "ProgramElementTitle": {
            "val": "Medical Systems - Adv Dev"
        },
        "R1LineNumber": {
            "val": "69"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "22.514"
            },
            "CurrentYear": {
                "val": "15.594"
            },
            "BudgetYearOne": {
                "val": "23.659"
            },
            "BudgetYearOneBase": {
                "val": "23.659"
            },
            "BudgetYearTwo": {
                "val": "32.295"
            },
            "BudgetYearThree": {
                "val": "32.270"
            },
            "BudgetYearFour": {
                "val": "28.219"
            },
            "BudgetYearFive": {
                "val": "28.373"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "FY15 reduction attributed to realignment to oher higher priority Army programs."
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) funds development of medical materiel within the early system integration portion of the System Development and Demonstration phase of the acquisition life cycle using 6.4 funding.  Program efforts support transition of promising Science and Technology candidate medical technologies (drugs, vaccines, medical devices, diagnostics, and mechanisms for detection and control of disease carrying insects) to larger scale testing in humans for safety and effectiveness.  Programs are aligned to meet future force requirements identified within concept documents and organizational structures.  This Program Element also provides funding for Food and Drug Administration (FDA) regulated human clinical trials to gain additional information about safety and effectiveness on the path to licensure for use in humans.  The Projects supported by this PE are: \n\n(PROJ 808) funds development of candidate medical countermeasures for infectious diseases of military relevance. Efforts include vaccines, drugs, diagnostic kits\/devices, and insect control measures.  These funds support human clinical efficacy trials of the drug\/vaccine in a larger group that are designed to assess performance and to continue safety assessments in a larger group of volunteers. Products from this project will transition to 849.\n\n(PROJ 811) funds the development of military relevant human immunodeficiency virus (HIV) medical countermeasures.  It provides funding for planning and conducting of human clinical trials in a group of healthy volunteers to assess the drug\/vaccine for safety, tolerability, how the drug\/vaccine is distributed, metabolized, and excreted from the body, and investigate the appropriate dose for therapeutic use.  Products from this project will transition to Project 812.\n\n(PROJ 836) funds the demonstration and validation of medical products for enhanced combat casualty care and follow-on care, including rehabilitation.  This project also funds the human clinical trials that test the safety and effectiveness of biologics, devices and demonstration.  Clinical trials are conducted in accordance with U.S. Food and Drug Administration (FDA) regulations.  Products from this project will transition to 832. \n\n(PROJ VS7) funds program upgrades, retrofits, trains, and sustains the fleet of Medical Evacuation legacy helicopters that continue to play a major role in Iraq and Afghanistan. The approved force design increased the number of air frames in the force from 12 to 15 aircraft for 37 MEDEVAC companies.  Products from this project will transition to VS8.\n\nThis program is managed by U.S. Army Medical Materiel Development Activity (USAMMDA) and U.S. Army Medical Materiel Agency (USAMMA)  of the US Army Medical Research and Materiel Command."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "24.384"
                },
                "CurrentYear": {
                    "val": "15.603"
                },
                "BudgetYearOne": {
                    "val": "30.796"
                },
                "BudgetYearOneBase": {
                    "val": "30.796"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "22.514"
                },
                "CurrentYear": {
                    "val": "15.594"
                },
                "BudgetYearOne": {
                    "val": "23.659"
                },
                "BudgetYearOneBase": {
                    "val": "23.659"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.870"
                },
                "CurrentYear": {
                    "val": "-0.009"
                },
                "BudgetYearOne": {
                    "val": "-7.137"
                },
                "BudgetYearOneBase": {
                    "val": "-7.137"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.044"
                    },
                    "CurrentYear": {
                        "val": "-0.009"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.700"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.489"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-7.137"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-7.137"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-2.037"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "808"
                    },
                    "ProjectTitle": {
                        "val": "DoD Drug & Vacc Ad"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "8.956"
                        },
                        "CurrentYear": {
                            "val": "6.888"
                        },
                        "BudgetYearOne": {
                            "val": "8.970"
                        },
                        "BudgetYearOneBase": {
                            "val": "8.970"
                        },
                        "BudgetYearTwo": {
                            "val": "17.138"
                        },
                        "BudgetYearThree": {
                            "val": "15.825"
                        },
                        "BudgetYearFour": {
                            "val": "14.282"
                        },
                        "BudgetYearFive": {
                            "val": "14.585"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project funds development of candidate medical countermeasures for infectious diseases of military relevance.  These efforts are in: vaccines, drugs, diagnostic kits\/devices, and determining if insects are infected with pathogenic organisms capable of infecting service members\/preventive medicine measures.  These funds support human clinical effectiveness (capacity to produce a desired size of an effect under ideal or optimal conditions) trials of the drug\/vaccine in larger groups that are designed to assess how well the drug\/vaccine works, and to continue safety assessments in a larger group of volunteers.  Funding supports both technical evaluations and human clinical testing to assure the safety and effectiveness of medical diagnostic kits and devices.  This work, which is performed in military laboratories or civilian pharmaceutical firms, is directed toward the prevention of disease, early diagnosis, and speeding recovery once diagnosed; to enhance battlefield readiness.  All clinical trials are conducted in accordance with U.S. Food and Drug Administration (FDA) regulations, a mandatory obligation for all military products placed into the hands of medical providers or service members.  Product development priorities are determined based upon four major factors: (1) the extent and threat of the disease within the Combatant Commands theater of operations, (2) the clinical severity of the disease, (3) the technical maturity of the proposed solution, and (4) the affordability of the solution (development and production)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "DoD Drug and Vaccine Advanced Development"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort in the development of candidate medical countermeasures for military relevant infectious disease."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.956"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "New Standard Military Insect Repellant: Testing for this product transitioned to advanced development in FY 2011, and funded with Defense Health Program Budget Activity 7 funding as the potential candidates are all commercially available.  Topical Antileishmanial Cream: Reviewed evaluations, and data from the Phase 2 safety\/effectiveness clinical trials completed in FY12 for the Topical Antileishmanial Cream; completed preparation for Phase 3 Pivotal clinical trials.  Dengue Tetravalent Vaccine: Finalized analysis and evaluation of Phase 2 effectiveness and safety data for the vaccine candidate for Dengue with industry partner Sanofi Pasteur. Continued global phase 3 clinical study in 10 countries with 30,000+ enrollees.  Joint Biological Agent identification and Diagnostic System (JBAIDS): Transitioned Joint Biological Agent identification and Diagnostic System (JBAIDS) assay planned to advanced development and begin developmental testing.  Leishmania Rapid Diagnostic Device (LRDD): Completed final process validation for Leishmania Rapid Diagnostic Device (LRDD).  Antimalarial Drug, Artesunate Intravenous: Completed FDA approval and transition to Project 849 (Drugs and Vaccines - 6.5) for Antimalarial Drug, Artesunate Intravenous."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.888"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Topical Antileishmanial Cream: Complete site development efforts for Phase 3 New World pivotal safety and effectiveness clinical trial on a diverse population.  Dengue Tetravalent Vaccine: Continue volunteer follow up and subsequent analysis of data from pivotal Phase 3  (safety and effectiveness in 10 countries, over 30000 volunteers) endemic region studies of Dengue Tetravalent Vaccine with commercial partner Sanofi Pasteur, provide Go\/No Go decision for pursuit of compressed vaccination schedule for US traveler\/military indication.  Joint Biological Agent identification and Diagnostic System (JBAIDS): Completed Analysis of Alternatives (AoA) and requirements analysis helped to determine that The Dengue JBAIDS capability does not meet user needs; therefore, the project has been terminated.  Leishmania Rapid Diagnostic Device (LRDD): Transition LRDD to Project 849 (Drugs and Vaccines - 6.5) after completion of the analytical testing and Good Manufacturing Practices manufacturing reviews.  Preventive Medicine Products: These products for the control\/mitigation of arthropod (insect) borne diseases field testing and evaluation will be delayed for several product candidates to include: field deployable detection devices for Chikungunya, Rift Valley Fever, Sand Fly Fever, Crimean-Congo Fever, advanced arthropod collection devices, Saliva Capture RTA card, spatial repellents, and advanced pesticides.  Infectious Disease Diagnostic: These products field testing and evaluation will be delayed for several product candidates to include: Scrub Typhus, Rickettsiae, and Sand Fly Fever based on decrement due to poor disbursements in FY2012."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.970"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.970"
                                            },
                                            "Text": {
                                                "val": "Topical Antileishmanial Cream is expected to transition in FY14 to Project 849 (Drugs and Vaccines - 6.5) after completion of the site development efforts for Phase 3 New World clinical trial. Expanded Access Treatment Program will continue until FDA approved product is available.  Will continue to compile existing documentation from previous clinical and non-clinical studies in FDA format necessary for supplemental New Drug Application (sNDA) for prophylaxis while Glaxo-Smith Kline decision to file a supplemental New Drug Application (sNDA) for prophylaxis is pending.  Dengue Tetravalent Vaccine transitioned in FY14 to Project 849 after completion of volunteer follow up and data analysis on pivotal Phase 3 safety and effectiveness clinical trials.  Preventive Medicine Products: These products for the control\/mitigation of arthropod (insect) borne diseases field testing and evaluation will transition into Advanced Development for several product candidates to begin process validation: field deployable detection devices for Chikungunya, Rift Valley Fever, Sand Fly Fever, Crimean-Congo Fever, advanced arthropod collection devices, Saliva Capture RTA card, spatial repellents, and advanced pesticides.  Infectious Disease Diagnostic: Will begin assays process validation of enteric point-of-care disease diagnostic assays.  Dengue Vaccine Block II: Will transition from Military Infectious Diseases S&T funding and prepare for Phase 2 safety and efficacy trial (24 to 300 subjects) of vaccine candidate in an adult\/military population.  Treatment for Resistant Wound Infections: Will transition from Military Infectious Diseases S&T funding and prepare for Phase 2 safety and efficacy trial (24 to 300 subjects) of drug candidate for the Treatment for Resistant Wound Infections."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Test and evaluate in-house and commercially developed products in extensive government-managed clinical trials to gather data required for FDA licensure and Environmental Protection Agency registration."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Medical Product Development Management Services Cost"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not Applicable"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Not applicable"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "13.532"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.919"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.939"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.965"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.965"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Medical Product Development Management Services Cost"
                                                },
                                                "FundingVehicle": {
                                                    "val": "PO"
                                                },
                                                "PerformingActivity": {
                                                    "val": "General Dynamics Information Technology, Frederick MD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Frederick MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.365"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.365"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.365"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Medical Product Development Cost"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not applicable"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Not applicable"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "20.778"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.049"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.066"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.374"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.374"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development of Malaria Prophylaxis"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Walter Reed Army Institute of Research"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Silver Spring, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.000"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development of Malaria Prophylaxis"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Allot"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Armed Forces Research Institute of Medical Sciences"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Cambodia"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.111"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.111"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development of Malaria Prophylaxis"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Allot"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.010"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.010"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.010"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Medical Product Development Support Cost"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not Applicable"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Not applicable"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "7.816"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.388"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.448"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.097"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.097"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Medical Product Development T&E Cost"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not applicable"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Not applicable"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "44.118"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.600"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.324"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.160"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.160"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Malaria Prophylaxis clinical trial"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.999"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.999"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.999"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Topical Antileishmanial Cream Phase Expanded Access Treatment Program"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Malaria Prophylaxis Clinical Trials Safety and Effectiveness Clinical Trials"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2010"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Infectious Disease Diagnostics Assays Validation of  point-of-care"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Dengue Vaccine Block II Phase 2 safety and efficacy trial preparation\/perform"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Arthropod Control \/ Surveillance Process Validation"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Treatment for Resistant Wound Infections Phase 2 safety and efficacy trial"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "811"
                    },
                    "ProjectTitle": {
                        "val": "Mil HIV Vac&Drug Dev"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.052"
                        },
                        "CurrentYear": {
                            "val": "0.550"
                        },
                        "BudgetYearOne": {
                            "val": "1.078"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.078"
                        },
                        "BudgetYearTwo": {
                            "val": "0.972"
                        },
                        "BudgetYearThree": {
                            "val": "0.846"
                        },
                        "BudgetYearFour": {
                            "val": "1.009"
                        },
                        "BudgetYearFive": {
                            "val": "1.031"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project funds development of militarily relevant human immunodeficiency virus (HIV) medical countermeasures.  It provides funding for the planning and conducting of human clinical trials in a group of healthy volunteers to assess the drug\/vaccine for safety, tolerability, how the drug\/vaccine is distributed, metabolized, and excreted from the body, and to investigate the appropriate dose for therapeutic use.  Development efforts are focused on militarily unique needs effecting manning, mobilization, and deployment. \n \nThe major contractor is Henry M. Jackson Foundation for the Advancement of Military Medicine, Rockville, MD.  Research efforts are coordinated with the National Institutes of Health."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Military HIV Vaccine & Drug Development"
                                    },
                                    "Description": {
                                        "val": "This project funds advanced development research to develop candidate HIV vaccines, assess their safety and effectiveness in evaluations with human subjects, and protect military personnel from risks associated with HIV infection."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.052"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed three inter-related previous clinical trials aimed at refining our understanding of immune responses elicited by the increment 1 HIV vaccine strategy.  Analyzed laboratory interrogation of samples from trial participants."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.550"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue the three inter-related clinical trials (RV305, RV306, RV328) aimed at refining our understanding of immune responses elicited by the increment 1 HIV regional vaccine strategy.  Analyze laboratory interrogation of samples from trial participants.  Refine vaccine administration schedule as well as clinical trial design based on data from clinical trials.  Safety and effectiveness clinical trial RV305, examine the immune responses to secondary boost of increment 1 HIV regional vaccine.  Safety and effectiveness clinical trial RV306, examine the intensive immune monitoring of Prime-Boost Vaccine.  Safety and effectiveness clinical trial RV328, conduct intensive immune monitoring of AIDSVAXB\/E Regional Vaccine with a large well controlled trial to test immunity of improved vaccine Boost Prime\/Boost Regional study to confirm safety and effectiveness in a diverse population.  Adjust plan for Regional well-controlled clinical trial large enough to demonstrate vaccine effectiveness to initiate in FY14."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.078"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.078"
                                            },
                                            "Text": {
                                                "val": "Will begin analysis of samples from safety and effectiveness clinical trial RV305 including extensive evaluation of binding antibodies based on previously determined correlates of protection. In addition, novel findings in cellular immune responses in the stomach have driven new requirements for evaluation of cytotoxic T cell responses in the peripheral blood.  During FY15 collection of late invasive samples for safety and effectiveness clinical trials RV306 and RV328 will be completed; those samples have a requirement for immediate processing and analysis.  During FY15 RV306 and 328 should conclude, with closing costs associated with the 5 clinical trial sites associated with those protocols.  Additional funding for analysis of safety and immunogenicity data by EMMES Corporation will be required. In addition, there will be costs in FY15 from analysis of new lots of the gp120 to be used in efficacy trials currently approved for FY16-17 . We anticipate these costs to be a) analysis of new immunogens in antigenicity assays; b) preclinical animal studies; c) safety and tox; d) bridging study against gp120 AIDSVAX B\/E. In addition further support of stability of AIDSVAX will be required."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Test and evaluate commercially developed drug\/vaccine candidates in government-managed trials."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "Remarks": {
                                        "val": "Not Applicable"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Medical Product Development Management Services Cost"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not Applicable"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Not Applicable"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.497"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.456"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.165"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.146"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.146"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Medical Product Development Cost"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not applicable"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Not applicable"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.618"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.574"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.115"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.550"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.550"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "Remarks": {
                                        "val": "Not Applicable"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Medical Product Development Support Cost"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.937"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.534"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.101"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.250"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.250"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.822"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Remarks": {
                                        "val": "Not Applicable"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Medical Product Development T&E Cost"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not applicable"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Not Applicable"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "15.119"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.488"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.169"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.132"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.132"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "15.908"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "RV305 Immune Responses to Secondary Boost of Regional Vaccine"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RV306 Intensive Immune Monitoring of Prime-Boost Vaccine"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RV328 Intensive Immune Monitoring of AIDSVAXB\/E alone"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Regional Vaccine  Large Well Controlled Large Trial to Test Immunity of Vaccine"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Prime\/Boost Regional Study to Confirm Safety and Effectiveness in a Diverse Pop."
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "836"
                    },
                    "ProjectTitle": {
                        "val": "Field Medical Systems Advanced Development"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "11.102"
                        },
                        "CurrentYear": {
                            "val": "7.595"
                        },
                        "BudgetYearOne": {
                            "val": "13.332"
                        },
                        "BudgetYearOneBase": {
                            "val": "13.332"
                        },
                        "BudgetYearTwo": {
                            "val": "14.185"
                        },
                        "BudgetYearThree": {
                            "val": "15.599"
                        },
                        "BudgetYearFour": {
                            "val": "12.928"
                        },
                        "BudgetYearFive": {
                            "val": "12.757"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this PE."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project funds the demonstration and validation of medical products for enhanced combat casualty care and follow-on care, including rehabilitation.  This project funds human clinical trials to test the safety and effectiveness of biologics (products derived from living organisms) and devices necessary to meet medical requirements.  When available, commercial-off-the-shelf (COTS) medical products are also tested and evaluated for transition to engineering and manufacturing development.  Consideration is also given to reducing the medical logistics footprint through smaller weight, volume, and equipment independence from supporting materials.  All clinical trials are conducted in accordance with U.S. Food and Drug Administration (FDA) regulations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Field Medical Systems Advanced Development - PM Medical Devices"
                                    },
                                    "Description": {
                                        "val": "Advanced Concept Development funding is provided for the following development of medical devices in support of enhanced combat casualty care."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.944"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Total Intravenus Anesthesia (TIVA): This product transitioned to Tech Watch in FY 2012 and is not scheduled for further development in FY 2013.  Auto Critical Care System (ACCLS): program cancelled as it is no longer a viable product.  Urinary Facilitation Device: no further R&D funding required as this is now a commercial product.  PEAK Plasmablade: no further R&D funding required as this is now a commercial product. Hydrosurgery System: no further R&D funding required as this is now a commercial product.  Non-invasive Multi-Analyze Monitor: submission cancelled because the Small Business innovation Research (SBIR) Product failed to meet future need\/requirement.  Eye Tracking System for Assessing Concussions (system is a traumatic brain injury diagnostic tool): IPT for Smooth Pursuit Eye Tracking re-baseline plan in January 2012 for next steps to reach MSB in FY 2013-FY 2014.  Fibrinogen Bandages: Phase I clinical trial to began in FY 2013.  No further funding is planned after current contract.  Product is a biologic and is transitioning back to S&T.  Cardiopulmonary Enhancement: currently there no device requirement identified. Bandits Banyan Biomarkers (now called TBI Diagnostic Assay System _ Increment II and Increment III Handheld): enrollment for clinical trials continued and identified a handheld platform for independent testing in June 2012.  Milestone B review scheduled."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.519"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Eye Tracking System for Assessing Concussions (system is a traumatic brain injury diagnostic tool): Re-baseline, as a Request for Information (RFI) was submitted in FY12 to reevaluate the most current devices and no Research Development Test Evaluation (RDTE) funds will be needed in FY14.  TBI Diagnostic Assay System Increment II Point of Care Device enter pivotal clinical trial for safety and effectiveness and transition to engineering and manufacturing funding in project 832.  Increment III of the TBI Diagnostic Assay System will be delayed and will not reach milestone B (proof of concept) in FY14 based on the maturity of the technology.  Impedance Threshold Device for the Treatment of TBI: Current device has a 510(k) (Premarket Notification) clearance for multiple indications.  Submission of a new 510(k) to cover the expanded indications for the currently fielded device.  Device will no longer be a stand-alone product, because the capability will be incorporated in existing ventilators.  Plan to transition Hydration Status Monitor (HSM) from project MM3 6.3 funding to prepare for milestone B (proof of concept) and down-select.  The HSM product will accurately detect the hydration status of Soldiers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.798"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.798"
                                            },
                                            "Text": {
                                                "val": "Eye Tracking System for Assessing Concussions: Noninvasive neurodiagnostic technologies for TBI is multi-focused.  The Eye Tracking System for Assessing Concussions (system is a traumatic brain injury diagnostic tool) is one of multiple systems to be evaluated.  Efforts to collate all non-invasive technologies into one integrated IPT is currently in place.  The 3 technologies currently involved are the Eye- Tracking System, the QEEG and Balance Platforms.  Future components of the multi-focused approach will fall under the scope of this line item.  No Research Development Test Evaluation (RDTE) funds are needed for FY15.  This project line is being programmed in FY16-20 plan under non-invasive nuerodiagnostic line item.  TBI Diagnostic Assay System: This effort has seen a dramatic realignment of effort and scope away from Banyan Technologies to Abbott Labs.  The focus of this effort will be to use the current Biomarker technology developed by Banyan and cross-level all known technologies to Abbott Diagnostics.  Contracting efforts will be developed to facilitate this path forward.  Once contracting efforts are completed, a path forward will be developed.  Impedance Threshold Device for the Treatment of TBI: Current device has a 510(k) (Premarket Notification) clearance for multiple indications.  Will continue the submission of a new 510(k) is planned to cover the expanded indications for the currently fielded device.  Device will no longer be a stand-alone product, because the capability will be incorporated in existing ventilators.  Hydration Status Monitor (HSM) transition was delayed until FY15.  Milestone B for this effort is scheduled for Feb 2015.   Contract is planned to be a 4 year effort to develop the actual device and gain FDA approval for use.  Compartment Syndrome Pressure Device: Will transition from project 840 6.3 funding and enroll patients in the pivotal trial for FDA clearance for anticipated FY15 start of the clinical trial."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Field Medical Systems Advanced Development - PM Pharmaceuticals"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for advanced concept development of biologic medical products managed by PM Pharmaceuticals."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.486"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Blood Pathogen Reduction\/Inactivation transitioned to advanced development in FY 2012, transitioning from Army to be funded with Defense Health Program RDT&E funding.  Freeze-dried Plasma: Transitioned to Freeze-dried Plasma program to maintain current schedule and avoid delays. Conducted Milestone B decision reviews for both Cryopreserved Platelets and Freeze-Dried Plasma Programs (new high priority from DoD leadership) and transition to Project 832.  Accelerated fielding of a FDA-approved Freeze-Dried Plasma was validated in the June 2011 Army Surgeon General's Report by the Blast Injury Task Force.  Freeze-Dried Plasma program: completed Phase 2 clinical trial of safety and effectiveness through a Cooperative Agreement with industry partner.  Cryopreserved Platelets: Conducted Milestone B decision reviews for both Cryopreserved Platelets and Freeze-Dried Plasma Programs (new high priority from DoD leadership) and transition to Project 832.  Cryopreserved Platelets: start Phase 2 safety\/effectiveness clinical trial in cancer patients with platelet deficiency."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Field Medical Systems Advanced Development - PM Medical Support Systems"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort in the development of products that support the medical mission in combat casualty care and health care operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.672"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "PM Heavy Brigade Combat Team (HBCT): Prepared and completed testing of the Treatment Table and Blood Refrigerator prototypes for PM Heavy Brigade Combat Team (HBCT).  Product transitioned to Project 832 .  Transitioned advanced cold chain technologies, trauma tiered medical bag, hoist aeromedical evacuation litter, and quad fold litter to Project 832 and continued development.  ISO Panel: Transitioned ISO panel development and Force Provider soft walled module components to Project 832 to finalize development.  Environmental Sentinel Biomonitor: Developed prototype for Environmental Sentinel Biomonitor, which transitioned from Science & Technology.  Insecticide impregnated bed net: Applied funding from terminated project Shock and Vibration Litter System to this SBIR Phase II product. Acquired data for EPA approval.   PEO Combat Support \/Combat Service Support: Collaborated with PEO Combat Support\/Combat Service Support on development efforts for emerging medical vehicle evacuation variants."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.076"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Environmental Sentinel Biomonitor: Continue development of the Environmental Sentinel Biomonitor (ESB) and transition to project 832.  The ESB will assist preventive medicine personnel certify water capabilities by providing a presumptive screening capability that can rapidly identify toxicity in water.  PEO Combat Support \/Combat Service Support: Continue collaboration with Program Executive Office Combat Support\/Combat Service Support (PEO CS&CSS) and Program Executive Office Ground Combat Systems (PEO GCS) on development efforts for emerging medical vehicle evacuation\/casualty evacuation (CASEVAC) variants.  Medical variants that will be collaborated on with PEO CS\/CSS consist of medical shelters, Mine Resistant Ambush Protected (MRAP), Armored Multipurpose Vehicle (AMPV), and Joint Light Tactical Vehicle (JLTV).  Collaborate with PEO GCS on medical variants for the Heavy Brigade Combat Team (HBCT).  Improved Vector Tent Traps: Develop prototypes of Vector Tent Traps for testing after transition from S&T.  The Vector Tent Trap allows researchers to safely conduct vector surveillance on insects that are attracted to humans and vector-borne diseases.  Altitude Readiness Management System (ARMS): Begin the development of the Altitude Readiness Management System (ARMS).  ARMS will transition from S&T MM3 funding line.  The ARMS product is a handheld sensor and software decision device to plan, monitor, and manage unit altitude illness risk and task performance prediction."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.534"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.534"
                                            },
                                            "Text": {
                                                "val": "PEO Combat Support \/Combat Service Support: Will continue collaboration with Program Executive Office Combat Support\/Combat Service Support (PEO CS&CSS) and Program Executive Office Ground Combat Systems (PEO GCS) on development efforts for emerging medical vehicle evacuation\/casualty evacuation (CASEVAC) variants.  Improved Vector Tent Traps: Continue prototype development of Vector Tent Traps and transition to project 832.  Altitude Readiness Management System (ARMS): Will continue prototype development of the Altitude Readiness Management System (ARMS) and transition to project 832.  Next Generation Uniform Repellent: Will begin development of the Next Generation Uniform Repellent (NGUR).  The NGUR will transition from an S&T SBIR.  The NGUR is an effort to develop new military uniform insect repellent formulations for the uniform materiel and the corresponding uniform treatment technology .   Next Generation Immobilization System: Will transition from S&T SBIR.  Will develop prototypes for initial developmental testing and FDA data collection.  The Next Generation Immobilization System (NGIS) will provide advanced vibration dampening to allow for safer evacuation of spinal cord injury and traumatic brain injury casualties."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Develop in-house or industrial prototypes in government-managed programs to meet military and regulatory requirements for production and fielding."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Medical Product Development Management Services Cost"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not Applicable"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Not applicable"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "39.609"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.622"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.024"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.933"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.933"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "TBI Diagnostic Assay System - Increment II (benchtop\/POC\/ Bandits)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Banyan BioMarkers, Inc"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Alachua FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.208"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.208"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Impedance Threshold Device for the Treatment of Traumatic Brain Injury"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Advance Circulatory Systems, Inc"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Roseville, MN"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.154"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.154"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Product Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.932"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.932"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.932"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Banyan BioMarkers, Inc"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Alachua FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "27.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "4.514"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "HemCon Medical Technologies"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Tigard, Oregon"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "9.720"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Development of Platelet Derived Hemostatic agent"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Fast Track Drugs & Biologics"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Frederick, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.800"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Medical Product Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ALL Product"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.931"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Product Development of Freeze-dried plasma"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.400"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "6.884"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "6.884"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "TBI Diagnostic Assay System - Increment II (benchtop\/POC\/ Bandits)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Banyan BioMarkers, Inc"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Alachua FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "5.666"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "5.666"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Impedance Threshold Device for the Treatment of Traumatic Brain Injury"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Advance Circulatory Systems Inc."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Roseville, MN"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.250"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.250"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Compartment Syndrome Pressure Device"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Twinstar"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Minniapolis, MN"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.878"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.878"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.878"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Hydration Status Monitor"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Gaia Medical"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "LaJolla CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.841"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.841"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.841"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "Remarks": {
                                        "val": "No product\/contract costs greater than $1M individually."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Medical Product Development Support Cost"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not Applicable"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Not applicable"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "42.799"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.066"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.932"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.932"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Remarks": {
                                        "val": "No product\/contract costs greater than $1M individually."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Medical Product Development T&E Cost"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not applicable"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Not applicable"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "33.468"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.500"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.093"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.932"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.932"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Cryopreserved Platelets (CPP) Critical Design Review MS-B"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Cryopreserved Platelets (CPP) Phase 1 Safety Clinical Trial"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Bench-top\/POC Biomarker assay for determining exposure to Traumatic Brain Injury"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Impedance Threshold Device for the Treatment of TBI (PreMarket Note.)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Compartment Syndrome Pressure Device MS-A"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Handheld Biomarker assay for determining exposure to TBI (Increment III)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Hydration Status Monitor MS-B"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Noninvasive Neuromodulator TBI MS-A"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Environmental Sentinel Biomonitor MS-B"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "VS7"
                    },
                    "ProjectTitle": {
                        "val": "MEDEVAC Mission Equipment Package (MEP) - Adv Dev"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.404"
                        },
                        "CurrentYear": {
                            "val": "0.561"
                        },
                        "BudgetYearOne": {
                            "val": "0.279"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.279"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "1.244"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Original models of Army Black Hawk MEDEVAC helicopters continue to play a major role in maintaining high US troop survival rates in Iraq and Afghanistan by evacuating wounded troops in less than one-hour.  In 2009 a VCSA-approved force design update increased the number of air frames in the force from 12 to 15 aircraft for 37 MEDEVAC companies to better meet operational needs.  In 2010, the AMEDD accepted life-cycle management of the MEDEVAC MEP from PEO Aviation.  In order to achieve required operational capability and enhance commonality across the MEDEVAC fleet, the MEDEVAC MEP program upgrades, retrofits, trains, and sustains the 256 MEDEVAC legacy helicopters to achieve the medical capability provided by the HH-60M, which is factory built for the MEDEVAC mission."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Telemedicine for MEDEVAC aircraft"
                                    },
                                    "Description": {
                                        "val": "Effort is focused on requirement to provide enroute patient data to treatment facilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.404"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Designed, developed, and tested telemedicine systems in order to provide medics with state of the art capability to monitor and communicate patient data to ground crews at forward treatment facility"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.561"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue design, development, and testing of the telemedicine systems in order to provide medics with state of the art capability to monitor and communicate patient data to ground crews at forward treatment facility."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Medical Evacuation Enroute Care Validation Study"
                                    },
                                    "Description": {
                                        "val": "Medical Evacuation Enroute Care Validation Study"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.279"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.279"
                                            },
                                            "Text": {
                                                "val": "Interim MEDEVAC Mission Support System (IMMSS) will be modified to take into account the new paramedic skills being used by the flight paramedic."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Develop in-house or industrial prototypes in government-managed programs to meet military MEDEVAC and regulatory requirements for production and fielding."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Medical Product Development Management Services Cost"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "APM MEDEVAC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Huntsville, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.152"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.037"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.189"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Medical Product Development Cost"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "APM MEDEVAC \nPEO  Aviation"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Huntsville AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.112"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.367"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.479"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Medical Product Development Support Cost"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "APM MEDEVAC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Huntsville, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.100"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.561"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.279"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.279"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.940"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Medical Product Development T&E Cost"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "APM MEDEVAC\nPEO Aviation"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Huntsville, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.199"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.199"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Telemedicine Research and Development and Tech transfer"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Medical Evacuation Enroute Care Validation Study"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}