{
    "id": "060790425f0ec22aa8c2ac4cd5f2ef4be2b6d279",
    "meta": {
        "filename": "dod-2015_RDTE_2015_OSD_RDTE_JustificationBook_Office_of_Secretary_Of_Defense_PB_2015.zzz_unzipped_RDTE_JustificationBook_Office_of_Secretary_Of_Defense_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605022D8Z"
        },
        "ProgramElementTitle": {
            "val": "Defense Exportability Program"
        },
        "R1LineNumber": {
            "val": "124"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "1.915"
            },
            "PriorYear": {
                "val": "1.655"
            },
            "CurrentYear": {
                "val": "3.750"
            },
            "BudgetYearOne": {
                "val": "3.244"
            },
            "BudgetYearOneBase": {
                "val": "3.244"
            },
            "BudgetYearTwo": {
                "val": "3.295"
            },
            "BudgetYearThree": {
                "val": "3.391"
            },
            "BudgetYearFour": {
                "val": "3.267"
            },
            "BudgetYearFive": {
                "val": "3.143"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Defense Exportability Features (DEF) Program is a result of a USD(AT&L) sponsored legislative proposal for authorities to better prepare warfighting systems for non-US use. The program funds will be replenished through non-recurring cost recoupment in future Foreign Military Sales (FMS) cases, Cooperative Program MOUs, or direct commercial sales contracts for sale\/transfer of DoD systems benefiting from exportability investments. This program funds activities to support identification of major defense acquisition programs for possible export, and the planning for design and incorporation of exportability features during research and development of these programs. Features include, but are not limited to, technology and engineering design activity such as capability differentials, anti-tamper, system assurance, and software assurance. Activities include the development of program protection strategies for the program; the design and incorporation of exportability features into the system; implementation of exportability requirements onto contracts; and research, development, test, and evaluation activities. \n\nDefense exportability features plays a critically important role in United States Government\/DoD efforts to build partnership capacity.  Funds support building joint and coalition environments by enabling the export of DoD systems to a wide range of partner nations, resulting in improved security and interoperability.  In addition to the operational benefits, by providing these resources up front, then collecting ‘fair share’ non-recurring cost recoupment, the United States and partner nations will save significant resources by more efficiently designing and producing exportable U.S. systems. \n\nFunding is increased in FY14 to expand the number of systems included in the Defense Exportability Pilot Program that are used to define and implement DEF ‘best practice’ program management, system engineering, and program protection measures in the DoD acquisition process. Failure to consider export variant designs early in the acquisition process results in increased costs, delayed delivery, and higher risk of  sensitive technology compromise due to ad-hoc sales late in production.  Early development of export variants including systems design approaches to integrate adequate domestic and exportable anti-tamper (AT) protection and differential capability (DC) requirements to lower production costs, increase quality and timely deliveries to allies and friends, and enhance US industry share of the global marketplace."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "1.859"
                },
                "CurrentYear": {
                    "val": "3.763"
                },
                "BudgetYearOne": {
                    "val": "3.786"
                },
                "BudgetYearOneBase": {
                    "val": "3.786"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "1.655"
                },
                "CurrentYear": {
                    "val": "3.750"
                },
                "BudgetYearOne": {
                    "val": "3.244"
                },
                "BudgetYearOneBase": {
                    "val": "3.244"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.204"
                },
                "CurrentYear": {
                    "val": "-0.013"
                },
                "BudgetYearOne": {
                    "val": "-0.542"
                },
                "BudgetYearOneBase": {
                    "val": "-0.542"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Strategic Efficiency Reduction"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.542"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.542"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "-0.013"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Reductions"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.204"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2013 from the previous President's Budget submission is predominately due to general Congressional and sequestration reductions and the\nSmall Business Innovation Research (SBIR) transfer.  \n\nFY 2015 decrease is a result of efficiencies identified to incorporate exportability features during research and development of programs."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P013"
                    },
                    "ProjectTitle": {
                        "val": "Defense Exportability Features (DEF) Program"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "1.915"
                        },
                        "PriorYear": {
                            "val": "1.655"
                        },
                        "CurrentYear": {
                            "val": "3.750"
                        },
                        "BudgetYearOne": {
                            "val": "3.244"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.244"
                        },
                        "BudgetYearTwo": {
                            "val": "3.295"
                        },
                        "BudgetYearThree": {
                            "val": "3.391"
                        },
                        "BudgetYearFour": {
                            "val": "3.267"
                        },
                        "BudgetYearFive": {
                            "val": "3.143"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Defense Exportability Features (DEF) Program is a result of a USD(AT&L) sponsored legislative proposal for authorities to better prepare warfighting systems for non-US use. The program funds will be replenished through non-recurring cost recoupment in future Foreign Military Sales (FMS) cases, Cooperative Program MOUs, or direct commercial sales contracts for sale\/transfer of DoD systems benefiting from exportability investments. This program funds activities to support identification of major defense acquisition programs for possible export, and the planning for design and incorporation of exportability features during research and development of these programs. Features include, but are not limited to, technology and engineering design activity such as capability differentials, anti-tamper, system assurance, and software assurance. Activities include the development of program protection strategies for the program; the design and incorporation of exportability features into the system; implementation of exportability requirements onto contracts; and research, development, test, and evaluation activities. \n\nDefense exportability features plays a critically important role in United States Government\/DoD efforts to build partnership capacity.  Funds support building joint and coalition environments by enabling the export of DoD systems to a wide range of partner nations, resulting in improved security and interoperability.  In addition to the operational benefits, by providing these resources up front, then collecting ‘fair share’ non-recurring cost recoupment, the United States and partner nations will save significant resources by more efficiently designing and producing exportable U.S. systems.  Incorporation of defense exportability features in initial designs can help control costs throughout the product life cycle.  \n\nFunding is increased in FY15 to expand the number of systems included in the Defense Exportability Pilot Program that are used to define and implement DEF ‘best practice’ program management, system engineering, and program protection measures in the DoD acquisition process. Failure to consider export variant designs early in the acquisition process results in increased costs, delayed delivery, and higher risk of  sensitive technology compromise due to ad-hoc sales late in production.  Early development of export variants including systems design approaches to integrate adequate domestic and exportable anti-tamper (AT) protection and differential capability (DC) requirements to lower production costs, increase quality and timely deliveries to allies and friends, and enhance US industry share of the global marketplace."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Defense Exportability Features (DEF) Program"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.655"
                                            },
                                            "Text": {
                                                "val": "Designate the following eight systems as DEF pilot programs: \n- Armed Aerial Scout Helicopter (US Army)\n- Small Diameter Bomb II (US Air Force)\n- MQ-9 Reaper Unmanned Aircraft System (US Air Force)\n- Joint Air-to-Surface Standoff Missile (US Air Force)\n- Next Generation Jammer (US Navy)\n- Air and Missile Defense Radar (US Navy)\n- P-8A Poseidon Multi-Mission Maritime Aircraft (US Navy)\n- E-2D Advanced Hawkeye (US Navy)\n\nInitiate and\/or continue DEF feasibility studies for the following seven systems:\n- MQ-4C Triton formerly Broad Area Maritime Surveillance (US Navy)\n- Army Integrated Air and Missile Defense (US Army)\n- Three-Dimensional Expeditionary Long-Range Radar (US Air Force)\n- Common Joint Proximity Height of Burst Fusing (US Army)\n- Common Infrared Countermeasures (US Army)\n- Small Diameter Bomb II (US Air Force)\n- Next Generation Jammer (US Navy)\n\n- Review major defense acquisition programs for exportability as part of the major milestone review process, including the Next Generation Jammer, Three Dimensional Expeditionary Long Range Radar, and Common Infrared Countermeasures and ensure exportability requirements are included in development contracts.\n- Draft a legislative proposal that authorizes DOD to recoup the DEF investment in program protection through future foreign military sales.\n- Manage and track the completion of the contractor feasibility studies for exportability. \n- Draft and submit the annual report to Congress on the program."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.750"
                                            },
                                            "Text": {
                                                "val": "- Funding is increased in FY14 to expand the number of systems included in the Defense ExportabilityPilot Program that are used to define and implement DEF ‘best practice’ program management, system engineering, and program protection measures in the DoD acquisition process.\n\nInitiate or continue contracts for DEF feasibility studies on the following fifteen systems:\n- Air and Missile Defense Radar (US Navy)\n- Armed Aerial Scout Helicopter (US Army)\n- Ground Combat Vehicle (US Army)\n- Indirect Fires Protection Capability (US Army)\n- Integrated Air and Missile Defense (US Army)\n- P-8A Poseidon Multi-Mission Maritime Aircraft (US Navy)\n- E-2D Advanced Hawkeye(US Navy)\n- Joint Air-to-Surface Standoff Missile (US Air Force)\n- Small Diameter Bomb II (US Air Force)\n- MQ-9 Reaper Unmanned Aircraft System (US Air Force)\n- MQ-4C Triton formerly Broad Area Maritime Surveillance (US Navy)\n- Next Generation Jammer (US Navy)\n- Three-Dimensional Expeditionary Long-Range Radar (US Air Force)\n- Common Joint Proximity Height of Burst Fusing (US Army)\n- Common Infrared Countermeasures (US Army)\n\n- Review of major defense acquisition programs for exportability as part of the major milestone review process.\n- Identify new pilot candidates.\n- Identify Service leads and subject matter experts, to provide support to programs, prior to Milestone B, to develop plans for exportability features. \n- Implement DOD procedures for the recoupment of the DEF investment in program protection through future foreign military sales.\n- Manage and track the completion of the contractor feasibility studies for exportability. \n- Draft and submit the annual report to Congress on the program.\n-Draft a legislative amendment adjusting the government\/contractor cost-sharing ratio from 50%-%50 to an \"appropriate share.\"\n\nThe focus for FY 2014 for the DEF pilot program will be to execute feasibility studies for FY 2013 pilot programs that have yet to receive DEF funding, and to review the next phases on FY 2012-13 DEF pilot programs.  As with the FY 2013 programs, FY 2014 feasibility studies will define the required actions for implementing DEF and assess the potential costs of those actions.  OUSD (AT&L) will engage with program offices through the Military Departments, and serve as a liaison among the program offices, the Military Departments, and other Technology Security and Foreign Disclosure offices to facilitate the feasibility studies.  For pre-MS A systems, the DEF feasibility studies will be addressed in the Technology Development Strategy and the Program Protection Plan (PPP).  For the systems that are in the pre-MS B development stage, the DEF feasibility studies will be addressed in the Acquisition Strategy and the PPP.  For Post-MS B platforms, when there is already a contract in place, OUSD (AT&L) will work with the program managers and contracting officers to implement the necessary contractual modifications to ensure that the feasibility studies are executed.  Depending on the maturity of each program and where it is in the acquisition life cycle, the feasibility studies may be addressed in the Requests for Proposals (RFPs).      \n\nOUSD (AT&L) will conduct a follow-up industry round-table meeting to discuss the DEF concept, capture government and industry perspectives, and to identify further corresponding government and industry strategic choices. Government and industry participants will also identify mutual risks and challenges in implementing defense exportability features, and identify legislative, regulatory, or policy change proposals.  This will take place in the spring of 2014.\n\nOUSD (AT&L) will continue to develop recommended procedures and guidance to be incorporated in the DAG regarding incorporating DE business case analyses into contract and acquisition strategies, as well as procedures to cost share DEF implementation with industry and recoupment of these costs though foreign sales.  OUSD (AT&L) will also develop policies and processes to identify additional DoD funding sources for the next phases of DEF activities, as well as cost-sharing with contractors for the initial and follow-on research and development costs of DEF pilot programs, in accordance with Section 252 of the NDAA for FY 2012."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.244"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.244"
                                            },
                                            "Text": {
                                                "val": "- Funding was increased in FY15 to expand the number of systems included in the Defense Exportability Pilot Program that are used to define and implement DEF ‘best practice’ program management, system engineering, and program protection measures in the DoD acquisition process.\n\nInitiate or continue contracts for DEF feasibility studies on the following fifteen systems:\n- Air and Missile Defense Radar (US Navy)\n- Armed Aerial Scout Helicopter (US Army)\n- Ground Combat Vehicle (US Army)\n- Indirect Fires Protection Capability (US Army)\n- Integrated Air and Missile Defense (US Army)\n- P-8A Poseidon Multi-Mission Maritime Aircraft (US Navy)\n- E-2D Advanced Hawkeye(US Navy)\n- Joint Air-to-Surface Standoff Missile (US Air Force)\n- Small Diameter Bomb II (US Air Force)\n- MQ-9 Reaper Unmanned Aircraft System (US Air Force)\n- MQ-4C Triton formerly Broad Area Maritime Surveillance (US Navy)\n- Next Generation Jammer (US Navy)\n- Three-Dimensional Expeditionary Long-Range Radar (US Air Force)\n- Common Joint Proximity Height of Burst Fusing (US Army)\n- Common Infrared Countermeasures (US Army)\n\n- Review of major defense acquisition programs for exportability as part of the major milestone review process.\n- Identify new pilot candidates.\n- Identify Service leads and subject matter experts, to provide support to programs, prior to Milestone B, to develop plans for exportability features. \n- Implement DOD procedures for the recoupment of the DEF investment in program protection through future foreign military sales.\n- Manage and track the completion of the contractor feasibility studies for exportability. \n- Draft and submit the annual report to Congress on the program."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "TBD"
                        }
                    }
                }
            ]
        }
    }
}