{
    "id": "06b7391a1ee36cd69c08740896b46442fa1742db",
    "meta": {
        "filename": "dod-2015_RDTE_2015_CDBP_RDTE_JustificationBook_Chemical_and_Biological_Defense_Program_PB_2015.zzz_unzipped_RDTE_JustificationBook_Chemical_and_Biological_Defense_Program_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Chemical and Biological Defense Program",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0601384BP"
        },
        "ProgramElementTitle": {
            "val": "CHEMICAL\/BIOLOGICAL DEFENSE (BASIC RESEARCH)"
        },
        "R1LineNumber": {
            "val": "7"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Chemical and Biological Defense Program"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Basic Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "45.613"
            },
            "CurrentYear": {
                "val": "51.426"
            },
            "BudgetYearOne": {
                "val": "48.261"
            },
            "BudgetYearOneBase": {
                "val": "48.261"
            },
            "BudgetYearTwo": {
                "val": "46.832"
            },
            "BudgetYearThree": {
                "val": "50.256"
            },
            "BudgetYearFour": {
                "val": "49.048"
            },
            "BudgetYearFive": {
                "val": "47.821"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element supports the Joint Service basic research program for Chemical, Biological, and Radiological (CBR) defense.  The objective of the basic research program is to advance fundamental knowledge and understanding of those fundamental sciences identified as having potential future impact on the Chemical and Biological Defense Program, with an emphasis in exploring new and innovative research for combating or countering chemical, biological and radiological weapons.  Moreover, basic research supports a Joint Force concept of a lethal, integrated, supportable, highly mobile force with enhanced capability by the individual service member.  Specifically, the program promotes theoretical and experimental research and studies in the physical, life and information sciences.  A portion of this program element directly supports basic research efforts for the translational medical technologies program.  Basic research activities described in this budget justification leverage existing research programs and activities within the DoD and other government agencies and promotes cross-pollination between government and academia, as well as sponsors promising efforts of world class scientists.  \n\nThe Projects within this BA reflect the research areas of (1) Life Sciences (LF1) which focuses on fundamental efforts to investigate molecular signatures, mechanisms of action, recognition, catalysis and biomimetics, as well as agent interactions and evolution, and (2) Physical Sciences (PS1) which focuses on fundamental scientific phenomena including chemistry, physics, materials science, environmental science, and nanotechnology.\n\nThe projects in this PE are placed in BA1 because they are basic research efforts directed towards non-specific or non-unique military applications.  Basic research technological breakthroughs support applied research (PE 0602384BP) activities."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "50.566"
                },
                "CurrentYear": {
                    "val": "51.426"
                },
                "BudgetYearOne": {
                    "val": "52.351"
                },
                "BudgetYearOneBase": {
                    "val": "52.351"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "45.613"
                },
                "CurrentYear": {
                    "val": "51.426"
                },
                "BudgetYearOne": {
                    "val": "48.261"
                },
                "BudgetYearOneBase": {
                    "val": "48.261"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-4.953"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-4.090"
                },
                "BudgetYearOneBase": {
                    "val": "-4.090"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.067"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "-4.208"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.678"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-4.090"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-4.090"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funding: FY13: Reduction of $4.2M delayed research enabling bacterial and viral therapeutics, development efforts for new diagnostic techniques, and nanotechnology studies. \n\nFY15: Reductions of $4.1M delay the ability to deliver future protection, sensing, and countermeasure technology.\n\nSchedule: N\/A\n\nTechnical: N\/A"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "LF1"
                    },
                    "ProjectTitle": {
                        "val": "CHEMICAL\/BIOLOGICAL DEFENSE - LIFE SCIENCES (BASIC RESEARCH)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "29.606"
                        },
                        "CurrentYear": {
                            "val": "34.646"
                        },
                        "BudgetYearOne": {
                            "val": "31.727"
                        },
                        "BudgetYearOneBase": {
                            "val": "31.727"
                        },
                        "BudgetYearTwo": {
                            "val": "28.939"
                        },
                        "BudgetYearThree": {
                            "val": "33.469"
                        },
                        "BudgetYearFour": {
                            "val": "32.117"
                        },
                        "BudgetYearFive": {
                            "val": "31.314"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project (LF1) supports research efforts in fundamental science phenomenology in microbiology, biochemistry, pathogenic mechanisms, cell and molecular biology, and immunology that are investigating molecular signatures, mechanisms of action, recognition, catalysis, and biomimetics.  Efforts in Life Sciences (Basic Research) include: innovative biotechnology approaches with potential application for rapidly identifying, diagnosing, preventing, and treating disease resulting from exposure to biological or chemical agents, or from radiological exposure; biological and bio-inspired science addressing concepts such as synthetic biology, biomimetics; and other emerging areas of science to build a foundation for developing novel materials.  Ultimately, knowledge gained through research in this area supports the development of medical and physical countermeasures against biological or chemical agents in areas such as diagnostics, detection, biosurveillance, protection (both physical and vaccine) and therapeutic intervention."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) Life Sciences"
                                    },
                                    "Description": {
                                        "val": "Focuses on fundamental efforts to investigate molecular signatures, mechanisms of action, recognition, catalysis and biomimetics, as well as agent interactions and evolution."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "29.606"
                                            },
                                            "Text": {
                                                "val": "Continued previous work emphasizing efforts to understand pathogens, novel threats and host responses (including human and zoonotic).  Investigated and evaluated systemic biological responses following exposure of living systems to CB agents.  Improved understanding of polymicrobial interactions influencing response to or course of disease.  Exploited advances in systems biology to mine \"omics\" experimental designs involving agents and hosts to provide new biomarkers, targets and options.  \"Omics\" informally refers to a field of study in biology ending in \"-omics\", such as genomics or proteomics.  Explored materials in biotic\/abiotic interface and biomimetics to enable functional molecular development (such as robust synthetic enzymes)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "34.646"
                                            },
                                            "Text": {
                                                "val": "Continue efforts to understand pathogens, novel threats and host responses (including human and zoonotic) to prevent\/minimize host injury.  Investigate and evaluate systemic biological responses following exposure of living systems to CB agents.  Improve understanding of how polymicrobial interactions interfere with bacterial activities (through investigation of genetic networks) to influence discovery of novel antagonists for medical countermeasures, thus influencing response to or course of disease.  As an important Life Sciences issue, pursue computational infectious models that utilize experimental data to generate mathematical models of infection and immunity.  Continue exploration of materials in biotic\/abiotic interface and biomimetics to enable design of robust synthetic enzymes.  Explore nano- and nanostructured materials as approaches to the needs of chemical and biological countermeasures, including behavior in biological systems and how morphology relates to biological interaction and function."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "31.727"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "31.727"
                                            },
                                            "Text": {
                                                "val": "Continue efforts to understand pathogens, novel threats and host responses (including human and zoonotic) to prevent\/minimize host injury.  Investigate and evaluate systemic biological responses following exposure of living systems to CB agents.  Improve understanding of how polymicrobial interactions interfere with bacterial activities to influence discovery of novel antagonists for medical countermeasures, thus influencing response to or course of disease.  Continue exploration of materials in biotic\/abiotic interface and biomimetics to enable design of robust synthetic enzymes and proteins.  Continue to explore nano- and nanostructured materials as approaches to the needs of chemical and biological countermeasures, including behavior in biological systems and how morphology relates to biological interaction and function."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "CB2"
                                    },
                                    "Title": {
                                        "val": "CHEMICAL BIOLOGICAL DEFENSE (APPLIED RESEARCH)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "44.384"
                                        },
                                        "CurrentYear": {
                                            "val": "44.903"
                                        },
                                        "BudgetYearOne": {
                                            "val": "54.061"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "54.061"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "52.579"
                                        },
                                        "BudgetYearThree": {
                                            "val": "54.705"
                                        },
                                        "BudgetYearFour": {
                                            "val": "53.910"
                                        },
                                        "BudgetYearFive": {
                                            "val": "52.563"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "TM2"
                                    },
                                    "Title": {
                                        "val": "TECHBASE MED DEFENSE (APPLIED RESEARCH)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "106.017"
                                        },
                                        "CurrentYear": {
                                            "val": "85.790"
                                        },
                                        "BudgetYearOne": {
                                            "val": "100.722"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "100.722"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "94.500"
                                        },
                                        "BudgetYearThree": {
                                            "val": "82.839"
                                        },
                                        "BudgetYearFour": {
                                            "val": "85.335"
                                        },
                                        "BudgetYearFive": {
                                            "val": "83.201"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "CB3"
                                    },
                                    "Title": {
                                        "val": "CHEMICAL BIOLOGICAL DEFENSE (ATD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "23.247"
                                        },
                                        "CurrentYear": {
                                            "val": "15.401"
                                        },
                                        "BudgetYearOne": {
                                            "val": "17.722"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "17.722"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "16.123"
                                        },
                                        "BudgetYearThree": {
                                            "val": "16.968"
                                        },
                                        "BudgetYearFour": {
                                            "val": "16.250"
                                        },
                                        "BudgetYearFive": {
                                            "val": "15.844"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "TM3"
                                    },
                                    "Title": {
                                        "val": "TECHBASE MED DEFENSE (ATD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "160.195"
                                        },
                                        "CurrentYear": {
                                            "val": "101.827"
                                        },
                                        "BudgetYearOne": {
                                            "val": "87.610"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "87.610"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "90.079"
                                        },
                                        "BudgetYearThree": {
                                            "val": "100.916"
                                        },
                                        "BudgetYearFour": {
                                            "val": "101.559"
                                        },
                                        "BudgetYearFive": {
                                            "val": "99.018"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "PS1"
                    },
                    "ProjectTitle": {
                        "val": "CHEM\/BIO DEFENSE - PHYSICAL SCIENCES (BASIC RESEARCH)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "16.007"
                        },
                        "CurrentYear": {
                            "val": "16.780"
                        },
                        "BudgetYearOne": {
                            "val": "16.534"
                        },
                        "BudgetYearOneBase": {
                            "val": "16.534"
                        },
                        "BudgetYearTwo": {
                            "val": "17.893"
                        },
                        "BudgetYearThree": {
                            "val": "16.787"
                        },
                        "BudgetYearFour": {
                            "val": "16.931"
                        },
                        "BudgetYearFive": {
                            "val": "16.507"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project (PS1) advances fundamental scientific knowledge in physical science areas that include chemistry, physics, materials science, environmental sciences, and nanotechnology that could potentially lead to transformational CB defensive capabilities enhancing Warfighter performance and safety.  Research results in physics, chemistry and materials sciences have potential application in point and standoff detection, as well as protection and decontamination.  Surface and environmental sciences focus on the study of physical and chemical properties and phenomena of interactions, especially with regard to Non Traditional Agents (NTAs), that seek to improve capabilities such as detection, protection, and decontamination.  Research in nanotechnology and nanoscale sciences, such as nanoelectromechanical systems, molecular motors, nanomechanical resonance sensing, and nanometer imaging, has potential application across CB capability areas to provide significant enhancement by, for example, decreasing detection response times, increasing medical countermeasure effectiveness against a wider array of threat agents, and providing currently unavailable modalities like detection imbedded in fabrics."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) Physical Sciences"
                                    },
                                    "Description": {
                                        "val": "Focuses on fundamental scientific phenomena including chemistry, physics, materials science, environmental science, and nanotechnology."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.007"
                                            },
                                            "Text": {
                                                "val": "Explored development of multifunctional material design and synthesis that identified materials that integrate functionality with durability to improve CB protection by increasing protection factors (resistance or filtration) and reducing physical burden.  Created novel decontamination options (through design and synthesis of novel materials\/solutions) that are more broadly applicable to multiple chemicals or biologicals with less potential to harm equipment.  Funded advanced options (through both experimental and theoretical efforts) for threat identification such as new spectra of signatures (THz and more) as well as other recognition elements (e.g., fluidic behavior) that reduced the requirements for consumables or logistics while increasing specificity.  Explored integration of functionality that may provide dynamic capabilities for CB defense countermeasures."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.780"
                                            },
                                            "Text": {
                                                "val": "Continue exploring multifunctional material design and synthesis to identify dynamic materials that combine functionality and durability to improve CB protection by increasing protection factors and reducing physical burden.  Design and synthesize novel decontamination options that are broadly applicable to multiple chemicals or biologicals and are less harmful to equipment.  Continue investigations into novel signatures and analytical methods, new separation approaches, and recognition elements to reduce logistical burden while increasing specificity to overcome limitations in current approaches to identifying and quantifying CB threats.  Explore nano- and nanostructured materials as novel approaches to needs in chemical and biological countermeasures.  Continue exploring integration of functionality that may provide adaptive materials and capabilities for CB defense countermeasures that sense, transduce, respond and mitigate threats."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.534"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.534"
                                            },
                                            "Text": {
                                                "val": "Continue exploring multifunctional material design and synthesis to identify dynamic materials that combine functionality and durability to improve CB protection by increasing protection factors and reducing physical burden.  Design and synthesize novel decontamination options that are broadly applicable to multiple chemicals or biologicals and are less harmful to equipment.  Continue investigations into novel signatures and analytical methods, new separation approaches, and recognition elements to reduce logistical burden while increasing specificity to overcome limitations in current approaches to identifying and quantifying CB threats.  Continue exploration of nano- and nanostructured materials as novel approaches to needs in chemical and biological countermeasures.  Continue exploring integration of functionality that may provide adaptive materials and capabilities for CB defense countermeasures that sense, transduce, respond and mitigate threats."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "CB2"
                                    },
                                    "Title": {
                                        "val": "CHEMICAL BIOLOGICAL DEFENSE (APPLIED RESEARCH)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "44.384"
                                        },
                                        "CurrentYear": {
                                            "val": "44.903"
                                        },
                                        "BudgetYearOne": {
                                            "val": "54.061"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "54.061"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "52.579"
                                        },
                                        "BudgetYearThree": {
                                            "val": "54.705"
                                        },
                                        "BudgetYearFour": {
                                            "val": "53.910"
                                        },
                                        "BudgetYearFive": {
                                            "val": "52.563"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "CB3"
                                    },
                                    "Title": {
                                        "val": "CHEMICAL BIOLOGICAL DEFENSE (ATD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "23.247"
                                        },
                                        "CurrentYear": {
                                            "val": "15.401"
                                        },
                                        "BudgetYearOne": {
                                            "val": "17.722"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "17.722"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "16.123"
                                        },
                                        "BudgetYearThree": {
                                            "val": "16.968"
                                        },
                                        "BudgetYearFour": {
                                            "val": "16.250"
                                        },
                                        "BudgetYearFive": {
                                            "val": "15.844"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}