{
    "id": "0739c343497b748dfb83cc17ea343e3ea5ebe374",
    "meta": {
        "filename": "dod-2015_RDTE_2015_AIRFORCE_V3A_RDTE_JustificationBook_Air_Force_PB_2015.zzz_unzipped_RDTE_JustificationBook_Air_Force_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0207268F"
        },
        "ProgramElementTitle": {
            "val": "Aircraft Engine Component Improvement Program"
        },
        "R1LineNumber": {
            "val": "150"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "114.802"
            },
            "CurrentYear": {
                "val": "89.369"
            },
            "BudgetYearOne": {
                "val": "109.664"
            },
            "BudgetYearOneBase": {
                "val": "109.664"
            },
            "BudgetYearTwo": {
                "val": "148.286"
            },
            "BudgetYearThree": {
                "val": "151.187"
            },
            "BudgetYearFour": {
                "val": "154.141"
            },
            "BudgetYearFive": {
                "val": "157.076"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Aircraft Engine Component Improvement Program (CIP) provides the only source of critical sustaining engineering support for in-service Air Force engines to maintain flight safety (highest priority), to correct service revealed deficiencies, to improve system operational readiness (OR) and reliability & maintainability (R&M), to reduce engine Life Cycle Cost (LCC), and to sustain engines throughout their service life.  Historically, aircraft systems change missions, tactics, and environments (including new fuels) to meet changing threats throughout their lives.  New technical problems can develop in the engines through actual use and Engine CIP provides the means to develop fixes for these field problems.  Engine CIP funding is driven by field events and types\/maturity of engines, not by the total engine quantity.  The program starts with government acceptance of the first procurement-funded engine and continues over the engine's life, gradually decreasing to a minimum level (safety\/depot repairs) sufficient to keep older inventory engines operational.  Engine CIP, through \"Lead the Fleet\" operational use and accelerated mission testing, identifies and fixes engine-related problems ahead of operational impacts.  Engine CIP addresses out-of-warranty usage\/life and enables the Air Force to obtain additional warranties when manufacturers incorporate Engine CIP improvements into production engines.  Engine CIP ensures continued improvements in engine R&M, which reduce out year support costs.  Historically, R&M related Engine CIP efforts significantly reduce out year Operations and Maintenance (O&M) and spares costs.  Without Engine CIP, out year support funding would have to be significantly increased. \n\nThis program is in Budget Activity 7, Operational System Development, because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "187.984"
                },
                "CurrentYear": {
                    "val": "139.369"
                },
                "BudgetYearOne": {
                    "val": "139.810"
                },
                "BudgetYearOneBase": {
                    "val": "139.810"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "114.802"
                },
                "CurrentYear": {
                    "val": "89.369"
                },
                "BudgetYearOne": {
                    "val": "109.664"
                },
                "BudgetYearOneBase": {
                    "val": "109.664"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-73.182"
                },
                "CurrentYear": {
                    "val": "-50.000"
                },
                "BudgetYearOne": {
                    "val": "-30.146"
                },
                "BudgetYearOneBase": {
                    "val": "-30.146"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.248"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "-50.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-49.449"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-5.133"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-18.352"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-30.146"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-30.146"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY2013 adjustments are Sequestration $-18.352M, Reprogrammings $-49.449M, and Small Business Innovative Research (SBIR) Reduction -$5.133M\n\nFY2014 -Congressional Directed Reduction $-50.000M \"Program Decrease\"\n\nFY2015 - Reduction - $30.146M due to higher Air Force Priorities"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "671012"
                    },
                    "ProjectTitle": {
                        "val": "Aircraft Engine Component Improvement Program"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "113.829"
                        },
                        "CurrentYear": {
                            "val": "70.069"
                        },
                        "BudgetYearOne": {
                            "val": "78.690"
                        },
                        "BudgetYearOneBase": {
                            "val": "78.690"
                        },
                        "BudgetYearTwo": {
                            "val": "116.738"
                        },
                        "BudgetYearThree": {
                            "val": "119.053"
                        },
                        "BudgetYearFour": {
                            "val": "121.379"
                        },
                        "BudgetYearFive": {
                            "val": "123.690"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Aircraft Engine Component Improvement Program (CIP) provides the only source of critical sustaining engineering support for in-service Air Force engines to maintain flight safety (highest priority), to correct service revealed deficiencies, to improve system operational readiness (OR) and reliability & maintainability (R&M), to reduce engine Life Cycle Cost (LCC), and to sustain engines throughout their service life. Historically, aircraft systems change missions, tactics, and environments (including new fuels) to meet changing threats throughout their lives. New technical problems can develop in the engines through actual use and Engine CIP provides the means to develop fixes for these field problems. Engine CIP funding is driven by field events and types\/maturity of engines, not by the total engine quantity. The program starts with government acceptance of the first procurement-funded engine and continues over the engine's life, gradually decreasing to a minimum level (safety\/depot repairs) sufficient to keep older inventory engines operational. Engine CIP, through \"Lead the Fleet\" operational use and accelerated mission testing, identifies and fixes engine-related problems ahead of operational impacts. Engine CIP addresses out-of-warranty usage\/life and enables the Air Force to obtain additional warranties when manufacturers incorporate Engine CIP improvements into production engines. Engine CIP ensures continued improvements in engine R&M, which reduce out year support costs.  Historically, R&M related Engine CIP efforts significantly reduce out year Operations and Maintenance (O&M) and spares costs. Without Engine CIP, out year support funding would have to be significantly increased.\n\nThis program is in Budget Activity 7, Operational System Development, because this budget activity includes development efforts to upgrade systems that have been fielded or have received for full rate production and anticipate production funding in the current or subsequent fiscal year."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Aircraft Engine Component Improvement Program"
                                    },
                                    "Description": {
                                        "val": "Aircraft Engine Component Improvement Program (CIP) provides critical sustainment engineering support for approximately 20,300 engines (including foreign military sales (FMS)) to maintain flight safety (highest priority), to address parts obsolescence, to improve system operational readiness (OR) and reliability & maintainability (R&M), to reduce engine Life Cycle Cost (LCC), and to sustain engines throughout their service life."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "113.829"
                                            },
                                            "Text": {
                                                "val": "Funding enabled Engine CIP to continue to execute tasks across 13+ engine types. Majority of the budget addresses engine issues associated with the A-10, B-1, B-2, C-130, F-15, F-16, and F-22 aircraft. Engine CIP work effort addresses safety of flight, engine component redesign, repair\/rework procedures, engine maturation and life limit\/mission analysis. In addition to engine maturation, ground and flight engine testing was used to validate redesigned parts and new repair procedures. Engine CIP maintained engine flight safety, addressed obsolescence deficiencies, improved system operational readiness (OR) and reliability & maintainability (R&M), reduced engine life cycle costs (LCC), and sustained engines throughout their service life."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "70.069"
                                            },
                                            "Text": {
                                                "val": "Funding enables Engine CIP to execute tasks across 13+ engine types.  Majority of the budget addresses engine issues associated with the A-10\nB-1, B-2, C-130, F-15, F-16, and F-22 aircraft. Engine CIP work effort addresses safety of flight, engine component redesign, repair\/rework procedures, engine maturation and life limit\/mission analysis. In addition to engine maturation, ground and flight engine testing is used to validate redesigned parts and new repair procedures. Engine CIP maintains engine flight safety, addresses obsolescence deficiencies, improves system operational readiness (OR) and reliability & maintainability (R&M), reduces engine life cycle costs (LCC), and sustains engines throughout their service life."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "78.690"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "78.690"
                                            },
                                            "Text": {
                                                "val": "Funding will enable Engine CIP to execute tasks across 13+ engine types. Majority of the budget addresses engine issues associated with the A-10, B-1, B-2, C-130, F-15, F-16, and F-22 aircraft. Engine CIP work effort addresses safety of flight, engine component redesign, repair\/rework procedures, engine maturation and life limit\/mission analysis. In addition to engine maturation, ground and flight engine testing is used to validate redesigned parts and new repair procedures. Engine CIP maintains engine flight safety, addresses obsolescence deficiencies, improves system operational readiness (OR) and reliability & maintainability (R&M), reduces engine life cycle costs (LCC), and sustains engines throughout their service life."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "None"
                                    },
                                    "Title": {
                                        "val": "N\/A"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "Other APPN RELATED ACTIVITIES\n(U) - PEs 0604268A and 0604268N, Army\/Navy Aircraft Engine CIPs, prior to FY1996\n(U) - PEs 0203752A and 0205633N, Army\/Navy Aircraft Engine CIPs, FY1996-present"
                        },
                        "AcquisitionStrategy": {
                            "val": "Contracts within this program are awarded sole source to engine manufacturers. Engine CIP tasks are generally assigned to original engine manufacturers based on available funding and prioritization of candidates."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0207268F_BPAC_671012_0.jpg"
                                }
                            }
                        ]
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "675365"
                    },
                    "ProjectTitle": {
                        "val": "F-35"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.973"
                        },
                        "CurrentYear": {
                            "val": "19.300"
                        },
                        "BudgetYearOne": {
                            "val": "30.974"
                        },
                        "BudgetYearOneBase": {
                            "val": "30.974"
                        },
                        "BudgetYearTwo": {
                            "val": "31.548"
                        },
                        "BudgetYearThree": {
                            "val": "32.134"
                        },
                        "BudgetYearFour": {
                            "val": "32.762"
                        },
                        "BudgetYearFive": {
                            "val": "33.386"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The F135 Aircraft Engine Component Improvement Program (CIP) supports F-35 single-engine fighter propulsion systems.  It provides the only source of critical sustaining engineering support for in-service Air Force propulsion systems.  Engine CIP maintains flight safety (highest priority), to correct service revealed deficiencies, to improve system Operational Readiness (OR) and Reliability & Maintainability (R&M), to reduce propulsion system Life Cycle Cost (LCC), and sustain the propulsion systems throughout the service life.  Historically, aircraft systems change missions, tactics, and environment (including new fuels) and meet changing threats throughout their lives.  New technical problems can develop in the propulsion system through actual use and the Engine CIP provides the means to develop fixes for these field problems.  Engine CIP funding is driven by field events and type\/maturity of the propulsion systems, not by the total quantity.  The program starts with government acceptance of the first procurement-funded engine and continues over the propulsion system's life, gradually decreasing to a minimum level (safety\/depot repairs) sufficient to keep older inventory propulsion systems operational.  Engine CIP, through \"Lead the Fleet\" operational use and accelerated mission testing, identifies and fixes propulsion-related problems ahead of operational impacts.  Engine CIP addresses out-of-warranty usage\/life and enables the Air Force to obtain additional warranties when manufacturers incorporate Engine CIP improvements into production propulsion systems.  Engine CIP ensures continued improvements in R&M, which reduce out year support costs.  Historically, R&M related Engine CIP efforts significantly reduce out year O&M and spares costs.  Without Engine CIP, out year support funding would have to be significantly increased.  \n\nThis program is in Budget Activity 7, Operational System Development, because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Aircraft Engine Component Improvement Program (F135)"
                                    },
                                    "Description": {
                                        "val": "The Aircraft Engine Component Improvement Program (CIP) provides the only source of critical sustainment engineering support for F-35 propulsion systems to maintain flight safety for this single-engine fighter (highest priority), to correct service revealed deficiencies, to improve system operational readiness (OR) and reliability & maintainability (R&M), to reduce engine Life Cycle Cost (LCC), and to sustain engines throughout their service life."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.973"
                                            },
                                            "Text": {
                                                "val": "FY13 allocated funding was used to assess and plan 2014 Joint Strike Fighter (JSF) Engine CIP requirements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.300"
                                            },
                                            "Text": {
                                                "val": "Funding enables JSF Engine CIP to execute approximately 8 tasks supporting initial flying operations on F135.  Engine CIP work effort addresses safety of flight, engine component redesign, repair\/rework procedures, accelerated maturation testing and life limit\/mission analysis.  In addition, ground and flight engine testing is used to validate redesigned parts and new repair procedures. Funding enables JSF CIP to maintain\/improve engine flight safety, address parts obsolescence, improve system operational readiness and reliability & maintainability, reduce engine life cycle cost, and sustain engines throughout their service life."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "30.974"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "30.974"
                                            },
                                            "Text": {
                                                "val": "Funding will enable JSF Engine CIP to execute approximately 25 tasks supporting initial flying operations on F135.  Engine CIP work effort will address safety of flight, engine component redesign, repair\/rework procedures, accelerated maturation testing and life limit\/mission analysis.  In addition, ground and flight engine testing will be used to validate redesigned parts and new repair procedures. Funding will enable JSF CIP to maintain\/improve engine flight safety, address parts obsolescence, improve system operational readiness and reliability & maintainability, reduce engine life cycle cost, and sustain engines throughout their service life."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "None"
                                    },
                                    "Title": {
                                        "val": "N\/A"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "Program Element 0205633N provides US Navy funding support for F-35 propulsion system"
                        },
                        "AcquisitionStrategy": {
                            "val": "Contracts within this program are projected to be awarded sole source to engine manufacturer.  F-35 Engine CIP tasks are generally assigned to the original engine manufacturer based on available funding and prioritization of candidates."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0207268F_BPAC_675365_0.jpg"
                                }
                            }
                        ]
                    }
                }
            ]
        }
    }
}