{
    "id": "07e94844f67753dc4b30c4719426cb03ad4fe7a5",
    "meta": {
        "filename": "dod-2015_RDTE_2015_NAVY_BA1_3_RDTE_JustificationBook_Navy_PB_2015.zzz_unzipped_RDTE_JustificationBook_Navy_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602114N"
        },
        "ProgramElementTitle": {
            "val": "Power Proj Applied Research"
        },
        "R1LineNumber": {
            "val": "4"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "92.396"
            },
            "CurrentYear": {
                "val": "104.513"
            },
            "BudgetYearOne": {
                "val": "95.753"
            },
            "BudgetYearOneBase": {
                "val": "95.753"
            },
            "BudgetYearTwo": {
                "val": "112.521"
            },
            "BudgetYearThree": {
                "val": "133.344"
            },
            "BudgetYearFour": {
                "val": "174.974"
            },
            "BudgetYearFive": {
                "val": "181.478"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "FY 2013 funding associated with Future Naval Capability (FNC) efforts were transferred to a new Program Element titled Future Naval Capabilities Applied Research (PE 0602750N).  This is to enhance the visibility of the FNC Program by providing an easily navigable overview of all 6.2 FNC investments in a single location."
        },
        "ProgramElementMissionDescription": {
            "val": "The efforts described in this Program Element (PE) are based on investment directions as defined in the Naval S&T Strategic Plan approved by the S&T Corporate Board (Sep 2011).  This strategy is based on needs and capabilities from Navy and Marine Corps guidance and input from the Naval Research Enterprise (NRE) stakeholders (including the Naval enterprises, the combatant commands, the Chief of Naval Operations (CNO), and Headquarters Marine Corps).  It provides the vision and key objectives for the essential science and technology efforts that will enable the continued supremacy of U.S. Naval forces in the 21st century.  The Strategy focuses and aligns Naval S&T with Naval missions and future capability needs that address the complex challenges presented by both rising peer competitors and irregular\/asymmetric warfare.\n\nThis PE supports both advanced technology research and near to mid-term transition opportunities.  The advanced research focus is primarily on high energy lasers, Electromagnetic Railgun (EMRG) development, Hyper Velocity Projectiles (HVP), high speed weapon propulsion, and electro-optic\/infrared (EO\/IR) sensor technologies. \n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "89.189"
                },
                "CurrentYear": {
                    "val": "104.513"
                },
                "BudgetYearOne": {
                    "val": "83.428"
                },
                "BudgetYearOneBase": {
                    "val": "83.428"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "92.396"
                },
                "CurrentYear": {
                    "val": "104.513"
                },
                "BudgetYearOne": {
                    "val": "95.753"
                },
                "BudgetYearOneBase": {
                    "val": "95.753"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "3.207"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "12.325"
                },
                "BudgetYearOneBase": {
                    "val": "12.325"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "4.325"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.847"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "7.842"
                                },
                                "BudgetYearOneBase": {
                                    "val": "7.842"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "4.483"
                                },
                                "BudgetYearOneBase": {
                                    "val": "4.483"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-8.271"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional Add Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "10.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Not applicable.\n\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0000"
                    },
                    "ProjectTitle": {
                        "val": "Power Proj Applied Research"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "83.229"
                        },
                        "CurrentYear": {
                            "val": "104.513"
                        },
                        "BudgetYearOne": {
                            "val": "95.753"
                        },
                        "BudgetYearOneBase": {
                            "val": "95.753"
                        },
                        "BudgetYearTwo": {
                            "val": "112.521"
                        },
                        "BudgetYearThree": {
                            "val": "133.344"
                        },
                        "BudgetYearFour": {
                            "val": "174.974"
                        },
                        "BudgetYearFive": {
                            "val": "181.478"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project addresses the technology issues involving the Navy's capability to project naval power on the broad seas and in the littoral regions."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "DIRECTED ENERGY"
                                    },
                                    "Description": {
                                        "val": "The goal of this activity is to develop Directed Energy (DE) technology for Navy applications. The DE program addresses the requirements of future Navy combatants to provide ship defense against the emerging threats that are proliferating throughout the Navies of the world. The Directed Energy portion of this activity consists of two elements. The first element involves applied research and development of technologies supporting advanced accelerators with applications to directed energy weapons. This activity also includes the Free Electron Laser (FEL) Innovative Naval Prototype (INP) which will deliver multi-mission capability. \n\n \nFY 2013 to FY 2014 and FY 2014 to FY 2015 increases in funding are due to increased work on the Solid State Laser (SSL) program. The SSL-QRC program was initiated during FY 2013 and is planned to complete during FY 2015 with plans to demonstrate the system at sea in CY 2014."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "29.569"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Directed Energy and Accelerator Research:\n- Continued to develop the most promising component technologies such as normal conducting and super conducting RF electron beam injectors, advanced high power cathode technologies, high power compact amplifiers, and advanced mirrors, coatings and optical components capable of handling the significantly higher energies. Consider analysis of smaller FEL system designs.\n\nApplied Electromagnetics for High Power Weapons:\n-Completed the development of Gallium Nitride as an advanced nonlinear optic material. \n-Completed applied research into applied electromagnetics as it relates to lasers, high power microwaves, and advanced sensors for Directed Energy Weapons. \n\nSolid State Laser - Technology Maturation (SSL-TM):\n-Initiated the development of technologies suitable for a solid state laser weapon system, including technologies for maritime beam director, targeting and laser subsystems, which are capable of supporting future Navy missions to defeat small boat swarms, UAV swarms, and provide potential ISR disruption and\/or defeat.  This work supports future prototype developments and will include laser subsystem (potentially both slab and fiber solid state systems) and required beam director scientific studies. The focus of the effort will be to support the development and advancement of future Navy Solid State Laser prototypes, including the development of lethality studies and atmospheric characterization. These scientific studies are critical to understand and support missions identified for a layered defensive capability, in the maritime environment, which shall include robust modeling and simulation of atmospheric absorption and turbulence.\n-Conducted lethality testing for notional solid state laser designs. This will include scientific studies of laser erosion, pitting, and ablation of various target materials for improved modeling and simulation, that will support development of the governing technical requirements for a beam director and targeting system capable of performing Navy surface ship self defense missions.  \n-Initiated and conducted studies of atmospheric absorption and turbulence, suitable to evaluate notional maritime beam director subsystems, and including studies in adaptive optics for improved lethality performance in low altitude, maritime surface conditions. These scientific studies are critical to understanding the impact of boundary layer and sea-water-air turbulent mechanics on future laser weapons systems and interfaces.\n-Initiated and conducted trade studies on innovative solid state laser subsystems designs, based off industry available technologies or those technologies identified by the High Energy Laser Joint Technology Office (HEL JTO). These investments will be considered \"break through\" type of investments, which require additional scientific study to determine their potential for  near term capability improvements in a future naval prototype system.\n-Initiated and conducted scientific studies on laser subcomponents, including laser pump diodes and laser gain media, which have the potential to support future acquisition programs, but are based on solid state laser technologies. Efforts in this area will focus on emerging commercial technologies and government sponsored research, which are suitable for use in a maritime domain. Research and technology developments will include advancements suitable for use by either solid state slab or solid state fiber optic laser subsystems - and which if matured, would enable rapid scientific advancements and improve specific systems performance against key performance parameters.\n-Initiated and conducted scientific trade studies of notional predictive avoidance systems, which examine the control interfaces between sensors and future prototypical naval laser weapons, which would provide an inherent \"safe-arm\" function for the projecting of laser power at long range (potentially beyond typical visible, line of sight distances.) Of particular concern is the designs for safety in future laser weapons to halt laser energy propagation, while performing Navy surface ship self defense missions, and avoid inadvertent illumination of non-threat forces (e.g. friendly sensors or platforms.)"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "40.350"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Directed Energy and Accelerator Research:\n-Continue all efforts of FY 2013 unless noted as completed above.\n\nSolid State Laser - Technology Maturation (SSL-TM): \n-Continue all efforts of FY 2013 unless noted as completed above.\n-Complete Concept Design Phase (Phase I) and Concept Design Review (CODR).  Results of the CODR will be used to identify contractors and concepts for continuation in Phase II.  Phase II will develop a detailed design and will include a Preliminary Design Review (PDR) during FY14 and a Critical Design Review during FY15 (CDR).\n-Initiate land based testing and evaluation of SSL Advanced Beam Director prototypes which have been ruggedized and suitable for long term exposure to a maritime environment as will be seen by naval combatants."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "40.470"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "40.470"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Directed Energy and Accelerator Research:\n-Continue all efforts of FY 2014 unless noted as completed above. \n\nApplied Electromagnetics for High Power Weapons: \n-Program was completed in FY 2013. \n-Complete the development of Gallium Nitride as an advanced nonlinear optic material. \n\nSolid State Laser - Technology Maturation (SSL-TM): \n-Continue all efforts of FY 2014 unless noted as completed above.\n-Conduct component and subcomponent laboratory tests.  \n-Complete Critical Design Phase, CDR and begin fabrication of Full SSL TM System.  Results from CDR may be used to identify contractors and concepts for continuation during Phase III of the program.  Phase III will include fabrication of a full laser weapons systems, shipboard integration, land based testing and sea based testing on a navy surface combatant at sea during FY 2016\/2017."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HIGH SPEED PROPULSION AND ADVANCED WEAPON TECHNOLOGIES"
                                    },
                                    "Description": {
                                        "val": "The high speed weapons work in this activity is focused on demonstrating propulsion and vehicle technologies for Mach3+ to Mach8 capable weapons.  This work includes technologies associated with high acceleration capable projectile structures, high temperature and high strength materials to enable projectiles to survive high speed launch environment, improved thermal prediction methodologies and test techniques, wide dynamic pressure adaptable projectile controls and non-explosively launched lethal mechanisms. The high speed projectile technologies are intended to support long range Naval Surface Fire Support weapons. \n \nFY 2014 to FY 2015 decrease is due to transition of the Hypervelocity Projectile to an FNC program PE's 0602750N and 0603673N."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.923"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continued effort to develop advanced guidance and control technologies for high speed weapons.\n-Initiated high temperature capable thermal management, insulator and ablative technology investigations.\n-Continued high speed propulsion and integrated airframe technology development to enhance system range, responsiveness and reliability.  \n-Continued investigations into advanced material solutions to high speed airframes and air systems operating in maritime environments.\n-Continued high temperature capable thermal management, insulator and ablative technology investigations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.427"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue all efforts of FY 2013 unless noted as completed above.\n-Initiate technology maturation of advanced airframes and controls, high gee components and miniaturization of electronics."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.919"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.919"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue all efforts of FY 2014 unless noted as completed above.\n-Transition HVP program to an FNC.\n-Initiate high speed hypersonic weapons technology program to provide exploratory development of enabling very long range hypersonic boost-glide missiles and hypersonic ship-launched projectiles. \n-Initiate development of advanced computational and experimental techniques for hypersonic boundary layer transition.\n-Initiate High Temperature thermal management research.\n-Initiate Ultra-high temperature materials research for hypersonic leading edges and nose tips."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "NAVIGATION, ELECTRO OPTIC\/INFRARED (EO\/IR), AND SENSOR TECHNOLOGIES"
                                    },
                                    "Description": {
                                        "val": "This activity describes Navy Science and Technology (S&T) investments in the areas of EO\/IR devices and advanced sensors and includes investment\/performance in the technology areas of Electronics, Electronic Warfare, and Communications. \n\nThe decrease from FY 2013 to FY 2014 is due to transfer of funding and associated efforts supporting the NEMESIS development of RF EW payloads for unmanned aerial systems to PE 0602271N, and transfer of NEMESIS development of distributed control, coordination, and networking of payloads and platforms to PE 0602235N."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.251"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Electro Optic\/Infrared:\n-Completed effort to develop power scaling of interband and quantum cascade lasers for mid-wave and long-wave infrared spectral bands. \n-Initiated development of structured dielectric elastomers for electromechanical devices and deformable optics. \n-Initiated development of magneto-optic materials and ultra-high sensitivity, room-temperature magnetic field sensors. \n\nElectronic Warfare:\n-Completed evaluation of long-range power beaming capabilities using high-power CW fiber lasers and advanced laser power converters to increase the flight duration and operational capabilities of EW UAVs.\n-Completed the development of technologies for autonomous in-flight reconfiguration to increase flight endurance of EW UAS. \n-Completed effort to develop germanium optical detectors on silicon substrates for high power density, high frequency applications. \n-Initiated efforts for LA - Unmanned Aerial System (UAS) Based EW:  The objective  is to develop a System of Systems (SoS) able to artificially create the appearance of a realistic naval force to many adversary surveillance and targeting sensors simultaneously. It will benefit the warfighter by providing battlespace confusion to adversary surveillance and targeting systems both above and below water, creating seamless cross-domain countermeasure coordination, and enabling rapid advanced technology\/capability insertion to counter emerging threats. Technology developments will include reconfigurable and modular EW payloads, Distributed Decoy and Jammer Swarms (DDJS), effective acoustic countermeasures (CM), and Multiple Input\/Multiple Output Sensor\/CM (MIMO S\/CM) for false force generation to both above and below water sensors.\n-Continued development of ultra low noise uncooled nanotechnology infrared sensors.\n-Continued development nanoatomic sensor nonvolatile memories.\n-Continued development of electronic field of view and zoom imagers.\n-Continued the development of an active optics system that can survey a wide area and instantly, non-mechanically zoom-in on an area of interest for target tracking\/identification.\n-Continued development of new processes\/methodologies to enable construction of composite countermeasures that fit the engagement timeline while maintaining effectiveness against existing and emerging IR guided threats.\n-Continued effort to develop mid & long wave IR focal plane arrays using graded-bandgap W-type-II. Superlattices with much higher detectivity than that of state-of-the-art HgCdTe (MCT).\n-Initiated development and prove a method of more efficiently transporting EW sensors using a low Reynolds Number regime boundary layer control system.\n-Initiated the development of a water assisted take-off process for electronic warfare sensors."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.432"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Electronic Warefare:\n-Continue all efforts of FY 2013 unless noted as completed above.\n-Complete development and prove a method of more efficiently transporting EW sensors using a low Reynolds Number regime boundary layer control system."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.882"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.882"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Electronic Warfare: \n-Continue all efforts of FY 2014 unless noted as completed above. \n-Complete development and prove a method of more efficiently transporting EW sensors using a low Reynolds Number regime boundary layer control system.\n-Complete the development of a water assisted take-off process for electronic warfare sensors."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "STRIKE AND LITTORAL COMBAT TECHNOLOGIES"
                                    },
                                    "Description": {
                                        "val": "The focus of this activity is on those technologies that will support Naval Precision Strike Operations and provide the Navy of the future the ability to quickly locate, target, and strike critical targets ashore."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.657"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Initiated the development and demonstration of new Electronic Protection (EP) techniques that can discriminate advanced jamming false targets from true targets and also suppress false targets so that true targes can be readily detected.\n-Continued development of multistatic electronic protection techniques against advanced jamming systems.\n\nEnhanced Weapon Technologies:\n-Continued three new products to expand current Counter Air \/ Counter Air Defense capabilities by providing improved range and end-game maneuverability while decreasing Time-of-Flight. Specific tasks to begin design and development phase are: Counter Air Advanced Medium-Range Air-to-Air Missile (AMRAAM) Improvements \/ Counter Air Defense \/ Improvement \/ High Speed Components.\n-Continued development and apply emerging technologies that support delivery of Technology Oversight Group approved FNC enabling capabilities structured to close operational capability gaps in power projection; package emerging power projection technologies into deliverable FNC products and ECs that can be integrated into acquisition programs within a five year period; and mature power projection technologies that support naval requirements identified within the Sea Strike and FORCEnet naval capability pillars.\n\nStrike Accelerator:\n-Continued Strike Accelerator program. This effort will provide an advanced airborne capability to accurately identify targets using Advanced Target Recognition (ATR). These capabilities are utilizing the F\/A-18 E\/F, AESA (Active Electronically Scanned Array) Radar and ATFLIR (Advanced Targeting Forward Looking Infrared) sensors.\n\nMulti-Target Laser Designator:\n- Continued research for advanced optical techniques to defeat SWARM attacks.\n\nSelectable Output Weapon:\n- Continued Selectable Output Weapon Sea Strike Project\n\nHigh Energy Fiber Laser System:\n- Continued development an advanced laser beam control, pointing mechanism and power subsystem to support an airborne laser weapon system. This system will provide the detection and defeat of current and future threats."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.769"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue all efforts of FY 2013 unless noted as completed above."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.763"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.763"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Increased Capability Against Moving and Stationary Targets:\n-Continue all efforts of FY 2014 unless noted as completed above.\n-Complete development of multistatic electronic protection techniques against advanced jamming systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "WMD DETECTION"
                                    },
                                    "Description": {
                                        "val": "The Chief of Naval Operations (CNO) in the Navy Strategic Plan (NSP) has directed that the Navy be able to combat Weapons of Mass Destruction (WMD) at sea and Maritime domain.  This activity addresses the development of key technologies for standoff detection of WMD's and component nuclear materials on ships at sea.  The program will develop and demonstrate technology for actively detecting fissile material and other weapons of mass destruction.\n  \nFY 2013 to FY 2014 decrease is due to realignment of funds to high priority requirements. FY 2014 to FY 2015 decrease is due to program completion."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.721"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Completed modeling and simulation efforts to determine the ability to use neutron activation analysis and passive detectors to locate smuggled nuclear weapons and material in maritime scenarios. \n-Completed investigation in using particle beam (neutrons and photons) to perform standoff detection of fissile material.\n-Completed the development of technologies for remote real time imaging of suspected WMD in a maritime environment for both Passive Detection and Active Interrogation, including laboratory and field testing. \n-Completed the development of technology for and conduct radiological WMD Detection from Naval UAV platforms. \n-Continued the technical development and testing of solid state high energy neutron detector without Helium 3. \n-Continued the development of a compact human portable Neutron Generator for enhanced mobile detection technology. \n-Continued field experiments for Passive Interrogation of SNM simulants using UUV's\n-Continued technology study of 3 Helium free silicon based replacement radiological detectors \n-Continued examination of CONOPS and strategies for supporting Naval Maritime Interdiction (MIO) and VBSS missions.\n-Continued development and testing of 3 Helium free silicon based replacement radiological detectors strategies for supporting Naval Maritime Interdiction (MIO) and VBSS missions.\n-Continued development of hand held and portable detector technology for maritime interdiction. \n-Completed radiological testing and active interrogation.\n\nDetection from unmanned underwater vehicles (UUVs)\n-Initiated the development of technology for and conduct radiological WMD Detection from Naval aviation platforms.\n-Initiated examination of system human dose limits and health effects of various Remote Stand Off Detection techniques.\n-Initiated acquisition of WMD Special Nuclear Materials (SNM) simulator from DOE.\n-Initiated high fidelity field testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.955"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue all FY 2013 plans unless noted as completed above.\n-Complete examination of CONOPS and strategies for supporting Naval Maritime Interdiction (MIO) and VBSS missions.\n-Complete the technical development and testing of solid state high energy neutron detector without Helium 3. \n-Complete the development of a compact human portable Neutron Generator for enhanced mobile detection technology. \n-Complete field experiments for Passive Interrogation of SNM stimulants using UUV's.\n-Continue development and testing of 3 Helium free silicon based replacement radiological detectors strategies for supporting Naval Maritime Interdiction (MIO) and VBSS missions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "ELECTROMAGNETIC GUNS"
                                    },
                                    "Description": {
                                        "val": "This activity is the Electro Magnetic (EM) railgun program that is focused on developing the technology to launch a long range projectile from Navy ships. EM railgun is being considered for multi-mission applications including USMC Naval Surface Fire Support, anti-surface warfare (ASUW) and ship self defense from missiles and small boat threats.\n\nFY 2013 to FY 2014 and FY 2014 to FY 2015 increase is due to planned pulsed power development and fabrication required to support repetitive rate testing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "24.108"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continued launcher development. \n-Continued material, physics and thermal property research for single shot launchers, pulsed power and projectiles for 32MJ muzzle energy launch; and initiated assessments from next generation, rep rate, and operational environments. \n-Continued IPT and Bore Life Consortium collaborations for 32 MJ launchers.\n-Continued material applications and component design assessments for next generation repetitive fires.\n-Initiated development of modeling and simulation capability to support bore life development and testing for rep rate bore life development assessments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "40.580"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue all efforts of FY 2013 unless noted completed above.\n-Initiate additional next generation pulsed power fabrication as part of a multi-module, multi-year build to increase full scale rep rate capability from 20MJ to 32MJ muzzle energy capability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "46.719"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "46.719"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue all FY 2014 efforts"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "This PE develops early components technologies that can be integrated into weapon systems that meet warfighter requirements.  Most of the work in this PE can be classified between Technology Readiness Level (TRL) 2 (technology concept and\/or application formulation) and TRL 4 (component and\/or breadboard validation in laboratory environments).  The metrics used to evaluate 6.2 programs are necessarily less precise than those used in 6.3 programs. \n\nThe metrics for this PE can be divided into two categories:  technological and organizational\/functional.  Technological metrics address the success of the work performed.  The primary technological metrics used in this PE involve laboratory experiments\/tests demonstrating proof of the concept for the technology.  This demonstration is frequently a hand-assembled functioning breadboard of the concept.  The organizational\/functional metrics applied to this PE include:  transition of the technology to advanced development in a 6.3 PE and applicability of the technology to documented warfighter problems or requirements.  Successful implementation of these categories would result in the application of a pass\/fail metric and further evaluation for possible transition to a 6.3 development\/demonstration program."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "9999"
                    },
                    "ProjectTitle": {
                        "val": "Congressional Adds"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "9.167"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "9.167"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Items not included in other Projects."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Power Proj Applied Research (Cong)"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "9.167"
                                        },
                                        "Text": {
                                            "val": "The UTC initiative continued to design, develop, integrate, test and demonstrate a gun hardened Guidance, Navigation, Control and Targeting (GNC&T) system.  UTC was leveraging its technologies and system components to enhance the value added for precision guided munitions.  As part of the initiative, UTC is developing a shortwave infra-red (SWIR) low cost multimode seeker.  Employing advanced technologies inherent in reconnaissance cameras these devices serve as both a superior semi-active laser (SAL) and a high resolution imaging seeker.  In FY13, UTC submitted milestone deliverables with a summary system technical data package complete with functional flow diagrams, performance requirements, and system architecture. UTC delivered a prototype SWIR seeker complete with performance predictions based on field test data.   The remainder of FY13 focused on integration and functionality into a compact, miniaturized modular seeker configuration and engineering builds and testing in laboratory environments and supersonic rocket testing to collect additional survivability and performance characteristics."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Congressional Add"
                        }
                    }
                }
            ]
        }
    }
}