{
    "id": "095f8314ff3e79e26725bf3cb57adac95eb6ad00",
    "meta": {
        "filename": "dod-2015_RDTE_2015_TJS_RDTE_JustificationBook_The_Joint_Staff_PB_2015.zzz_unzipped_RDTE_JustificationBook_The_Joint_Staff_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "The Joint Staff",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0902298J"
        },
        "ProgramElementTitle": {
            "val": "Management Headquarters"
        },
        "R1LineNumber": {
            "val": "241"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "The Joint Staff"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "5.537"
            },
            "PriorYear": {
                "val": "4.148"
            },
            "CurrentYear": {
                "val": "3.475"
            },
            "BudgetYearOne": {
                "val": "4.409"
            },
            "BudgetYearOneBase": {
                "val": "4.409"
            },
            "BudgetYearTwo": {
                "val": "2.978"
            },
            "BudgetYearThree": {
                "val": "1.010"
            },
            "BudgetYearFour": {
                "val": "1.055"
            },
            "BudgetYearFive": {
                "val": "1.055"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "4.148"
                },
                "CurrentYear": {
                    "val": "3.533"
                },
                "BudgetYearOne": {
                    "val": "5.530"
                },
                "BudgetYearOneBase": {
                    "val": "5.530"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "4.148"
                },
                "CurrentYear": {
                    "val": "3.475"
                },
                "BudgetYearOne": {
                    "val": "4.409"
                },
                "BudgetYearOneBase": {
                    "val": "4.409"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "-0.058"
                },
                "BudgetYearOne": {
                    "val": "-1.121"
                },
                "BudgetYearOneBase": {
                    "val": "-1.121"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.058"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Change"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-1.121"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.121"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P001"
                    },
                    "ProjectTitle": {
                        "val": "Joint Staff Information Network (JSIN)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "5.537"
                        },
                        "PriorYear": {
                            "val": "4.148"
                        },
                        "CurrentYear": {
                            "val": "3.475"
                        },
                        "BudgetYearOne": {
                            "val": "4.409"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.409"
                        },
                        "BudgetYearTwo": {
                            "val": "2.978"
                        },
                        "BudgetYearThree": {
                            "val": "1.010"
                        },
                        "BudgetYearFour": {
                            "val": "1.055"
                        },
                        "BudgetYearFive": {
                            "val": "1.055"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Management Headquarters provides the day-to-day financial resources necessary to support The Joint Staff (TJS) operations.  Across TJS, Management Headquarters supports various efforts including network infrastructure, civilian pay accounts, supplies, travel, training, portfolio management, business process reviews, and transformation initiatives.  TJS is transitioning to the Joint Information Environment (JIE) framework to achieve full spectrum superiority, improve mission effectiveness, increase security, and realize IT efficiencies."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Staff Information Network (JSIN)"
                                    },
                                    "Description": {
                                        "val": "Provides RDT&E funds for the Joint Staff Information Network (JSIN).  JSIN is the network infrastructure (for both classified and unclassified information) enabling collaboration and information-sharing among the Joint Staff, Combatant Commands (CCMD) and the Services.  The JSIN also provides crucial business-related, decision-making information and workflow support affecting military operations in support of the JCS.  JSIN improves actions processing for faster coordination of critical issues with CCMDs, Services, and Agencies, as well as within TJS."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.148"
                                            },
                                            "Text": {
                                                "val": "Provided support to Joint Staff Information Technology initiatives including planning for the migration and assumption of partial Service desk operations by the US Army Information Technology Agency, planning for Verification, Design and Implementation (VDI), Desktop, Server and Application Virtualization (S), transition to multi-domain Consolidated Data Center (CDC) planning; Cross Domain Services Initial Operational Capability (IOC), Enterprise Content Management (U), Mobile Computing solutions, Unified Communications Capabilities, Enterprise Services Implementation and Joint Information Environment (JIE) planning and implementation, Identity and Access Management capabilities; reduction and consolidation of JS print capabilities and classified Secure Terminal Equipment (STE) reduction to achieve efficiencies, improve mission effectiveness, and strengthen our security posture.  \n\nOptimization, closing, or realigning use of data centers with virtualization methods and evaluations, improved tools and visibility to virtual platforms, and researching improved ways to obtain hosting services.  Provided evaluations technology with consideration for the potential to become an enterprise service.  Refined tracking of costs and decision making through the Portfolio Management Repository, capturing inputs, and validation across the Joint Staff."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.475"
                                            },
                                            "Text": {
                                                "val": "Provide planning and support to Joint Staff Information Technology initiatives, including continued Defense Enterprise Computing Center (DECC) migration for JS applications, Thin Client (U) and Mobile Computing, Defense Enterprise Portal Services (DEPS) (S), continue Application Virtualization (S) and (U), Cross Domain Services Full Operational Capability (FOC), DISA Enterprise Content Management (DECMS) (U) optimization and integration, Mobile Computing solutions, Unified Communications Capabilities transition to VOIP\/VoSIP, Enterprise Services Implementation including Enterprise Task Management (U\/S), JS Service Desk optimization implementation, Identity and Access Management capabilities and Cloud Computing readiness to achieve efficiencies, improve mission effectiveness, and strengthen our security posture."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.409"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.409"
                                            },
                                            "Text": {
                                                "val": "Provide planning and support to Joint Staff Information Technology initiatives, including continued migration for Service Desk operations to the US Army Information Technology Agency and JS applications, refinement of Thin Client (U) and Mobile Computing solutions, Application Virtualization (S) and (U), Cross Domain Services FOC, Enterprise Content Management  and Task Management (U) optimization and integration through JIE, on-going STE transition to Secure VOIP\/VoSIP, Enterprise Services Implementation including Enterprise Task Management (U\/S), Identity and Access Management capabilities, implementation of a Managed Print Service (MPS), and consideration of DoD cloud services for achieving efficiencies, improved mission effectiveness, and strengthening our security posture.  Track JIE definitions and architecture for purposes of migration upon availability."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "(1) Reduce technical support hours per desktop a minimum of 10% through deployment of thin client and virtualized management of the IT baseline.\n(2) Avoid cost for technology refresh of NIPR and SIPR desktops via the proper planning, testing and piloting of a Joint Staff Thin Client solution.\n(3) Reduce the cost of building, operating, and maintaining Joint Staff specific solutions through implementation of enterprise capabilities and adoption of new cost models for execution (Enterprise Task management, Unified Communications, JIE, and MPS).\n(4) Reduce redundancies in Core and Mission IT Capabilities through implementation of a comprehensive Portfolio management policy and avoid cost through the institutionalization of investment management governance model."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Contract Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SPAWAR"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Washington, DC"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "5.537"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.179"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.497"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "4.409"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "4.409"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Contract Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SPAWAR"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Washington, DC"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.969"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.978"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}