{
    "id": "09bdb88d87bc2f7c1cb4195f2feab4e0056d4ae9",
    "meta": {
        "filename": "dod-2015_RDTE_2015_NAVY_BA7_RDTE_JustificationBook_Navy_PB_2015.zzz_unzipped_RDTE_JustificationBook_Navy_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0203761N"
        },
        "ProgramElementTitle": {
            "val": "Rapid Technology Transition (RTT)"
        },
        "R1LineNumber": {
            "val": "176"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "68.227"
            },
            "PriorYear": {
                "val": "21.906"
            },
            "CurrentYear": {
                "val": "8.561"
            },
            "BudgetYearOne": {
                "val": "12.480"
            },
            "BudgetYearOneBase": {
                "val": "12.480"
            },
            "BudgetYearTwo": {
                "val": "26.096"
            },
            "BudgetYearThree": {
                "val": "25.821"
            },
            "BudgetYearFour": {
                "val": "26.292"
            },
            "BudgetYearFive": {
                "val": "26.828"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "NOTE TO FMB:  The R2 Titled should be changed to Technology Insertion Program for Savings (TIPS) prior to Pres Bud submission to reflect the remaining R&D project within the PE that is funded. \n\n\nMISSION: \nRTT programs transition technology from any source, including those not traditionally associated with defense technology. An effective and robust integration of commercial and military technologies can reduce costs and improve naval capabilities by keeping pace with the fast moving changes in technologies and operational needs. The RTT program is comprised of three elements: The Rapid Technology Transition (RTT) program, the Technology Insertion Program for Savings (TIPS), and the Rapid Development and Deployment (RDD) program. The RTT and TIPS programs are structured to bring transition deals to closure quickly, and to provide execution year funding for a rapid start, bridging the gap until the program of record can fund the completion of the technology insertion. The RDD program is structured to quickly develop a prototype solution that will be deployed in theater for Naval forces engaged in Overseas Contingency Operations (OCO).\n\nThe mission of the RTT program is to increase the rate that new, innovative, and potentially disruptive technologies are inserted into Department of Navy (DON) acquisition programs and the hands of the warfighter. \n\nThe mission of the TIPS program is to increase the rate that new cutting edge technologies are inserted into DON acquisition programs in order to significantly reduce operations and maintenance support costs.\n\nThe RDD program provides for the rapid development and fielding of prototype solutions to meet urgent operational needs. The RDD process applies when existing DON processes cannot meet urgent operational needs. Overseas Contingency Operations (OCO) have generated rapidly evolving military needs that require responsive materiel solutions. \n\nRapid transition opportunities occur when a sufficiently mature technology is identified that can meet a particular need on a timetable which matches that of an acquisition program, and is supported by a business case which justifies the associated cost and schedule risk. The combination of circumstances which create such opportunities can appear, and disappear, well inside the Program Objectives Memorandum (POM) cycle. These programs are designed to be proactive in identifying opportunities and to work with resource sponsors, fleet and force users, and Program Managers (PMs) in constructing viable technology transition deals one at a time. \n\nTo ensure the widest possible awareness of emergent commercial technology opportunities, these programs interact with the industry and coordinate closely with Program Executive Offices (PEOs) and Program Managers (PMs) to maintain awareness of insertion opportunities. Utilizing existing authorities, RTT applies execution year funds where necessary to \"jump-start\" transitions so they can be inserted and validated by Sea Trial experiments leading directly to deployment and\/or demonstrations of high risk\/high payoff technologies. This Program Element is the only Navy program that addresses current, urgent requirements that are required by the fleet within a 18-24 month period. As such, planning and execution are accomplished within the same fiscal year, which causes a non-traditional financial execution profile for the program. The program therefore does not meet traditional execution benchmarks.\n\nHigher Navy priorities result in the termination of the RTT program in 2014.\n\nThe  Technology Insertion Program for Savings (TIPS) transitions technology from any source, including those not traditionally associated with defense technology. An effective and robust integration of commercial and military technologies can reduce costs by keeping pace with the fast moving changes in technologies and operational needs. The TIPS program is structured to bring transition deals to closure quickly, and to provide execution year funding for a quick start, bridging the gap until the program of record can fund the completion of the technology insertion.\n\nThe mission of the TIPS program is to increase the rate that new cutting edge technologies are inserted into DON acquisition programs in order to significantly reduce operations and maintenance support costs. Opportunities occur when a sufficiently mature technology is identified that can meet a particular need on a timetable which matches that of an acquisition program, and is supported by a business case which justifies the associated cost and schedule risk. The combination of circumstances which create such opportunities can appear, and disappear, well inside the Program Objectives Memorandum (POM) cycle. This program is designed to be proactive in identifying opportunities and to work with resource sponsors, fleet and force users, and Program Managers (PMs) in constructing viable technology transition deals, one at a time. To ensure the widest possible awareness of emergent commercial technology opportunities, this program interacts with the industry and coordinate closely with Program Executive Offices (PEOs) and Program Managers (PMs) to maintain awareness of insertion opportunities. Utilizing existing authorities, TIPS applies execution year funds where necessary to \"jump-start\" transitions so they can be inserted and validated leading directly to deployment and\/or demonstrations of high risk\/high payoff technologies. This Program Element is the only Navy program that addresses current opportunities to reduce operations and support (O&S) cost drivers within a 18-24 month period. As such, planning and initiation are accomplished within the same fiscal year, which causes a non-traditional financial execution profile for the program. The program therefore does not meet traditional execution benchmarks. \n\nFunding increase to the TIPS reflects emphasis on increasing the number of projects that reduce operations and support costs."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "25.566"
                },
                "CurrentYear": {
                    "val": "13.561"
                },
                "BudgetYearOne": {
                    "val": "17.165"
                },
                "BudgetYearOneBase": {
                    "val": "17.165"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "21.906"
                },
                "CurrentYear": {
                    "val": "8.561"
                },
                "BudgetYearOne": {
                    "val": "12.480"
                },
                "BudgetYearOneBase": {
                    "val": "12.480"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-3.660"
                },
                "CurrentYear": {
                    "val": "-5.000"
                },
                "BudgetYearOne": {
                    "val": "-4.685"
                },
                "BudgetYearOneBase": {
                    "val": "-4.685"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-5.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.963"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.469"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-4.685"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-4.685"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-2.228"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Not applicable.\n\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "3126"
                    },
                    "ProjectTitle": {
                        "val": "Rapid Technology Transition (RTT)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "40.807"
                        },
                        "PriorYear": {
                            "val": "10.374"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "51.181"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The mission of the RTT project is to increase the rate that new, innovative, and potentially disruptive technologies are inserted into DON acquisition programs and the hands of the warfighter.  A key aspect of the RTT project is its charter to transition technology from any source, including those not traditionally associated with defense technology.  An effective and robust integration of commercial and military technologies can reduce costs and improve naval capabilities by keeping pace with the fast moving changes in technologies and operational needs.  The RTT project is structured to bring transition deals to closure quickly, and to provide execution year funding for a rapid start, bridging the gap until the program of record can fund the completion of the technology insertion.\n\nThe RTT program has been terminated at the end of FY 2013 and funding religned to higher naval priorities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RAPID TECHNOLOGY TRANSITION (RTT)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.374"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued the following RTT projects: \t \n- T64 Prognosis\/Diagnosis Based Management (PDBM) \t \n- Integrated Laser Designator\/Rangefinder for the M1A1 Tank \t \n- Integrated Variable Message Format (VMF) in the E-2 Hawkeye.\n- Secure Communications Controller\n- VVoSIP and Call Management for Afloat Networks\n- Unit-Level ISR&T for DCGS-N\n- Tactical Transfer Cross-Domain Solution Device\n- Calibration and Certification of MAC Sensors for Intelligence Data Collection\n- High Gain Broadband (Graywing) Shipboard IO Antenna\n- Image Based Navigation for Tomahawk Block IV Cruise Missile (ImageNav)  \n- Disruptive Tolerant Networking  \n- Seal Delivery Vehicle (SDV) Umbilical management System (UMS)  \n- Maritime Radar Processor (MRP) RTT\n- Graywing and SSEE Mods Broadband Amplifier\n- Fire Resistant Nanocomposite Coating\n- Advanced Special Communications Waveform  In  MARCOR Radios (ASWIMR)\n- CBSP VIPERSAT\n- Automated Transparency Refurbishment (ATR)\n- Naval Superstructure Cracking Due to Aluminum Sensitization\nInitiated 2 RTT projects to improve Naval Warfighting capability.\nInitiated program shut down."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Utilize existing authorities on a case-specific basis to exploit rapid technology transition opportunities."
                        },
                        "PerformanceMetrics": {
                            "val": "The RTT program will initiate new project each year that provide for new, innovative, and potentially disruptive technology being inserted into DON acquisition programs.  The RTT deals will have a greater than 80% success rate of insertion and fielding of technology into DON warfighting systems."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3173"
                    },
                    "ProjectTitle": {
                        "val": "Technology Insertion Program for Savings (TIPS)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "16.745"
                        },
                        "PriorYear": {
                            "val": "11.318"
                        },
                        "CurrentYear": {
                            "val": "8.436"
                        },
                        "BudgetYearOne": {
                            "val": "12.480"
                        },
                        "BudgetYearOneBase": {
                            "val": "12.480"
                        },
                        "BudgetYearTwo": {
                            "val": "26.096"
                        },
                        "BudgetYearThree": {
                            "val": "25.821"
                        },
                        "BudgetYearFour": {
                            "val": "26.292"
                        },
                        "BudgetYearFive": {
                            "val": "26.828"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The mission of the Technology Insertion Program for Savings (TIPS) is to increase the rate that new cutting edge technologies are inserted into DON acquisition programs in order to significantly reduce operations and maintenance support costs.  The program is structured to quickly transition applicable commercial off-the-shelf solutions and late-stage development technologies from any source to meet an emerging opportunity.  TIPS provides execution year funding for a rapid start, bridging the gap until the program of record can fund the completion of the technology insertion.\n\nFunding decrease from FY13 to FY14 resulting from CNO higher priority or requirements\nFunding increase from FY14 through FY15 reflects emphasis on increasing the number of projects that reduce operations and support costs."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "TECHNOLOGY INSERTION PROGRAM FOR SAVINGS (TIPS)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.318"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued the following TIPS projects:\n- Composite Patch Technology\n- Global Ammunition Strategic Positioning Model (GASPM)\n- Backscatter X-ray for F-18 Depot Level Structural Inspection\n- Revolutionary Low FOD Drogue\n- Initiate 6-8 new TIPS projects to improve naval warfighter capabilities"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.436"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue efforts from FY 2013 unless otherwise noted as complete.\nInitiate 6-8 new TIPS projects to improve naval warfighter capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.480"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.480"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue efforts from FY 2014 unless otherwise noted as complete.\nInitiate 6-8 new TIPS projects to improve naval warfighter capabilities."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Utilize existing authorities on a case-specific basis to exploit rapid technology transition opportunities."
                        },
                        "PerformanceMetrics": {
                            "val": "The TIPS program will initiate new projects each year that provide for new, innovative, and potentially disruptive technology being inserted into DON acquisition programs.  The TIPS projects will have a greater than 80% success rate of insertion and fielding of technology into DON warfighting systems and\/or operations and support cost efforts."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3174"
                    },
                    "ProjectTitle": {
                        "val": "Rapid Development and Deployment (RDD)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "10.675"
                        },
                        "PriorYear": {
                            "val": "0.214"
                        },
                        "CurrentYear": {
                            "val": "0.125"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "11.014"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Rapid Development and Deployment (RDD) provides an environment and process for rapid development and fielding of prototype solutions to meet urgent operational needs.  The RDD process applies when existing DON processes cannot meet urgent operational needs.  Overseas Contingency Operations (OCO) have generated rapidly evolving military needs that require responsive materiel solutions.  RDD is a fast track process for application, by exception, to Navy and USMC capability needs and materiel solutions that meet the following criteria:  (1) Need identified during active or incipient combat or contingency operation, or (2) Need derived from combat survivability of the warfighter or impacts the success of the mission.  RDD initiates projects to deliver prototype solutions that are not readily available off-the-shelf and that can be developed, integrated with other components and systems (as necessary), tested, and fielded within 270 days of need approval.  RDD provides startup funds to initiate projects that meet the above criteria while other funding is made available within the year of execution. Rapid Development and Deployment (RDD) provides an environment and process for rapid development and fielding of prototype solutions to meet urgent operational needs."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RAPID DEVELOPMENT AND DEPLOYMENT (RDD)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.214"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued MV-22 Traffic Collision Avoidance System (TCAS) efforts.\nComplete the V-22 Windscreen Durability Improvements.\nInitiate shutdown of the RDD program office and integrate functions into ONR Technology Transition Office."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.125"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete shutdown of the RDD program office and integrate functions into ONR Technology Transition Office."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "For RDD requirements that meet the selection criteria, the virtual Rapid Development and Deployment Office (RDDO) is used to initiate projects.  The RDDO is a virtual organization operating across Naval Laboratories and Warfare Centers, with interfaces and\/or contractual agreements with other Military Services, Industry, Academia and the National Laboratory community.  The RDDO will bring together, on demand, multi-disciplinary teams to develop and deliver rapid, innovative solutions.  The RDDO will maintain visibility of available and emerging technologies from all sources that may serve as enablers to the success of RDD initiatives.  The RDDO will review Urgent Combat Needs, identify and evaluate alternative solutions and provide recommendations.  The RDDO will include a rapid acquisition channel, consistent with all applicable procurement regulations, for access to industry products and services as needed.  For approved projects, the RDDO will select appropriate technologies, and develop, integrate, test, and deliver fieldable prototypes with the essential logistics for use by the warfighter.  End users will be involved throughout the process as part of the virtual team."
                        },
                        "PerformanceMetrics": {
                            "val": "The RDD program goal is to respond to urgent operational needs within 30 days and provide for rapid development and fielding of prototype solutions within 270 - 360 days."
                        }
                    }
                }
            ]
        }
    }
}