{
    "id": "0a4816be8a343ab20e8ac72604c76cbecf6a08d0",
    "meta": {
        "filename": "dod-2015_RDTE_2015_ARMY_BA7_RDTE_JustificationBook_Army_PB_2015.zzz_unzipped_RDTE_JustificationBook_Army_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0708045A"
        },
        "ProgramElementTitle": {
            "val": "End Item Industrial Preparedness Activities"
        },
        "R1LineNumber": {
            "val": "194"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "53.461"
            },
            "CurrentYear": {
                "val": "56.106"
            },
            "BudgetYearOne": {
                "val": "76.225"
            },
            "BudgetYearOneBase": {
                "val": "76.225"
            },
            "BudgetYearTwo": {
                "val": "56.824"
            },
            "BudgetYearThree": {
                "val": "59.215"
            },
            "BudgetYearFour": {
                "val": "55.437"
            },
            "BudgetYearFive": {
                "val": "55.873"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "FY 13 decreases attributed to Congressional General Reductions (-86 thousand); SBIR\/STTR transfers (-1542 million);\nand Sequestration reductions (-4819 million)\nFY15 funding increase for efforts in armor and sensor manufacturing technology."
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) develops and demonstrates manufacturing processes that enable improvements in producibility and affordability of emerging and enabling components and subsystems of Army air, ground, Soldier, and command\/control\/communications systems.  Initiatives within the PE result in cost savings and reduced risk of transitioning military-unique manufacturing processes into production.  Project E25 fosters the transfer of new\/improved manufacturing technologies to the industrial base, including manufacturing efforts that have potential for high payoff across the spectrum of Army systems. \n\nWork in this PE is related to, and fully coordinated with, PE 0603710A (Night Vision Advanced Technology), PE 0602303A (Missile Technology), PE 0602105A (Materials Technology), PE 0602618A (Ballistics Technology), PE 0602601A (Combat Vehicle and Automotive Technology), and PE 0603005A (Combat Vehicle and Automotive Advanced Technology) and PE 0602705A (Electronics and Electronic Devices).\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology focus areas and the Army Modernization Strategy. \n\nWork in this PE is performed by the Army Research, Development, and Engineering Command (RDECOM) and efforts are executed by the Army Research Laboratory (ARL) and appropriate Army Research, Development, and Engineering Centers (RDECs)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "59.908"
                },
                "CurrentYear": {
                    "val": "56.136"
                },
                "BudgetYearOne": {
                    "val": "60.866"
                },
                "BudgetYearOneBase": {
                    "val": "60.866"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "53.461"
                },
                "CurrentYear": {
                    "val": "56.106"
                },
                "BudgetYearOne": {
                    "val": "76.225"
                },
                "BudgetYearOneBase": {
                    "val": "76.225"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-6.447"
                },
                "CurrentYear": {
                    "val": "-0.030"
                },
                "BudgetYearOne": {
                    "val": "15.359"
                },
                "BudgetYearOneBase": {
                    "val": "15.359"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.086"
                    },
                    "CurrentYear": {
                        "val": "-0.030"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.542"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "15.359"
                                },
                                "BudgetYearOneBase": {
                                    "val": "15.359"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments 1"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-4.819"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "E25"
                    },
                    "ProjectTitle": {
                        "val": "Mfg Science & Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "53.461"
                        },
                        "CurrentYear": {
                            "val": "56.106"
                        },
                        "BudgetYearOne": {
                            "val": "76.225"
                        },
                        "BudgetYearOneBase": {
                            "val": "76.225"
                        },
                        "BudgetYearTwo": {
                            "val": "56.824"
                        },
                        "BudgetYearThree": {
                            "val": "59.215"
                        },
                        "BudgetYearFour": {
                            "val": "55.437"
                        },
                        "BudgetYearFive": {
                            "val": "55.873"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project develops and demonstrates manufacturing processes that enable improvements in producibility and affordability of emerging and enabling components and subsystems of Army air, ground, Soldier and command\/control\/communications\/intelligence systems. Focus is on components and subsystems such as advanced armor, power and energy devices, rotors, sensors, displays, propellants and gun tubes. In addition, work is conducted to advance the state of the art in processing and fabrication techniques for coatings, multifunctional materials and structural elements for Army specific applications.\n\nWork supports all Army S&T portfolios. Work in this PE is related to and fully coordinated with PE 0602105A (Materials Technology), PE 0602211A (Aviation Technology, PE 0602303A (Missile Technology), PE 0602601A (Combat Vehicle and Automotive Technology), PE 0602618A (Ballistics Technology), PE 0602705A (Electronics and Electronic Devices), PE 0603003 (Aviation Advanced Technology), PE 0603005A (Combat Vehicle and Automotive Advanced Technology) and PE 0603710A (Night Vision Advanced Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering S&T focus areas and the Army Modernization Strategy.   \n\nWork in this project is performed by the Army Research, Development and Engineering Command (RDECOM) and efforts are executed by the Army Research Laboratory (ARL) and appropriate Army Research, Development and Engineering Centers (RDECs)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Air Systems"
                                    },
                                    "Description": {
                                        "val": "This effort funds manufacturing technology advances needed for more affordable manned and unmanned aircraft components and subsystems. Work focuses on addressing challenges in areas such as engine performance and life, rotor and blade durability, reliable component integration\/attachment, structural durability at low weight, and reduced corrosion."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.400"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Demonstrated an advanced ceramic manufacturing process for the fabrication of Ceramic Matrix Composite (CMC) and Stage High Pressure Turbine (HPT) Shrouds for helicopter engines to reduce overall system weight and improve fuel consumption and reliability; developed manufacturing processes for the use of direct metal laser sintering to reduce cost and increase performance of complex components such as UAV turbine engine recuperators; demonstrated machining of rotary engine side seal grooves which will increase the reliability and performance of rotary engines for UAV applications; demonstrated a chemical etching technique for high performance flexible airborne antenna substrates by using lay-up processes to reduce touch labor and riveting issues resulting in significantly increased yield and reduced cost per missile; developed and demonstrated automated Plasma Assisted Chemical Vapor Deposition equipment and manufacturing procedures for the application of nanocrystalline diamond and amorphous carbon coatings for improved optical transmission for infrared devices, improved corrosion resistance, increased surface hardness, reduced friction, and increased wear performance on critical AH-64 and UH-60 helicopter components."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.100"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop machining, finishing and assembly processes for drive train and propulsion system components; demonstrate and transition an automated production system for applying nanocrystalline diamond and amorphous carbon coatings to Army aviation systems; develop advanced manufacturing and repair processes for composite structures; develop and demonstrate cost-effective repair of high-value drive shafts and power-train components using additive manufacturing techniques.  Develop manufacturing techniques and tooling for balistically tolerant fuel bladders, taking advantage of advanced modeling and simulation techniques, light-weight\/high performance materials and flexible tooling concepts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "Will continue development of manufacturing techniques and tooling for balistically tolerant fuel bladders; will investigate novel processing and machining techniques for reducing the cost and improving the performance of low-horse power heavy-fuel engines for UAV applications; will develop processes for rapidly manufacturing composite components that meet air-worthiness requirements for aviation systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ground Systems"
                                    },
                                    "Description": {
                                        "val": "This effort funds manufacturing technology advances needed for more affordable components and subsystems for tactical and combat vehicles and weapons systems. Work focuses on addressing challenges in areas such as advanced armor, gun barrel life, insensitive propellants, precision munitions and vehicle power devices."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.829"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Scaled-up manufacturing of high optical clarity Spinel armor plates up to 14 x 14 in size by using a sintered process to address both size and cost; developed low cost production and assembly processes of complex passive kinetic energy armors for combat vehicle systems; exploited forming\/forging\/joining technologies to enable fabrication of a single under-body design of high performance\/strength alloys for a blast resistant lower hull and underbody kits for combat vehicle systems; developed explosive loading processes, requiring no post-machining, inside warhead molding of insensitive munitions and fragment generating sleeves for the Extended Area Protection and Survivability (EAPS) system and next generation cluster munitions; developed a manufacturing process to reduce the cost and time associated with applying Ta-10W liners for medium and large caliber Chromium free cannon barrels; developed initial manufacturing processes for automated production of low cost, high power battery and fuel cell systems for manned and unmanned ground systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "26.910"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Demonstrate successful application of Ta-10W liners for medium and small-caliber barrels through live-fire demonstrations and evaluation of liner wear, transition the Ta-10W liner application process to Watervliet Arsenal for implementation; demonstrate increased yield and reduced missile antenna manufacturing cost through limited production runs and deliver process and technical data to the Cruise Missile Defense Systems Program Office for implementation on future missile systems; demonstrate safer and more cost effective processes for loading explosives in the 120mm Advanced Multi-Purpose munition through limited production runs and transition robust processes for the use of nano-particle field assisted sintering technologies (FAST) to reduce variability and improve fragmentation and performance of warhead liners for the EAPS system program; demonstrate a domestic production capability for producing Spinel powder materials and initiate pilot line production runs of sintered Spinel plates followed by integration of the Spinel plates into laminated transparent armor solutions for performance evaluation and production cost validation; scale up manufacturing of low-cost alumina-based ceramic tiles, improve 3D weaving technologies to integrate ceramic tiles of varying thicknesses and demonstrate production of large, single-piece underbody armor solutions to meet objective threat level ballistic requirements, demonstrating manufacturing process maturity for each technology through limited production runs; develop mature manufacturing processes for utilizing metal and polymer-based additive manufacturing processes to reduce prototyping and production times through rapid manufacturing, multi-material structures and rapid tooling development for ground vehicles; demonstrate selected high volume, cost effective, manufacturing processes for micro-electro-mechanical systems (MEMS) scale components to allow automated inspection and assembly for safety-and-arm systems; demonstrate gear machining and finishing processes and optimized assembly processes to increase throughput and yield while decreasing the cost for power-take-off systems; conduct batch manufacturing of granular IMX-104 to demonstrate scaled-up manufacturing process that reduces production costs and increases throughput and yield of IMX-104; continues development of manufacturing processes for automated production of low cost, high power battery and fuel cell systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "39.772"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "39.772"
                                            },
                                            "Text": {
                                                "val": "Will transition tooling and processes for applying Ta-10W liners to gun barrels for implementation on medium and small-caliber systems; will continue the demonstration of selected high volume, cost effective, manufacturing processes for micro-electro-mechanical systems (MEMS) scale components; will continue demonstration of gear machining and finishing processes and optimized assembly processes to increase throughput and yield while decreasing the cost for power-take-off systems; will develop equipment for automated assembly of ceramic tile-based armors, will mature automated material consolidation techniques for vehicle armor solutions; will demonstrate automated assembly process resulting in improved quality control, reduced assembly times and re-work issues, increased throughput and reduced cost of fuel cells for ground vehicle and soldier-born applications; will demonstrate low-cost, mature manufacturing processes by conducting limited production runs and prototype builds of advanced armor systems using low-cost ceramics, cast and forged steel and aluminum alloys and hybridized 3D woven composites; will demonstrate machining and post-processing techniques to drastically improve the yield and decrease the cost of tungsten-based penetrators; will continue demonstration of scaled-up manufacturing process of granular IMX-104 that reduces production costs and increases throughput and yield; will develop the ability to rapidly and cost-effectively repair high-cost machined items; will develop novel methods of producing and inspecting advanced armor system components for next generation ground vehicle applications; will develop novel packaging and processing techniques to enable weight and cost reductions in ground-based systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Lethality (Formerly Precision Munitions and Armament Systems)"
                                    },
                                    "Description": {
                                        "val": "The Precision Munitions and Armament Systems focus area consists of Advanced Weapon Systems, Fire Control, Logistics, Emerging Technologies and Advanced Energetics and Warheads. Future efforts in this area are moved to the Ground Systems portfolio."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.800"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop the manufacturing process to reduce the cost and time associated with applying Ta-10W liners for medium and large caliber Chromium free cannon barrels.  Develop explosive loading processes, requiring no post-machining, inside warhead molding of insensitive munitions and fragment generating sleeves for the EAPS and Next Generation Cluster Munitions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.387"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.387"
                                            },
                                            "Text": {
                                                "val": "Validates the manufacturing process to reduce the cost and time associated with applying Ta-10W liners for medium and small caliber Chromium free cannon barrels. (This effort contained in the Ground Systems portfolio in FY14)"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Command, Control, Communications and Intelligence Systems"
                                    },
                                    "Description": {
                                        "val": "This effort funds manufacturing technology advances needed for more affordable components and subsystems for intelligence, surveillance, reconnaissance and targeting sytems, mission command systems, electronic warfare and improved Explosive Device detect\/defeat systems.  Work focuses on addressing challenges in areas such as large format multi-color focal plane arrays, flexible displays, night vision sensors, target detectors, advanced antennas and sensors."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "22.400"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Optimized the production of the Automated Exhaust Station (AES) to increase yield and demonstrate increased median photocathode response for improved low-light-level sensor performance; demonstrated lot-sized production of 200 and 325 sqcm focal plane array (FPA) wafers, improving yield and small pixel processing\/hybridization; manufactured and evaluated sample batches of 640x480, 1920x1280 and 1280x720 pixel FPAs to validate improved yield for affordable high definition, multi-band, multi-color FPAs grown on low-cost substrate for target acquisition and vision systems; demonstrated lot-sized production of 49 sqcm wafers for high-operating temperature FPAs, reducing surface defects and improving contrast ratio for wide area coverage of persistent surveillance systems; integrated Organic Light Emitting Diodes (OLED) into the Gen II production line for 6.4-12 inch diagonal flexible displays to achieve a resolution of 600x800 super video graphics array (SVGA)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.405"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Demonstrate improved yield and reliability for low light level sensor over multiple production runs; demonstrate manufacturing of large sized high-operating temperature FPAs, increase growth, processing and hybridization yields and deliver 640x480 FPAs for system integration; develop manufacturing processes for reducing the cost and improving performance and reliability of short wave infrared sensors; develop manufacturing processes for reducing the cost and improving performance and reliability of flexible electronics for large area sensors."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.009"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.009"
                                            },
                                            "Text": {
                                                "val": "Will develop processes, tooling and automation techniques to increase yield, decrease fabrication and assembly times and reduce cost of miniaturized short-wave infrared cameras; Will develop manufacturing processes to fabricate low-defect flexible digital radiography panels, will demonstrate techniques for integrating flexible sensors and electronics into circuits for system demonstration; will transition growth process, with demonstrated improved yield, for high operating temperature focal plane arrays to ground and airborne platforms; will develop and demonstrate processes to reduce the size, weight, power and cost of sensors and electronics for networked communications and information gathering systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier Systems"
                                    },
                                    "Description": {
                                        "val": "This effort funds manufacturing technology advances needed for more affordable components and subsystems for combat feeding, aerial delivery of supplies, expeditionary basing, Soldier-borne sensors, clothing and protective equipment. Work focuses on addressing challenges in areas such as multifunctional fabrics for shelters, uniforms and portage equipment; affordable, non-contaminating packaging for rations; and lightweight materials for body armor."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.597"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed the manufacturing of T6 laminate at 14oz\/yd2 for Low Rate Initial Production of shelter fabric; completed and demonstrate the low rate initial production (LRIP) process for lightweight x-Small Arms Protective Insert (SAPI) plates for a flexible hybridized body armor solution; demonstrated low-cost rapid prototyping and injection molding techniques for protective mask systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.730"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Demonstrate mature manufacturing processes supporting the production of light-weight x-SAPI plates for flexible hybridized body armor and transition process data to PM SPIE for procurement; develop manufacturing processes to reduce the cost of developing and producing advanced field medical systems; develop novel processing techniques for utilizing advanced materials to reduce the weight and increase the performance of Soldier-born systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.000"
                                            },
                                            "Text": {
                                                "val": "Will develop manufacturing processes to facilitate low cost, light weight systems for the dismounted Soldier and for basing operations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Innovation Enablers (Formerly Advanced Manufacturing Initiatives)"
                                    },
                                    "Description": {
                                        "val": "This effort funds manufacturing technology advances needed for affordable model based manufacturing, network centric manufacturing data environments, collaborative manufacturing modeling and simulation, and advanced manufacturing technologies. Work focuses on addressing challenges in areas such as 3D technical data packages for armor systems; providing digital manufacturing capabilities to depots and laboratories, processes and models for data transfer and prototype production; and advanced laser manufacturing techniques for repairing components."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.435"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Integrated depot planning and rebuild operations within a 3Dimensional TDP; establish interactive S1000D publications (International specification for technical publications utilizing a Common Source Database), manuals and work instructions; identify Type 1 NSNs to link with the 3D TDPs; developed processes and models for demonstrating data transfer and prototype production within a collaborative environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.961"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Transition process for developing and using Digital Work Instruction to select depots to support production operations, demonstrate the use of MIL-STD-31000 for weapon system production data management; demonstrate integration of manufacturing planning and machining technologies at select Army organic manufacturing sites."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.057"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.057"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate digital data driven manufacturing of prototype systems; will deploy the use of standard machine language and protocols to monitor machine performance to predict quality issues and optimize production rates for high-volume items; will establish and demonstrate the use of a common machine tool library for cross-Army utilization."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "Not applicable for this item."
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable for this item."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}