{
    "id": "0bbc5bb02557fcfb91b53bf448c68e3ca98ad30e",
    "meta": {
        "filename": "dod-2015_RDTE_2015_AIRFORCE_V3B_RDTE_JustificationBook_Air_Force_PB_2015.zzz_unzipped_RDTE_JustificationBook_Air_Force_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0305240F"
        },
        "ProgramElementTitle": {
            "val": "Support to DCGS Enterprise"
        },
        "R1LineNumber": {
            "val": "220"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "22.454"
            },
            "CurrentYear": {
                "val": "19.309"
            },
            "BudgetYearOne": {
                "val": "20.218"
            },
            "BudgetYearOneBase": {
                "val": "20.218"
            },
            "BudgetYearTwo": {
                "val": "28.623"
            },
            "BudgetYearThree": {
                "val": "28.166"
            },
            "BudgetYearFour": {
                "val": "26.748"
            },
            "BudgetYearFive": {
                "val": "27.256"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element contains Distributed Common Ground\/Surface System (DCGS) Family of Systems interoperability efforts for which the AF is lead service. The DCGS Family of Systems, including AF DCGS, was directed to migrate to a net-centric DoD Intelligence, Surveillance and Reconnaissance (ISR) enterprise enabling the Services to operate and share intelligence products more effectively in a joint environment.  All Services must pursue a common path based on a set of common enterprise services consistent with the Department's net-centric vision while maintaining flexibility to support the full range of warfighter missions.  Specifically, DoD charged the Air Force to lead the development, upgrade, integration, and test of common DCGS Integration Backbone (DIB) enterprise services.  The DIB is a set of enterprise standards and services that enable interoperability and component reuse.  All the military services are mandated to incorporate DIB interoperability standards and commit to DIB architecture as the migration path to common DCGS enterprise services. \n\nThe Distributed Common Ground Systems-Imagery (DCGS-I) Testbed is an integration and test environment, used by the Services and Agency DCGS program offices to conduct integration of DCGS components and test interoperability interfaces with new sensors, applications, and net-centric operations. This testbed also supports the integration and testing of DoD DCGS components prior to introduction into the operational environment.  Periodic upgrades ensure the Testbed stays current with DCGS standards and architecture.\n\nSupport to OUSD(I), AF DCGS, and NATO interoperability efforts is also provided through this program element. This includes development, testing, and implementation of international standards (to include NATO standardization agreements) to ensure joint, allied, and coalition interoperability. \n\nThe Common Imagery Processor effort develops a common imagery sensor processing capability within the DCGS architecture.  The imagery processor accepts airborne imagery data, processes it into an exploitable format, and provides it to other elements within the weapon system and the DCGS Enterprise. Current efforts are transitioning the legacy imagery processor from a hardware\/software capability to a virtual software capability, thereby improving enterprise processing capabilities.   Efforts continue to keep the capability on track to handle the current sensors. Activities also include testing, development, and demonstrations integrating updated and new\/emerging sensors into DCGS.\n\nActivities also include studies and analysis to support both current program planning and execution and future program planning.\n\nThis program is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "24.500"
                },
                "CurrentYear": {
                    "val": "23.016"
                },
                "BudgetYearOne": {
                    "val": "25.350"
                },
                "BudgetYearOneBase": {
                    "val": "25.350"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "22.454"
                },
                "CurrentYear": {
                    "val": "19.309"
                },
                "BudgetYearOne": {
                    "val": "20.218"
                },
                "BudgetYearOneBase": {
                    "val": "20.218"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.046"
                },
                "CurrentYear": {
                    "val": "-3.707"
                },
                "BudgetYearOne": {
                    "val": "-5.132"
                },
                "BudgetYearOneBase": {
                    "val": "-5.132"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.033"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "-3.707"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-2.013"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-5.132"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-5.132"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "In FY13, $2.013M for sequestration.\nIn FY14, $3.707M for Congressional Directed Reduction.\nIn FY15, $5.132M for higher Air Force priorities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "674826"
                    },
                    "ProjectTitle": {
                        "val": "Common Imagery Ground \/ Surface Systems"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "12.898"
                        },
                        "CurrentYear": {
                            "val": "12.040"
                        },
                        "BudgetYearOne": {
                            "val": "11.560"
                        },
                        "BudgetYearOneBase": {
                            "val": "11.560"
                        },
                        "BudgetYearTwo": {
                            "val": "16.255"
                        },
                        "BudgetYearThree": {
                            "val": "16.006"
                        },
                        "BudgetYearFour": {
                            "val": "15.196"
                        },
                        "BudgetYearFive": {
                            "val": "15.485"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "DoD charged the AF with developing, upgrading and managing the Distributed Common Ground\/Surface System (DCGS) Integration Backbone (DIB) for all the Services to provide common DCGS enterprise services and interoperability at the data level.  The DIB is a set of enterprise standards and services that enable interoperability and component reuse. Using the DIB, the Air Force Distributed Common Ground System (AF DCGS) modernization will transform AF DCGS from its existing proprietary system to a net-centric service oriented architecture.\n\nThe DCGS Family of Systems, including AF DCGS, was directed to migrate to a net-centric DoD Intelligence, Surveillance, and Reconnaissance (ISR) enterprise enabling the Services to operate and share intelligence products more effectively in a joint environment.  All Services must pursue a common path based on common enterprise services consistent with the Department's net-centric vision, while maintaining flexibility to support the full range of warfighter missions.  Also, all Services are mandated to incorporate DIB interoperability standards and commit to DIB architecture as the migration path to common DCGS enterprise services. \n\nThe Distributed Common Ground Systems-Imagery (DCGS-I) Testbed is an integration and test environment, used by the Services and Agency DCGS program offices to conduct integration of DCGS components and test interoperability interfaces with new sensors, applications, and net centric operations.  This testbed also supports the integration and testing of DoD DCGS components prior to introduction into the operational environment.  Periodic upgrades ensure the Testbed stays current with DCGS standards and architecture.\n \nThe AF-sponsored DIB System Program Office also participates in the development, testing, and implementation of international standards (to include NATO standardization agreements) to ensure joint, allied, and coalition interoperability."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Distributed Common Ground \/ Surface System (DCGS) Integration Backbone"
                                    },
                                    "Description": {
                                        "val": "Upgrade, improve and manage the DCGS Integration Backbone (DIB)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.591"
                                            },
                                            "Text": {
                                                "val": "Continued to upgrade, improve and manage the DIB."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.488"
                                            },
                                            "Text": {
                                                "val": "Continuing to upgrade, improve and manage the DIB."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.944"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.944"
                                            },
                                            "Text": {
                                                "val": "Will continue to upgrade, improve and manage the DIB."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Distributed Common Ground \/ Surface System-Imagery (DCGS-I) Testbed"
                                    },
                                    "Description": {
                                        "val": "Continue DCGS-I Testbed development and upgrades.  Continue to use the Testbed to conduct DIB and DCGS enterprise tests."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.907"
                                            },
                                            "Text": {
                                                "val": "Continued DCGS-I Testbed development and upgrades.  Continued to use the Testbed to conduct DIB and DCGS enterprise tests."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.651"
                                            },
                                            "Text": {
                                                "val": "Continuing DCGS-I Testbed development and upgrades.  Continuing to use the Testbed to conduct DIB and DCGS enterprise tests."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.700"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.700"
                                            },
                                            "Text": {
                                                "val": "Will continue to develop and upgrade the DCGS-I Testbed and use for DIB and DCGS enterprise tests."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Support to Distributed Common Ground \/ Surface System (DCGS) Enterprise"
                                    },
                                    "Description": {
                                        "val": "Provide support to OUSD(I), AF DCGS and NATO Interoperability Enterprise efforts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.400"
                                            },
                                            "Text": {
                                                "val": "Provided support to OUSD(I), AF DCGS and NATO Interoperability Enterprise efforts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.901"
                                            },
                                            "Text": {
                                                "val": "Continuing to provide support to OUSD(I), AF DCGS and NATO Interoperability Enterprise efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.916"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.916"
                                            },
                                            "Text": {
                                                "val": "Will continue to provide support to OUSD(I), AF DCGS and NATO Interoperability Enterprise efforts."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Air Force uses an evolutionary acquisition approach with version releases and periodic upgrades to develop, field, and upgrade the system and structure contracts for the improved capabilities through full and open competition to the maximum extent possible."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0305240F_BPAC_674826_0.jpg"
                                }
                            }
                        ]
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "675265"
                    },
                    "ProjectTitle": {
                        "val": "Common Imagery Processor (CIP)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "9.556"
                        },
                        "CurrentYear": {
                            "val": "7.269"
                        },
                        "BudgetYearOne": {
                            "val": "8.658"
                        },
                        "BudgetYearOneBase": {
                            "val": "8.658"
                        },
                        "BudgetYearTwo": {
                            "val": "12.368"
                        },
                        "BudgetYearThree": {
                            "val": "12.160"
                        },
                        "BudgetYearFour": {
                            "val": "11.552"
                        },
                        "BudgetYearFive": {
                            "val": "11.771"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Common Imagery Processor effort develops a common imagery sensor processing capability within the DCGS architecture.  The imagery processor accepts airborne imagery data, processes it into an exploitable format, and provides it to other elements within the weapon system and\/or the DCGS Enterprise. Current efforts are transitioning the legacy imagery processor from a hardware\/software capability to a virtual software capability, thereby improving enterprise processing capabilities.   Efforts continue to keep the capability on track to handle the current sensors. Activities also include testing, development, and demonstrations integrating updated and new\/emerging sensors into DCGS."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Imagery Processor"
                                    },
                                    "Description": {
                                        "val": "Continue to develop the imagery processor to keep pace with growing sensor baseline."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.556"
                                            },
                                            "Text": {
                                                "val": "Continued development of imagery processing capability to keep pace with growing sensor baseline."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.269"
                                            },
                                            "Text": {
                                                "val": "Continuing development of imagery processing capability to keep pace with growing sensor baseline."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.658"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.658"
                                            },
                                            "Text": {
                                                "val": "Will continue to develop imagery processing capability to keep pace with growing sensor baseline."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "RDTE: BA07: 0305208F"
                                    },
                                    "Title": {
                                        "val": "Distributed Common Ground System"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "43.580"
                                        },
                                        "CurrentYear": {
                                            "val": "6.321"
                                        },
                                        "BudgetYearOne": {
                                            "val": "27.265"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "27.265"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "24.702"
                                        },
                                        "BudgetYearThree": {
                                            "val": "23.177"
                                        },
                                        "BudgetYearFour": {
                                            "val": "23.630"
                                        },
                                        "BudgetYearFive": {
                                            "val": "24.081"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "For imagery processing the Air Force uses an evolutionary acquisition approach with blocks (increments) and spirals to develop, field, and upgrade the system and structure contracts for the improved capabilities through full and open competition to the maximum extent possible."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0305240F_BPAC_675265_0.jpg"
                                }
                            }
                        ]
                    }
                }
            ]
        }
    }
}