{
    "id": "0bcd38e68e2988c62fbe6c75e3de54e8e7955e50",
    "meta": {
        "filename": "dod-2015_RDTE_2015_NAVY_BA6_RDTE_JustificationBook_Navy_PB_2015.zzz_unzipped_RDTE_JustificationBook_Navy_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605866N"
        },
        "ProgramElementTitle": {
            "val": "Navy Space & Electr Warfare Supt"
        },
        "R1LineNumber": {
            "val": "161"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "6.091"
            },
            "CurrentYear": {
                "val": "3.264"
            },
            "BudgetYearOne": {
                "val": "2.505"
            },
            "BudgetYearOneBase": {
                "val": "2.505"
            },
            "BudgetYearTwo": {
                "val": "2.712"
            },
            "BudgetYearThree": {
                "val": "2.794"
            },
            "BudgetYearFour": {
                "val": "2.836"
            },
            "BudgetYearFive": {
                "val": "2.903"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Project 0706, Electromagnetic Compatibility (EMC) and Radio Frequency (RF) Management Program: Develops advanced technology to identify and eliminate Electromagnetic Interference (EMI) sources from Navy systems.  Supports research and development technology efforts, develops top-level plans, and supports systems in the Space and Electronic Warfare (SEW) mission area.\n\nProject 0739, Navy Command, Control, Communications, Computers, and Intelligence (C4I) Top Level Requirements - This project provides analysis of both Fleet requirements and research and development technology to develop top-level plans and space systems in the Space and Electronic Warfare (SEW) mission area. The Space and Electronic Warfare Studies and Analysis Program (SEWSAP) supports analyses of fleet requirements and research and development technology to develop top-level plans for operating Navy Command, Control, Communications, Intelligence, Surveillance and Reconnaissance (C4ISR) and space systems in the SEW mission area."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "9.779"
                },
                "CurrentYear": {
                    "val": "3.265"
                },
                "BudgetYearOne": {
                    "val": "4.406"
                },
                "BudgetYearOneBase": {
                    "val": "4.406"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "6.091"
                },
                "CurrentYear": {
                    "val": "3.264"
                },
                "BudgetYearOne": {
                    "val": "2.505"
                },
                "BudgetYearOneBase": {
                    "val": "2.505"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-3.688"
                },
                "CurrentYear": {
                    "val": "-0.001"
                },
                "BudgetYearOne": {
                    "val": "-1.901"
                },
                "BudgetYearOneBase": {
                    "val": "-1.901"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.001"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-2.664"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.185"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.431"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.431"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-1.470"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.470"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.839"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0706"
                    },
                    "ProjectTitle": {
                        "val": "EMC & RF Mgmt"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "5.576"
                        },
                        "CurrentYear": {
                            "val": "2.911"
                        },
                        "BudgetYearOne": {
                            "val": "2.505"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.505"
                        },
                        "BudgetYearTwo": {
                            "val": "2.712"
                        },
                        "BudgetYearThree": {
                            "val": "2.794"
                        },
                        "BudgetYearFour": {
                            "val": "2.836"
                        },
                        "BudgetYearFive": {
                            "val": "2.903"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Electromagnetic Compatibility (EMC) and Radio Frequency (RF) Management Program. This project develops tools, processes, and algorithms to identify and mitigate EMI sources for Navy systems and platforms. \n\n(a) It will support the Afloat Electromagnetic Spectrum Operations Program (AESOP), an automated spectrum Fleet operational capability.  The application will be enhanced to comply with fleet operational requirements and streamline Strike Force frequency management processes. It will provide automated Spectrum Management (SM) tools for development of operational task communication and radar\/weapon plans to support fleet deployments, exercises, and contingency operations.  It will provide identification and mitigation of EMI in Navy, North Atlantic Treaty Organization (NATO), Allied, Ashore and Joint Combat Operations.\n\n(b) It will support the Shipboard Electromagnetic Compatibility Improvement Program (SEMCIP) to identify, engineer, and evaluate effectiveness of potential EMI corrections.  The program also characterizes and quantifies the operational impact of EMI problems on system's mission performance.\n\n(c) It will support the Nuclear Electromagnetic Pulse (EMP) Survivability Program.  The program assesses the EMP survivability of all mission critical systems and funds development of a hardness assurance and maintenance program. It will develop improved modeling capability to reduce hardness validation costs at delivery and over the lifetime of the system\/platform. The program provides design criteria, test methodology, test limits, and survivability validation procedures for all Navy systems, ships, submarines and shore facilities.\n\n(d) It will support Advanced Technology Concepts. The program investigates Electromagnetic (EM) environmental effects and electromagnetic spectrum techniques and technologies to provide the ability to monitor EM spectrum usage on all ships in a given strike group.  The program will investigate technologies to build an EM Spectrum Common Operational Picture (COP) to detect and assess operational capability in real-time.  Additional investigations will be performed to develop processes and procedures to predict the EM environment.  In the out-years, these capabilities will be used to build the next generation combat system with inherent spectrum agility and self-awareness capability, further enhancing the Navy's ability to command the EM spectrum warfighting domain."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Afloat Electromagnetic Spectrum Operations Program (AESOP)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.643"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Researched and developed NATO\/Coalition\/National Spectrum requirements and coordinated results with all naval commands; updated the AESOP application requirements for the next release (version 3.1).   Supported the National Broadband Plan, provided analysis system capability to support National Level recommendations.  Performed test and evaluation of systems and updated spectrum radiation restrictions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.558"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Research fleet operations, spectrum engineering advances, open architecture and extensible mark-up language (XML) standards, and Navy and Joint standards \/ interfaces to align AESOP with the CNO Roadmaps, CNO's Navigation Plan for FY13-FY17, Net-centric warfare requirements, and the Joint Vision 2020.  Design and develop\/prototype interfaces between Navy automated spectrum planning software and feedback loops.  Support experiments for testing prototypes.  Plan and conduct tests of new and modified Navy equipment and calculate electromagnetic compatibility criteria; document criteria and parameters in OP-3840 and test reports.   Support the National Broadband Plan, provided analysis system capability to support National Level recommendations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue research of fleet operations, spectrum engineering advances, open architecture and extensible mark-up language (XML) standards, and Navy and Joint standards \/ interfaces to align AESOP.   Provide engineering, research, and analysis support for DoD\/DoN response to President's National Broadband Plan and Spectrum Inventory Act, and their associated impacts on Navy systems.  Perform power density analyses and make recommendations for spectrum sharing,  interference susceptibilities, required stand-off distances for compatibility, and impact assessments from any military concessions on spectrum use.  Conduct technical and regulatory analyses for \"comparable spectrum\" targeted for potential migration by Navy systems that are displaced through spectrum reallocation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "EMC Systems Engineering (SEMCIP)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Supported identification and characterization of Electromagnetic Interference (EMI) problems which debilitate the combat capability and operational readiness of the strike force.  The primary focus was to provide support to the Navy's Air and Missile Defense Radar (AMDR) program and consolidated SATCOM\/Communication stacked antenna technology.  Evaluated the effectiveness of several proposed EMI solutions and initiated the coordination efforts for final integration\/procurement of the required EMI fixes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.831"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue efforts to identify and characterize EMI which can debilitate the combat capability of strike force capability and operational readiness.   Focus in on the fielding of Enhanced Forward Error Correction for Television Direct to Sailor (TV-DTS), SPY-3 Radar, Navy Multiband Terminal (NMT), Commercial Broadband SATCOM Program (CBSP), Ku-Band Common Data Link (CDL) and Close in Weapon System (CIWS) programs. Evaluate the effectiveness of proposed EMI solutions and coordinate for integration\/procurement of final EMI fix."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.643"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.643"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue efforts to identify and characterize EMI which can debilitate the combat capability of strike force capability and operational readiness.   Focus in on the Navy's Next Generation Radar, EW and SATCOM programs. Evaluate the effectiveness of proposed EMI solutions and coordinate for integration\/procurement of final EMI fix."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Electromagnetic Pulse (EMP) Survivability"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.771"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conducted research and developed technical standards for incorporation into the Maritime EMP Standard (i.e., MIL-STD-4023); planned for issuance to Navy commands.   Performed a low level continuous wave illumination test and evaluation event on the ex-US Coast Guard Cutter (USCGC) MONHEGAN.   Investigated capabilities to improve shipboard corrosion resistance and ensure reduced life cycle costs of EMP hardening materials. Collected shipboard corrosion resistance test and evaluation results on four ships by performing Grounding Effectiveness (GE) test analysis."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.848"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue EMP experiments on the ex-USCGC MONHEGAN to develop new testing protocols.  Investigate the development of mobile EMP testing capability.  Mobile test systems would be composed of both radiating systems required for radiated susceptibility testing and pulse current injection systems required for conductive susceptibility testing.   In addition, investigate potential upgrades to the Naval Surface Warfare Center Dahlgren Division (NSWCDD) Naval Ordinance Transient Electromagnetic Simulator (NOTES) EMP Facility (ashore test bed)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.662"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.662"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigate and develop new testing techniques for both ashore and afloat pulse current injection testing that will support the new Maritime EMP Standard (MIL-STD-4023).  Develop streamlined testing capability to support grounding effectiveness testing, that will increase repeatability, verification of test results, while reducing total cost of ownership.  Implement new testing capabilities\/revised software capabilities at the Naval NSWCDD Naval Ordinance Transient Electromagnetic Simulator (NOTES) EMP Facility (ashore test bed) to meet MIL-STD-2169C threat levels."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Technology"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.053"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Demonstrated the capability to monitor Electromagnetic (EM) Spectrum usage on a ship and\/or strike group in a laboratory environment.   Developed a process to provide a shared Common Operational Picture (COP) of EM Spectrum usage and requirements.  Demonstrated the capability to manage shipboard systems EM parameters to avoid Electromagnetic Interference (EMI)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.674"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Support development of operational concepts from the CNO's Electromagnetic Maneuver Warfare (EMMW) Roadmap.  Demonstrate the capability to monitor EM spectrum usage on ships in a strike group.  Enhance the EM Spectrum COP to provide layers of data displays for levels of command.   Publish Phase 2 of the Information Dominance Roadmap, detailing total ownership costs, and refine the action plan to identify top level Navy investments that will enable a leap-forward to provide Real-Time Spectrum Operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.700"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.700"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue innovative development of operational concepts from the CNO's Electromagnetic Maneuver Warfare (EMMW) Roadmap.  Enhance the EM Spectrum COP to provide predictive layers of data displays for levels of command.   Investigate the acquisition processes, procedures, and architecture protocols to support spectrum agility within new systems and equipment.  Investigate technology to enhance system and equipment future operations, allowing full EM spectrum control (i.e., emissions control (EMCON), de-confliction to preclude EMI, advanced agility capabilities)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Overseas Contingency Operations (OCO)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.109"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "(a) Joint Emitters during Overseas Contingency Operations is a source of debilitating Electromagnetic Interference (EMI) to critical air operations and BMD assets.  Funding will be used to expand afloat and ashore spectrum management tools to address the critical need for interoperability. USN\/USMC integration promotes interoperability with the multi-national deployed forces fighting the OCO and decreases the risk of friendly fire incidents. Increased situational awareness, reduction of interference, and restored mission capability are all expected benefits of the improved processes and procedures. The requested funds will deliver a Joint capability system that allows group planning and execution, information data discovery, data interoperability, and data fusion to USN and USMC forces directly supporting OCO OPS. \n\n(b) Develops advanced technology to identify and reduce EMI sources from Navy systems and platforms.  Supports both In-Theater & Pre-Deployment support. Funding to address actions taken to restore units to a desired level of combat capability. Upgrades to deploying ships and development of EMI solution for the deploying strike group. This funding will be used to evaluate and mitigate potential EMI problems that may be introduced as the fleet continues to field additional variants of combat systems and commission new ships. Timely development of EMI solutions restores combat capability lost due to EMI. Evaluation of short-term and long-term EMI fix evaluation on deploying ships is required to determine optimum EMI solution."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "An acquisition strategy is not required."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics will consist of quarterly program reviews."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "0739"
                    },
                    "ProjectTitle": {
                        "val": "Navy C2 Top Level"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.515"
                        },
                        "CurrentYear": {
                            "val": "0.353"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "0.868"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project provides analysis of both Fleet requirements and research and development technology, to develop top-level plans and space systems in the Space and Electronic Warfare (SEW) mission area. The Space and Electronic Warfare Studies and Analysis Program (SEWSAP) supports analyses of fleet requirements and research and development technology to develop top-level plans for operating Navy Command, Control, Communications, Intelligence, Surveillance and Reconnaissance (C4ISR) and space systems in the SEW mission area. Supports Navy Information Dominance."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Navy C2 Top Level"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.515"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued to initiate and complete studies supporting resource and requirement decisions in the PPBE System. Conduct FORCEnet\/Information Dominance Fleet experiments; FORCEnet\/Information Dominance Architecture selection; evaluation of Tactics, Techniques, and Procedures (TTP) and Research, Development, Test, and Evaluation (RDT&E) efforts with FORCEnet\/Information Dominance requirements.\n- Initiated evaluation of Modeling and Simulation (M&S) tools and scenarios."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.353"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue to initiate and complete studies supporting resource and requirement decisions in the PPBE System. Conduct FORCEnet\/Information Dominance Fleet experiments; FORCEnet\/Information Dominance Architecture selection; evaluation of TTP and Research, Development, Test, and Evaluation (RDT&E) efforts with FORCEnet\/Information Dominance requirements. \n- Continue and complete evaluation of M&S tools and scenarios."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "An acquisition strategy is not required."
                        },
                        "PerformanceMetrics": {
                            "val": "Conduct studies and report plans and analysis of Fleet requirements for operating Navy C4ISR and space systems in the space, electronic warfare, and information dominance mission areas."
                        }
                    }
                }
            ]
        }
    }
}