{
    "id": "0d3b83746da92d5ac778a17c5637dec829bde376",
    "meta": {
        "filename": "dod-2015_RDTE_2015_OSD_RDTE_JustificationBook_Office_of_Secretary_Of_Defense_PB_2015.zzz_unzipped_RDTE_JustificationBook_Office_of_Secretary_Of_Defense_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604250D8Z"
        },
        "ProgramElementTitle": {
            "val": "Advanced Innovative Technologies"
        },
        "R1LineNumber": {
            "val": "102"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "129.883"
            },
            "BudgetYearOne": {
                "val": "190.000"
            },
            "BudgetYearOneBase": {
                "val": "190.000"
            },
            "BudgetYearTwo": {
                "val": "76.000"
            },
            "BudgetYearThree": {
                "val": "48.000"
            },
            "BudgetYearFour": {
                "val": "30.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Strategic Capabilities Office (SCO) identifies, analyzes, demonstrates, and transitions game-changing applications of existing and near-term technology--and other U.S. Government capabilities--to shape and counter emerging threats. Currently focused on the Asia-Pacific Rebalance, SCO combines capability innovation with concepts of operation and information management to develop novel concepts often crossing Service, Defense-Intelligence, and multi-classification divides--to solve critical national security challenges in partnership with the Services, Combatant Commands, Joint Chiefs of Staff, Intelligence Community, and the Office of the Secretary of Defense. SCO analyzes, demonstrates, and red-teams these concepts on an accelerated time frame to enable subsequent programmatic decisions on alternative capabilities that have greater mission impact and lower cost.\n\nThe Advanced Innovative Technologies Program Element contains projects that include in-depth analysis to determine technical and operational performance and risk, component- and subsystem-level prototyping and testing to reduce risk, and operational demonstrations to prove concept viability prior to subsequent programmatic decisions. Due to nature of these projects, specific applications and detailed plans are available at higher classification levels."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "130.000"
                },
                "BudgetYearOne": {
                    "val": "102.000"
                },
                "BudgetYearOneBase": {
                    "val": "102.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "129.883"
                },
                "BudgetYearOne": {
                    "val": "190.000"
                },
                "BudgetYearOneBase": {
                    "val": "190.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "-0.117"
                },
                "BudgetYearOne": {
                    "val": "88.000"
                },
                "BudgetYearOneBase": {
                    "val": "88.000"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FFRDC Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "-0.117"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "DoD Priorities and Requirements"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "88.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "88.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2015:  Program increase is to support the higher priorities of agency operations."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P250"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Innovative Technologies"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "129.883"
                        },
                        "BudgetYearOne": {
                            "val": "190.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "190.000"
                        },
                        "BudgetYearTwo": {
                            "val": "76.000"
                        },
                        "BudgetYearThree": {
                            "val": "48.000"
                        },
                        "BudgetYearFour": {
                            "val": "30.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Strategic Capabilities Office (SCO) identifies, analyzes, demonstrates, and transitions game-changing applications of existing and near-term technology--and other U.S. Government capabilities--to shape and counter emerging threats. Currently focused on the Asia-Pacific Rebalance, SCO combines capability innovation with concepts of operation and information management to develop novel concepts--often crossing Service, Defense-Intelligence, and multi-classification divides--to solve critical national security challenges in partnership with the Services, Combatant Commands, Joint Chiefs of Staff, Intelligence Community, and the Office of the Secretary of Defense. SCO analyzes, demonstrates, and red-teams these concepts on an accelerated time frame to enable subsequent programmatic decisions on alternative capabilities that have greater mission impact and lower cost.\n\nThe Advanced Innovative Technologies Program Element contains projects that include in-depth analysis to determine technical and operational performance and risk, component- and subsystem-level prototyping and testing to reduce risk, and operational demonstrations to prove concept viability prior to subsequent programmatic decisions. Due to nature of these projects, specific applications and detailed plans are available at higher classification levels."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Land-Based Rail Gun (LBRG)"
                                    },
                                    "Description": {
                                        "val": "Exisiting Navy Science and Technology (S&T) Railgun program will be leveraged into Land-based Railgun (LBRG) analysis, prototyping, and experimentation. Cost-effective land-based defense will be demonstrated by closing the fire control loop between existing sensors and prototype ground-launched Railgun projectiles. To facilitate this, LBRG will integrate the Railgun launcher, power, projectile, and sensor so that projectiles may be command guided during a series of flight tests. These tests will verify performance and lethality results from modeling and simulation. Testing will conclude by demonstrating projectile fly-out and control, sensor tracking of projectiles, communication from sensor to projectile, integrated guidance, navigation and control, culminating in an FY2015 live-fire, closed-loop, command-guided launch from a 20 mega-joule Railgun.\n\nThis is a new PE for FY 2014 that contains OSD land-based Railgun investments to accelerate fire control loop closure. In FY 2011 and FY 2012, ramp investments were provided from alternate RDT&E PEs to enable the following accomplishments:\n• Initiated development of high fidelity models and simulations for gun launched guided projectile engagements.\n• Anchored projectile models with wind tunnel and flight test data in collaboration with the Navy’s Office of Naval Research (ONR).\n• Analyzed several effective sensor architectures using existing sensors to support gun launched guided projectile engagements.\n• Selected sensors to support FY 2014 flight tests of prototype projectile airframes.\n• Conducted several projectile airframe flight tests in the first quarter—a quarter ahead of schedule—in collaboration with ONR.\n• Installed tracker hardware and successfully tracked a projectile flight with tactically relevant measurement accuracies in the first quarter in collaboration with ONR and the Army’s Armament Research Development and Engineering Center."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "129.883"
                                            },
                                            "Text": {
                                                "val": "• Initiate development of  prototype projectiles.\n• Initiate procurement of 20MJ Railgun launcher system (power and energy, launcher, cables, test stand, and launcher\/power controls).\n• Initiate development of close-loop-control for testing of prototype projectiles.\n• Initiate launcher testing of prototype projectile.\n• Initiate design and fabrication of high power prototype gun mount system.\n• Initiate systems engineering for Railgun System (power, gun, projectile and sensor)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "102.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "102.000"
                                            },
                                            "Text": {
                                                "val": "• Continue development of prototype projectiles.\n• Continue development of closed loop control for testing of prototype projectiles.\n• Continue launcher testing of prototype projectiles.\n• Continue design and fabrication of high power prototype gun mount system.\n• Continue integration of Railgun System (power, gun projectile, and sensor).\n• Investigate alternative lethality methods."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Assured Tactical C2"
                                    },
                                    "Description": {
                                        "val": "Leverage existing technologies to analyze and demonstrate an alternative Command and Control solution for contested environments. Due to nature of this project, specific descriptions and detailed plans are available at higher classification levels."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "35.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "35.000"
                                            },
                                            "Text": {
                                                "val": "Project will apply existing Department of Defense investments in novel way to increase command and control reliability in contested environments. FY2015 efforts will include design and prototyping for subsequent proof-of-principle demonstrations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Navigation"
                                    },
                                    "Description": {
                                        "val": "Leverage existing technologies to analyze and demonstrate a prototype advanced navigation technique for contested environments. Due to nature of this project, specific descriptions and detailed plans are available at higher classification levels."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "21.300"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "21.300"
                                            },
                                            "Text": {
                                                "val": "Projects will apply existing technologies to demonstrate advanced navigation techniques. FY2015 efforts will include design, prototyping, data collections, and tests. Test results will be used to anchor modeling and simulation performance results and develop operationally-relevant proof-of-principle demonstrations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Intelligence, Surveillance, and Reconnaissance (ISR) Denial"
                                    },
                                    "Description": {
                                        "val": "Leverage existing technologies to analyze and demonstrate a prototype solution to disrupt enemy targeting of critical U.S. assets. Due to nature of this project, specific descriptions and detailed plans are available at higher classification levels."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.000"
                                            },
                                            "Text": {
                                                "val": "Project will apply existing technologies to demonstrate ISR denial techniques. FY2015 efforts will include design, prototyping, and field testing. Results will be used to anchor modeling and simulation performance results and develop and execute operationally-relevant proof-of-principle demonstrations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enhanced Munitions"
                                    },
                                    "Description": {
                                        "val": "Leverage existing technologies to analyze and prototype enhancements to current and future munitions. Due to nature of this project, specific descriptions and detailed plans are available at higher classification levels."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.700"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.700"
                                            },
                                            "Text": {
                                                "val": "Projects will apply existing technology to enhance the effectiveness of current and future munitions. FY2015 efforts will include analysis, prototyping, and subsystem testing to develop operationally-relevant proof-of-principle demonstrations."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics are specific to each aspect of the Land-Based Rail Gun (LBRG), Assured Tactical C2, Advanced Navigation, ISR Denial and Enhanced Munitions efforts, funded under the Advanced Innovative Technologies Program Element.  All of which include measures identified in the management approach, Statement of Work (SOW) and Period of Performance (POP). In addition, completions and successes are monitored against schedules and deliverables stated in the initiative's management approach. Specific applications and plans are available at a higher classification level, upon request."
                        }
                    }
                }
            ]
        }
    }
}