{
    "id": "10b5f737caa3a2eceff24155e0c1b69abecebe5c",
    "meta": {
        "filename": "dod-2015_RDTE_2015_ARMY_BA3_RDTE_JustificationBook_Army_PB_2015.zzz_unzipped_RDTE_JustificationBook_Army_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603003A"
        },
        "ProgramElementTitle": {
            "val": "AVIATION ADVANCED TECHNOLOGY"
        },
        "R1LineNumber": {
            "val": "31"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "57.364"
            },
            "CurrentYear": {
                "val": "81.037"
            },
            "BudgetYearOne": {
                "val": "88.990"
            },
            "BudgetYearOneBase": {
                "val": "88.990"
            },
            "BudgetYearTwo": {
                "val": "90.394"
            },
            "BudgetYearThree": {
                "val": "94.966"
            },
            "BudgetYearFour": {
                "val": "101.461"
            },
            "BudgetYearFive": {
                "val": "101.421"
            }
        },
        "ProgramElementNote": {
            "val": "FY 13 reductions attributed to sequestration (-5,123 million), general Congressional reductions (-63 thousand), and SBIR\/STTR transfers (-1,636 million)"
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) matures and demonstrates manned and unmanned air vehicle technologies to enable Army aviation modernization.  Within this PE, aviation technologies are advanced and integrated into realistic and robust demonstrations.  Project 313 matures, demonstrates and integrates enabling component, subsystems and systems in the following areas: rotors, drive trains, structures and survivability.  Project 436 matures, integrates and demonstrates air launched weapons systems and mission equipment packages to enable control of unmanned systems.  Project 447 matures and demonstrates affordable and efficient engines.  Focus areas include: engines & drive trains; rotors & vehicle management systems; platform design & structures; aircraft & occupant survivability; aircraft weapons & sensors; maintainability & sustainability; and unmanned & optionally manned systems. A major effort in this PE is the Joint Multi-Role (JMR) Technology Demonstrator.\n \nWork in this PE contributes to the Army S&T Air Systems portfolio and is related to and fully coordinated with PE 0602211A (Aviation Technology), PE 0603313A (Missile and Rocket Advanced Technology), PE 0603710A (Night Vision Advanced technology), and PE 0603270A (Electronic Warfare Technology).  \n \nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering S&T focus areas and the Army Modernization Strategy.   \n \nWork in this PE is performed by the U.S. Army Aviation and Missile Research, Development, and Engineering Center (AMRDEC) with facilities located at Redstone Arsenal, AL; Joint Base Langley-Eustis, VA; and Moffett Field, CA."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "64.215"
                },
                "CurrentYear": {
                    "val": "81.080"
                },
                "BudgetYearOne": {
                    "val": "92.341"
                },
                "BudgetYearOneBase": {
                    "val": "92.341"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "57.364"
                },
                "CurrentYear": {
                    "val": "81.037"
                },
                "BudgetYearOne": {
                    "val": "88.990"
                },
                "BudgetYearOneBase": {
                    "val": "88.990"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-6.851"
                },
                "CurrentYear": {
                    "val": "-0.043"
                },
                "BudgetYearOne": {
                    "val": "-3.351"
                },
                "BudgetYearOneBase": {
                    "val": "-3.351"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.092"
                    },
                    "CurrentYear": {
                        "val": "-0.043"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.636"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-3.351"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-3.351"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Sequestration"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-5.123"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "313"
                    },
                    "ProjectTitle": {
                        "val": "Adv Rotarywing Veh Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "40.008"
                        },
                        "CurrentYear": {
                            "val": "63.513"
                        },
                        "BudgetYearOne": {
                            "val": "72.732"
                        },
                        "BudgetYearOneBase": {
                            "val": "72.732"
                        },
                        "BudgetYearTwo": {
                            "val": "73.612"
                        },
                        "BudgetYearThree": {
                            "val": "81.545"
                        },
                        "BudgetYearFour": {
                            "val": "88.528"
                        },
                        "BudgetYearFive": {
                            "val": "89.349"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures, demonstrates and integrates components, subsystems and systems for vertical lift and unmanned air systems that provide, improved aircraft and occupant survivability, reduced maintenance and sustainment costs, and greater performance through improved rotors, drives, vehicle management systems and platform design and structures.  Systems demonstrated include rotors, drive trains, robust airframe structures and integrated threat protection systems.  A major effort in this project is the Joint Multi-Role (JMR) Technology Demonstrator in support of the Future Vertical Lift (FVL) family of aircraft.\n \nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering S&T focus areas and the Army Modernization Strategy. \n \nWork in this project is performed by the Aviation Development Directorate of the U.S. Army Aviation and Missile Research, Development, and Engineering Center (AMRDEC), Joint Base Langley-Eustis, VA, and the System Simulation Development Directorate, AMRDEC, Redstone Arsenal, AL.  Work in this project is coordinated with Program Manager Aircraft Survivability Equipment (PM-ASE)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Aircraft & Occupant Survivability Systems"
                                    },
                                    "Description": {
                                        "val": "This effort increases rotorcraft survivability by reducing platform signatures, providing the means to more efficiently counter enemy detection and tracking systems, and also increases protection to the aircraft and aircrew against ballistic munitions, crash landings, and post-crash fire events. This effort enhances air crew situational awareness, allowing manned\/unmanned aircraft to avoid enemy air threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.637"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Matured concepts that most effectively and efficiently make the pilot aware of the current threat situation and offer the best survivability actions to dynamic threats;  began design of a three dimensional (3-D) route optimization planner architecture that allows the aircraft to maneuver to its flight dynamic limits, coupled with real-time threat lethality predictions; began maturing preliminary component design of a combat tempered platform that exemplifies enhanced aircraft and crew\/occupant protection, improved battlefield durability, and reduced environmental vulnerability; substantiated the results of the system level trade studies, which are key to understanding structural design parameters and the performance of the optimized concepts through integrated, full-scale component testing; conducted system engineering trades; and started validation of component integration."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.418"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Generate real-time threat lethality prediction algorithms and 3-D route planning optimization algorithms which include consideration of aircraft flight dynamics limits, and demonstrate in the AMRDEC Aviation Integration System Facility; demonstrate modular integrated survivability architecture using aircraft survivability equipment components, and Future Airborne Common Environment conforming software; and begin full scale fabrication of a combat tempered airframe sub-section designed to meet damage tolerance criteria."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.118"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.118"
                                            },
                                            "Text": {
                                                "val": "Will integrate for flight demonstration purposes route planner software, common processing hardware, displays, and sensors onto a relevant aircraft platform; conduct system ground testing and a series of flight tests that will quantify the capability of the hardware\/software to process data from threat sensors and display appropriate adjustments to the route plan; complete development and demonstration of a common software\/hardware interface to rapidly integrate survivability technologies into aviation platforms; complete coordinated development of an airworthiness qualification process with a focus on qualifying and reusing software components; and demonstrate reduced operational durability and total survivability through full-scale tests of combat tempered airframe, zero-vibration helicopter, durable main rotor, integrated crash protection system, and adaptive flight control laws."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rotors & Vehicle Management Systems"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates the performance benefits of advanced rotors through the evaluation of alternative designs aimed to satisfy future force capability needs for increased system durability, speed, range and payload.  This effort also integrates advanced flight controls with real-time aircraft state information into vehicle management systems to enable safe, low-effort maneuvering and real-time adaptation to aircraft state changes (degradation, damage, mission, etc.)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.143"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Began testing to mitigate risk and address integration issues associated with integrating multiple active technologies into a rotor system; began maturing design of reconfigurable rotors with integrated active rotor components; demonstrated improved state sensing subsystems (rotor states, weight on wheels, external loads), rotating to non-rotating data and power transfer, real time adaptive control laws, and software validation technologies; matured a fault tolerant architecture that combines flight safety critical, mission critical and other non-safety critical subsystems into an integrated rotorcraft guidance and control system (Adaptive VMS); and matured system hardware and software components in preparation for fabrication and flight demonstration."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.296"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Demonstrate scalable and portable vehicle management system techniques to more efficiently use available data to improve performance and reduce pilot workload using advanced flight controls across a wide range of Army rotorcraft sized vehicles and missions (cargo, assault, scout, attack and recon); and demonstrate an integrated reconfigurable rotor, at full scale in a wind tunnel, and its capability to adapt during operation to maximize performance, reduce vibrations, and reduce acoustic signatures."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.455"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.455"
                                            },
                                            "Text": {
                                                "val": "Will mature advanced Vehicle Management System (VMS) technologies and will demonstrate via flight test a system which more efficiently utilizes available vehicle data to improve system performance and reduce pilot workload across the range of Army rotorcraft applicable to both the legacy fleet and the Future Vertical Lift (FVL) fleet."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Platform Design & Structures Systems"
                                    },
                                    "Description": {
                                        "val": "Design, fabricate, evaluate and demonstrate advanced vertical lift aircraft system configurations that address Future Vertical Lift (FVL) medium class capability needs.  Determine optimum vehicle attributes that meet future force capability needs for increased system speed, range, payload, and reduced operating costs.  Conduct preliminary and detailed system design of multiple candidate systems.  Flight demonstrate operational capability of FVL medium class technology demonstrators."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.534"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed initial Operations Analysis and used results to assign warfighter value to aircraft features and attributes; completed Configuration Trades & Analysis tasks, utilizing multiple contractors, that documented design trades, cost\/weight sensitivity studies, and vehicle configuration recommendations; investigated space, weight & power requirements and provisions for aircraft mission equipment (avionics, weapons, sensors); developed a demonstrator performance specification; and began preliminary design of multiple aircraft concepts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "33.068"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct preliminary design of multiple technology demonstrator aircraft, considering higher speed rotor\/prop-rotor configurations, lightweight airframe structures, and low drag fuselages to support medium lift utility and attack\/recon missions; conduct design support testing to establish performance expectations for vehicle subsystem concepts and enablers; refine a model development specification; mature technology development plans for the selected vehicle concepts; and conduct configuration and architecture concept evaluations with analyses and demonstrations performed to mature tools, processes and technologies required for mission systems development."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "48.777"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "48.777"
                                            },
                                            "Text": {
                                                "val": "Will Complete detailed design of Joint Multi-Role technology demonstrator concepts; mature final design drawings; provide cost\/weight analyses; conduct critical system design review; begin component and subsystem fabrication and test; update analytical tools; conduct the Joint Common Architecture demonstration; refine the objective Mission Equipment Package (MEP) definition; define an Architecture Centric Virtual Integration process for avionics architecture development; and complete version 1 of the Joint Common Architecture standard."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rotorcraft Drive Systems"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates advanced rotorcraft drive technologies with the potential to: increase the horsepower-to-weight ratio; reduce drive system noise; reduce production, operating and support costs; and provide automatic component impending failure detection. The drive system demonstrators for this effort will be applicable to current platforms and future Vertical Lift platforms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.899"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Validated gear and bearing component hardware designs; evaluated modeling and design tools for accuracy to predict component stresses and material properties; tested advanced oils and additives for extending component durability; assessed reliability of new technologies for improved aircraft affordability; and tested advanced cooling technologies for reduced aircraft subsystem weight."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.204"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Mature designs of full-scale demonstrator transmissions and tail rotor drive shaft system; fabricate full-scale demonstrator hardware for Kiowa Warrior and Blackhawk aircraft configurations; assess and validate reliability and maintainability algorithms; and assess progress towards meeting production and operational cost goals."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.986"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.986"
                                            },
                                            "Text": {
                                                "val": "Will complete final assembly of the full-scale drive system demonstrator hardware for Kiowa and Blackhawk configurations; will conduct full-scale testing to include endurance testing for reliability and over torque testing to validate material design parameters; and will evaluate loss of lubrication capabilities through testing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Maintainability & Sustainability Systems"
                                    },
                                    "Description": {
                                        "val": "Mature and demonstrate technologies that improve the operational availability of rotorcraft while reducing operating and support (maintenance) costs.  Efforts include component sensing, diagnostics, prognostics, and control systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.539"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Performed an aircraft level demonstration of the integrated set of technologies developed in FY11 and projected the operational benefits and support cost savings; demonstrated additional prognostic technologies for accessories and controls; began validation of  prognostic algorithms for structural integrity, corrosion, electrical distribution system, and rotor components; prepared for flight test in FY14 of energy harvesting sensors used to monitor component health and extend component service times; and began validation of a sensor network system  that improves health monitoring capabilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.027"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Mature advanced prognostic algorithms for more chaotic, non-linear dynamic failure modes for engines, flight controls, rotor systems and drives; mature the interfaces for health monitoring systems to communicate with Joint Common Architecture standards; and evaluate the integration of system health monitoring with electronic controls to enable adaptive control systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.396"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.396"
                                            },
                                            "Text": {
                                                "val": "Will mature engine adaptive controls to optimize performance, component life and maintenance schedule based on engine health; mature planetary gear failure detection technology, multifunctional aircraft sensor technology to reduce number of sensors and system weight, and a drive system intermediate rating methodology; demonstrate technologies for assessment of the structural integrity of a primarily composite airframe; verify the integrity of composite repairs, and predict the remaining useful life; and demonstrate in-flight real-time, automated methods to sense rotor system track and balance and make adjustments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint Common Architecture"
                                    },
                                    "Description": {
                                        "val": "This program evaluates, and integrates real-time airspace de-confliction and collision avoidance technologies. The JCA effort develops standards and requirements for an aviation open systems, mission processing architecture that is scalable across joint rotorcraft missions. This effort implements these standards into a processing system and demonstrates them through Software Integration Lab (SIL) testing.  In FY14 and 15, JCA related efforts for the Joint Multi-Role are moved to Platform Design and Structures Systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.256"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Published version 3 of the JCA standard that defines an open avionics systems architecture for future vertical lift aircraft and validated performance of the supporting JCA Ecosystem components (Software Developer's Tool Kit, Integrator's Tool Kit, Conformance Test Tool, Repository, and Simulation\/Stimulation tools)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Crew Decision Aid System"
                                    },
                                    "Description": {
                                        "val": "Demonstrate intelligent algorithms that aid decisions and actions in order to increase situation awareness, maximize use of on-board and off-board sensors, efficiently manage a team of manned and unmanned vehicles and their mission systems, and develop and execute effective and appropriate offensive and defensive responses.  This work continues in FY15 in Project 436 under the Unmanned \/ Optionally Manned Systems effort."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.500"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Demonstrate an intelligent search and screen function to sort actionable priority data from onboard and off-board sources and evaluate Joint Common Architecture-like protocols for algorithm integration."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "436"
                    },
                    "ProjectTitle": {
                        "val": "Rotarywing MEP Integ"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "8.487"
                        },
                        "CurrentYear": {
                            "val": "9.252"
                        },
                        "BudgetYearOne": {
                            "val": "8.004"
                        },
                        "BudgetYearOneBase": {
                            "val": "8.004"
                        },
                        "BudgetYearTwo": {
                            "val": "8.506"
                        },
                        "BudgetYearThree": {
                            "val": "8.442"
                        },
                        "BudgetYearFour": {
                            "val": "6.802"
                        },
                        "BudgetYearFive": {
                            "val": "5.885"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures and validates man-machine integration and mission equipment software and hardware technologies for unmanned and optionally manned aircraft systems. Efforts focus on artificial intelligence, intelligent agents, cognitive decision aiding, sensors, avionics, communications, and pilot vehicle interfaces. This project improves the overall mission execution by demonstrating manned and unmanned system teaming, enhanced aircraft pilotage capability, improved crew workload distribution, and new capabilities for both manned and unmanned aircraft. This project supports Army transformation by providing mature technology to greatly expand the capabilities of unmanned aircraft, in current operating roles and future unmanned wingman roles. This project also develops, demonstrates and integrates manned and unmanned sensor and weaponization technologies such as advanced missiles, guns, fire controls, advanced target acquisition and pilotage sensors into Army aviation platforms.  Efforts are directed toward reducing the integrated weight of weapons, increasing engagement ranges, providing selectable effects on a variety of threats, and enabling cost-effective integration across multiple aviation platforms.  \n \nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering S&T focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Aviation Development Directorate of the U.S. Army Aviation and Missile Research, Development and Engineering Center (AMRDEC), Joint Base Langley-Eustis, VA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Unmanned and Optionally Manned Systems"
                                    },
                                    "Description": {
                                        "val": "Mature and apply tactical behavior algorithms and safe-flight technologies to enable unmanned and optionally manned aircraft to maintain safe, responsive, flexible and tactical formation flight with manned helicopters for unmanned wingman applications in re-supply, reconnaissance, surveillance and attack missions.  Develop, mature, apply, and integrate advanced decision aiding, autonomy, and human-machine interface technologies to enable the helicopter flight crew to make full use of the capabilities of an unmanned aerial system (UAS) without requiring continuous attention. Efforts include development of intelligent algorithms that aid decisions and actions in order to increase situation awareness, maximize use of on-board and off-board sensors, efficiently manage a team of manned and unmanned vehicles and their mission systems, and develop and execute effective and appropriate offensive and defensive responses."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.816"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed fabrication of an unattended delivery and landing system through incorporation of three dimensional (3-D) terrain analysis and mapping; matured and integrated multi-vehicle control technologies for cargo\/resupply UAS operations; and prepared for flight demonstration."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.257"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Mature and integrate autonomous retrograde capability on rotary-wing cargo UAS; conduct flight testing and system-level demonstration of all technologies integrated on the cargo unmanned aerial demonstrator system; determine highest-value unmanned wingman functions for decision aiding and autonomy; and select and begin algorithm implementation and integration approach."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.004"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.004"
                                            },
                                            "Text": {
                                                "val": "Will complete implementation of aiding and autonomy algorithms into simulation; test and evaluate task and mission effectiveness of interface devices and concepts, and aiding and autonomy algorithms; optimize approach for full integration of selected devices, concepts, and algorithms; and demonstrate a hierarchical structure of nested crew aiding and autonomy functions and evaluate the structure and functionality set for application across multiple Army aircraft, both current and future, and for suitability as the aiding\/autonomy domain of the Joint Common Architecture (JCA)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aircraft Weapon & Sensor Systems"
                                    },
                                    "Description": {
                                        "val": "Mature and integrate sensors, weapons, and networked technologies into manned and unmanned air systems for enhanced reconnaissance, attack, utility, and cargo missions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.671"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Performed detailed design of the lightweight, integrated weapon system concept developed in FY12 to defeat threat aircraft systems (manned and unmanned) and soft ground targets; matured designs for target tracking algorithms to enable airborne engagement of maneuvering targets; began evaluation of performance of airburst ammunition fuzing concepts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.995"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Mature advanced fire control systems and demonstrate an integrated weapon system through flight test, including: sensors, proximity\/point detonation airburst ammunition and sensor targeting algorithms, for use against ground and air targets. This effort terminates at the end of FY14."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "447"
                    },
                    "ProjectTitle": {
                        "val": "ACFT Demo Engines"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "8.869"
                        },
                        "CurrentYear": {
                            "val": "8.272"
                        },
                        "BudgetYearOne": {
                            "val": "8.254"
                        },
                        "BudgetYearOneBase": {
                            "val": "8.254"
                        },
                        "BudgetYearTwo": {
                            "val": "8.276"
                        },
                        "BudgetYearThree": {
                            "val": "4.979"
                        },
                        "BudgetYearFour": {
                            "val": "6.131"
                        },
                        "BudgetYearFive": {
                            "val": "6.187"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates power system technologies through design, fabrication, and evaluation of advanced engine components in order to improve the performance of turbine engines for vertical lift aircraft.  This project supports Army modernization by demonstrating mature technologies for lighter turbine engines that provide increased power, increased fuel efficiency, improved sustainability and reduced maintenance.  These advanced engine designs will significantly improve the overall aircraft performance characteristics and reduce the logistical footprint of vertical lift aircraft.    \n \nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering S&T focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Aviation Development Directorate of the U.S. Army Aviation and Missile Research, Development, and Engineering Center (AMRDEC), at Joint Base Langley-Eustis, VA. \n\n \nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering S&T focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Aviation Development Directorate of the Aviation and Missile Research, Development, and Engineering Center (AMRDEC), at Joint Base Langley-Eustis, VA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Future Affordable Turbine Engine (FATE)"
                                    },
                                    "Description": {
                                        "val": "Demonstrate an advanced, innovative 7000 horsepower class gas turbine engine that provides significant improvement in operational capability for current and future rotorcraft.  FATE uses sequential design and fabrication iterations to mature a design to demonstrate significant reduction in specific fuel consumption (SFC), significant improvement in horsepower-to-weight ratio, and significant reduction in production and maintenance cost compared to year 2000 state-of-the-art engine technology.  The sequential design and fabrication process will begin with the compressor subsystem, then the combustor subsystem, then the turbine subsystem, and finally the mechanical systems.  Work in this project is coordinated with efforts in PE 0602211A, project 47A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.869"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed detailed system design activities and initiated tests for multiple engine subsystems and components (e.g. compressor, turbine, combustor, and mechanical systems), with an emphasis on the compressor and turbine subsystems of the advanced FATE design; began validation of the design's aerodynamic performance and mechanical integrity, prior to the first integrated, full-engine test; and began analysis of completed component test results to support redesign efforts as required for future engine builds."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.272"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete all remaining component tests in support of first engine build; use results from these initial component level tests to complete\/refine hardware fabrication efforts as appropriate for the first engine build and redesigned component tests; complete FATE engine hardware fabrication and initiate assembly\/instrumentation for first engine test; and identify design improvements for goal demonstration testing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.254"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.254"
                                            },
                                            "Text": {
                                                "val": "Will complete assembly\/instrumentation for first engine test; this initial, full engine, system level test will validate the mechanical integrity of the advanced FATE architecture and provide data for an initial integrated performance assessment; begin redesigned component tests in support of final goal engine build; and use results from first engine test to establish optimized component flow areas and variable geometry schedules."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}