{
    "id": "1559af6828ee6b0376f87d32292b7eb03bd806b5",
    "meta": {
        "filename": "dod-2015_RDTE_2015_ARMY_BA6_RDTE_JustificationBook_Army_PB_2015.zzz_unzipped_RDTE_JustificationBook_Army_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604258A"
        },
        "ProgramElementTitle": {
            "val": "TARGET SYSTEMS DEVELOPMENT"
        },
        "R1LineNumber": {
            "val": "136"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "12.583"
            },
            "CurrentYear": {
                "val": "13.481"
            },
            "BudgetYearOne": {
                "val": "10.040"
            },
            "BudgetYearOneBase": {
                "val": "10.040"
            },
            "BudgetYearTwo": {
                "val": "9.717"
            },
            "BudgetYearThree": {
                "val": "16.119"
            },
            "BudgetYearFour": {
                "val": "9.899"
            },
            "BudgetYearFive": {
                "val": "10.216"
            }
        },
        "ProgramElementNote": {
            "val": "FY13 adjustments attributed to Congressional General Reductions (-23 thousand); SBIR\/STTR transfers (-300 thousand); and Sequestration reductions (-1.128 million).\nFY15 reduction attributed to realignment to other higher priority Army programs."
        },
        "ProgramElementMissionDescription": {
            "val": "This program funds aerial and ground target hardware and software development, maintenance, and upgrades.  The overall objective is to ensure validation of weapon system accuracy and reliability by developing aerial and ground targets essential for test and evaluation (T&E).  These targets are economical and expendable, remotely controlled or stationary, and often destroyed in use.  The Army is the Tri-Service lead under Reliance for providing rotary wing, mobile ground, towed, and designated targets for T&E.  The Army executes development of some Service-peculiar target requirements in support of quality assurance, lot acceptance, and training and continues development of Service-peculiar and on-going target materiel upgrades to maintain continuity with current weapons technology and trends in modern and evolving Army weapons."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "14.034"
                },
                "CurrentYear": {
                    "val": "13.488"
                },
                "BudgetYearOne": {
                    "val": "12.055"
                },
                "BudgetYearOneBase": {
                    "val": "12.055"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "12.583"
                },
                "CurrentYear": {
                    "val": "13.481"
                },
                "BudgetYearOne": {
                    "val": "10.040"
                },
                "BudgetYearOneBase": {
                    "val": "10.040"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.451"
                },
                "CurrentYear": {
                    "val": "-0.007"
                },
                "BudgetYearOne": {
                    "val": "-2.015"
                },
                "BudgetYearOneBase": {
                    "val": "-2.015"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.023"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.300"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "-0.007"
                                },
                                "BudgetYearOne": {
                                    "val": "-2.015"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.015"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-1.128"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "238"
                    },
                    "ProjectTitle": {
                        "val": "Aerial Targets"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "8.982"
                        },
                        "CurrentYear": {
                            "val": "10.026"
                        },
                        "BudgetYearOne": {
                            "val": "7.397"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.397"
                        },
                        "BudgetYearTwo": {
                            "val": "7.189"
                        },
                        "BudgetYearThree": {
                            "val": "8.501"
                        },
                        "BudgetYearFour": {
                            "val": "5.914"
                        },
                        "BudgetYearFive": {
                            "val": "6.048"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Rotary Wing Targets completed in FY13."
                        },
                        "ProjectMissionDescription": {
                            "val": "Aerial Targets support Army Transformation by providing for development, acquisition, operation, storage, update, and maintenance of realistic surrogate or acquired threat high-performance, multi-spectral aerial targets and development of virtual target computer models of aerial targets. Modern weapons require test, evaluation, and training using threat representative aerial targets to assess their effectiveness on the battlefield.  This program encompasses a family of rotary and fixed-wing targets; full-scale, miniature, and subscale targets; virtual targets; ancillary devices; and their control systems.  These products are required to adequately stress weapon systems undergoing test and evaluation (T&E).  In order to stress systems during T&E, aerial targets must have flight characteristics, signatures, and other performance factors that emulate the modern threat.  This program includes long-range planning to determine future target needs and development of coordinated requirement documents; the management of target research, development, test and evaluation process; execution of the validation process to ensure that surrogate targets adequately represent the threat; development and acquisition of surrogate and acquired targets; and continuing maintenance, storage, and development\/enhancement\/update via engineering services of the developed and acquired threat targets to ensure availability for the T&E customer.  The Army is the Reliance lead for Rotary Wing Targets and towed target developments and the Tri-Service lead for procurement and enhancement of the MQM-107 fixed wing target."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Engineering and Manufacturing Development (EMD) phase contract activity for the Rotary Wing Targets."
                                    },
                                    "Description": {
                                        "val": "Sustainment phase contract activities for the Rotary Wing Targets, including updates for obsolescence, maintenance, and safety to support Test & Evaluation (T&E) programs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.468"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed the EMD for the Rotary Wing Targets program to provide flight operations of DoD's current fleet of helicopters.  Rotary Wing Targets also provided updates for obsolescence, maintenance, and safety to support T&E programs such as Navy Standard Missile (SM-6), Navy LHA air defense upgrades, and Army and Navy Aircraft Survivability development projects."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Engineering and Manufacturing Development (EMD) phase contract activity for the High Speed Aerial Target."
                                    },
                                    "Description": {
                                        "val": "Continue EMD phase contract activities for the High Speed Aerial Target (HSAT, MQM-107) equipment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.232"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued EMD for the aging High Speed Aerial Target (HSAT, MQM-107) that provides a realistic aerial target capable of simulating the performance of enemy aircraft to aid in the reseach, development, test, and evaluation of weapons systems and to aid in training operational units employing producton missile systems. Funds were required to overcome obsolescence for spare and repair parts, and to maintain equipment and documenation for safe operations supporting T&E programs such as Patriot, Stinger, and classified programs for Army and Tri-Service customers."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.386"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continues EMD for the aging High Speed Aerial Target (HSAT, MQM-107) that will provide a realistic aerial target capable of simulating the performance of enemy aircraft to aid in the reseach, development, test, and evaluation of weapons systems and to aid in training operational units employing producton missile systems. Funds are required to overcome obsolescence for spare and repair parts, and to maintain equipment and documenation for safe operations supporting T&E programs such as Patriot, Stinger, JLENS, MEADS, and classified programs for Army and Tri-Service customers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.054"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.054"
                                            },
                                            "Text": {
                                                "val": "Will continue EMD for the aging High Speed Aerial Target (HSAT, MQM-107) that will provide a realistic aerial target capable of simulating the performance of enemy aircraft to aid in the reseach, development, test, and evaluation of weapons systems and to aid in training operational units employing producton missile systems. Funds will be required to overcome obsolescence for spare and repair parts, and to maintain equipment and documenation for safe operations. Supports all Army systems needing to test ISR, kinetic, EW, IR or ISR capabilities againts an aerial target with high speed, high altitude flight envelope."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Engineering and Manufacturing Development (EMD) phase contract activity for the Target Tracking Control Systems (TTCS) and aerial target control components."
                                    },
                                    "Description": {
                                        "val": "Continue EMD phase contract activities for the TTCS and aerial target control components."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.620"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued EMD for the TTCS and aerial target control components. Provides for design modifications to solve obsolescence problems and updates software to correct anomalies. Provides for software performance enhancement modifications to support T&E missions, improves test sets and developes upgraded operator displays. Updates documentation of the system and operations and maintenance manuals.  Supported operational repair and maintenance with engineering analysis of target control system performance. Provides support to programs such as Patriot, MEADS, and others."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.649"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continues EMD for the TTCS and aerial target control components. Will provide for design modifications to solve obsolescence problems and updates software to correct anomalies. Will provide for software performance enhancement modifications to support T&E missions, improve test sets and develop upgraded operator displays. Will update documentation of the system and operations and maintenance manuals.  Will support operational repair and maintenance with engineering analysis of target control system performance. This will provide support to programs such as Patriot, MEADS, and others."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.602"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.602"
                                            },
                                            "Text": {
                                                "val": "Will continue EMD for the TTCS and aerial target control components. Will provide for design modifications to solve obsolescence problems and updates software to correct anomalies. Will provide for software performance enhancement modifications to support T&E missions, improve test sets and develop upgraded operator displays. Will update documentation of the system and operations and maintenance manuals.  Will support operational repair and maintenance with engineering analysis of target control system performance."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Engineering and Manufacturing Development (EMD) phase contract activity for the Towed Targets\/Ancillary devices."
                                    },
                                    "Description": {
                                        "val": "Continue EMD phase contract activities for the Towed Targets\/Ancillary devices."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.696"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued EMD for the Towed Targets\/Ancillary devices. Continued development, enhancement, maintenance, and storage for all RDT&E aerial targets, towed targets, and ancillary devices. Continued development and testing of Low Cost Towed target systems (Cruise Missile Tow Target, Reduced Radar Tow Target, and the Special Low Altitude Tow Target) emulating current threats at a very low cost to Patriot, JLENS and classified customers.  Signature modification and performance enhancement efforts for these targets is ongoing. Investigated\/tested other cost-saving towed systems (Glide-Tow, Towed Spheres, Height-Keeping-Tow, and Tow Test Bed) for Air Defense Weapons System customers."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.114"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continues EMD for the Towed Targets\/Ancillary devices. Continues development, enhancement, maintenance, and storage for all RDT&E aerial targets, towed targets, and ancillary devices. Continues development and testing of Low Cost Towed target systems (Cruise Missile Tow Target, Reduced Radar Tow Target, and the Special Low Altitude Tow Target) emulating current threats at a very low cost to Patriot, JLENS and classified customers.  Signature modification and performance enhancement efforts for these targets is ongoing. Investigates\/tests other cost-saving towed systems (Glide-Tow, Towed Spheres, Height-Keeping-Tow, and Tow Test Bed) for Air Defense Weapons System customers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.915"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.915"
                                            },
                                            "Text": {
                                                "val": "Will continue EMD for the Towed Targets\/Ancillary devices. Will continue development, enhancement, maintenance, and storage for all RDT&E aerial targets, towed targets, and ancillary devices. Will continue development and testing of Low Cost Towed target systems (Cruise Missile Tow Target, Reduced Radar Tow Target, and the Special Low Altitude Tow Target) emulating current threats at a very low cost to Patriot, JLENS and classified customers.  Signature modification and performance enhancement efforts for these targets is ongoing. Investigates\/tests other cost-saving towed systems (Glide-Tow, Towed Spheres, Height-Keeping-Tow, and Tow Test Bed) for Air Defense Weapons System customers."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Engineering and Manufacturing Development (EMD) phase contract activity for the Integrated Avionics Package (IAP)."
                                    },
                                    "Description": {
                                        "val": "Continue EMD phase contract activities for the IAP."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.258"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued EMD for the IAP which provides the avionics for aerial targets to support multiple mission requirements for programs such as Patriot, and MEADS. Designed component changes to correct for obsolescence. Updated software to correct issues and to modify the software to support specific test and evaluation mission requirements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.271"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete the EMD for the IAP which provides the avionics for aerial targets to support multiple mission requirements for programs such as Patriot, and MEADS."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Engineering and Manufacturing Development (EMD) phase contract activity for Aerial Virtual Targets."
                                    },
                                    "Description": {
                                        "val": "Continue EMD phase contract activities for Aerial Virtual Targets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.871"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued EMD for Aerial Virtual Targets for evolving Army and DoD simulation standards and evolving implementation techniques; focuses on simulation target models of airplanes, helicopters, missiles, unmanned aerial vehicles, and aerial targets in commonly used formats to support visualization, infrared analysis, and radar analysis simulations; supports verification and validation of models, and provides archiving and distribution of simulation target models to simulation developers throughout the Army and DoD T&E communities. Simulation target models are employed to facilitate simulations for developmental testing (DT) and operational testing (OT) test planning, test rehearsal, post-test analysis, hardware-in-the-loop testing, and execution of test events that are too costly or difficult to be conducted under actual field conditions. These models are being used by multiple DoD agencies and multiple weapon systems such as Close Combat Weapon System (CCWS), Unmanned Aerial System, Lower Tier Program offices, and Longbow Hellfire."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.098"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue EMD for Aerial Virtual Targets for evolving Army and DoD simulation standards and evolving implementation techniques; focuses on simulation target models of airplanes, helicopters, missiles, unmanned aerial vehicles, and aerial targets in commonly used formats to support visualization, infrared analysis, and radar analysis simulations; supports verification and validation of models, and provides archiving and distribution of simulation target models to simulation developers throughout the Army and DoD T&E communities. Simulation target models are employed to facilitate simulations for developmental testing (DT) and operational testing (OT) test planning, test rehearsal, post-test analysis, hardware-in-the-loop testing, and execution of test events that are too costly or difficult to be conducted under actual field conditions. These models are being used by multiple DoD agencies and multiple weapon systems such as Close Combat Weapon System (CCWS), Unmanned Aerial System, Lower Tier Program offices, and Longbow Hellfire."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.753"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.753"
                                            },
                                            "Text": {
                                                "val": "Will continue EMD for Aerial Virtual Targets for evolving Army and DoD simulation standards and evolving implementation techniques; will focus on simulation target models of airplanes, helicopters, missiles, unmanned aerial vehicles, and aerial targets in commonly used formats to support visualization, infrared analysis, and radar analysis simulations; will support verification and validation of models, and provides archiving and distribution of simulation target models to simulation developers throughout the Army and DoD T&E communities. Simulation target models are employed to facilitate simulations for developmental testing (DT) and operational testing (OT) test planning, test rehearsal, post-test analysis, hardware-in-the-loop testing, and execution of test events that are too costly or difficult to be conducted under actual field conditions. These models are being used by multiple DoD agencies and multiple weapon systems such as Close Combat Weapon System (CCWS), Unmanned Aerial System, Lower Tier Program offices, and Longbow Hellfire."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Engineering and Manufacturing Development (EMD) phase contract activity for the Army Ground Aerial Target Control System (AGATCS)."
                                    },
                                    "Description": {
                                        "val": "EMD phase contract activities for the Army Ground Aerial Target Control System (AGATCS). which will support a modern current technology target control system for control of both aerial and ground targets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.264"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued EMD for the AGATCS which provides a modern current technology target control system for control of aerial, ground, and seaborne targets. The system incorporates software for control of existing targets and provisions for control of future target systems. Replaces the existing aerial target control TTCS and several different ground target control systems that becomes obsolete and non-supportable with a DIACAP compliant control system. Provides control system components within the aerial and ground targets to be controlled by the AGATCS. Provides support to programs such as Patriot, MEADS, E-IBCT, Apache, and others."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.928"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continues EMD for the AGATCS which provides a modern current technology target control system for control of aerial, ground, and seaborne targets. The system incorporates software for control of existing targets and provisions for control of future target systems. Replaces the existing aerial target control TTCS and several different ground target control systems that becomes obsolete and non-supportable with a DIACAP compliant control system. Provides control system components within the aerial and ground targets to be controlled by the AGATCS. Provides support to programs such as Patriot, MEADS, E-IBCT, Apache, and others."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.621"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.621"
                                            },
                                            "Text": {
                                                "val": "Will continue EMD for the AGATCS which provides a modern current technology target control system for control of aerial, ground, and seaborne targets. The system incorporates software for control of existing targets and provisions for control of future target systems. Replaces the existing aerial target control TTCS and several different ground target control systems that becomes obsolete and non-supportable with a DIACAP compliant control system. Provides control system components within the aerial and ground targets to be controlled by the AGATCS. Provides support to programs such as Patriot, MEADS, E-IBCT, Apache, and others."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Engineering and Manufacturing Development (EMD) phase contract activity for the Unmanned Aerial System - Target (UAS-T)."
                                    },
                                    "Description": {
                                        "val": "Continue EMD phase contract activities for the UAS-T to provide threat representative support for test and experimentation missions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.573"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued EMD for the UAS-T to operate and maintain a generic, tactical class, unmanned aircraft system target to support a wide variety of test requirements as well as to provide threat representative support for test and experimentation missions. Funds enabled the identification and correction of system anomalies identified during flight operations. Funds provided forth demonstration flights of production air vehicles to verify performance of the production equipment. Provided limited engineering capability to address minor enhancements to the basic target system identified during operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.580"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continues EMD for the UAS-T to operate and maintain a generic, tactical class unmanned aircraft system target to support a wide variety of test requirements by providing generic threat representative support for test and experimentation missions. Projects to be supported include the Space and Missile Defense Command High Energy Laser project, the Stinger proximity fuse development and testing, other missile system upgrade projects, JIAMDO sponsored Black Dart 2014, Littoral Combat Ship testing, and a variety of research and development efforts. Funds will enable the identification and correction of system anomalies identified during operations and the flight demonstration of system corrections. Funds will provide for limited engineering capability to address minor enhancements to the basic target system to meet shortcomings identified during operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.452"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.452"
                                            },
                                            "Text": {
                                                "val": "Will continue EMD for the UAS-T to operate and maintain a generic, tactical class unmanned aircraft system target to support a wide variety of test requirements by providing generic threat representative support for test and experimentation missions. Funds will enable the identification and correction of system anomalies identified during operations and the flight demonstration of system corrections. Funds will provide for limited engineering capability to address minor enhancements to the basic target system to meet shortcomings identified during operations. Funds will also provide for updating of the system drawing package and systems documents to incorporate modifications made to the system. Supports all Army systems needing to test ISR, kinetic, EW, IR or ISR capabilities against an unmanned aerial target with a medium flight envelope."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "459"
                    },
                    "ProjectTitle": {
                        "val": "Ground Targets"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.601"
                        },
                        "CurrentYear": {
                            "val": "3.455"
                        },
                        "BudgetYearOne": {
                            "val": "2.643"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.643"
                        },
                        "BudgetYearTwo": {
                            "val": "2.528"
                        },
                        "BudgetYearThree": {
                            "val": "7.618"
                        },
                        "BudgetYearFour": {
                            "val": "3.985"
                        },
                        "BudgetYearFive": {
                            "val": "4.168"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Mibile Ground Target Hardware completed in FY13."
                        },
                        "ProjectMissionDescription": {
                            "val": "This program funds Army efforts to support test and evaluation (T&E) of advanced weapon systems and supports Army Transformation by developing surrogates, acquiring foreign equipment and developing virtual target computer models of ground vehicle targets. These products are required to adequately stress weapon systems undergoing T&E. This tasking includes long-range planning to determine future target needs and development of coordinated requirement documents; the centralized management of the ground target research, development, test and evaluation processes; execution of the validation process; acquisition of foreign equipment; and continuing maintenance, storage, and development\/enhancement\/update via engineering services of developed and acquired targets to ensure availability for T&E customers. This program also manages use of current assets and operates centralized spare parts program. The US Army is the Tri-Service lead for providing mobile ground targets for T&E."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Mobile Ground Target Operations"
                                    },
                                    "Description": {
                                        "val": "Mobile Ground Target Operations to provide oversight of five Primary Operating Centers to include operation, storage, maintenance, repair, safety and configuration management.  Efforts support users such as Brigade Modernization Command (BMC), Apache Block III, Guided Multiple Launch Rocket System (GMLRS), PM Robotic Unmanned Sensor (PM RUS), Small Diameter Bomb (SDB II), PM Unmanned Aircraft Systems (PM UAS) and others."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.476"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Mobile Ground Target Operations provides five Primary Operating Centers to include operations, storage, maintenance, repair, safety and configuration management for 67 active and 178 inactive Foreign Mobile Ground Target Vehicles, and acquisition of new material and spare parts. Efforts supported users such as U.S. Army Test and Evaluation Command (ATEC), Apache Block-III, GMLRS, Brigade Modernization Command, KIOWA, Ground Combat Vehicle, Shadow, Joint Light Tactical Vehicle(JLTV), PM Force Protection System, Unmanned Aircraft System, Light Armored Vehicle and others."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.753"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Mobile Ground Target Operations provides five Primary Operating Centers to include operations, storage, maintenance, repair, safety and configuration management for 67 active and 178 inactive Foreign Mobile Ground Target Vehicles, and acquisition of new material and spare parts. Efforts support users such as ATEC, Apache Block-III, GMLRS, Brigade Modernization Command, KIOWA, Ground Combat Vehicle, Shadow, Joint Light Tactical Vehicle(JLTV), PM Force Protection System, Unmanned Aircraft System, Light Armored Vehicle and others."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.079"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.079"
                                            },
                                            "Text": {
                                                "val": "Mobile Ground Target Operations provides five Primary Operating Centers to include operations, storage, maintenance, repair, safety and configuration management for 67 active and 178 inactive Foreign Mobile Ground Target Vehicles, and acquisition of new material and spare parts. Efforts will support users such as ATEC, Apache Block-III, GMLRS, Brigade Modernization Command, KIOWA, Ground Combat Vehicle, Shadow, Joint Light Tactical Vehicle(JLTV), PM Force Protection System, Unmanned Aircraft System, Light Armored Vehicle and others."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mobile Ground Target Hardware"
                                    },
                                    "Description": {
                                        "val": "Mobile Ground Targets provides threat fleet with up to date threat representative ground targets that emulate the visual, infrared, radio frequency and acoustic signatures.  \nThese ground targets include: 1) air defense systems with emitters, 2) main battle tanks, 3) infantry fighting vehicles, 4) armored personnel carriers, 5) Decoys, and 6) insurgent representation to adequately stress weapon sensors and provide realistic maneuvers, and communications. Provides targets for multiple customers' DT & OT events to include U.S. Army Test and Evaluation Command (ATEC), Apache Block-III, GMLRS, Brigade Modernization Command, KIOWA, Ground Combat Vehicle, Shadow and others."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.456"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed the Mobile Ground Targets project that provided threat fleet with up to date threat representative ground targets that emulate the visual, infrared, radio frequency and acoustic signatures.  \nThese ground targets included: 1) air defense systems with emitters, 2) main battle tanks, 3) infantry fighting vehicles, 4) armored personnel carriers, 5) Decoys, and 6) insurgent representation to adequately stress weapon sensors and provide realistic maneuvers, and communications. Provides targets for multiple customers' DT & OT events to include ATEC, Apache Block-III, GMLRS, Brigade Modernization Command, KIOWA, Ground Combat Vehicle, Shadow and others."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ground Virtual Targets"
                                    },
                                    "Description": {
                                        "val": "Government System Test and Evaluation to support the research and development of Ground Virtual Targets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.669"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued Government System Test and Evaluation to fund the research and development of Ground Virtual Targets for evolving Army and DoD simulation standards and implementation techniques.  Focus on simulation target models of wheeled and tracked ground vehicles in commonly used model formats; develop simulation target models visualization simulations, infrared (IR) analysis simulations, and radio frequency (RF) analysis simulations; support verification and validation of models, and provide archiving and distribution of simulation target models to simulation developers throughout the Army and DoD T&E communities.  Simulation target models are employed to facilitate simulations for both developmental testing (DT) and operational testing (OT); Virtual Targets support test planning, test rehearsal, post-test analysis, hardware-in-the-loop testing, and execution of test events that are too costly or difficult to be conducted under actual field conditions.  These models are used by multiple DoD agencies and multiple weapon systems such as the Joint Air to Ground Missile (JAGM) and Longbow Hellfire offices."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.702"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue Government System Test and Evaluation to fund the research and development of Ground Virtual Targets for evolving Army and DoD simulation standards and implementation techniques.  Focuses on simulation target models of wheeled and tracked ground vehicles in commonly used model formats; develop simulation target models visualization simulations, infrared (IR) analysis simulations, and radio frequency (RF) analysis simulations; supports verification and validation of models, and provides archiving and distribution of simulation target models to simulation developers throughout the Army and DoD T&E communities.  Simulation target models will be employed to facilitate simulations for both developmental testing (DT) and operational testing (OT); Virtual Targets support test planning, test rehearsal, post-test analysis, hardware-in-the-loop testing, and execution of test events that are too costly or difficult to be conducted under actual field conditions.  These models will be used by multiple DoD agencies and multiple weapon systems such as the Joint Air to Ground Missile (JAGM) and Longbow Hellfire offices."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.564"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.564"
                                            },
                                            "Text": {
                                                "val": "Will continue Government System Test and Evaluation to fund the research and development of Ground Virtual Targets for evolving Army and DoD simulation standards and implementation techniques.  Will focus on simulation target models of wheeled and tracked ground vehicles in commonly used model formats; will develop simulation target models visualization simulations, infrared (IR) analysis simulations, and radio frequency (RF) analysis simulations; will support verification and validation of models, and will provide archiving and distribution of simulation target models to simulation developers throughout the Army and DoD T&E communities.  Simulation target models will be employed to facilitate simulations for both developmental testing (DT) and operational testing (OT); Virtual Targets support test planning, test rehearsal, post-test analysis, hardware-in-the-loop testing, and execution of test events that are too costly or difficult to be conducted under actual field conditions.  These models will be used by multiple DoD agencies and multiple weapon systems."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}