{
    "id": "15f11dfd4f3bc12ee1e2fb6886489cebe5a3ddfc",
    "meta": {
        "filename": "dod-2015_RDTE_2015_NAVY_BA7_RDTE_JustificationBook_Navy_PB_2015.zzz_unzipped_RDTE_JustificationBook_Navy_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0101402N"
        },
        "ProgramElementTitle": {
            "val": "Navy Strategic Comms"
        },
        "R1LineNumber": {
            "val": "175"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "402.959"
            },
            "PriorYear": {
                "val": "17.461"
            },
            "CurrentYear": {
                "val": "21.723"
            },
            "BudgetYearOne": {
                "val": "13.676"
            },
            "BudgetYearOneBase": {
                "val": "13.676"
            },
            "BudgetYearTwo": {
                "val": "13.174"
            },
            "BudgetYearThree": {
                "val": "12.889"
            },
            "BudgetYearFour": {
                "val": "12.779"
            },
            "BudgetYearFive": {
                "val": "16.051"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Shore to Ship Communications System develops communication system elements which provide Nuclear Command, Control and Communications (NC3) from originator to execution platforms. The Shore to Ship Communications System provides continuous assessment of the command and control links between the National Command Authority and missile platforms and which is conducted to ensure compliance with Nuclear Command and Control System Technical Performance Criteria (NTPC). \nThe Shore to Ship Communications System addresses joint system design issues for Emergency Action Message (EAM) distribution to all nuclear platforms and provides evaluation of joint interoperability of EAM delivery systems. Tools are developed to provide strategic command and control planning within the submarine shore infrastructure to support deployed ballistic missile submarines. \n\nThe Navy Strategic Communications Project responds to emerging E-6B Command, Control and Communications capability requirements by performing technical evaluations, modeling and simulation, investigative ground and flight testing, enhanced software modifications and development of configuration modifications.  The E-6B is a manned airborne platform that provides survivable, endurable and reliable Command, Control and Communications capability in support of the President, Secretary of Defense and United States strategic and non-strategic forces.  These efforts support follow-on aircraft modification procurements necessary to ensure interoperability in information-assured network-centric strategic environments."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "19.208"
                },
                "CurrentYear": {
                    "val": "21.729"
                },
                "BudgetYearOne": {
                    "val": "14.285"
                },
                "BudgetYearOneBase": {
                    "val": "14.285"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "17.461"
                },
                "CurrentYear": {
                    "val": "21.723"
                },
                "BudgetYearOne": {
                    "val": "13.676"
                },
                "BudgetYearOneBase": {
                    "val": "13.676"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.747"
                },
                "CurrentYear": {
                    "val": "-0.006"
                },
                "BudgetYearOne": {
                    "val": "-0.609"
                },
                "BudgetYearOneBase": {
                    "val": "-0.609"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.006"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.187"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.325"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "1.471"
                                },
                                "BudgetYearOneBase": {
                                    "val": "1.471"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.001"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-2.080"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.080"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-1.608"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "1083"
                    },
                    "ProjectTitle": {
                        "val": "Shore To Ship Com System"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "133.562"
                        },
                        "PriorYear": {
                            "val": "16.348"
                        },
                        "CurrentYear": {
                            "val": "21.723"
                        },
                        "BudgetYearOne": {
                            "val": "13.180"
                        },
                        "BudgetYearOneBase": {
                            "val": "13.180"
                        },
                        "BudgetYearTwo": {
                            "val": "12.670"
                        },
                        "BudgetYearThree": {
                            "val": "12.376"
                        },
                        "BudgetYearFour": {
                            "val": "12.257"
                        },
                        "BudgetYearFive": {
                            "val": "15.519"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Shore to Ship Communication System develops communication elements which provide Nuclear Command, Control and Communications (NC3) from originator to execution platforms.  This portfolio of programs provides design and developments for shore-to-ship transmit and receive communications systems.\n\nThe Low Band Universal Communications System (LBUCS) is a modernization program that will upgrade the transmit and receive subsystems of the Fixed Submarine Broadcast System (FSBS) which are approaching their operational end of life. LBUCS will ensure operational capability through the Very Low Frequency (VLF) architecture by providing system life extension and flexibility of submarine broadcast traffic to submarines operating in a stealth posture. The flexibility includes enhanced throughput and anti-jam capability, ensuring more operational products are delivered to a submarine without risking mast exposure. The flexibility further includes a simplified shore architecture to maintain capability while maximizing use of shore nodes (Broadcast Keying Sites). LBUCS also provides an upgrade to the VLF receive system, with all interoperable waveforms, to ensure continued compliance with Nuclear Command and Control System Technical Performance Criteria (NTPC). \n\nThe Strategic Communications Assessment Program\/Continued Evaluation Program provides constant assessment of the effectiveness of the end-to-end NC3 network and analysis of system performance in various mission locations.\n\nTechnologies to improve high voltage insulators, helix house bushings and antenna components used in the fixed VLF transmit systems are evaluated and tested through the High Voltage Improvement Program (HVIP). Development of information assurance solutions for the Broadcast Control Authority (BCA) and Submarine Operating Authority (SUBOPAUTH) Wide Area Network (SWAN) are part of this program to mitigate vulnerability concerns."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Low Band Universal Communication System (LBUCS)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.812"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Commenced Submarine Operating Authority (SUBOPAUTH) Wide Area Network (SWAN) Information Assurance (IA) upgrade development.\n-Continued statutory and regulatory acquisition documentation in preparation for Low Band Universal Communications System (LBUCS) Transmit Milestone C including the Capability Production Document (CPD).\n-Commenced LBUCS Transmit Engineering Design Model (EDM) Developmental Testing (DT) and Operational Assessment (OA).\n-Commenced LBUCS Receive development.\n-Commenced development of a new Very Low Frequency (VLF) mode, which will be incorporated into the Low Band Universal Communication System (LBUCS) Receive development effort."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.775"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue Submarine Operating Authority (SUBOPAUTH) Wide Area Network (SWAN) Information Assurance (IA) upgrade development.\n-Complete statutory and regulatory acquisition documentation in preparation for LBUCS Transmit Milestone C including the Capability Production Document (CPD).\n-Complete LBUCS Transmit Engineering Design Model (EDM) Developmental Test (DT) and Operational Assessment (OA).\n-Complete LBUCS Transmit Milestone C.\n-Commence Low Band Universal Communication System (LBUCS) Transmit Low Rate Initial Production (LRIP) procurement.\n-Continue LBUCS Receive development.\n-Continue development of a new Very Low Frequency (VLF) Mode which, will be incorporated into the LBUCS Receive development effort.\n-Commence and complete LBUCS Receive Preliminary Design Review (PDR) and Critical Design Review (CDR)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.227"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.227"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue SWAN IA upgrade development.\n-Complete LBUCS Transmit LRIP procurement.\n-Commence LBUCS Transmit LRIP Developmental Testing (DT-C1)\/Integration Testing (DT-C2)\/Operational Testing (OT).\n-Commence and complete LBUCS Transmit LRIP installation.\n-Complete LBUCS Receive development.\n-Commence LBUCS Receive DT\/OA.\n-Complete development of new VLF mode."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Strategic Communications Assessment Program (SCAP)\/Continuing Evaluation Program (CEP)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.084"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continued mission analysis of Ship Submersible Ballistic Nuclear (SSBN) Emergency Action Message (EAM) reception for SSBN patrols.\n-Continued development of automated data collection and analysis tools to reduce latency time between missions and results availability.\n-Commenced and completed reports on performance, adherence to delivery time requirements and shortfalls."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.811"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue mission analysis of Ship Submersible Ballistic Nuclear (SSBN) Emergency Action Message (EAM) reception for SSBN patrols.\n-Continue development of automated data collection and analysis tools to reduce latency time between missions and results availability.\n-Commence and complete reports on performance, adherence to delivery time requirements and shortfalls."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.439"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.439"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue mission analysis of SSBN EAM reception for SSBN patrols.\n-Complete development of automated data collection and analysis tools to reduce latency time between missions and results availability.\n-Commence and complete reports on performance, adherence to delivery time requirements and shortfalls."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Concept Development\/Systems Planning"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.450"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Completed integration of Joint\/Allied Network Enabled Operation (NEO) with Command, Control, Communications, Computers, and Intelligence (C4I) applications\n-Completed United States \/ United Kingdom NEO demonstrations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Voltage Improvement Program (HVIP)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.737"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Completed examination of aging laminated wood used in Very Low Frequency (VLF)\/Low Frequency (LF) Helix Houses. \n-Completed examination of aging multi-conductor High Q inductor cable used in Very Low Frequency (VLF)\/Low Frequency (LF) Helix Houses."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.835"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Commence examination of innovative lighting methods for high voltage Very Low Frequency (VLF)\/Low Frequency (LF) towers.\n-Commence analysis of sulfur hexaflouride (SF6) breakdown in high voltage fields."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.136"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.136"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Complete examination of innovative lighting methods for high voltage VLF\/LF towers.\n-Complete analysis of sulfur hexaflouride (SF6) breakdown in high voltage fields.\n-Commence examination of methods for reducing risk of fire or damage by detection of partial discharge in Helix Houses."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Broadcast Control Authority (BCA)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.265"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continued development of the Submarine Operating Authority (SUBOPAUTH) communications tools to include: file repository, Operation Schedule (OpSked) Editor, Submarine Notes (SubNotes) Editor, and Web Off The Air Monitor (WebOTAM).\n-Commenced systems engineering support for Information Assurance (IA) improvements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.302"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Complete development of SUBOPAUTH communications tools including: file repository, OpSked Editor, SubNotes Editor, and WebOTAM.\n-Continue systems engineering support for Information Assurance (IA) improvements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.378"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.378"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Commence development of Submarine Operating Authority (SUBOPAUTH) Wide Area Network (SWAN) hardening prototype system (lab)\n-Continue systems engineering support for Information Assurance (IA) improvements."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPN\/3107"
                                    },
                                    "Title": {
                                        "val": "Submarine Broadcast"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "3.650"
                                        },
                                        "CurrentYear": {
                                            "val": "7.856"
                                        },
                                        "BudgetYearOne": {
                                            "val": "11.057"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "11.057"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "18.479"
                                        },
                                        "BudgetYearThree": {
                                            "val": "15.844"
                                        },
                                        "BudgetYearFour": {
                                            "val": "17.974"
                                        },
                                        "BudgetYearFive": {
                                            "val": "18.340"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Low Band Universal Communications System (LBUCS): LBUCS is the modernization program that will upgrade the Transmit and Receive subsystems of the Fixed Submarine Broadcast System (FSBS) which are approaching their operational end of life. The development of LBUCS Receive continues in FY15."
                        },
                        "PerformanceMetrics": {
                            "val": "LBUCS FY15: LBUCS Transmit complete Low Rate Initial Procurement (LRIP) procurement and installation. \n\nStrategic Communications Assessment Program (SCAP)\/Continuing Evaluation Program (CEP) FY15: Delivery of Submersible Ballistic Nuclear Submarine (SSBN) patrol reports.\n\nHigh Voltage Improvement Program (HVIP) FY15: Complete examination of innovative lighting methods for high voltage Very Low Frequency (VLF)\/Low Frequency (LF) towers.\n \nBroadcast Control Authority (BCA) FY15: Complete Information Assurance (IA) assessment reports."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0101402N_1083_FILE1.PNG"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0101402N_1083_FILE2.PNG"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0101402N_1083_FILE3.PNG"
                                }
                            }
                        ]
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3002"
                    },
                    "ProjectTitle": {
                        "val": "Navy Strategic Comm Project"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "269.397"
                        },
                        "PriorYear": {
                            "val": "1.113"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.496"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.496"
                        },
                        "BudgetYearTwo": {
                            "val": "0.504"
                        },
                        "BudgetYearThree": {
                            "val": "0.513"
                        },
                        "BudgetYearFour": {
                            "val": "0.522"
                        },
                        "BudgetYearFive": {
                            "val": "0.532"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The E-6 is a manned airborne platform that provides survivable, endurable and reliable Command, Control and Communications capability in support of the President, Secretary of Defense and United States strategic and non-strategic forces. In order to respond effectively to emerging capability requirements, continued effort is needed to perform technical evaluations, modeling and simulation, investigative ground and flight testing, enhanced software modifications and development of configuration modifications. Funding has been added starting in FY15 for advanced development engineering and analysis of hardware\/software required to optimize E-6 systems for interoperability in a network-centric strategic environment."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Conduct Developmental Test (DT) Governmental Training"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.077"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete Block IA ECP DT Governmental Training efforts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Studies & Analysis"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.496"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.496"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Perform and conduct advanced simulations, integrations and demonstrations using E-6B Systems Integration Laboratory and contractor assets of newly developed commercial technology to address system obsolescence and potential upgrades to ensure survivability and reliability of the E-6B platform."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Prototype Aircraft Installation"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.036"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete Block IA ECP Prototype Aircraft Installation efforts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "APN 056400"
                                    },
                                    "Title": {
                                        "val": "E-6 A\/B Series"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "140.159"
                                        },
                                        "CurrentYear": {
                                            "val": "157.549"
                                        },
                                        "BudgetYearOne": {
                                            "val": "212.876"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "212.876"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "196.629"
                                        },
                                        "BudgetYearThree": {
                                            "val": "200.303"
                                        },
                                        "BudgetYearFour": {
                                            "val": "203.856"
                                        },
                                        "BudgetYearFive": {
                                            "val": "178.089"
                                        },
                                        "CostToComplete": {
                                            "val": "489.546"
                                        },
                                        "TotalCost": {
                                            "val": "2409.771"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Advanced development engineering and analysis of hardware\/software required to optimize E-6 systems for interoperability in a network-centric strategic environment."
                        },
                        "PerformanceMetrics": {
                            "val": "Mission Systems Evaluation; Technical Analysis 1st Qtr FY15, Design Analysis 2nd Qtr FY15, SIL Test and Reporting 4th Qtr FY15."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0101402N_3002_FILE1.PNG"
                                }
                            }
                        ]
                    }
                }
            ]
        }
    }
}