{
    "id": "16ac50adc99849ebfd7e5b10eeeaf4ecc863b0cd",
    "meta": {
        "filename": "dod-2015_RDTE_2015_NAVY_BA7_RDTE_JustificationBook_Navy_PB_2015.zzz_unzipped_RDTE_JustificationBook_Navy_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0308601N"
        },
        "ProgramElementTitle": {
            "val": "Modeling & Simulation Support"
        },
        "R1LineNumber": {
            "val": "226"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "16.035"
            },
            "PriorYear": {
                "val": "5.217"
            },
            "CurrentYear": {
                "val": "5.116"
            },
            "BudgetYearOne": {
                "val": "4.719"
            },
            "BudgetYearOneBase": {
                "val": "4.719"
            },
            "BudgetYearTwo": {
                "val": "4.795"
            },
            "BudgetYearThree": {
                "val": "5.019"
            },
            "BudgetYearFour": {
                "val": "5.109"
            },
            "BudgetYearFive": {
                "val": "5.198"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element addresses projects under the Navy Modeling and Simulation (M&S) Office.  It supports technical \nand management initiatives directed by Congress, Department of Defense (DOD), Secretary of the Navy (SECNAV), and \nChief of Naval Operations (CNO) with the aim of bringing organization, focus, and efficiency to the development and \nuse of M&S throughout the Navy and DoD.  It provides a central agency for the formulation and implementation of policy and guidance in M&S, and represents Navy interests in Joint and other agency initiatives.  It funds efforts to define and coordinate the corporate Navy M&S policy and guidance to evolve an interoperable and reusable core M&S capability consistent with the M&S technical framework prescribed by DOD.  Efforts are organized around three product areas: \n(1) Core Services: This activity provides essential planning and coordination of M&S efforts with other Services, the Office of Secretary of Defense (OSD), the Joint Staff, and other agencies to develop policies and procedures necessary for M&S standards, visibility, and potential reuse across DoD.  (2) Community Services:  This activity provides M&S subject matter expert support embedded in the DON M&S Communities to recommend implementations for M&S policies, standards, VV&A, and reuse within their Community and to ensure that the wider DON and DoD are aware (visibility) \nof the M&S products and services, initiatives, processes, and standards.  (3) Community Experiments and Prototypes:  This activity conducts experiments and prototypes aimed at determining the feasibility and applicability of proposed standards or technical approaches to Navy M&S and investigates Service-unique requirements for standards or guidance to achieve M&S efficiencies."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "5.908"
                },
                "CurrentYear": {
                    "val": "5.116"
                },
                "BudgetYearOne": {
                    "val": "5.489"
                },
                "BudgetYearOneBase": {
                    "val": "5.489"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "5.217"
                },
                "CurrentYear": {
                    "val": "5.116"
                },
                "BudgetYearOne": {
                    "val": "4.719"
                },
                "BudgetYearOneBase": {
                    "val": "4.719"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.691"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.770"
                },
                "BudgetYearOneBase": {
                    "val": "-0.770"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.184"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.770"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.770"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.507"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Not applicable.\n\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "2222"
                    },
                    "ProjectTitle": {
                        "val": "Modeling & Simulation"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "16.035"
                        },
                        "PriorYear": {
                            "val": "5.217"
                        },
                        "CurrentYear": {
                            "val": "5.116"
                        },
                        "BudgetYearOne": {
                            "val": "4.719"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.719"
                        },
                        "BudgetYearTwo": {
                            "val": "4.795"
                        },
                        "BudgetYearThree": {
                            "val": "5.019"
                        },
                        "BudgetYearFour": {
                            "val": "5.109"
                        },
                        "BudgetYearFive": {
                            "val": "5.198"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This Program Element addresses projects under the Navy Modeling and Simulation (M&S) Office.  It supports technical and management initiatives directed by Congress, Department of Defense (DoD), Secretary of the Navy (SECNAV), and Chief of Naval Operations (CNO) with the aim of bringing organization, focus, and efficiency to the development and use of M&S throughout the Navy and DoD.  It provides a central agency for the formulation and implementation of policy and guidance in M&S, and represents Navy interests in Joint and other Agency initiatives.  It funds efforts to define and coordinate the corporate Navy M&S policy and guidance to evolve an interoperable and reusable core M&S capability consistent with the M&S technical framework prescribed by DoD.  Efforts are organized around three product areas:  (1) Core Services: This activity provides essential planning and coordination of M&S efforts with other Services, the Office of Secretary of Defense (OSD), the Joint Staff, and other agencies to develop policies and procedures necessary for M&S standards, visibility, and potential reuse across DoD.  (2) Community Services:  This activity provides M&S subject matter expert support embedded in the DON M&S Communities to recommend implementations for M&S policies, standards, VV&A, and reuse within their Community and to ensure that the wider DON and DoD are aware (visibility) of the M&S products and services, initiatives, processes, and standards.  (3) Community Experiments and Prototypes:  This activity conducts experiments and prototypes aimed at determining the feasibility and applicability of proposed standards or technical approaches to Navy M&S and investigates Service-unique requirements for standards or guidance to achieve M&S efficiencies."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "CORE SERVICES"
                                    },
                                    "Description": {
                                        "val": "This activity provides essential planning and coordination of M&S efforts with other Services, the Office of Secretary of Defense (OSD), the Joint Staff, and other agencies to develop policies and procedures necessary for M&S visibility and potential reuse across DoD.  It provides updates to the DoD Enterprise Catalog, M&S Master Plan, and M&S Investment Strategy.  This activity supports development of common services, tools, and databases to ensure the integration and connectivity of M&S products employed in Naval assessments, training, acquisition, and among operational communities.  It manages and maintains the Navy M&S Information Service (NMSIS), the central Naval M&S information resource to support informed M&S investment decision making across DON.  It implements and manages the Modeling and Simulation (M&S) Quality Assurance (VV&A) process and guidelines for implementing for modeling, simulation, and data.  It reviews both new and legacy M&S VV&A plans and reports and develops and maintains the Naval M&S VV&A repository.  It establishes and implements a VV&A training curriculum for developers and Accreditation Agents."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.576"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Chaired NMSG-100 Resource Discovery and Access technical activity to develop processes for generation and maintenance of NATO metadata; worked with the DoD Modeling and Simulation Coordination Office (M&SCO) to prepare for the NMSG Business Meetings; participated in the annual NATO and DoD Review of progress and Technical Activity Proposal and Terms of Reference compliance with DoD Global Information Grid (GIG) Enterprise Services; and authored draft Technical Report for participating country review. Participating countries include Canada, France, Germany, Turkey and United States.  \n- Navy Net-Centric Accomplishments include collaborated with Ocean M&S Executive Agent (MSEA) to obtain metadata updates for the Oceanographic and Atmospheric Master Library (OAML) and posted updates to the M&S Catalog and DoD Enterprise Catalog, published M&S Training Course metadata as single entries to the Enterprise Catalog for discovery, developed and coordinated new NMSO Net Centric Data initiative briefing to assist Service Commands in making their M&S data Net-Centric compliant for improved informational sharing and reuse, provided M&S resources data to Navy Research, Development, Test & Evaluation (RDT&E) for Navy Infrastructure & Capability (NICAP) survey, compared questionnaire data to metadata in the DoD Data Service Environment and M&S Catalog to develop more complete surveys and provide a means to evaluate Navy resources that should be documented with metadata discovery. \n- Provided substantive inputs to DoD plans, strategies, guidance, and definitions. Specific documents reviewed include the latest draft version of the DoD M&S Glossary, the Priority Objective Implementation Plan, Navy [IT] Standards Working Group final draft Charter, DoDI 5000.61 (DoD M&S VV&A ), and the Defense Standardization Program's Standardization Directory (SD-1) updated with additional standardization management activity responsibilities assigned to NMSO.  As a result of this coordination M&S documents were streamlined, rationalized, and synchronized across DoD.\n- Responded to multiple VV&A Help Desk inquiries from organizations to include the Strategic Systems Programs, NAVAIR Flight Dynamics Branch, the Hydrodynamics Department of the Naval Surface Warfare Center, the Joint Strike Fighter (JSF) Operational Test Team, etc.  Provided VV&A information, advice, assistance, and collected VV&A documents for archiving, discovery, and sharing.\n- Newly appointed Technical Deputy for the M&S Steering Committee Priority Objective 2.g targeting VV&A Improvement.   Effort expanded to focus on VV&A policy, education, best practices, and collaboration as a VV&A Improvement Group (VIG).  Action items completed include updating the listing of VV&A-related policy and guidance documents originally compiled in 2011, analysing VV&A behavior that needs to be changed, implementing steps to modify that behavior, and providing the Modeling & Simulation Coordination Office with a roadmap to comply with DoDI 5025.01 (DoD Directives Program).  \n- Researched M&S Standards issues and represented Navy in votes on NATO Standard Agreements and other M&S documents.\n- Coordinated with the NMSO Data and Web Services Lead to update information on the NMSO Navy M&S Information System (NMSIS) relating to VV&A and Standards.  Focused on updating or deleting outdated information, and promoting M&S activities from around the Navy by linking information that promotes Navy's use of M&S.  Also added infomation about the DISA Enterprise Catalog, how to add metadata to it, and how to search it.  \n- Approved requests for access to the M&S Resource Repository (MSRR), M&S Standard Vetting Tool and other tools as NMSO's Navy and Marine Registrar and Resource Content Manager; completed web page and M&S Information System (MSIS) re-design to comply with new DoD Information Assurance Certification (DIACAP) guidance on protection of DoD Personally Identifiable Information (PII). \n- Serves multiple roles in the Simulation Interoperability Standards Organization (SISO), the only non-governmental Standards Development Organization (SDO) focused on M&S Standards. Ensured M&S standardization across the industry and government thus reducing future impacts on Navy programs.  \n   - Vice-Chair of the Standards Activity Committee (SAC) participating in meetings and teleconferences and assisting working groups\n   - SAC Representative to the IEEE Computer Society Standards Activities Board\n   - SAC ex-officio member of the SISO Conference Committee\n   - Vice-Chair of SISO VV&A Forum Planning and Review Panel\n   - Member of Generic Methodology for Verification and Validation Product Development Group\n- Identifying  Naval organizations for classification as a Standard Management Activity (SMA).  These activities will become part of the coordination and review team for M&S Standards and Methodologies Standardization Area (MSSM) documents under the Defense Standardization Program.\n- Provided input on DoD \/ Modeling & Simulation Coordination Office products including: Defense Standardization Program's Acquisition Streamlining and Standardization Information System (ASSIST), Naval SYSCOM Technical Standards Policy, Procedure for New and Reinstated Defense Standards, and Modelling and Simulation Architecture Standards for Technical Interoperability High Level Architecture (HLA).   Highlights include: identified incorrect information about two IEEE Standards (IEEE Std 1730 and IEEE Std 1516.3), provided correct information, and recommended changes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.655"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Fulfill the requirement to write a NATO technical report for NATO's Country review comprising technical aspects of NATO's Resource Discovery and Access effort that will result in a successful closure of the NATO MSG-100 effort.  Completion of the technical report for submission to NATO's Science and Technology Organization Collaborative Support Office web site is expected by April 2014.\n- Assist interested M&S Communities of Interests in their efforts to make M&S resources discoverable for reuse to the Global Information Grid Enterprise Service ensuring compliance with DoD Net Centric Data Strategy (dated May 9, 2003) and Directive 8320.02 (Data Sharing in a Net Centric Department of Defense).\n- Manage the Navy Modeling and Simulation (M&S) Registry of systems to enable access to M&S data searched across repositories and web sites.\n- Perform web page and MSRR upgrades as required to comply with new DoD Information Assurance Certification guidance.\n- Lead DoD M&S Community of Interest Enterprise Data Team. Focus on appropriate use of semantic and structural metadata to make data discoverable, understandable and trusted in support of the Net Centric Data Strategy guidance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.978"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.978"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue FY14 efforts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "COMMUNITY SERVICES"
                                    },
                                    "Description": {
                                        "val": "This activity provides M&S subject matter expert support embedded in the DON M&S Communities to recommend implementations for M&S policies and standards within their Community and to ensure that the wider Navy is aware of the M&S products and services, initiatives, processes, and standards (visibility).  It promotes M&S reuse through cooperative Community M&S activities which identify and prioritize M&S capability requirements between and across Communities.  It also provides an M&S degree program through the Naval Postgraduate School (NPS), Modeling Virtual Environments and Simulation (MOVES) curriculum which qualifies officers to fill 6202-P coded billets.  Financial support for thesis and dissertation efforts done by the students is covered by this funding.  Topics are broad M&S topics of concern which are prioritized based on how they meet the requirements across, between and within the M&S Communities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.446"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Coordinated with the Naval Postgraduate School MOVES Institute and the MOVES degree program to provide military relevant theses topics for their doctorate candidates.  Also successfully negotiated USMC and US Army agreements to use MOVES as their primary post graduated education source to maximize DoD M&S knowledge and standardization and as a result minimize costs. \n- Conducted multiple M&S Forums across the Navy System Commands to coordinate, advise, inform, advocate, and implement M&S plans, strategies, goals, objectives and activities across the M&S acquisition, testing and experimentation communities.\n- Participated in DoD Service working groups and Joint reviews of M&S plans, programs, policies, and procedures, and publications.\n- Continued to promote and support participation in Joint and cooperative research, development, acquisition, and operation of M&S systems, technologies, and capabilities.\n- The Marine Corp Modeling & Simulation Management Office (MCMSMO), per direction from the Marine Corps Senior Analyst, is co-leading a DoD M&S Steering Committee effort on reuse.  Working with M&S communities throughout DoD, this effort aims to outline the circumstances and incentives most appropriate for reuse of models, simulations, and their data.\n- Training IDS team is an integral member of the U.S. Fleet Forces Command (USFF) N73-led Readiness Kill Chain Cross-Functional Team.  Provided insights and assisted with analysis of possible actions the USFF Commander can take now to initiate improvements for training readiness kill chain.\n- Provided support to US Fleet Forces Command Training Directorate for development of Navy wide training policies and programs that facilitate effective force generation at lower costs through the effective use of M&S in the continued development of the Navy Continuous Training Environment and Fleet Synthetic Training Program."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.543"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue FY13 efforts"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.232"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.232"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue FY14 efforts"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "COMMUNITY EXPERIMENTS and PROTOTYPES"
                                    },
                                    "Description": {
                                        "val": "This activity conducts experiments and prototypes aimed at determining the feasibility and applicability of proposed standards or technical approaches to Navy M&S, and investigate Service-unique requirements for standards or guidance.  Individual efforts focus on developing or evaluating approaches to optimize training, assessments and acquisition functional\/mission objectives through more efficient development and use of M&S.  This activity develops methodologies and standards that will result in model and data reusability and interoperability through the formulation of a technical framework.  These standards support the full range of architecture and engineering design requirements across the Navy.  This activity also supports Fleet exercises and experiments through the application of distributed simulations across a wide variety of warfighting and supporting communities.  Specifically, it develops and integrates appropriate M&S into Fleet Synthetic Training (FST), and develops simulation efforts to test and evolve the standards for models, interfaces, and data.  It supports development of tools necessary to enable the seamless access and use of operationally relevant M&S products to support Navy training, warfare assessments and acquisition requirements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.195"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Developed Virtual World Standard Interfaces (VWSI) and finalized architecture as an extension of AMIE to allow virtual environments to rapidly integrate M&S to improve rapid development of requirements, DOTMLPF solutions, and design alternatives.\n   - Successfully tested a Naval Undersea Warfare Center (NUWC) Weapons Analysis Facility (WAF) hardware-in-the-loop torpedo through the AMIE VWSI plug-in to drive and visualize its virtual world representation. \n   - Established an instance of the OpenSimulator virtual world at DISA's Rapid Access Computing Environment (RACE) to provide Navy-wide access for its VWSI reference implementation.   \n   - Completed preliminary testing for VWSI integration with AMIE using Joint Integration Mission Model (JIMM), Comprehensive Acoustic System Simulation (CASS), and Gaussian Ray Bundle (GRAB).  \n- Established, documented, and demonstrated a draft Government-owned, non-proprietary open architecture M&S integration environment titled Architecture Management Integration Environment (AMIE) which is currently in use by 8 Navy Sites, 3 Army Sites, 1 Air Force site, and 1 Academia site and presently has 46 developed interfaces.\n   - The NAVAIR Invention Evaluation Board (IEB) found considerable merit with this project and is filing a patent with the United States Patent Office.\n   - Successfully conducted an open architecture demonstration of AMIE and Future Airborne Capability Environment (FACE).  The integration of the HL-20 FACE compliant model into AMIE is the first step in setting up a test bed to test conformance of FACE components in an operational environment.\n   - Successfully led the integration test utilizing AMIE as the architecture to combine the NAVSEA  Probability of raid annihilation P(ra) test bed physics based simulation data and the Manned Flight Simulator Hardware In-The-Loop (HWIL) MH60S hostile fire gun to run in operational warfare environment.\n   - Successfully utilized AMIE for integration testing with Redstone Test Center (RTC), the Unmanned Aircraft Systems Integration Lab (UASIL), and the Atlantic Test Range (ATR) for the Joint Unmanned Aircraft Systems Mission Environment (JUAS ME) project.\n   - Naval Post Graduate School (NPS) is utilizing VWSI and AMIE capabilities to complete research to support the development of a web-based virtual world environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.918"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Expand AMIE configuration control board beyond NAVAIR, and onto other Navy SYSCOMS and services.\n- Complete regression testing of AMIE and VWSI.\n- Publish reference implementation and Training Guide for AMIE and VWSI using enterprise feedback and results of regression testing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.509"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.509"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue FY14 efforts"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "This is a non-ACAT program.  The focus of the Navy Modeling and Simulation (M&S) Office is to facilitate and enable the efficient use of M&S by minimizing duplication of M&S efforts and maximize the reuse of M&S and data."
                        },
                        "PerformanceMetrics": {
                            "val": "This program supports efforts to  define, develop, and utilize M&S technologies, standards and techniques in DoN and joint programs across a wide range of disciplines and technical arenas.  As such, performance metrics are specific to individual projects initiated under this program element.  Representative examples of performance criteria for M&S support include the following:  VV&A of deployed M&S systems to support Fleet and Force missions and assessments; degree of composability and adaptability of system architectures employed M&S systems; ability of M&S systems to replicate and permit recreation of force or system interactions that otherwise would be performed by more labor-intensive or expensive personnel, forces, or elements; degree to which M&S frameworks would permit rapid integration and employment of analytic capabilities for the analysis and documentationof warfighter missions, weapons systems or Tactics, Techniques and Procedures (TT&P); and ability od a specific M&S technology or technique to meet the requirements specified in an individual project supported by this program."
                        }
                    }
                }
            ]
        }
    }
}