{
    "id": "1bb76ce93bd0686b6cbd6716a2436208e4813567",
    "meta": {
        "filename": "dod-2015_RDTE_2015_NAVY_BA4_RDTE_JustificationBook_Navy_PB_2015.zzz_unzipped_RDTE_JustificationBook_Navy_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603561N"
        },
        "ProgramElementTitle": {
            "val": "Advanced Submarine System Development"
        },
        "R1LineNumber": {
            "val": "40"
        },
        "MdapCode": {
            "val": "P444"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "2281.989"
            },
            "PriorYear": {
                "val": "500.161"
            },
            "CurrentYear": {
                "val": "850.062"
            },
            "BudgetYearOne": {
                "val": "70.551"
            },
            "BudgetYearOneBase": {
                "val": "70.551"
            },
            "BudgetYearTwo": {
                "val": "72.144"
            },
            "BudgetYearThree": {
                "val": "83.088"
            },
            "BudgetYearFour": {
                "val": "78.595"
            },
            "BudgetYearFive": {
                "val": "88.996"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element supports innovative research and development in submarine Hull, Mechanical and Electrical (HM&E) and combat systems technologies and the subsequent evaluation, demonstration, and validation for submarine platforms. It will increase the submarine technology base and provide subsystem design options not currently feasible. The program element also supports programs transitioning from Science and Technology (S&T), Defense Advanced Research Projects Agency (DARPA), Independent Research and Development, and Small Business Innovation Research (SBIR) projects. \nProject Unit 0223:\nThe Advanced Submarine Combat Systems Development non-acquisition (NON-ACAT) Project supports Navy Submarine Acoustic Superiority and Technology Insertion Initiatives through the application of advanced development and testing of sonar and tactical control systems improvements. This Project transitions technologies developed by Navy technology bases, the private sector, Office of Naval Research (ONR), Future Naval Capabilities (FNC), and DARPA. The Project addresses technology challenges to improve tactical control in littoral and open ocean environments for a variety of operational missions including peacetime engagement, surveillance, battle space preparation, deterrence, regional sea denial, precision strike, task group support, and ground warfare support. Prototype hardware\/software systems are developed to demonstrate technologically promising system concepts in laboratory and at-sea submarine environments. Specifically, the focus of the technology efforts will be Advanced Processing Build (APB) for acoustics, imaging, tactical control, electronic warfare, and Advanced Sonar Arrays. APBs develop and demonstrate improvements to current and future sonar\/combat control systems. The Advanced Sonar Arrays program develops and tests new sensors and demonstrates large array configurations. This Project is funded under demonstration and validation, as it develops and integrates hardware for experimental tests related to specific platform applications. Technologies and\/or capabilities developed under this program will be shared, as applicable, with surface and surveillance sonar\/combat system development programs. In particular, development programs for surface ship sonar, Advanced Capability Build (ACB) and surveillance platforms, Advanced Surveillance Build (ASB), will work closely with the APB program to optimize software reuse. ACB, ASB and APB may co-develop capabilities and modular architecture technologies to maximize commonality and cost effectiveness.\n\nProject Unit 2033:\nThe Advanced Submarine Systems Development (ASSD) Program is a non-acquisition program that develops and matures technologies for successful integration into future and modernized submarine classes, thus lowering acquisition and life cycle program costs while improving mission capability.  ASSD transitions Hull, Mechanical, and Electrical (HM&E) technologies and future naval concepts from Science & Technology (S&T) and Research and Development (R&D) to operational platforms; performs tests and demonstrates submarine design and naval architecture products destined for integration into future submarine classes or backfit into existing fleet assets; develops, initially integrates, and does test validation of leading payload concepts for submarine integration in support of the Design for Undersea Warfare; and operates unique R&D experimentation, modeling, testing and simulation facilities to enhance submarine stealth, maneuverability, capability, and affordability. The program also supports Small Business Innovation Research (SBIR), Small Business Technology Transfer (STTR), Office of Naval Research (ONR), Defense Advanced Research Projects Agency (DARPA) Programs and near and mid-term technology insertion to achieve future submarine class total ownership cost reductions, and influence future submarine concept designs and core technologies. Experimentation and demonstration is conducted in a joint warfighting context with other services, (i.e. the U.S. Marines, U.S. Army, and the U.S. Air Force), to enable early assessment of warfighting capabilities, and to contribute to smarter technology selection decisions for potential incremental development. This program also supports Information Exchange Programs and joint Project Arrangements (PA) with the United Kingdom, Canada, Australia and other international partners.\n\nProject 2033 is comprised of  three budget categories: Stealth, Payloads & Sensors, and Innovative Technology Transition\/Concept Development. \nNOTE: Project 2033 has combined Advanced Propulsion\/Ship Concept and Total Ownership Cost (TOC) into Innovative Technology Transition\/Concept Development. Budget categories were combined to consolidate projects into one. \n\nThe major developmental efforts include:\nSustainment of Vital Submarine Stealth R&D Capabilities\n    - Stone Mason (completed in FY13)\n    - Large Scale Vehicle (LSV) \n    - Intermediate Scale Measurement System (ISMS)\n    - Submarine Signature Management\/Acoustic Superiority\n    - SSN\/SSGN Survivability Program (S3P)\n    - Advanced Coatings\nDevelopment of Technologies for Innovative Technology Transition\/Concept Development\n    - Hydraulics Elimination through Electrification (Completed in FY13)\n    - Advanced CO2 Scrubber (completes in FY14)\n    - Corrosion Control (Ionic Current Monitoring System (ICMS), Advanced Active Shaft Grounding System (A-ASGS),  Sprayable Acoustic Damping System (SADS))  \n    - Advanced Submarine Control (Secondary Propulsion System)     \n    - Advanced Material Propeller (AMP) Technology\n    - Electric Actuation of Retractable Bow Plane Control Surfaces (Completed FY13)\n    - Hybrid Multi-Material Rotor Development (HMMR) (Completes in FY14)\nImproved Payload & Sensor Capabilities  \n    - Next Generation Towed Array Handler System\n    - Towed Array Reliability\n    - Payload Integration (Advanced Weapons Enabled by Submarine UAS against Mobile targets (AWESUM))\n    - Integrated Autonomous Undersea Warfare Sensor (IAUWS)\n  \n\nProject Unit 3197:\nThe Undersea Superiority Project supports offboard Anti-Submarine Warfare (ASW) technologies selected by the Chief of Naval Operations (CNO) ASW Cross Functional Team for technologies that hold the potential for deployment and\/or use by submarine platforms. Efforts associated with these technologies include design, development, integration and testing of future Undersea Superiority systems.\n\nProject Unit 3220:\nThe objective of the Sea Based Strategic Deterrent (SBSD) Advanced Submarine System Development project is to design and prepare for construction of the replacement of the OHIO Class SSBN."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "555.123"
                },
                "CurrentYear": {
                    "val": "852.977"
                },
                "BudgetYearOne": {
                    "val": "926.177"
                },
                "BudgetYearOneBase": {
                    "val": "926.177"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "500.161"
                },
                "CurrentYear": {
                    "val": "850.062"
                },
                "BudgetYearOne": {
                    "val": "70.551"
                },
                "BudgetYearOneBase": {
                    "val": "70.551"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-54.962"
                },
                "CurrentYear": {
                    "val": "-2.915"
                },
                "BudgetYearOne": {
                    "val": "-855.626"
                },
                "BudgetYearOneBase": {
                    "val": "-855.626"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.120"
                    }
                },
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-2.795"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-12.700"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-852.980"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-852.980"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-2.646"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.646"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-47.262"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional Add Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "5.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Reduced FY13 funding for Sequestration reductions.\n\nProjects 0223 and 2033:  Reduced FY15 funding due to the Department's decision to reduce contracted services.\n\nNote:  Beginning in 2015, there is an administrative change that will shift efforts funded from PE 0603561N (Advanced Submarine System Development) \/ Project 3220 to PE 0603595N (Ohio Replacement) \/ Project 3220.  This shift is consistent with Congressional intent identified in HR 933 (FY13)."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0223"
                    },
                    "ProjectTitle": {
                        "val": "Sub Combat System Improvement (ADV)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "350.448"
                        },
                        "PriorYear": {
                            "val": "32.845"
                        },
                        "CurrentYear": {
                            "val": "32.693"
                        },
                        "BudgetYearOne": {
                            "val": "34.787"
                        },
                        "BudgetYearOneBase": {
                            "val": "34.787"
                        },
                        "BudgetYearTwo": {
                            "val": "37.767"
                        },
                        "BudgetYearThree": {
                            "val": "38.209"
                        },
                        "BudgetYearFour": {
                            "val": "38.055"
                        },
                        "BudgetYearFive": {
                            "val": "48.610"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Project Unit 0223: The Advanced Submarine Combat Systems Development Non-ACAT program supports Navy Submarine Acoustic Superiority and Technology Insertion Initiatives by the application of advanced development and testing of sonar and tactical control systems improvements. This Project addresses technology challenges to improve tactical control in littoral and open ocean environments for a variety of operational missions including peacetime engagement, surveillance, battle space preparation, deterrence, regional sea denial, precision strike, task group support, and ground warfare support. These technologies, developed by Navy technology bases, the private sector, ONR, FNC, and DARPA are then transitioned. Prototype hardware\/software systems are developed to demonstrate technologically promising system concepts in laboratory and at-sea submarine environments. Specifically, the focus of the technology efforts are APBs for acoustics, imaging, electronic warfare, tactical control, and Advanced Sonar Arrays. APBs develop and demonstrate improvements to current and future sonar\/combat control systems. The Advanced Sonar Arrays program develops and tests new sensors and demonstrates large array configurations. Technologies and\/or capabilities developed here are shared to optimize re-use and cost effectiveness with surface and surveillance programs. ACB, ASB and APB may co-develop capabilities and modular architecture technologies to maximize commonality and cost effectiveness."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Processing Build - (Acoustic\/Imaging\/Tactical)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "30.148"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued development of APB-13 focusing on revitalizing Operator Machine Interfaces (OMI) to apply commercial industry design thinking and technologies to support ease of use and reduced training burden; continued improvement of new passive acoustic ranging techniques and automated contact tracking; enhanced software architecture to improve system reliability; improved periscope image clarity, image automation, and tracking; and continued refinement of technologies initiated in APB-11. Integrated APB-13 for testing. Conducted land-based testing of APB-13, including laboratory string testing, using the Submarine Mission Module Team Trainer (SMMTT). Initiated planning for APB-15 to include establishment of the tactical scenario to guide development focus; conducted Watch Section Task Analysis (WSTA) gaps and seams test to inform system shortfalls in the context of the selected scenarios; and conducted an Industry Day and Broad Agency Announcement (BAA) solicitation to drive competition for APB-15 innovative technologies.  Continued development of the Submarine Mission Planning capability.  \n\nAPB tactical scenarios and capability focus areas are provided by the Submarine Fleet via the Submarine Tactical Requirements Group (STRG), COMSUBFOR and CNO N97."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "30.793"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete ACB-13 land-based testing including Return-On-Investment (ROI) WSTA using the SMMTT. Conduct at-sea testing and the transition of APB-13. Use the product of FY14 ROI, WSTA gaps and seams, and BAA evaluations along with direction from the Fleet\/STRG\/COMSUBFOR\/N97 to establish content and continue the development of capabilities for APB-15. Development will include the first two steps of the 4 Step APB process; Step 1 - algorithm assessment by peer review panels of subject matter experts to down-select technologies and assist developers with technical guidance; Step 2 - algorithm\/technology testing with open and closed data sets to further down-select and refine capabilities prior to integration and testing. Continue development, conduct system integration and initiate testing of the Submarine Mission Planning capability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "31.587"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "31.587"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue the development of APB-15, integrate APB-15 for testing, and initiate the land-based testing of APB-15, including laboratory string testing. Initiate planning for APB-17 to include the establishment of the tactical scenario to guide development focus; conduct a WSTA gaps and seams test to inform system shortfalls in the context of the selected scenarios; and conduct an Industry Day and Broad Agency Announcement (BAA) solicitation to drive competition for future APB innovative technologies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Sensors"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.697"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conducted Light Weight (LW) Low Cost Conformal Array (LCCA) sea test and transition to 688I program. Continued development and test of Advanced Towed Array technologies. Conducted 12X Advanced Development Model (ADM) at-sea test and analysis. Initiated studies for development of sensors for the Ohio Class Replacement Program. Continued fat line VSTA ADM development."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.900"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete fat line VSTA ADM development. Continue Ohio Class Replacement Program sensor development studies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.200"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.200"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct fat line VSTA prototype lake test and data analysis. Initiate the development of thin line VSTA, and transition technology from ONR FNC."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Use competitively awarded contracts from Broad Agency Announcement (BAA) solicitations and Small Business Innovative Research (SBIR) initiatives."
                        },
                        "PerformanceMetrics": {
                            "val": "- APB: Deliver at-sea tested submarine capability improvements to PEO Submarines as prescribed by the Fleet every two years. Conduct milestone reviews with the Milestone Decision Authority and PEO Submarines prior to delivery.\n- Conducted Light Weight Low Cost Conformal Array (LWLCCA) Advanced Development Model (ADM) sea test.\n- Deliver Vector Sensor Towed Array (VSTA) Short Aperture (3X) Array, and VSTA (3X) Lake Pend Oreille Test Reports.\n- Deliver Fat Line VSTA Lake Pend Oreille Test Reports."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0603561N_0223_FILE1.PNG"
                                }
                            }
                        ]
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2033"
                    },
                    "ProjectTitle": {
                        "val": "Adv Submarine Systems Development"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "371.617"
                        },
                        "PriorYear": {
                            "val": "30.865"
                        },
                        "CurrentYear": {
                            "val": "32.546"
                        },
                        "BudgetYearOne": {
                            "val": "35.764"
                        },
                        "BudgetYearOneBase": {
                            "val": "35.764"
                        },
                        "BudgetYearTwo": {
                            "val": "34.377"
                        },
                        "BudgetYearThree": {
                            "val": "44.879"
                        },
                        "BudgetYearFour": {
                            "val": "40.540"
                        },
                        "BudgetYearFive": {
                            "val": "40.386"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Advanced Submarine Systems Development (ASSD) Program is a non-acquisition program that develops and matures technologies for successful integration into future and modernized submarine classes, thus lowering acquisition and life cycle program costs while improving mission capability.  ASSD transitions Hull, Mechanical, and Electrical (HM&E) technologies and future naval concepts from Science & Technology (S&T) and Research and Development (R&D) to operational platforms; performs tests and demonstrates submarine design and naval architecture products destined for integration into future submarine classes or backfit into existing fleet assets; develops, initially integrates, and does test validation of leading payload concepts for submarine integration in support of the Design for Undersea Warfare; and operates unique R&D experimentation, modeling, testing and simulation facilities to enhance submarine stealth, maneuverability, capability, and affordability. The program also supports Small Business Innovation Research (SBIR), Small Business Technology Transfer (STTR), Office of Naval Research (ONR), Defense Advanced Research Projects Agency (DARPA) Programs and near and mid-term technology insertion to achieve future submarine class total ownership cost reductions, and influence future submarine concept designs and core technologies. Experimentation and demonstration is conducted in a joint warfighting context with other services, (i.e. the U.S. Marines, U.S. Army, and the U.S. Air Force), to enable early assessment of warfighting capabilities, and to contribute to smarter technology selection decisions for potential incremental development. This program also supports Information Exchange Programs and joint Project Arrangements (PA) with the United Kingdom, Canada, Australia and other international partners.\n\nProject 2033 is comprised of  three budget categories: Stealth, Payloads & Sensors, and Innovative Technology Transition\/Concept Development. \nNOTE: Project 2033 has combined Advanced Propulsion\/Ship Concept and Total Ownership Cost (TOC) into Innovative Technology Transition\/Concept Development. Budget categories were combined to consolidate projects into one. \n\nThe major developmental efforts include:\nSustainment of Vital Submarine Stealth R&D Capabilities\n    - Stone Mason (completed in FY13)\n    - Large Scale Vehicle (LSV) \n    - Intermediate Scale Measurement System (ISMS)\n    - Submarine Signature Management\/Acoustic Superiority\n    - SSN\/SSGN Survivability Program (S3P)\n    - Advanced Coatings\nDevelopment of Technologies for Innovative Technology Transition\/Concept Development\n    - Hydraulics Elimination through Electrification (Completed in FY13)\n    - Advanced CO2 Scrubber (completes in FY14)\n    - Corrosion Control (Ionic Current Monitoring System (ICMS), Advanced Active Shaft Grounding System (A-ASGS),  Sprayable Acoustic Damping System (SADS))  \n    - Advanced Submarine Control (Secondary Propulsion System)     \n    - Advanced Material Propeller (AMP) Technology\n    - Electric Actuation of Retractable Bow Plane Control Surfaces (Completed FY13)\n    - Hybrid Multi-Material Rotor Development (HMMR) (Completes in FY14)\nImproved Payload & Sensor Capabilities  \n    - Next Generation Towed Array Handler System\n    - Towed Array Reliability\n    - Payload Integration (Advanced Weapons Enabled by Submarine UAS against Mobile targets (AWESUM))\n    - Integrated Autonomous Undersea Warfare Sensor (IAUWS)"
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Payloads and Sensors\/Subtotal Cost"
                                    },
                                    "Description": {
                                        "val": "Develop promising advanced technologies and\/or concepts capable of revolutionizing submarine design, improving payload flexibility, increasing capability, reducing weight and space requirements, exploring alternative payload launch mechanisms.  Develop payload demonstrations targeted at improving flexible ocean interfaces, Intelligence, Surveillance, Reconnaissance (ISR) requirements, and payload and launch retrieval methods from undersea platforms. Conduct Navy and joint demonstrations in order to assess the operational value of the technologies and systems under consideration. The experiments support examination and assessment of potential new Fleet capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.564"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Commenced development of the Next Generation Towed Array Handling System (TAHS) TEMPALT package and conducted land based testing for TAHS improvements for 688 class OA-9070B Handling System.  Continue to leverage products between Small Business and Future Naval Concepts.  Commenced ULRM TEMPALT and conduct fully integrated system testing.  Led the technology development for Submarine Launched Unmanned Aerial System (UAS) in support of Advanced Weapons Enabled by Submarine UAS against Mobile targets (AWESUM) capability."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.287"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue TAHS TEMPALT package, install handler improvements, and test at sea for 688 Class OA-9070B Handling System. Continue OA-9070 Handler Improvements. Commence VA Class (OA-9070E) design efforts and land-based testing.  Continue to leverage products between Small Business and Future Naval Concepts (FNC).  Continue submarine integration CONOPs development in support of AWESUM. Demonstrate submarine launch UAS capability via FLEX in support of AWESUM.  Commence Integrated Autonomous Undersea Warfare Sensor (IAUWS) Coalition Warfare Program (CWP) Project Agreement (PA) between US and Australia."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.258"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.258"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Remove 688 Class OA-9070 Handler TEMPALT.  Continue OA-9070 Handler Improvements.  Commence VA Class (OA-9070E) land-based testing.  Continue to leverage products between Small Business and Future Naval Concepts (FNC).  Demonstrate submarine launch UAS capability via FLEX in support of AWESUM.  Continue Integrated Autonomous Undersea Warfare Sensor (IAUWS) Project Agreement (PA) between US and Australia."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Stealth\/Subtotal Cost"
                                    },
                                    "Description": {
                                        "val": "Develop technologies and tools to increase the survivability of submarines by recognizing and mitigating sources of acoustic and non-acoustic vulnerabilities to ensure submarines can penetrate contested waters and remain undetected in the littorals. Develop technologies and Tactics, Techniques, and Procedures (TTPs) that facilitate new or enhance existing warfighting concepts. Operate the Large Scale Vehicle (LSV 2) and the Intermediate Scale Measurement System (ISMS) in support of VIRGINIA and OHIO Replacement Class Program of Records to conduct large model experiments for submarines focusing on stealth, maneuvering and control, affordability, and operational effectiveness. Address gaps in stealth and survivability for current and future SSN\/SSGN force."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.681"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued Electromagnetic Silencing PA with the UK executing the third (four planned) scale stress magnetization and electric model experiments. Conducted LSV maintenance, support, and operations and maintain LSV and ISMS test ranges.  Supported OHIO Replacement signature trials.  Assessed current and evolving SSN\/SSGN operations to identify and address gaps in stealth and survivability for current and future SSN\/SSGN force."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.012"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue Electromagnetic Silencing PA with the UK executing the fourth (four planned) scale stress magnetization and electric model experiments. Complete tech refresh at ISMS range. Conduct LSV maintenance, support, and operations and maintain LSV and ISMS test ranges. Support Ohio Replacement signature trials. Conduct VIRGINIA Improved Advanced Hybrid (IAH) test. Address gaps in stealth and survivability for current and future SSN\/SSGN force to execute submarine tactical and strategic operations. Participate in Triumph v Dallas exercise."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "21.474"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "21.474"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct OHIO Replacement Improved Advanced Hybrid (IAH) test.  Conduct LSV 2 maintenance, support, and operations and maintain ISMS test ranges, data processing systems, operational capability.  Support ship and system alternations to safely support OHIO Replacement signature and propulsor trials. Address gaps in stealth and survivability for current and future SSN\/SSGN force to execute submarine tactical and strategic operations.  Advanced Coatings will develop methods to test existing coating materials and modifications to coatings materials to improve acoustic performance. Define requirements, initiate treatment configuration."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Innovative Technology Transition\/Concept Development"
                                    },
                                    "Description": {
                                        "val": "Develop submarine alternative propulsion, propeller designs, and stern configurations with potential to significantly reduce submarine acquisition costs. Demonstrate critical performance parameters through appropriate scale demonstrators in realistic environmental conditions. Evaluate integration of technologies and approaches for cost reduction in future submarines. Develop understanding of ship concept studies and submarine cost drivers and model analysis. Develop and demonstrate technologies for future submarines in areas of hull and platform technologies, propulsors, propellers, corrosion control, ship control, electric actuation, sensors, and self-defense. This work will apply to future submarine designs including the long-lead concept work on the OHIO Replacement Program.  Demonstrate technologies with potential to reduce total ownership costs of submarine systems by lowering construction costs, improving commonality of interfaces, extending the life of parts, and lowering life cycle maintenance requirements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.620"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Monitored operation and collected data for the Ball Valve Electrical Actuation System (EAS) aboard USS MISSOURI. Complete the transition of the CO2 Scrubber technology to VA Class program office.  Removed the CO2 Scrubber SSN shipboard test cube.  Commenced corrosion controls technologies. Developed Ionic Current Monitoring System (ICMS) and Advanced Active Shaft Grounding System (AASGS) corrosion control and sensing technologies. Commence Advanced Submarine Control (ASC) secondary propulsion system pump-jet technology development.  Commenced partnership with ONR on the Advanced Material Propeller (AMP) Future Naval Capabilities (FNC) program. Conducted land-based functional end-to-end, Electromagnetic Interference (EMI), and acoustics testing of Retractable Bow Planes (RBP) Control Surface Electric Actuation System (EAS). Continued partnership with DARPA on HMMR program to include delivery of coupled design software tool sets and fabrication of DARPA HMMR multi-material rotor solution for testing on LSV 2."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.247"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Remove the Ball Valve EAS and Universal Modular Mast (UMM) EAS TEMPALT from USS MISSOURI and restore the shipboard hydraulic service systems.  Continue data collection of the CO2 shipboard test cube aboard SSBN platform.  Complete ICMS TEMPALT planning and install TEMPALT on a VIRGINIA Class hull.  Complete ASSGS development and perform TEMPALT planning.  Perform Sprayable Acoustics Damping System (SADS) Research and Development (R&D). Assemble ASC secondary propulsion system technology components and perform factory and land-based component testing. Continue partnership with ONR on the AMP FNC program. Monitored AMP FNC project between U.S. and Australia via a collaborative Project Arrangement (PA) to demonstrate a full scale AMP on an Australian Collins Class Submarine. Design fabricate and test 1\/4 scale AMP composite material coupon panels.  Obtain AMP structural materials design approval and initiate full-scale AMP blade and hub structural testing. Test DARPA HMMR multi-material rotor solution on LSV 2.\n."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.032"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.032"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue data collection of the CO2 shipboard test cube aboard SSBN platform. Remove CO2 SSBN Shipboard test cube. Perform and monitor at-sea ICMS demonstration and install on VIRGINIA SSN 790.  Install AASGS TEMPALT on VIRGINIA SSN 786.  Conduct shipyard feasibility demonstration and large scale testing of SADS.  Perform in-water barge and on land functional testing of an integrated ASC secondary propulsion system. Continue partnership with ONR on the AMP FNC program.  Complete full-scale AMP blade and hub structural testing and initiate certification testing for the AMP FNC program."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "F2033: Sole source Concept Formulation (CONFORM) contracts with the only two submarine design\/construction shipyards, General Dynamics Electric Boat (GDEB) and Huntington Ingalls Industries (HII). Engagement with industry to build vendor base and support development of R&D products for enhanced submarine capability via competitively awarded Small Business Innovation Research (SBIR) contracts to support Hull Mechanical & Electrical systems (HM&E)."
                        },
                        "PerformanceMetrics": {
                            "val": "To enable transition of a minimum of three technology challenge solutions supporting emergent warfighter needs. \n- Sustain critical one of a kind national R&D hydroacoustic infrastructure enabling the design and assessment of VIRGINIA Class and OHIO Replacement designs. \n- Refine the design of the Advanced Carbon Dioxide Removal System (ACRU) CO2 Scrubber System based on at-sea testing of new solid sorbent materials and the removal of liquid amine system from future submarines. \n- At-sea demo of AWESUM. \n- Assess as-built VIRGINIA and OHIO Class SSBN\/SSGN submarine for design drivers\/design tools and model validation to define R&D needs for OHIO Class component development and technical design maturity.\n- Develop and test innovative Towed Array Handler concept focused on improving system reliability and fleet operational availability.\n- Conduct in depth assessment of SSN\/SGN Survivability for peacetime and wartime operations in anti-access area denial environment.\n- Develop future coatings to enable continued acoustic superiority of VA Class design."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0603561N_2033_FILE1.JPG"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0603561N_2033_FILE2.JPG"
                                }
                            }
                        ]
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3220"
                    },
                    "ProjectTitle": {
                        "val": "SBSD Advanced Submarine System Development"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "1555.333"
                        },
                        "PriorYear": {
                            "val": "431.860"
                        },
                        "CurrentYear": {
                            "val": "784.823"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "2772.016"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Note:  Beginning in 2015, there is an administrative change that will shift efforts funded from PE 0603561N (Advanced Submarine System Development) \/ Project 3220 to PE 0603595N (Ohio Replacement) \/ Project 3220.  This shift is consistent with Congressional intent identified in HR 933 (FY13).\n\nThe Sea Based Strategic Deterrent (SBSD) Advanced Submarine System Development project supports the OHIO Replacement (OR) program.  The funding applies to the design, systems engineering, prototyping, and vendor qualification activities needed to execute the schedule for Common Missile Compartment (CMC) design, whole ship design, and component technologies development for the next generation U.S. ballistic missile submarine. This RDT&E program supports cooperation with the United Kingdom (UK) to maintain strategic deterrence, based on a single effort to develop a CMC as agreed by the UK Secretary of State for Defence and the U.S. Secretary of Defense in 2009.\n\nThe OHIO Replacement program strategy is to maximize the re-use of existing OHIO systems and new designs from the SEAWOLF and VIRGINIA Classes (as applicable), focus on Life Cycle Total Ownership Cost (TOC) affordability, and meet the military requirements established for this SSBN to achieve mission success in a challenging environment. The requested funding levels support the Technology Development, Design, and Engineering Integration efforts to support the OHIO Replacement SSBN lead ship construction start in FY 2021.\n\nThe following key activities support a ship acquisition program to replace the OHIO Class SSBNs: \t\t\t\t\t\t\t\t\t\t\t\n1. Design and development of a missile compartment, launch system, and strategic support systems to meet U.S. strategic requirements while cooperating with the UK on modernizing its strategic deterrent in accordance with Presidential direction (December 2006).\n\n2. Concept and System Definition for remaining portions of the ship will be accomplished by the Design\/Build\/Sustain approach modeled after the VIRGINIA Class program.\t\t\t\t\t\t\t\t\t\t\t\n3. Development of advanced submarine platform technologies to provide capabilities needed to enhance platform operational effectiveness and minimize life cycle cost.\n\n\t\t\t\t\t\t\t\t\t\t\t\nOR Concept and System Definition Prototyping, and Technology Development Efforts:\t\t\t\t\t\t\t\t\t\t\t\nThe OR program supports design, systems engineering, prototyping and vendor qualification activities needed to develop CMC design, the OHIO Replacement whole ship design, and component development. The OR design timelines are based on the approach proven on VIRGINIA Class Program, adjusted for the additional complexity of a missile compartment and Strategic Weapons Systems (SWS). Planned technical studies and prototyping are necessary to reduce risks associated with updating SSBN system designs for current technical standards and demonstrating design feasibility of developmental technology to inform the establishment of detailed requirements. \t\t\t\t\t\t\t\t\t\t\t\nThe Navy continues investing in Design for Affordability (DFA) initiatives similar to those employed successfully for VIRGINIA Class, but tailored to the unique SSBN mission and operational tempo of OHIO Replacement to drive down overall program costs. Efforts will focus on reducing ship construction costs through implementing more effective design features to produce a more affordable\/producible class. As part of this effort, alternative contracting strategies will be examined to include multi-class multiyear procurement (MYP) and economic order quantity (EOQ).\t\t\t\t\t\t\t\t\t\t\t\nActivities planned for FY 2015 are required to maintain the first article prototype of the CMC to support the UK SUCCESSOR programme.  The CMC program will mature required technologies and re-host the TRIDENT II D5 SWS (Launcher, Fire Control and Navigation) while ensuring no degradation to D5 security, safety and performance. In addition, whole ship design efforts are focused on technologies requiring significant development times and those technologies that are required to support ship design and construction schedules such as the propulsor, maneuvering\/ship control and signatures.  These technologies are critical for stealth capability for a ship class that will be in service until the 2080s. Ship concept design efforts include important pre-construction activities such as finalizing ship requirements, risk characterization of developmental technology, improvement and validation of performance prediction tools and improvement of design tools. Technology development will address maturation of technologies.\n\nNote:  Beginning in 2015, there is an administrative change that will shift efforts funded from PE 0603561N (SBSD Advanced Submarine System Development) \/ Project 3220 to PE 0603595N (Ohio Replacement) \/ Project 3220.  This shift is consistent with Congressional intent identified in HR 933 (FY13)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "CMC Design and Prototyping"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "101.377"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued efforts for the design and development of the CMC to include: CMC ship specifications, missile tube design and first article missile quad pack design, and CMC system diagrams.  Continued design and prototype efforts and manufacturing of additional fixtures.  Continued validation of missile tube to missile tube quad pack production techniques.  Completed validation and verification of the Integrated Tube and Hull (ITH) shape weldment design and preliminary design\/prototyping of the missile tube quad to hull manufacturing fixture prototypes to validate planned missile compartment production techniques.  Continued system engineering efforts to define the required CMC testing during the build cycle.  Commenced design for the missile compartment.  Commenced planning activities for CMC test facilities.  Continued development and testing of missile tube to keel robotic welding techniques."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "262.623"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue efforts for the design and development of the CMC to include: drawings of the first article missile tube quad pack, and CMC system diagrams.  Review missile tube drawings and commence CMC arrangements.  Continue validation of missile tube to missile tube quad pack production techniques.  Continue design and prototype efforts and manufacturing of additional fixtures.  Continue validation and verification of the casting design and preliminary design of the missile tube quad to hull manufacturing fixture prototypes to validate planned missile compartment production techniques.  Continue system engineering efforts to define the required CMC testing during the build cycle.  Continue design for the missile compartment.  Finalize planning activities for CMC test facilities.  Continue development and testing of missile tube to keel robotic welding techniques to support process certification."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ship Study and Design"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "39.276"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued preliminary design of forward and aft ends of OHIO Replacement Class.  Continued Rest of Ship concept development, system integration, component design, system definition documents, system diagrams, ship arrangements, construction drawings, control surface design and studies.  Continued Rest of Ship specifications development.  Continued CMC interface with Rest of Ship and began detail design of CMC.  Developed ship manufacturing assembly plan.  Decisions defining torpedo handling, battery configuration, hydrostatic stability, C5I configuration, hull coating material, quantity of torpedo tubes, deck mounting configuration, Air Conditioning plant configuration, stern control surface configuration, navigational draft restrictions, plumbing system architecture, emergency diesel generator downselect, bow non-pressure hull configuration, and ventilation system architecture were completed.  Forward modules were developed with sufficient fidelity in arrangements to support setting overall ship length."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "101.205"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue with preliminary design of forward and aft ends of OHIO Replacement Class.  Complete ship specifications and system definition documents.  Complete non-shipboard prototype.  Continue Rest of Ship concept development, system integration, component design, system diagrams, ship arrangements, construction drawings, control surface design, and studies.   Continue CMC interface with Rest of Ship and detail design of CMC.  FY14 milestones include missile tube fixture delivery, initial fielding of the Integrated Product Development Environment (IPDE) tool set, NSWC Carderock structural model development, resolution of simplified shock attributes on ship design, determination of anchor requirements, superstructure design, ship service hydraulic plant architecture, ship's refrigeration design, Electronics Auxiliary Fresh Water (EAFW) architecture, BRR-6 reliability upgrade efforts, and the Automatic Battery Monitoring System (ABMS) \/ Battery Charge Monitoring System (BCMS) decision."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "NAVSEA R&D and Prototyping"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "55.982"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Final model testing and simulations to support selection of the control surface configuration.  Initial testing and simulations to support control surface design.  Continued Generation 1 design for propulsor concepts including scale module-testing in the water tunnel.  Conducted resistance and powering testing for Generation 1 propulsors.  Demonstrated sufficiency of forging a propulsor to shaft inner hub connection.  Conducted a lift of a VIRGINIA Duct to aid in the quick disconnect duct design.  Completed construction and setup of the full scale bearing test facility in Key West, FL.  Delivered an instrumented propulsor rotor to support testing on the large scale vehicle.  Fabrication and testing of CMC pressure hull models.  Populated motion simulator with electronics to support a ship control Concept of Operations Experiment (COOPEX).  Conducted a full scale low voltage anode test.    Continued component development to support ship requirements.  Provided preliminary Government Furnished Information (GFI) to the Prime Contractor for Non-Propulsion Electronics Systems (NPES)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "107.603"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Finalize Generation 1 propulsor designs for OHIO Replacement.  Commence fabrication of Generation 1 large scale vehicle hardware.  Finalize requirements for large scale vehicle modifications.  Initial full scale bearing test rig shakedown using VA sized components.  Continue control surface detailed design.  Conduct full scale low voltage anode simulations.   Development of the cathodic protection system preliminary design.  Begin Phase I of the COOPEX to support Hovering and Missile Compensation Control System (HMCCS) and Ship Control Designs.  Equip surrogate full scale test platform to support stern design.  Continue component development to support ship requirements. Continue development and delivery of preliminary GFI for NPES."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.700"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued efforts to identify T&E requirements for the program and interfaced with OSD Test and Evaluation (T&E) oversight organizations.  Continued planning for and drafting Test and Evaluation Master Plan (TEMP) and Live Fire Test and Evaluation (LFT&E) Master Plan.  Commander, Operational Test and Evaluation Force (COMOPTEVFOR) completed Early Operational Assessment (EOA) OT-A1 in support of Milestone B."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Strategic Weapons Systems Integration"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "132.227"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued system engineering efforts required for the re-hosting and integration of the TRIDENT II (D5) SWS on the OHIO Replacement submarine; including review and modification of SWS Coordination, Interface and Arrangement Drawings for SWS equipment within the CMC and Missile Control Center Module (MCCM), SWS system and subsystem preliminary design, and Hardware and Software requirements development.  SWS Ashore test capability development.  SWS training capability \/ requirements development.  Partial material procurement and build of Fire Control Engineering Test Systems.  Continued design efforts (at a reduced level due to Sequestration) for the development of a missile launch tube test capability and test stand including refurbishment of a test vehicle to support launch system prototype efforts and evaluation \/ qualification program."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "178.764"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue system engineering efforts required for the re-hosting and integration of the TRIDENT II (D5) SWS on the OHIO Replacement submarine; including review and modification of SWS Coordination, Interface and Arrangement Drawings for SWS equipment within the CMC and MCCM, SWS system and subsystem preliminary design, and Hardware and Software requirements development.  Continue SWS test systems material procurement and builds, test berth \/ facility modifications and development of special test vehicles. SWS Ashore test capability development.   SWS training capability \/ requirements development.  Commence build of Fire Control Engineering Test Systems.  Continue design efforts for the development of a missile launch tube test capability and test stand including refurbishment of a test vehicle to support launch system prototype efforts and evaluation \/ qualification program.  Initiate design and development efforts for shipboard SWS Navigation.  Initiate systems engineering design efforts related to the OHIO Replacement guidance handling carts.   Material procurement for underwater launch risk mitigation testing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Systems Engineering\/Program Management"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "50.298"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued to provide technical oversight including Program Office management and technical support from government laboratories for review, analysis and modeling.  Continued maintenance planning and design for sustainment activities.  Continued requirement definition and trade assessments to support the most affordable ship design and efficiencies in specification development."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "84.628"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to provide technical oversight including Program Office management and technical support from government laboratories for review, analysis and modeling.  Continue maintenance planning and design for sustainment activities. Update the Ohio Replacement Service Capabilities Development Document (CDD) and its derivative documents in preparation for submission to and approval by the Joint Requirements Oversight Counsel (JROC).  Continue the functional allocation of platform level requirements as informed by the CDD to ship systems and components to support the maturation of the ship's design documents.  Continue to identify and assess issues with the platform, shore facilities, and infrastructure as well as their impact on program costs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Design for Affordability"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "50.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued execution of the DFA program and related design initiatives in order to drive down overall program costs.  Achieved significant progress in reducing non-recurring engineering (NRE) construction and Operations and Support (O&S) costs through contractor affordability incentives, and investments in life cycle cost reduction initiatives.  Specific initiative investments include robotic welding, Integrated Product Development Environment (IPDE) process development, and material reuse.  DFA initiatives and DFA funded design yard incentives are reaping substantial savings."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "50.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue execution of the DFA program including design yard cost reduction initiatives in order to drive down overall program costs across design, construction and Operations and Support (O&S).  Specific initiatives include robotic welding, Integrated Product Development Environment (IPDE) process development, and material reuse.  Continue to fund design yard incentives.  Continue program affordability efforts targeted to achieving potential savings associated with multi-year and\/or Economic Order Quantity (EOQ) procurements across submarine classes, investigating the government vs. contractor furnished equipment mix for potential efficiencies, and potential savings associated with continuous missile tube and\/or launch tube production runs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "RDTEN\/3219"
                                    },
                                    "Title": {
                                        "val": "SBSD Nuclear Technology Development"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "73.714"
                                        },
                                        "CurrentYear": {
                                            "val": "296.050"
                                        },
                                        "BudgetYearOne": {
                                            "val": "369.964"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "369.964"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "422.661"
                                        },
                                        "BudgetYearThree": {
                                            "val": "411.598"
                                        },
                                        "BudgetYearFour": {
                                            "val": "401.698"
                                        },
                                        "BudgetYearFive": {
                                            "val": "291.302"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "SCN\/1045"
                                    },
                                    "Title": {
                                        "val": "OHIO Replacement Submarine"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "13.200"
                                        },
                                        "BudgetYearThree": {
                                            "val": "777.793"
                                        },
                                        "BudgetYearFour": {
                                            "val": "791.793"
                                        },
                                        "BudgetYearFive": {
                                            "val": "2887.937"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTEN\/3220"
                                    },
                                    "Title": {
                                        "val": "(U) OHIO Replacement"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "849.277"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "849.277"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "994.926"
                                        },
                                        "BudgetYearThree": {
                                            "val": "696.281"
                                        },
                                        "BudgetYearFour": {
                                            "val": "709.471"
                                        },
                                        "BudgetYearFive": {
                                            "val": "394.450"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The common missile compartment will be designed and developed to support the U.S. and UK in development of the OHIO Replacement and SUCCESSOR SSBN programs enabling a common U.S.-UK CMC and maximizing the benefit of the ongoing U.S.-UK partnership in strategic deterrence.  The OHIO Replacement R&D efforts will incentivize cost reduction initiatives in the design, construction and operations & support portions of the program.  R&D efforts will be performed by Navy laboratories, shipyards, private industry, and University Affiliated Research Centers."
                        },
                        "PerformanceMetrics": {
                            "val": "Updated Integrated Master Schedule and CMC build strategy down-select. Development of signature management efforts to address knowledge gap, concepts for propulsor and shafting, and design guidance and interface control requirements."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0603561N_3220_FILE2.JPG"
                                }
                            }
                        ]
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "9999"
                    },
                    "ProjectTitle": {
                        "val": "Congressional Adds"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "4.591"
                        },
                        "PriorYear": {
                            "val": "4.591"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "9.182"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Add Projects."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Seawolf Risk Reduction Efforts"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "4.591"
                                        },
                                        "Text": {
                                            "val": "Conduct risk reduction efforts for the Seawolf Bow Dome."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Congressional Add Projects."
                        }
                    }
                }
            ]
        }
    }
}