{
    "id": "1c7ea04fb24386209f0766e06b746c34451ac4db",
    "meta": {
        "filename": "dod-2015_RDTE_2015_ARMY_BA3_RDTE_JustificationBook_Army_PB_2015.zzz_unzipped_RDTE_JustificationBook_Army_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603004A"
        },
        "ProgramElementTitle": {
            "val": "Weapons and Munitions Advanced Technology"
        },
        "R1LineNumber": {
            "val": "32"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "69.788"
            },
            "CurrentYear": {
                "val": "73.885"
            },
            "BudgetYearOne": {
                "val": "57.931"
            },
            "BudgetYearOneBase": {
                "val": "57.931"
            },
            "BudgetYearTwo": {
                "val": "65.886"
            },
            "BudgetYearThree": {
                "val": "72.808"
            },
            "BudgetYearFour": {
                "val": "69.494"
            },
            "BudgetYearFive": {
                "val": "65.711"
            }
        },
        "ProgramElementNote": {
            "val": "FY13 adjustments attributed to Congressional Add funding (10.0 million); Congressional general reductions (-122 thousand); SBIR\/STTR transfers (-1.560 million); and Sequestration reductions (-6.143 million)\nFY14 adjustments attributed to FFRDC reductions (-34 thousand) and Congressional Add funding (10.0 million)\nFY15 funding realigned to support higher Army priorities."
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) matures weapons and munitions components\/subsystems and demonstrates lethal and non-lethal weapons and munitions with potential to increase force application and force protection capabilities across the spectrum of operations.  The weapons and munitions include artillery, mortars, medium caliber, tank fired, and shoulder fired. Project 232 focuses on affordable delivery of scalable (lethal to non-lethal) effects.  Project L96 matures and integrates critical high energy laser subsystems into a mobile demonstrator to explore and validate system performance in relevant environments.   Project L97 demonstrates performance of advanced obscurants and delivery of mechanisms and conducts forensic analysis of explosives and hazardous materials to enable detection by Soldier and Small Units.  \n\nWork in this PE is related to, and fully coordinated with, PE 0602120A (Sensors and Electronic Survivability), PE 0602307A (Advanced Weapons Technology),  PE 0602618A (Ballistics Technology), PE 0602622A (Chemical, Smoke, and Equipment Defeating Technology), PE 0602624A (Weapons and Munitions Technology), PE 0602772A (Advanced Tactical Computer Science and Sensor Technology), PE 0602782A (Command, Control, Communications Technology), PE 0603005A (Combat Vehicle and Automotive Advanced Technology), PE 0603008A (Electronic Warfare Advanced Technology), and PE 0603313A (Missile and Rocket Advanced Technology).\n  \nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n  \nWork in this PE is performed by the Armament Research, Development, and Engineering Center (ARDEC), Picatinny Arsenal, NJ; Edgewood Chemical Biological Center (ECBC), Edgewood, MD; and the U.S. Army Space and Missile Defense Center (SMDC), Huntsville, AL."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "67.613"
                },
                "CurrentYear": {
                    "val": "63.919"
                },
                "BudgetYearOne": {
                    "val": "64.767"
                },
                "BudgetYearOneBase": {
                    "val": "64.767"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "69.788"
                },
                "CurrentYear": {
                    "val": "73.885"
                },
                "BudgetYearOne": {
                    "val": "57.931"
                },
                "BudgetYearOneBase": {
                    "val": "57.931"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "2.175"
                },
                "CurrentYear": {
                    "val": "9.966"
                },
                "BudgetYearOne": {
                    "val": "-6.836"
                },
                "BudgetYearOneBase": {
                    "val": "-6.836"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.122"
                    },
                    "CurrentYear": {
                        "val": "-0.034"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "10.000"
                    },
                    "CurrentYear": {
                        "val": "10.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.560"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-6.836"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-6.836"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Sequestration"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-6.143"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "232"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Lethality & Survivability Demo"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "47.111"
                        },
                        "CurrentYear": {
                            "val": "46.644"
                        },
                        "BudgetYearOne": {
                            "val": "39.823"
                        },
                        "BudgetYearOneBase": {
                            "val": "39.823"
                        },
                        "BudgetYearTwo": {
                            "val": "48.903"
                        },
                        "BudgetYearThree": {
                            "val": "49.987"
                        },
                        "BudgetYearFour": {
                            "val": "46.708"
                        },
                        "BudgetYearFive": {
                            "val": "42.596"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates enabling technologies for affordable precision lethal and non-lethal weapons and munitions.  Technologies include advanced energetic materials, insensitive munitions, novel fuze designs, penetrators, scalable effects and pulsed laser and millimeter wave sources for  high power microwave (HPM) systems.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nEfforts in this project support the Ground domain portfolio.\n\nWork in this project is performed by the Armament Research, Development, and Engineering Center (ARDEC), Picatinny Arsenal, NJ."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Ground Based Networked Munitions Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort provides follow-on technology advancement to ground based munitions systems currently being developed with improved capabilities.  This includes an autonomous non-lethal response system. In FY 2014 this effort supports Technology Enabled Capability Demonstration 1.a, Force Protection Basing."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.388"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Mature autonomous Non-Lethal Alert technology for personnel detection\/discrimination that was previously developed with improved communications and decreased size and weight to better support the base protection mission; optimize non-lethal effects package for Autonomous Non-Lethal Alert to provide enhanced force protection."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.992"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.992"
                                            },
                                            "Text": {
                                                "val": "Will integrate and demonstrate technologies for multi-purpose networked munitions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Operationally Adaptable Effects"
                                    },
                                    "Description": {
                                        "val": "This effort utilizes the technologies demonstrated in Scalable Effect Weapons and Munitions System to enable the defeat of a wide range of threats and provide scalable capabilities to engage ground targets and aerial threats, prevent fratricide and minimize collateral damage."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.790"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Designed and fabricated variable yield unitary warhead that used reactive materials, preformed fragmenting composite casing and dual purpose energetics to demonstrate improved scalable lethal and non-lethal effects."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tunable Pyrotechnics"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates smoke and flare countermeasure for passive protection for ground and air combat platforms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.864"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Demonstrated and validated performance of ultraviolet, laser beam rider, and imaging seeker counter measures;  subsequently validated performance using flares through flight testing; compared results to modeling and simulation studies and used derived information to advance computer modeling and simulation capabilities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Extended Area Protection and Survivability (EAPS)"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates the use of command-guided medium caliber projectiles for the interception and destruction of incoming rockets, artillery, and mortar rounds (RAM)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.493"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Demonstrated the ability to track, command-maneuver, and command-detonate multiple in-flight projectiles against RAM targets and improved software based on flight results."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.019"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Demonstrate integrated system of radar, command guided interceptors, and auto cannon by a defeat of a statically placed threat munitions; demonstrate performance requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.113"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.113"
                                            },
                                            "Text": {
                                                "val": "Will optimize and demonstrate an integrated Counter Unmanned Aerial Systems (C-UAS) capability, comprised of; algorithms, fire control and command guided interceptor munitions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Lethality Demonstration"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates novel penetrator designs (without using depleted uranium (DU)), as well as alternative lethal mechanisms to maintain or exceed tank main gun performance against multiple target types into the future."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.327"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Fabricated several full-up KE rounds with selected novel penetrator and demonstrated that lethality performance met modeling and simulation predictions and range objectives in an instrumented range; designed concept based on results, refined design and prepared additional testing on range and simulated operational environment, i.e., fired from a 120mm tank gun."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.170"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Build\/procure hardware components, assemble cartridges, and conduct functional and armor tests leading to techonology demo; conduct technology demonstration (120 mm ballistic testing through all temperatures);  analyze test data: provide test results to PM-MAS to determine if the Army needs to continue DU production."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Dual-Use Improved Conventional Munitions (DPICM) Replacement Acceleration"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates ultra high reliability fuzing, advanced kill mechanisms, and alternative dispensing technologies to provide increased battlefield lethality with reduced unexploded ordnance (UXO) compliant with current DoD cluster munitions policy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.729"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed warhead insensitive munition tests, producibility studies and final static arena tests validating system lethality; conducted instrumented ballistic firings and dispersion verification tests of finalized dispense\/stabilizer designs;  built optimized fuze technology demonstrator and conducted evaluation testing;  finalized submunition baseline, built demonstrator and conducted final 155mm integrated ballistic demonstration validating demonstrator."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.035"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Perform TRL6 demonstration on complete system which will consist of two major tests - a static arena test on the warhead and a ballistic demonstration test;  the static arena test provides data on the effectiveness of the round which will then be used to validate that the system meets the lethality requirements;  the ballistic demonstration test shows the performance of the system in a representative environment and shows the improvement in reliability over traditional DPICM."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "Will mature the design and demonstrate performance against the expanded target set that now includes tracked and light wheeled tactical vehicles; will exploit emerging breakthroughs in warhead technologies that enable defeat of the expanded target sets at a reduced cost (e.g. number of rounds fired to service a target)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Medium Caliber Weapon Systems"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates advanced medium caliber rounds, weapon and ammunition handling systems optimized for remote operation.  This effort addresses multiple warfighter capability gaps including super high elevation engagement, high performance stabilization, remote ammunition loading, weapon safety and reliability, improved lethality, accuracy, and the ability to fire a suite of ammunition from non-lethal to highly lethal, to provide escalation of force capability in one system."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.586"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Matured and demonstrated air burst munition and armament to validate accuracy; conducted analysis to model accuracy performance and optimize air burst munition; matured air burst munition; optimized performance of onboard fuze and fuze setter for programmable airburst munition;  provided interface control documents for weapon, ammunition handling system and air burst munition; optimized fire control software for scenario based touch screen user interface; matured fire control system with downrange wind sensor, dynamic meteorological, environmental, temperature (MET ) sensor and improved laser ranging;  continued with the maturation phase of remote weapon station to reach a higher level of ruggedness and reliability; optimized the control system; improved the operator control interface;  conducted extended system level cycling tests; matured weapon and ammo handling\/turret cycling tests to determine system reliability and effectiveness; demonstrated remote weapon station capabilities using both lethal and non lethal ammunition."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.051"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Demonstrate and mature the turret control system in preparation for the integration of the weapon, ammunition handling system and fire control sensor enhancements within a Bradley fighting vehicle; demonstrate system level optimized performance capabilities of a 30mm weapon platform; optimize and down select the appropriate air bursting fuze technologies for the integration within the 50mm air bursting cartridge; continue to mature and improve the fire control target based user interface software as well as continue to develop and optimize the design of the 50mm Bushmaster III gun."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "Primary focus will be to optimize technologies from Weapon, Fire Control and Turret functional areas together in preparation of demonstrating a system level platform integration with an advanced medium caliber weapon system within a Bradley Fighting Vehicle (BFV) variant.  In support of this effort, will finalize and optimize a prototype turret and drive system to support the XM813 30mm weapon system; will optimize and mature the advanced sensors (down range wind sensor, dynamic metrology sensor and improved laser range finder) and the scenario based fire control system supporting the XM813 30mm weapon system, 30mm armor piercing (AP) munition and the Mk310 30mm programmable air bursting munitions (PABM);  will perform the integration of these technologies within the BFV and will demonstrate improved accuracy and lethality performance at a system level.  Additionally, will finalize 50mm fuze improvements and will perform a fuze shoot off and demonstration to down select and optimize the burst point accuracy of the 50mm PABM munition."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Remote\/Robotic Armament System (ARAS)"
                                    },
                                    "Description": {
                                        "val": "This effort provides advanced remote armaments with scalable effects from non-lethal to lethal engagements. In FY 2014 this effort supports Technology Enabled Capability Demonstration 1.a, Force Protection – Basing.\nNote: Prior to FY14, this effort was combined with Medium Caliber Weapon Systems above."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.006"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Mature and demonstrate ARAS software\/electronics controls and validate\/improve mechanical subsystems to ensure they meet all design specifications which will mitigate risks associated with obtaining an Army Test and Evaluation Command (ATEC) limited safety release which is essential for the capstone demonstration; also, in preparation of ATEC testing, perform generation of a Safety Assessment Report (SAR) and other pre-ATEC activities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Power and Energy Management for Munitions"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates the technology options available to provide the next generation of gun fired smart munitions, with advanced fuzing and power components for improved performance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.033"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigated fabricate technologies for gravity sensor, and performed small scale environmental testing; for proximity sensor,  designed necessary components and integrated into preliminary sensor, and  conducted performance tests in lab environment; for multi-point initiation,  created breadboard multi-point system based on artillery application, testing control circuitry and simultaneity;  fabricated demonstration millimeters thin lithium- ion batteries and demonstrated environmental robustness; matured supercapacitor for munition application and fabricated for bench and environmental evaluation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.247"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "For multi-point initiation, demonstrate a distributed four point initiation system in a future warhead application that is capable of achieving simultaneity between points and selectable control; for proximity sensor, demonstrate improved range extraction and enhanced countermeasure protections through ballistic testing; for impact switch, mature and demonstrate a micro electrical mechanical system (MEMS) based impact switch that has multi-level sensing capability against varying targets; for thin film thermal batteries, mature and demonstrate a thin film heat source integrated into existing thin film battery; for super capacitor, demonstrate robustness of design through environmental and ballistic testing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.600"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.600"
                                            },
                                            "Text": {
                                                "val": "Will optimize next generation proximity sensor (NGPS) sub-system to meet improved performance requirements; will demonstrate and validate NGPS design in an artillery platform to achieve a TRL 6."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Scale-up of Energetic Materials"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates the performance and insensitivity of energetic materials in medium caliber (direct fire) and large cal (indirect fire) weapons."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.182"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigated insensitive materials of interest for augmenting lethality; scaled up and formulated nano energetics for increased performance; scaled up organic compounds based explosives to augment energy and lethality outcomes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.819"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Scale-up and formulate newly synthesized ingredients for lethality and insensitive munition (IM) benefits; optimize propellant formulations for various applications of interest for extended range; prototype novel propulsion system concepts; perform live fire and performance testing for nano pressed explosives; conduct IM insult testing on XM1128 projectile; perform IM testing on compatible IM detonation trains."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.927"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.927"
                                            },
                                            "Text": {
                                                "val": "Will perform appropriate test series on mature propellant and explosive formulations to facilitate certification at the Energetic Material Qualification Board (EMQB) level and enable transition of new materials to munitions qualification programs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Counter Countermeasure (CCM) Technology Demonstrations"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates the continued effectiveness of US weapon systems and ammunition against current and projected enemy countermeasures, including conventional and classified threats and unexploded ordnance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.707"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Matured and demonstrated CCM technologies that optimized performance against threats, e.g. novel anti-armor weapon systems to defeat Active Protection Systems protected platforms; matured technology to reduce mounted soldier vulnerability by decreasing time on target."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Lethality Efforts"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates several advanced lethality efforts, including weaponization of a robotic armed vehicle, air burst fuzing technology to enhance lethality against personnel in defilade, next generation kinetic energy penetrators, improved interception of Kinetic Energy Active Protection System projectiles, and increased lethality for medium caliber technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.300"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Matured existing weapon platform and fire control software for integration and demonstration on a robotic platform; matured and demonstrated enabling integrated technologies tactically relevant to increasing battlefield lethality\/survivability; continued to demonstrate technologies for improving precision that extends beyond existing ranges."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Force Protection and Tactical Overmatch Armament Systems"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates improved ability to deliver decisive effects by providing hemispherical protection to semi-fixed and mobile sites against personnel, vehicle, and materiel targets to enable tactical overmatch to the Tactical Small Unit."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.534"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Integrate mature component technologies that have demonstrated effects against threat UAS, direct and indirect fired munitions providing hemispherical protection system of systems approach to accurately sense, warn, and respond to threats by delivering decisive effects timely and accurately."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Active Protection Armament Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort supports the Army's Active Protection System (APS) program to mature and demonstrate APS technologies to reduce vehicle weight while reducing reliance on armor through the use of other means such as sensing, warning, hostile fire detection, and active countermeasures to achieve increased protection against current and emerging threats. This effort is done in coordination with efforts in PE 0602601A, PE 0602618A, PE 0603004A, PE 0603005A, PE 0603270A, and PE 0603313A."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.125"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.125"
                                            },
                                            "Text": {
                                                "val": "Will mature and integrate hard kill related technologies such as fire control, target detection device and hard kill countermeasures into the Army's APS common architecture."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Remote Armament System Integration"
                                    },
                                    "Description": {
                                        "val": "This effort integrates and demonstrates weapon systems on a semi-autonomous and autonomous unmanned platform while maintaining positive control of weapon system."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.912"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Integrate mature component technologies of a medium caliber weapon mounted on a 1+ ton unmanned vehicle controlled via secure distributed communications operating up to 5 km from command and control entity."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Networked Effects Decision Suite"
                                    },
                                    "Description": {
                                        "val": "This effort provides sensor-to-shooter capabilities to deliver desired effects on target, specifically addressing accurate target location and target hand-off, improving accuracy and lethality at the small combat level."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.100"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Improved weapon target pairing (WTP) enhancement for non-lethal effects; improved fire support of unmanned aerial vehicle\/unmanned ground vehicle tactical behavior along with the remote weapon station collaborative effort; validated de-conflction of target data received; demonstrated improvements to validate the enhanced sensor-to-shooter WTP capabilities for lethal and non-lethal effects; validated the networked fire control perfomance utilizing existing hardware and software."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.511"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Implement fire support execution matrix; improve target prioritization; improve 3D de-conflictions of fires application; demonstrate target data\/track management and effects planning; demonstrate weapon placement coordination; demonstrate effects planning component."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Precision Non-Line-of-Sight (NLOS) Munition for Light Forces"
                                    },
                                    "Description": {
                                        "val": "This effort will provide a precision technology capability for an 81mm mortar cartridge for light forces for base defense. In FY 2014 this effort supports Technology Enabled Capability Demonstration 1.a, Force Protection  Basing."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.006"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Improve and optimize down selected 81mm mortar GPS precision design candidate; mature design and integrate into 81mm mortar round system taking into account warhead and propulsion system; validate the 81mm precision mortar design integration."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.507"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.507"
                                            },
                                            "Text": {
                                                "val": "Will mature components, build hardware and verify 81mm precision design live system test: will verify GPS and fuze setter technology and designs with tests."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Solid State Active Denial Technology (SS-ADT)"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates non-lethal counter-personnel directed energy (DE) technology for crowd control up to 100 meters. In FY 2014 this effort supports Technology Enabled Capability Demonstration 1.a, Force Protection Basing."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.914"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Improve the azimuth and elevation steering capability and develop a Fire Control Suite for Target Tracking; perform demonstration of human target effects."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Integrated Base Defense Hostile Protection System"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates technology to locate unmanned aircraft systems (UAS) in bearing via acoustic sensor arrays as well as the source of mortars and mortars and rocket propelled grenades (RPGs). \nIn FY 2014 this effort supports Technology Enabled Capability Demonstration 1.a, Force Protection – Basing."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.510"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Demonstrate and optimize acoustic detection and tracking in bearing of UAS; mature multi node system level fusion to improve performance, repackage components to reduce logistic burden and optimize power usage, for extended mission life and maintenance cycles; support and participate in TECD 1a to demonstrate integrated capabilities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Extended Range\/Guided 40mm Munition"
                                    },
                                    "Description": {
                                        "val": "This effort develops a 40mm guided, low cost, extended range projectile for use in the M320 launcher.  Warfighter\/Command & Control will be able to see beyond line-of-sight targets while in flight. In FY 2014 this effort supports Technology Enabled Capability Demonstration 1.a, Force Protection Basing."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.013"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Mature and demonstrate optimized components for guidance navigation and control system for extended range 40mm low velocity grenades; perform improvements of extended range technologies to include airframe and Guidance, Navigation and Control and conduct a demonstration; optimize and demonstrate a mature warhead integrated into the projectile."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.016"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.016"
                                            },
                                            "Text": {
                                                "val": "Will mature, integrate and demonstrate previously demonstrated component technologies in an extended range guided 40mm projectile to 600 meters (threshold)\/ 1000 meters (objective); will demonstrate improved probability of hit at an increased range; will provide a low cost integrated guidance navigation and control system with optimized  airframe, canards, tail fin, and propulsion system; will optimize fuze and warhead design and functionality to enhance lethality capabilities;. will demonstrate target acquisition, increased range and guide to hit projectile, at targets at ranges between 600 to 1000 meters."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Automated Direct\/Indirect Fire Mortar (ADIM)"
                                    },
                                    "Description": {
                                        "val": "This effort develops a line-of-sight\/non-line-of-sight remotely operatable mortar system for use in base protection and mobile fire support. In FY 2014 this effort supports Technology Enabled Capability Demonstration 1.a, Force Protection Basing."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Improve and optimize the baseline, ground-up designed system; demonstrate its capabilities in a controlled environment in order to validate expected increases in performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "Will adapt the system to be compatible with 81mm precision mortar cartridge; will prepare for an integrated demonstration."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Explosive Hazard Predetonation System"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates a system to neutralize improvised explosive devices (IEDs) leveraging emerging detection, geo-location, and classification technologies on a ground vehicle. It provides an integrated system approach to enhanced neutralization \/ predetonation that leverages data from sensor networks providing IED detection, geolocation and classification data. It transitions from the IED Neutralization Technology effort in PE 0602642A\/Proj H19 in FY2014\/15."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.006"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Demonstrate an improved IED neutralization capability that interoperates with standard communications networks and databases that provide historical and real time IED emplacement data; mature the neutralization system to utilize beam steering algorithms for convoy operations as well as integrate emerging waveforms to defeat a wider class of IEDs; demonstrate reduce Size, Weight and Power (SWaP) requirements for legacy neutralization systems utilizing emplacement data and RF generation enhancements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enhanced Sniper Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort will investigate advanced projectile designs such as long rod technologies that will provide snipers with the capability for increased range effectiveness (up to 1500m, possibly greater), hit probability, and armor penetration for man-portable sniper systems."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.503"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Optimize the performance of the long rod sabot, notably the slip obturator and discard; demonstrate accuracy improvements associated with design modifications to existing projectiles; investigate the technological advances and viability of guided munitions in small caliber applications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.507"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.507"
                                            },
                                            "Text": {
                                                "val": "Will validate the technology matured through this program by demonstrating improved sniper cartridges in common calibers that increase a sniper's probability of hit in non-ideal\/combat relevant conditions at extended ranges."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Long Range Gun Technology"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates extended range artillery weapon system and projectile technologies that increase the range by 25% without an increase in platform weight."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.036"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.036"
                                            },
                                            "Text": {
                                                "val": "Will mature component technologies associated with longer range artillery capabilities and it will include weapon system components like cannon tube, breech and mount."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier Fired Advanced Effect Air Burst Munition"
                                    },
                                    "Description": {
                                        "val": "This effort will provide improved lethality of air bursting munitions that focus on emerging requirements from the User as shown in the Soldier Lethality Roadmap (e.g., 25mm High Explosive Air Bursting Improvements)."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.800"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.800"
                                            },
                                            "Text": {
                                                "val": "Will mature technologies for neutralization of targets in defilade; will mature and demonstrate advanced explosives\/fragmentation warheads to increase lethal zone."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Affordable Precision Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort will integrate complementing navigation sensors, actuators and subsystems in order to demonstrate precision delivery capability on an indirect fire munition system in a GPS denied environment."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "Will integrate and optimize critical guidance subsystems; will demonstrate airframe and actuator performance through flight testing in order to verify the maneuverability."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Guided Enhanced Fragmentation Mortar Munition"
                                    },
                                    "Description": {
                                        "val": "This effort will develop and demonstrate a 120mm precision guided mortar with improved capabilities with respect to the currently fielded 120mm precision guided mortar."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.200"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.200"
                                            },
                                            "Text": {
                                                "val": "Will build and test fully integrated systems to verify designs and demonstrate functionality at nominal and environmental extreme conditions."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "43A"
                    },
                    "ProjectTitle": {
                        "val": "ADV WEAPONRY TECH DEMO"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7.487"
                        },
                        "CurrentYear": {
                            "val": "10.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding for Advanced Weaponry Technology development."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "Description": {
                                        "val": "This is a Congressional Interest Item"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.487"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Matured and demonstrated lethal and non-lethal weapons and munitions with potential to increase force application and force protection capabilities across the spectrum of operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Mature and demonstrate lethal and non-lethal weapons and munitions with potential to increase force application and force protection capabilities across the spectrum of operations."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "L96"
                    },
                    "ProjectTitle": {
                        "val": "High Energy Laser Technology Demo"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "12.460"
                        },
                        "CurrentYear": {
                            "val": "13.963"
                        },
                        "BudgetYearOne": {
                            "val": "14.381"
                        },
                        "BudgetYearOneBase": {
                            "val": "14.381"
                        },
                        "BudgetYearTwo": {
                            "val": "12.611"
                        },
                        "BudgetYearThree": {
                            "val": "17.849"
                        },
                        "BudgetYearFour": {
                            "val": "17.742"
                        },
                        "BudgetYearFive": {
                            "val": "18.053"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates advanced technologies for future High Energy Laser (HEL) weapons technology.  The major effort under this project is the phased approach for mobile high power solid state laser (SSL) technology demonstrations that are traceable to the form, fit, and function requirements for a HEL weapon.  At entry level weapon power of around 10 kW, SSL technology has the potential to engage and defeat small caliber mortars, unmanned aerial vehicles (UAVs), surface mines, sensors, and optics.  At full weapon system power levels of around 100 kW, SSL technology has the potential to engage and defeat rockets, artillery and mortars (RAM), UAVs, and anti-tank guided missiles (ATGMs), as well as surface mines, sensors, and optics at tactically relevant ranges.  HELs are expected to complement conventional offensive and defensive weapons at a lower cost-per-shot than current systems and without the need to strategically, operationally, or tactically stockpile ordnance.  This effort utilizes a modular building block approach with open systems architecture to ensure growth, interoperability, and opportunity for technology insertions for maturation of laser, beam control, sensor\/radar, integration of power and thermal management subsystems, as well as Battle Management Command, Control, and Computers (BMC3). \n \nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy. \n \nWork is performed by the US Army Space and Missile Defense Command\/Army Forces Strategic Command, Technical Center, Huntsville, AL."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Laser System Ruggedization"
                                    },
                                    "Description": {
                                        "val": "This effort ruggedizes laser systems for integration on tactical platforms.  Ruggedization includes modifications of the laser system to withstand vibration, temperature, and contamination environments expected on the HEL MD platform, and other selected tactical platforms, while ensuring platform volume, weight, and interface specifications are met. The laser system consists of laser devices, such as the laboratory laser devices developed under PE 0602307A, Project 042, and the prime power, command and control and thermal management subsystems required for the laser device operation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.886"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Used the HEL technology selected under PE 0602307A, Project 042 to begin ruggedization of a 25-50kW class laser device for integration on the HEL MD platform; validated vibration, temperature, and contamination environment specifications for the laser device and supporting equipment, as well as volume, weight, and interface specifications to ensure compatibility with the platform; began ruggedization efforts for available programmable pulsed power technology to provide prime power for the 25-50 kW laser device; and ruggedized available thermal management technology that can cool the 25-50 kW laser device."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.563"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete ruggedization efforts for available programmable pulsed power technology to provide prime power for the 50 kW laser device; begin ruggedization of available thermal management technology that can cool the 50 kW laser device; provide additional ruggedization of the 50 kW laser device to enable integration into the HEL MD platform; correct beam control system deficiencies discovered during the 10 kW demonstration."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.679"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.679"
                                            },
                                            "Text": {
                                                "val": "Will continue additional ruggedization of a 50kW class laser device for integration on the HEL MD platform; continue ruggedization of thermal management technology that can cool the 50 kW laser device; and initiate power generation function ruggedization for recharging the power storage modules."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Energy Laser Mobile Demonstrations (HEL MD)"
                                    },
                                    "Description": {
                                        "val": "This effort initially integrates a commercial-off-the-shelf (COTS) laser subsystem (then later a ruggedized higher power laser subsystem) into the existing mobile laser demonstrator platform that includes the ruggedized BCS built under the HEL TD effort and other required subsystems to demonstrate weapon system performance. The goal is to demonstrate and evaluate performance of a complete mobile high power laser weapon in a relevant environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.574"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Capitalized on the availability of COTS 10 kW class lasers and reduced risk for integration of higher power lasers on a mobile platform by integrating a COTS 10kW laser system on the HEL MD platform to conduct demonstrations, including assessment of mobile SSL performance against mortars and other selected targets; demonstrated the HEL JTO provided AO technologies with the 10kW device to assess increases to effective range; and began the integration of ruggedized components on the HEL MD platform to support the next phase (25-50kW) of HEL mobile demonstrations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.400"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete the 10 kW laser demonstration integrated with the HEL MD platform; finish assessment of 10 kW integrated subsystem performance against selected targets; demonstrate and assess the performance of the HEL JTO provided AO technologies with the 10kW laser device to determine increases to effective range of the laser; begin integration of power subsystem for future 50kW demonstration."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.702"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.702"
                                            },
                                            "Text": {
                                                "val": "Will begin subsystem demonstration and performance validation for the ruggedized thermal management technology that cools the 50 kW laser device; begin subsystem demonstration and performance validation for the ruggedized battle management function that provides controls for the 50kW laser and other subsystems; and begin planning for the integrated 50kW class demonstration, to include objective definition, demonstration reference missions, and long-lead purchases."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "L97"
                    },
                    "ProjectTitle": {
                        "val": "Smoke And Obscurants Advanced Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.730"
                        },
                        "CurrentYear": {
                            "val": "3.278"
                        },
                        "BudgetYearOne": {
                            "val": "3.727"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.727"
                        },
                        "BudgetYearTwo": {
                            "val": "4.372"
                        },
                        "BudgetYearThree": {
                            "val": "4.972"
                        },
                        "BudgetYearFour": {
                            "val": "5.044"
                        },
                        "BudgetYearFive": {
                            "val": "5.062"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The project matures and demonstrates obscurant technologies with potential to enhance personnel\/platform survivability by degrading threat force surveillance sensors and defeating the enemy's target acquisition devices, missile guidance, and directed energy weapons. Dissemination systems for new and improved obscurants are developed with the goal of providing efficient and safe screening of deployed forces.  This project also matures and demonstrates improved detection of explosives and hazardous materials by Soldiers and Small Units.\n\nWork in this PE is related to, and fully coordinated with, PE 0602622A (Chemical, Smoke and Equipment Defeating Technology) and PE 0603606A, project 608 (Countermine & Barrier Development).   \n\nThis project sustains Army science and technology efforts supporting the Ground portfolio.\n   \nThe cited work is consistent with the Director, Defense Research and Engineering Strategic Plan, the Army Modernization Strategy, and the Army Science and Technology Master Plan.   \n  \nWork in this project is performed and managed by the Army Research, Development, and Engineering Command (RDECOM), Edgewood Chemical Biological Center (ECBC), Edgewood, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Obscurant Enabling Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates the dissemination of new and advanced obscurants."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.627"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Optimized new low hazard visual obscurant grenade."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.659"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct toxicology studies of optimized grenades; further characterize performance of low hazard visual obscurant grenade."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.697"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.697"
                                            },
                                            "Text": {
                                                "val": "Will conduct initial dissemination studies on artillery\/mortar delivered low hazard visual obscurant.  Will demonstrate low hazard visual smoke grenade."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Forensic Analysis of Explosives"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates improved point and stand-off detection of explosives and home made explosive (HME) precursors."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.787"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Optimized and matured a HME detection kit for the dismounted soldier."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.053"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Integrate and demonstrate Colorimetric Reconnaissance Explosive Sensor System (CRESS) HME detection kit for dismounted Soldiers; fabricate the Chemical Fingerprint Identification System (CFIS) device for unambiguous biometric identification detection of explosives in latent fingerprints; develop a prototype forensic optical imager that will generate digital fingerprints compatible with law enforcement databases and simultaneously determine the chemical composition of trace residue using Raman chemical imaging and fluorescence imaging."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.378"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.378"
                                            },
                                            "Text": {
                                                "val": "Will integrate and demonstrate Chemical Fingerprint Identification System (CFIS) device for unambiguous biometric identification of an individual linking explosive residue identified and found in latent fingerprints using Raman Chemical Imaging."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Detection Mechanisms for Contaminants"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates improved point and standoff detection of a wide range of hazardous materials."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.316"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Optimized and demonstrated recommended spectroscopic approaches for standoff, proximity and point detection of explosives, homemade explosives, and\/or homemade explosive precursors; and demonstrated integrated sensing of chemical agents and explosives in a common Ion Mobility Spectroscopy system (IMS) Joint Chemical Detector (JCD)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.566"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Optimize and mature unified ion mobility based sensing of explosives and chemical agents in the Joint Chemical Detector (JCD) system; demonstrate standoff detection of trace homemade explosives with laser based systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.652"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.652"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate unambiguous detection of explosives and chemical agents in a unified and integrated system based on ion mobility spectrometry."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}