{
    "id": "1cadaeca1575438ffb0a1d72329021779323fe28",
    "meta": {
        "filename": "dod-2015_RDTE_2015_MDA_RDTE_JustificationBook_Missile_Defense_Agency_PB_2015.zzz_unzipped_RDTE_JustificationBook_Missile_Defense_Agency_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Missile Defense Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603180C"
        },
        "ProgramElementTitle": {
            "val": "Advanced Research"
        },
        "R1LineNumber": {
            "val": "36"
        },
        "MdapCode": {
            "val": "362"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Missile Defense Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "19.188"
            },
            "BudgetYearOne": {
                "val": "16.584"
            },
            "BudgetYearOneBase": {
                "val": "16.584"
            },
            "BudgetYearTwo": {
                "val": "16.715"
            },
            "BudgetYearThree": {
                "val": "16.924"
            },
            "BudgetYearFour": {
                "val": "18.336"
            },
            "BudgetYearFive": {
                "val": "18.723"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "Beginning in FY 2014, the Advanced Research effort transferred from the Ballistic Missile Defense Technology Program Element 0603175C to the Advanced Research Program Element, per the FY 2014 Consolidated Appropriations Act (P.L. 113-76)."
        },
        "ProgramElementMissionDescription": {
            "val": "Advanced Research conducts leading edge research and development to create and enable future missile defense capability. The Missile Defense Agency (MDA) executes this mission by capitalizing on the creativity and innovation of the brightest minds in our Nation's universities and small businesses, collaborative research partnerships between allied country academic institutions, innovative ideas from industry, and facilitates technology transition to the Ballistic Missile Defense System through a Commercialization and Transition Office.  Advanced Research identifies priorities and balances the research portfolio in collaboration with the Agency's Chief Architect, Chief Engineer, and an Agency-wide executive level Research Council."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "19.188"
                },
                "BudgetYearOne": {
                    "val": "16.584"
                },
                "BudgetYearOneBase": {
                    "val": "16.584"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "19.188"
                },
                "BudgetYearOne": {
                    "val": "16.584"
                },
                "BudgetYearOneBase": {
                    "val": "16.584"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "19.188"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustment"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "16.584"
                                },
                                "BudgetYearOneBase": {
                                    "val": "16.584"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Beginning in FY 2014, the Advanced Research effort transferred from the Ballistic Missile Defense Technology Program Element 0603175C to the Advanced Research Program Element, per the FY 2014 Consolidated Appropriations Act (P.L. 113-76)."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "MD25"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Technology Development"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "19.188"
                        },
                        "BudgetYearOne": {
                            "val": "15.787"
                        },
                        "BudgetYearOneBase": {
                            "val": "15.787"
                        },
                        "BudgetYearTwo": {
                            "val": "15.791"
                        },
                        "BudgetYearThree": {
                            "val": "15.886"
                        },
                        "BudgetYearFour": {
                            "val": "17.098"
                        },
                        "BudgetYearFive": {
                            "val": "17.386"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "Beginning in FY 2014, the Advanced Research effort was transferred from the Ballistic Missile Defense Technology Program Element 0603175C to the Advanced Research Program Element 0603180C, per the FY 2014 Consolidated Appropriations Act (P.L. 113-76)."
                        },
                        "ProjectMissionDescription": {
                            "val": "Advanced Technology Development explores new Ballistic Missile Defense System (BMDS) capability by leveraging the creativity and innovation of the Nation's small businesses and universities, and through cooperative international research efforts between U.S. and foreign universities of allied nations. The program manages the selection process and administers the Missile Defense Small Business Innovation Research (SBIR) Program Element, 0605502C.  SBIR topics and projects are selected annually based on identified needs across the BMDS and executed in partnership with the sponsoring elements. In FY 2015, the program will conduct Advanced Technology Innovation Broad Agency Announcement (ATI BAA) solicitation for identifying potentially breakthrough research on missile defense related technology with private industry, qualified accredited educational institutions, and non-profit organizations. Projects may include directed energy, sensors, command and control, or interceptor technology.  The program will execute and administer the Missile Defense Agency Science, Technology and Research Broad Agency Announcement (MSTAR BAA) which invests in university research ranging from sensor data fusion to solid rocket propulsion to advanced materials for missile defense application.\n\nAdvanced Technology Development pursues a broad range of revolutionary technology targeted for application and insertion into the BMDS.  This effort facilitates the commercialization and transition of promising technology into the BMDS by promoting a cooperative environment to reduce cost and increase return on investment between small business, prime contractors and MDA elements. The program also manages the Science, Technology, Engineering and Mathematics (STEM) program for MDA, with a goal of increasing the awareness of K-12 and college students in STEM careers in order to enhance the number of U.S. scientists and engineers capable of solving future BMDS challenges."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Research"
                                    },
                                    "Description": {
                                        "val": "N\/A"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FY 2013 accomplishments are captured in the BMD Technology Program Element, 0603175C."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.188"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Award Advanced Research contracts to domestic universities for innovative investigations to enlarge the battle space and enhance discrimination and raid handling \n\n-Pursue on-going scientific and engineering university research initiatives and projects:\n--Clemson University: Power scaling capability of High Power Fiber Laser Research \n--Texas A&M University: Solid Propellant Additives for Divert Attitude Control System (DACS) Applications \n--Tuskegee University: Mechanical properties, fracture behavior and failure mechanisms of selective composites for re-entry vehicles \n--University of Illinois: Decision Theory for Optimal Engagement Planning \n--University of Tennessee: Target Handoff and Resource Management for Multi-Sensor Multi-Target Tracking System \n--North Carolina State University\/Czech Republic Institute of Physics: Multi-sensor algorithm development to track space objects and debris \n--U.S. Air Force Academy: Scaling Diode Pumped Alkali Lasers for higher power output \n--Alabama A&M University: Computational algorithms using reconfigurable logic devices\n--University of Alabama Huntsville: Computational studies of aero-optic effects of higher Reynolds numbers gas flows over sensor structures. \n--University of Southern California: Algorithms for detection, track, and classification of objects in a high debris environment\n--Texas A&M University: Hybrid Waveguide\/Micro Electro Mechanical System Optical Signal Processor \n\n-Sponsor breakthrough technology and innovative solutions from private industry, qualified accredited domestic educational institutions, and nonprofit organizations, using the Advanced Technology Innovation Broad Agency Announcement (BAA), to include research in: \n  --  Lightweight optics \n  --  Passive jitter control using mechanical isolation \n  --  Lightweight rigid optics mounts \n  --  Beam control optimization \n  --  Interceptor Technology\n  --  Sensor Technology\n\n-Partner with industry, the High Energy Laser Joint Technology Office, Universities and National Laboratories through advanced technology initiatives to improve sensor technology, high energy laser acquisition, tracking, and pointing technology, and lightweight fiber laser amplifiers\n\n-Conduct research and material solution analysis to identify initiatives and technology to include missiles, sensors, and command and control components in the defense against current and future threats\n\n-Leverage University-to-University (UUR) International Research opportunities with allied nations to enhance BMDS Advanced Technology initiatives and build stronger relationships with Missile Defense Agency (MDA) North Atlantic Treaty Organization (NATO) Allied nations and our partner countries.\n\n-Manage the selection process of the Small Business Innovation Research (SBIR) and Technology Applications programs to assist MDA-funded technology developers in finding and entering technology transfer opportunities to missile defense applications\n\n-Conduct system engineering and integration to identify and mature initiatives and technology to defend against current and future threats"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.787"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.787"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Pursue on-going scientific and engineering university research initiatives and projects:\n  --Texas A&M University: Solid Propellant Additives for Divert Attitude Control System (DACS) Applications \n  --Texas A&M University: Hybrid Waveguide\/Micro Electro Mechanical System Optical Signal Processor\n  --University of Illinois: Decision Theory for Optimal Engagement Planning \n  --University of Tennessee: Target Handoff and Resource Management for Multi-Sensor Multi-Target Tracking\n    System \n  --University of Alabama Huntsville: Computational studies of aero-optic effects of higher Reynolds numbers gas\n    flows over sensor structures \n  --University of Southern California: Algorithms for detection, track, and classification of objects in a high debris\n    environment \n  --University of Maryland: Development of Thrusters for Fast Response Time DAC Propulsion\n    Systems\n  --University of New Hampshire: Gas Circulator for Diode Pumped Alkali Laser\n  --University of Connecticut: Innovative Radar Signal Processing & Algorithms\n  --Purdue University: Propulsion Improvements for MDA Applications\n  --Howard University: Infrared Analysis in Counterfeit Parts Detection and Supply Chain Validation\n  --Auburn University \/ Middle East Technical University, Turkey: Integrated Framework for Engineering Replicability into High Assurance BMDS Simulations\n\n-Sponsor breakthrough technology and innovative solutions from private industry, qualified accredited domestic educational institutions, and nonprofit organizations, using the Advanced Technology Innovation Broad Agency Announcement (BAA), to include research in: \n  -- Radar Systems\n  -- Directed Energy Systems\n  -- Electro-Optical \/ (Infrared)IR Sensor Systems\n  -- Computer Science, Signal and Data Processing\n  -- Mechanical and Aerospace engineering\n  -- Decision Theory\n  -- Modeling & Simulation\n  -- Interceptor Technology\n  -- Sensor Technology\n\n-Partner with industry, the High Energy Laser Joint Technology Office, Universities and National Laboratories through advanced technology initiatives to improve sensor technology, high energy laser acquisition, tracking, and pointing technology, and lightweight fiber laser amplifiers\n\n-Conduct research and material solution analysis to identify initiatives and technology to include missiles, sensors, and command and control components in the defense against current and future threats\n\n-Leverage University-to-University (UUR) International Research opportunities with allied nations to enhance Ballistic Missile Defense System (BMDS) Advanced Technology initiatives and build stronger relationships with Missile Defense Agency (MDA) North Atlantic Treaty Organization (NATO) Allied nations and our partner countries.\n\n-Manage the selection process of the Small Business Innovation Research (SBIR) and Technology Applications programs to assist MDA-funded technology developers in finding and entering technology transfer opportunities to missile defense applications\n\n-Conduct system engineering and integration to identify and mature initiatives and technology to defend against current and future threats\n\n-MDA Science Technology Engineering and Mathematics (STEM) Outreach will expand volunteer activities for other MDA facilities to increase overall MDA K-12 STEM awareness and engagement nationwide"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0603175C"
                                    },
                                    "Title": {
                                        "val": "Ballistic Missile Defense Technology"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "69.438"
                                        },
                                        "CurrentYear": {
                                            "val": "9.321"
                                        },
                                        "BudgetYearOne": {
                                            "val": "38.800"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "38.800"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "76.400"
                                        },
                                        "BudgetYearThree": {
                                            "val": "52.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "112.800"
                                        },
                                        "BudgetYearFive": {
                                            "val": "178.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "536.7590"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603176C"
                                    },
                                    "Title": {
                                        "val": "Advanced Concepts and Performance Assessment"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "6.919"
                                        },
                                        "BudgetYearOne": {
                                            "val": "8.470"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "8.470"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "10.683"
                                        },
                                        "BudgetYearThree": {
                                            "val": "10.867"
                                        },
                                        "BudgetYearFour": {
                                            "val": "11.687"
                                        },
                                        "BudgetYearFive": {
                                            "val": "11.994"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603177C"
                                    },
                                    "Title": {
                                        "val": "Discrimination Sensor Technology"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "29.642"
                                        },
                                        "BudgetYearOne": {
                                            "val": "45.110"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "45.110"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "59.278"
                                        },
                                        "BudgetYearThree": {
                                            "val": "60.054"
                                        },
                                        "BudgetYearFour": {
                                            "val": "62.897"
                                        },
                                        "BudgetYearFive": {
                                            "val": "21.051"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603178C"
                                    },
                                    "Title": {
                                        "val": "Weapons Technology"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "46.708"
                                        },
                                        "BudgetYearOne": {
                                            "val": "14.068"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "14.068"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "36.494"
                                        },
                                        "BudgetYearThree": {
                                            "val": "46.026"
                                        },
                                        "BudgetYearFour": {
                                            "val": "56.037"
                                        },
                                        "BudgetYearFive": {
                                            "val": "83.722"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603294C"
                                    },
                                    "Title": {
                                        "val": "Common Kill Vehicle Technology"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "70.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "25.639"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "25.639"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "33.171"
                                        },
                                        "BudgetYearThree": {
                                            "val": "37.348"
                                        },
                                        "BudgetYearFour": {
                                            "val": "38.454"
                                        },
                                        "BudgetYearFive": {
                                            "val": "54.256"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The acquisition strategy to conduct this technology development effort consists of partnering with accredited domestic universities, small businesses, and nonprofit organizations. Missile Defense Agency awards competitive procurements via the MDA Science and Technology Advanced Research Broad Agency Announcement; the Advanced Technology Innovation Broad Agency Announcement; the Small Business Innovative Research program; the Small Business Technology Transfer program; and the Science, Technology, Engineering, and Mathematics Outreach program."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MD40"
                    },
                    "ProjectTitle": {
                        "val": "Program-Wide Support"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.797"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.797"
                        },
                        "BudgetYearTwo": {
                            "val": "0.924"
                        },
                        "BudgetYearThree": {
                            "val": "1.038"
                        },
                        "BudgetYearFour": {
                            "val": "1.238"
                        },
                        "BudgetYearFive": {
                            "val": "1.337"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "Beginning in FY 2014, the Advanced Research effort was transferred from the Ballistic Missile Defense Technology Program Element 0603175C to the Advanced Research Program Element 0603180C, per the FY 2014 Consolidated Appropriations Act (P.L. 113-76)."
                        },
                        "ProjectMissionDescription": {
                            "val": "Program-Wide Support (PWS) contains non-headquarters management costs in support of Missile Defense Agency (MDA) functions and activities across the entire Ballistic Missile Defense System (BMDS). It Includes Government Civilians, Contract Support Service, and Federally Funded Research and Development Center (FFRDC) providing integrity and oversight of the BMDS as well as, supporting MDA in enabling the development and evaluation of technologies that will respond to the changing threat. In addition, includes Global Deployment personnel and support performing deployment site preparation and activation. Other costs included provide facility capabilities for MDA Executing Agent locations, such as physical and technical security, legal services, travel and agency training, office and equipment leases, utilities, data and unified communications support, supplies and maintenance, materiel and readiness and central property management of equipment, and similar operating expenses. Also includes legal settlements. In keeping with congressional intent, Program Wide Support is allocated on a pro-rata basis and therefore, fluctuates by year based on the total MDA budget."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Program Wide Support"
                                    },
                                    "Description": {
                                        "val": "See paragraph A: Mission Description and Budget Item Justification"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.797"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.797"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "See paragraph A: Mission Description and Budget Item Justification"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}