{
    "id": "1cd112a3d074ba0607369074c98f6a0f1dfa8d63",
    "meta": {
        "filename": "dod-2015_RDTE_2015_OSD_RDTE_JustificationBook_Office_of_Secretary_Of_Defense_PB_2015.zzz_unzipped_RDTE_JustificationBook_Office_of_Secretary_Of_Defense_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605142D8Z"
        },
        "ProgramElementTitle": {
            "val": "Systems Engineering"
        },
        "R1LineNumber": {
            "val": "145"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "39.118"
            },
            "PriorYear": {
                "val": "38.882"
            },
            "CurrentYear": {
                "val": "39.606"
            },
            "BudgetYearOne": {
                "val": "44.246"
            },
            "BudgetYearOneBase": {
                "val": "44.246"
            },
            "BudgetYearTwo": {
                "val": "44.256"
            },
            "BudgetYearThree": {
                "val": "44.265"
            },
            "BudgetYearFour": {
                "val": "44.274"
            },
            "BudgetYearFive": {
                "val": "44.283"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) establishes the dedicated funding line to carry out the duties as described in Title 10 US Code, Section 139, the Weapons Systems Acquisition Reform Act of 2009.  The Deputy Assistant Secretary of Defense for Systems Engineering (DASD(SE)) is the principal advisor to the Secretary of Defense, the Under Secretary of Defense for Acquisition, Technology and Logistics (USD(AT&L)) and the Assistant Secretary of Defense for Research and Engineering (ASD(R&E)) on systems engineering, development planning, and related technical fields in the Department of Defense.  The DASD(SE) develops policies and guidance for (1) the use of systems engineering principles and best practices; (2) the use of systems and software engineering planning and contracting approaches to enhance reliability, availability, and maintainability on major defense acquisition programs (MDAPs); (3) the systems engineering plans (SEPs) for MDAPs including software, and systems engineering considerations in support of lifecycle management and sustainability; and (4) the inclusion of provisions relating to systems engineering and reliability in requests for proposals.  The DASD(SE) reviews and approves the SEP for each MDAP and monitors and reviews the systems engineering and development planning activities of MDAPs and other defense acquisition programs as directed by the Secretary of Defense or the USD(AT&L).  Based on the DASD(SE)’s continuous program engagement, the DASD(SE) advises and makes recommendations to the Secretary of Defense and the USD(AT&L) regarding systems engineering, development planning and the execution of these activities.  As a member of the Defense Acquisition Board, the DASD(SE) provides independent assessments of defense acquisition program’s systems engineering, development planning, technical execution, and risk.  The DASD(SE) also provides input on the inclusion of systems engineering requirements as part of the Joint Requirements Oversight Council's process for joint military requirements, to include developing specific inputs relating to each capabilities development document.\n\nThe DASD(SE) issues guidance to, and consults with, the Services and Agencies with respect to systems engineering in the Department, providing advocacy, oversight, and guidance to elements of the acquisition workforce responsible for systems engineering, development planning, and lifecycle management and sustainability functions and developing policies and guidance for the integration of specialty engineering functions.  \n\nThe DASD(SE) periodically reviews the organizations and capabilities of the military departments with respect to systems engineering, development planning, and lifecycle management and sustainability, and identifies needed changes or improvements to such organizations and capabilities. The DASD(SE) prepares and submits an annual report to Congress on systems engineering activities and effectiveness.\n\nThis PE includes efforts by the office of the DASD(SE) in implementing the Department’s Trusted Defense System Strategy.  Specifically, the PE will develop and mature the critical sub discipline of systems engineering - system security engineering and the Comprehensive Program Protection Planning process that implements a risk-based approach to protection of critical technology, components and information in acquisition programs.  This includes study and maturation of policy, guidance and SSE discipline fundamentals such as engineering methods, tools and best practices.  These activities will be promulgated in defense acquisition as a fundamental element of DASD(SE) systems engineering and technical reviews."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "43.195"
                },
                "CurrentYear": {
                    "val": "44.237"
                },
                "BudgetYearOne": {
                    "val": "52.067"
                },
                "BudgetYearOneBase": {
                    "val": "52.067"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "38.882"
                },
                "CurrentYear": {
                    "val": "39.606"
                },
                "BudgetYearOne": {
                    "val": "44.246"
                },
                "BudgetYearOneBase": {
                    "val": "44.246"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-4.313"
                },
                "CurrentYear": {
                    "val": "-4.631"
                },
                "BudgetYearOne": {
                    "val": "-7.821"
                },
                "BudgetYearOneBase": {
                    "val": "-7.821"
                }
            },
            "AdjustmentDetails": {
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "-3.023"
                    },
                    "CurrentYear": {
                        "val": "-4.400"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "-0.116"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.174"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Strategic Efficiency Savings"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-7.821"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-7.821"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "-0.231"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The reduction is a strategic efficiency approach to reduce funding and staffing.  As a result, we provide a better alignment of funding and provide support to a smaller military force."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P142"
                    },
                    "ProjectTitle": {
                        "val": "Systems Engineering"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "34.554"
                        },
                        "PriorYear": {
                            "val": "34.326"
                        },
                        "CurrentYear": {
                            "val": "30.324"
                        },
                        "BudgetYearOne": {
                            "val": "34.715"
                        },
                        "BudgetYearOneBase": {
                            "val": "34.715"
                        },
                        "BudgetYearTwo": {
                            "val": "34.364"
                        },
                        "BudgetYearThree": {
                            "val": "34.345"
                        },
                        "BudgetYearFour": {
                            "val": "34.292"
                        },
                        "BudgetYearFive": {
                            "val": "34.080"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project (142) supports the execution of the missions of the Deputy Assistant Secretary of Defense for Systems Engineering (DASD(SE)) to: (1) provide flexible engineering policy, guidance, and workforce development requirements for the Department of Defense (DoD) acquisition workforce; (2) foster an acquisition environment of collaboration, teamwork, and joint ownership of program success through a proactive program oversight process, ensuring appropriate levels of systems engineering discipline are applied through all phases of the acquisition life cycle; and (3) engage all stakeholders across government, industry, and academia to collectively advance systems engineering practice and achieve acquisition excellence.  The outcome of this effort is to ensure systems engineering principles and disciplines are fully accepted and assimilated into the DoD acquisition workforce positioning the DoD for acquisition excellence and leading to a stronger national defense.\n\nActivities include the following functions:\n\nProgram Support \n• Work with program managers to prepare systems engineering plans (SEPs) to document the technical management approach.\n• Conduct periodic program engagements in support of technical reviews to confirm programs are executed in accordance with the SEP.\n• Review all aspects of the systems engineering process for major defense acquisition programs (MDAPs) to ensure they are adequate to support fielding and the achievement of cost and performance goals including reliability, sustainment, and other considerations.\n• Participate in Systems Engineering Integrated Project Teams (IPTs), Systems Engineering Working Integrated Project Teams (WIPTs), and Systems Engineering technical reviews, especially Preliminary Design Reviews and Critical Design Reviews.\n• Work with DoD Service program managers, their staffs, and other organizations, technical authorities, and oversight organizations to develop and implement technical management programs for MDAPs.\n• Conceive plans and lead program support reviews and assessments of MDAP weapons systems and other programs (e.g., Major Automated Information Systems (MAIS)) to shape technical planning and management to ensure program success.\n• Conduct other technical reviews as requested, e.g., Nunn-McCurdy certification reviews, Non-Advocate Reviews, focused technical assessments, and software readiness reviews to identify and mitigate program risk.\n\nMission Assurance \n• Establish engineering policy, guidance, and workforce development to drive the development of fully capable and supportable weapons systems.\n• Oversee Component implementation of engineering initiatives and conduct independent assessments.\n• Develop education and training materials for instructing, maintaining, and enhancing the defense acquisition workforce.  Activities include: (1) developing guidance to enhance Systems Planning, Research, Development and Engineering (SPRDE) and Production Quality and Manufacturing (PQM) acquisition career planning and progression; and (2) monitoring, and facilitating Defense Acquisition University (DAU) updates to the systems engineering, quality and software engineering courses, to ensure the curriculum represents the education and training requirements necessary to be a viable team member in the acquisition process.\n• Drive an overall improvement in weapon system reliability through improved reliability engineering, reliability growth management, and reliability monitoring in program development contracting, execution and sustainment.\n• Prepare and submit annual reports to Congress on the Department’s capabilities and effectiveness in systems engineering and development planning.\n\nSystem Analysis\n• Foster program protection planning methodology, system security engineering discipline, industry standards, and engagement with acquisition programs to support risk assessment and vulnerability mitigation.\n• Guide Service and other component organizations in the development planning process to ensure proposed MDAP programs are executable within acceptable levels of risk.\n• Resolve long-term major systems engineering challenges such as systems of systems (SoS) systems engineering, systems engineering Complexity Analysis, and systems engineering based technical trade off analysis and pre-program formulation stages. \n• Provide necessary modeling and simulation policy and guidance, clarify the application of distributed simulation standards and work with the DoD modeling and simulation community to identify and promulgate required capabilities and competencies needed to support acquisition modeling and simulations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Systems Engineering Initiatives"
                                    },
                                    "Description": {
                                        "val": "The DASD(SE) provides objective assessments of program risk to support knowledge-based decision making by DoD leaders regarding DoD MDAPs and MAISs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "34.326"
                                            },
                                            "Text": {
                                                "val": "Strategic Thrust: Major Program Support\n• Conducted deep-dive systems engineering reviews of MDAPs and special interest programs.  \n• Expanded conduct of SE and execution risk assessments.\n• Continued expansion of systems integration and development planning risk assessments.\n• Continued monitoring of programs, provided SE oversight to include all MDAPs, MAIS, and special interest programs.\n• Conducted systemic analysis and process management. \n• Expanded root cause analysis conducted during and after Program Support Reviews (PSRs).\n• Expanded detailed performance measurements and analysis.\n• Provided decision-quality information and recommendations to Defense Acquisition Boards (DABS), In Progress Reviews (IPRs), Defense Space Acquisition Boards (DSABs) and Information Technology Advisory Boards (ITABs).\n• Reviewed MDAP Request for Proposals for critical engineering requirements.\n\nStrategic Thrust:  Systems Engineering Capabilities Assessment\n• Conducted analysis of Military Departments systems engineering self-assessments; conducted analysis of DoD’s SE capability.\n• Authored annual systems engineering Report to Congress.\n• Developed and strengthened component SE organization and capabilities.\n\nStrategic Thrust: Engineering and Policy\n• Developed and updated core SE policy, guidance and standards, including a complete update to Chapter Four of the Defense Acquisition Guidebook on Systems Engineering; reviewed all acquisition policy for SE implications.\n• Workforce development: Functional Lead for SPRDE, PQM and assisted software engineering.\n\nStrategic Thrust: Early Systems Engineering and Development Planning\n• Developed policy and guidance for development planning and early SE; oversaw its implementation and execution within Services.\n• Performed early acquisition risk assessment, including pre-Milestone A (pre-MS A) engagement with Joint Requirements Oversight Council processes.\n• Supported Services and COCOMs in pre-MS A formulation.\n• Supported requirements analyses and analysis of alternatives.\n• Supported initial capabilities document definition and development.\n• Led systems engineering research, systems of systems research and collaboration across Services to identify areas of improvement; developed and established best practices.\n• Oversaw the Systems Engineering Research Universit Affiliated Research Center (UARC) and conducted University-based research into SE processes and techniques."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "30.324"
                                            },
                                            "Text": {
                                                "val": "Strategic Thrust:  Program Support \nContinue to:\n• Conduct deep-dive systems engineering reviews of major defense acquisition programs (MDAPs) and special interest programs.\n• Expand conduct of SE and execution risk assessments.\n• Expand systems integration and development planning risk assessments.\n• Continue monitoring of programs, provide SE oversight to include all MDAPs, Major Automated Information Systems (MAIS), and special interest programs.\n• Conduct systemic analysis and process management.\n• Expand root cause analysis conducted during and after Program Support Reviews (PSRs).\n• Expand detailed performance measurements and analysis.\n• Provide decision-quality information and recommendations to Defense Acquisition Boards, In Progress Reviews, Defense Space Acquisition Boards and Information Technology Advisory Boards.\n• Review MDAP Request for Proposals for critical engineering requirements.\n\nStrategic Thrust:  Specialty Engineering \n• Continue implementation of engineering policies for the integration of specialty engineering functions as part of the SE responsibility in the acquisition process including, but not limited to, cyber security; program protection in accordance with Reference (gc); software; reliability, availability, and maintainability; modeling and simulation; configuration management; data management; and risk management. \n• Conduct studies and analyses of methods, processes and tools to identify challenges and opportunities and develop and promulgate best practices and guidance for applying SE to rapid development and acquisition.\n• Assess challenges and impact and develop new guidance, best practices, methods, processes and tools to more effectively implement SE for Systems of Systems.\n\nStrategic Thrust:  Work Force Development\n• Workforce development: Functional Lead for Systems Planning, Research, Development and Engineering (SPRDE), Process Quality Management (PQM), all Department non-construction engineering and assist software engineering.\n• Build an Enduring high performance engineering culture across the Department in Systems Engineering. \n• Outline a Department plan for engineering workforce career development, focused on delivering critical Engineering content vs. teaching OSD acquisition Policy.\n• Outline a Department plan for engineering workforce rewards and recognition.\n• Outline a strategy to show the value of systems engineering contributions to \"design and manufacturing quality\" in DoD acquisition systems.\n• Perform outreach to services and OSD to focus Department’s attention and behavior on promoting an engineering culture.\n• Manage DoD sponsorship of the MITRE Federally Funded Research and Development Center (FFRDC)\n\nStrategic Thrust:  Engineering and Policy \n• Support Service and component implementation of updated core SE policy, guidance and standards; review all acquisition policy for SE implications.\n• Provide advice and make recommendations to the Secretary of Defense and the USD(AT&L) regarding systems engineering and development planning and the execution of these activities within and across Defense acquisition programs.  Issue guidance to and consult with the Heads of the DoD Components with respect to systems engineering and development planning in the Department of Defense. \n• Provide guidance to Defense acquisition programs for developing and documenting each program’s technical strategy and management approach in the SEP throughout the program’s lifecycle. \n\nStrategic Thrust: Systems Engineering Capabilities Assessment \n• Conduct analysis of Military Departments’ annual systems engineering self-assessments; conduct analysis of DoD’s SE capability.\n• Author DoD Annual Systems Engineering Report to Congress.\n• Work jointly with DT&E to develop and track new measurable performance criteria.\n• Develop and strengthen component SE organization and capabilities.\n• Periodically review the organizations and capabilities of the Military Departments and Defense Agencies with respect to systems engineering, development planning, and lifecycle management and sustainability, and identify needed changes or improvements to such organizations and capabilities. \n• Store and analyze Performance Criteria in SEPs and Test and Evaluation Master Plans (TEMPs) for MDAPs; Develop Program Metrics to aid SE assessments and program execution.\n\nStrategic Thrust:  Early Systems Engineering and Development Planning\n• Develop policy and guidance for development planning and early SE; oversee its implementation within Services.\n• Perform early acquisition risk assessment including pre-MS A engagement with Joint Requirements Oversight Council processes.\n• Support Services and COCOMs in pre-MS A formulation.\n• Support requirements analyses and analysis of alternatives.\n• Support initial capabilities document definition and development."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "34.715"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "34.715"
                                            },
                                            "Text": {
                                                "val": "Strategic Thrust:  Program Support \nContinue to:\n• Conduct deep-dive systems engineering reviews of major defense acquisition programs (MDAPs) and special interest programs.\n• Conduct SE and execution risk assessments.\n• Perform systems integration and development planning risk assessments.\n• Monitor programs, providing SE oversight to include all MDAPs, Major Automated Information Systems (MAIS), and special interest programs.\n• Conduct systemic analysis and process management.\n• Expand root cause analysis conducted during and after Program Support Reviews (PSRs).\n• Expand use of detailed performance measurements and analysis.\n• Provide decision-quality information and recommendations to Defense Acquisition Boards, In Progress Reviews, Defense Space Acquisition Boards and Information Technology Advisory Boards.\n• Review MDAP Request for Proposals for critical engineering requirements.\n\nStrategic Thrust:  Specialty Engineering \n• Develop engineering and policies for the integration of specialty engineering functions as part of the SE responsibility in the acquisition process including, but not limited to, cyber security; program protection in accordance with Reference (gc); software; reliability, availability, and maintainability; modeling and simulation; configuration management; data management; and risk management. \n• Conduct studies and analyses of methods, processes and tools to identify challenges and opportunities and develop and promulgate best practices and guidance for applying SE to rapid development and acquisition.\n• Assess challenges and impact and develop new guidance, best practices, methods, processes and tools to more effectively implement SE for Systems of Systems.\n\nStrategic Thrust:  Work Force Development\n• Workforce development: Functional Lead for Systems Planning, Research, Development and Engineering (SPRDE), Process Quality Management (PQM), all Department non-construction engineering and assist software engineering.\n• Build an Enduring high performance engineering culture across the Department in Systems Engineering.\n• Outline a Department plan for engineering workforce career development, focused on delivering critical Engineering content vs. teaching OSD acquisition Policy.\n• Outline a Department plan for engineering workforce rewards and recognition.\n• Outline a strategy to show the value of systems engineering contributions to \"design and manufacturing quality\" in DoD acquisition systems.\n• Perform outreach to services and OSD to focus the Department’s attention and behavior on promoting an engineering culture.\n• Manage DoD sponsorship of the MITRE Federally Funded Research and Development Center (FFRDC)\n\nStrategic Thrust:  Engineering and Policy \n• Develop and update core SE policy, guidance and standards; review all acquisition policy for SE implications.\n• Provide advice and make recommendations to the Secretary of Defense and the USD(AT&L) regarding systems engineering and development planning and the execution of these activities within and across Defense acquisition programs.  Issue guidance to and consult with the Heads of the DoD Components with respect to systems engineering and development planning in the Department of Defense. \n• Provide guidance to Defense acquisition programs for developing and documenting each program’s technical strategy and management approach in the SEP throughout the program’s lifecycle. \n\nStrategic Thrust: Systems Engineering Capabilities Assessment \n• Conduct analysis of Military Departments’ systems engineering self-assessments; conduct analysis of DoD’s SE capability.\n• Author DoD Annual Systems Engineering Report to Congress.\n• Work jointly with DT&E to develop and track new measurable performance criteria.\n• Develop and strengthen component SE organization and capabilities.\n• Periodically review the organizations and capabilities of the Military Departments and Defense Agencies with respect to systems engineering, development planning, and lifecycle management and sustainability, and identify needed changes or improvements to such organizations and capabilities. \n• Store and analyze Performance Criteria in SEPs and Test and Evaluation Master Plans (TEMPs) for MDAPs; Develop Program Metrics to aid SE assessments and program execution.\n\nStrategic Thrust:  Early Systems Engineering and Development Planning\n• Develop policy and guidance for development planning and early SE; oversee its establishment within Services.\n• Perform early acquisition risk assessment including pre-MS A engagement with Joint Requirements Oversight Council processes.\n• Support Services and COCOMs in pre-MS A formulation.\n• Support requirements analyses and analysis of alternatives.\n• Support initial capabilities document definition and development."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Improve the Systems Engineering effectiveness of the Department’s acquisition enterprise and provide Department leadership with technical insights into acquisition program performance through:\n• Systems engineering plans (SEPs) reviewed and approved to document each program’s technical management approach.\n• Program support reviews (PSRs) and periodic program engagements conducted and program technical reviews supported to confirm programs are executed in accordance with the SEP.\n• Technical reviews conducted as requested, e.g., Nunn-McCurdy certification reviews, Non-Advocate Reviews, and focused technical assessments to identify and mitigate program risk.\n• DABs, Overarching Integrated Product Teams (OIPTs), and other program review participation to provide technical insights to OSD stakeholders.\n• Effective systems engineering policy and guidance established and promulgated throughout the Military Services and the Defense Acquisition System.\n• A systems engineering workforce staffed, trained and certified with capable and experienced personnel.\n• Improved reliability engineering, reliability growth management, and reliability monitoring in program development contracting, execution and sustainment.\n• Annual reports to Congress prepared and submitted on the Department’s capabilities and effectiveness in systems engineering and development planning.\n• Service and other component organizations engaged and supported in the development planning process through effective policy, guidance, document reviews and program engagement to ensure proposed MDAP programs are executable within acceptable levels of risk."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P143"
                    },
                    "ProjectTitle": {
                        "val": "Program Protection"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "4.564"
                        },
                        "PriorYear": {
                            "val": "4.556"
                        },
                        "CurrentYear": {
                            "val": "4.300"
                        },
                        "BudgetYearOne": {
                            "val": "4.531"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.531"
                        },
                        "BudgetYearTwo": {
                            "val": "4.892"
                        },
                        "BudgetYearThree": {
                            "val": "4.920"
                        },
                        "BudgetYearFour": {
                            "val": "4.982"
                        },
                        "BudgetYearFive": {
                            "val": "5.203"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Department of Defense (DoD) must address cyber security and supply chain risks to DoD networks, weapons systems and information stored and processed on both DoD and Defense Industrial Base (DIB) unclassified networks that support DoD programs.  Increased reliance on the internet as a vehicle for sharing information, globalization of the supply chain, and advanced persistent threats (APTs) that can evade commercially available security tools and defeat generic security best practices, drive the need for better and smarter program protection planning and execution.  Comprehensive Program Protection Planning links high level policies and practical expertise to specific acquisition practices, systems engineering activities, and risk reduction activities.  Through this initiative the Department will pilot activities with the DIB to reduce risks in sharing and storing critical program information, better understand and mitigate supply chain risks, improve program protection planning, and improve and streamline program protection engineering.  Activities carried out support implementation of DoD Directive 5200.44 Trusted Systems and Networks with the use of proven mitigation techniques and tools, the ongoing refinement of risk management processes, and creation of needed technology."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Program Protection"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.556"
                                            },
                                            "Text": {
                                                "val": "• Provided support to Acquisition Category (ACAT) I programs to conduct broad program protection planning.  \n   - Conducted criticality analyses.  \n   - Developed Program Protection Plans, and tracked progress to verify protection of critical program capabilities. \n   - Reviewed ACAT I Program Protection Plans and provided recommendations for their approval to Under Secretary of Defense for Acquisition, Technology, and Logistics.  \n\n• Conducted outreach to further the implementation and understanding of system security engineering requirements and practices (courseware, guidance dissemination, mentoring of Service teams, training, and outreach).  \n\n• Collaborated in developing Defense Federal Acquisition Regulation Supplement (DFARS) or Federal Acquisition Regulation (FAR) language to implement information security on DoD contracts for protection of defense program information.  Developed and implemented process for adjudicating public comments.  Provided acquisition support to DIB Cyber Security program.\n\n• Oversaw and managed the acquisition security database and tracked implementation by the components.  Implemented horizontal protection adjudication process.  Evolved the Horizontal Protection processes to meet changing threats."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.300"
                                            },
                                            "Text": {
                                                "val": "Continue to:\n\n• Provide support to Acquisition Category (ACAT) I programs to conduct broad program protection planning.\n   - Conduct criticality analyses to determine system vulnerabilities.\n   - Develop Program Protection Plans, and track progress to verify protection of critical program capabilities.\n   - Review ACAT I Program Protection Plans and provide recommendations for their approval to Under Secretary of Defense for Acquisition, Technology, and Logistics.\n \n• Advance the state of the practice of systems security engineering.\n   - Continue development of methodology to identify and mitigate security risk.\n   - Courseware, guidance dissemination, mentoring of Service teams, training, and outreach."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.531"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.531"
                                            },
                                            "Text": {
                                                "val": "Continue to:\n\n• Provide support to Acquisition Category (ACAT) I programs to conduct broad program protection planning.\n   - Conduct criticality analyses to determine system vulnerabilities.\n   - Develop Program Protection Plans, and track progress to verify protection of critical program capabilities.\n   - Review ACAT I Program Protection Plans and provide recommendations for their approval to Under Secretary of Defense for Acquisition, Technology, and Logistics.\n \n• Advance the state of the practice of systems security engineering.\n   - Continue development of methodology to identify and mitigate security risk.\n   - Courseware, guidance dissemination, mentoring of Service teams, training, and outreach."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "The program protection project supports activities focused on:  (1) reducing risks in sharing and storing critical program information, (2) better understanding and mitigating supply chain risks, (3) improving program protection planning, and (4) improving and streamlining program protection engineering.  \n\nImpact of the program protection initiative is assessed based upon number of major acquisition programs supported with formal assessments, program protection plans reviewed and approved and through engagement supporting acquisition policy initiatives related to program protection."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P241"
                    },
                    "ProjectTitle": {
                        "val": "Systems Engineering Research Center"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "4.982"
                        },
                        "BudgetYearOne": {
                            "val": "5.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.000"
                        },
                        "BudgetYearTwo": {
                            "val": "5.000"
                        },
                        "BudgetYearThree": {
                            "val": "5.000"
                        },
                        "BudgetYearFour": {
                            "val": "5.000"
                        },
                        "BudgetYearFive": {
                            "val": "5.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Systems Engineering Research Center (SERC) is a University Affiliated Research Center (UARC) established in 2008.  As a UARC, the SERC is a strategic resource to further systems research and increase its impact on the Department’s ability to meet its mission.  Greatly improved systems engineering is essential to the president’s strategy for the Department to field systems that are agile, affordably sustainable, flexible, and ready for a full range of contingencies in the face of declining budgets and a shrinking workforce.  The SERC consists of a network of eighteen research universities from across the US that work collaboratively to bring the best talent in the nation to bear on DoD’s systems engineering research problems. \n\nIn prior years, DASD\/SE has resourced the SERC at $1.000 million per year from P142. \n\nThe additional funding, beginning in FY 2014, will increase the Department’s engagement with SERC, supporting additional research on topics of strategic importance to DoD.  \n\nThis new project code, established within the Systems Engineering Program Element:  (1) provides core funding for the SERC; (2) provides adequate stable resources for the SERC research agenda; and (3) enables the SERC to take full advantage of the university collaborators, enabling them to address DoD needs much more effectively."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Systems Engineering Research Center"
                                    },
                                    "Description": {
                                        "val": "The Systems Engineering Research Center (SERC) is a DoD University Affiliated Research Center which conducts University-based research that directly supports DoD’s Strategic Plan through development of new systems engineering methods, processes and tools."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.982"
                                            },
                                            "Text": {
                                                "val": "Funding will provide enhanced engineering methods, processes and tools (MPTs) that make significant improvements in four areas:\n\n(1) Systems Engineering Transformation: transform systems engineering within the defense enterprise by developing new engineering and estimation methods to address complexity in modern systems and enable affordable development of flexible systems responsive to changing threats and missions;\n\n(2) Enterprises and Systems of Systems:  build and transform enterprises and systems of systems using new systems engineering methods with fewer unintended consequences and unforeseen risks;\n\n(3) Trusted Systems:  secure defense systems from cyber and other threats through systemic security approaches that complement incomplete current perimeter\/network defense methods; and\n\n(4) Human Capital Development:  speed the professional development of strong systems engineers and technical leaders in the Department and the Defense Industrial Base."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "Continue to enhance engineering methods, processes and tools (MPTs) to improve in the following areas:\n\n(1) Systems Engineering Transformation: transform systems engineering within the defense enterprise by developing new engineering and estimation methods to address complexity in modern systems and enable affordable development of flexible systems responsive to changing threats and missions;\n\n(2) Enterprises and Systems of Systems:  build and transform enterprises and systems of systems using new systems engineering methods with fewer unintended consequences and unforeseen risks;\n\n(3) Trusted Systems:  secure defense systems from cyber and other threats through systemic security approaches that complement incomplete current perimeter\/network defense methods; and\n\n(4) Human Capital Development:  speed the professional development of strong systems engineers and technical leaders in the Department and the Defense Industrial Base."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Develop and extend fundamental knowledge, advanced methods, processes and tools and cutting edge techniques for systems engineering of complex designs of relevance to the DoD mission.\n    \n    • Generation and execution of relevant and appropriate SERC Research tasks.\n    • Promulgation of advanced SE approaches through research publications, presentations and monographs."
                        }
                    }
                }
            ]
        }
    }
}