{
    "id": "25587274b40efd9fbb882b25842e94667343aacb",
    "meta": {
        "filename": "dod-2015_RDTE_2015_TJS_RDTE_JustificationBook_The_Joint_Staff_PB_2015.zzz_unzipped_RDTE_JustificationBook_The_Joint_Staff_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "The Joint Staff",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0604828J"
        },
        "ProgramElementTitle": {
            "val": "Joint FIRES Integration and Interoperability Team"
        },
        "R1LineNumber": {
            "val": "108"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "The Joint Staff"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "6.541"
            },
            "CurrentYear": {
                "val": "7.506"
            },
            "BudgetYearOne": {
                "val": "7.102"
            },
            "BudgetYearOneBase": {
                "val": "7.102"
            },
            "BudgetYearTwo": {
                "val": "6.963"
            },
            "BudgetYearThree": {
                "val": "7.107"
            },
            "BudgetYearFour": {
                "val": "7.218"
            },
            "BudgetYearFive": {
                "val": "7.218"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "7.364"
                },
                "CurrentYear": {
                    "val": "7.506"
                },
                "BudgetYearOne": {
                    "val": "7.109"
                },
                "BudgetYearOneBase": {
                    "val": "7.109"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "6.541"
                },
                "CurrentYear": {
                    "val": "7.506"
                },
                "BudgetYearOne": {
                    "val": "7.102"
                },
                "BudgetYearOneBase": {
                    "val": "7.102"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.823"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.007"
                },
                "BudgetYearOneBase": {
                    "val": "-0.007"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Change"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.823"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.007"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.007"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Program Element 0604828J, Joint Fires Integration and Interoperability transferred from OUSD (AT&L) to the Joint Staff in FY 2013.  FY 2013 was the first year this PE belonged to the Joint Staff.\n\nFunding decreased from FY 2014 - FY 2015 to match TJS Directorates' mission priorities with planned topline budget reductions."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P857"
                    },
                    "ProjectTitle": {
                        "val": "Joint Deployable Analysis Team (JDAT)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "6.541"
                        },
                        "CurrentYear": {
                            "val": "7.506"
                        },
                        "BudgetYearOne": {
                            "val": "7.102"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.102"
                        },
                        "BudgetYearTwo": {
                            "val": "6.963"
                        },
                        "BudgetYearThree": {
                            "val": "7.107"
                        },
                        "BudgetYearFour": {
                            "val": "7.218"
                        },
                        "BudgetYearFive": {
                            "val": "7.218"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Deployable Analysis Team (JDAT) mission is to employ scientific methods to research, investigate, test, assess, and evaluate current and emergent Joint command and control (C2) information systems, and associated procedures.  These activities measure capabilities and limitations, identify shortfalls and root cause, recommend and verify solutions, and validate joint capabilities.  The resultant empirical outcomes influence Joint Capability development in areas such as: Policy, Joint Doctrine, Tactics, Techniques and Procedures (TTP), and integration and interoperability of capabilities.  JDAT provides decision-quality data and cogent solutions to customers and stakeholders responsible for improving Joint C2 information systems integration and interoperability, informing acquisition decisions, and ensuring that Services and Agencies field integrated and interoperable systems.\n\nThe emphasis of JDAT efforts is the analysis of C2 information systems and supporting procedures to provide Services and Agencies findings and recommendations based on quantifiable data to improve Joint C2 integration and interoperability.  Evaluations range from small, single-focus events to large, multi-event\/venue exercises."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Deployable Analysis Team (JDAT)"
                                    },
                                    "Description": {
                                        "val": "JDAT conducts assessments in conjunction with Service and Combatant Command (CCMD) exercises, experiments, and test and evaluation events. \n\nThe primary outputs and efficiencies of JDAT include:\n(1) Improvement in the Services’ ability to employ Joint C2 information systems.\n(2) Recommendations for C2 system integration and interoperability.\n(3) Ability to define appropriate Joint context during system acquisition or development.\n(4) Updates\/revisions to C2-related Chairman, Joint Chief Staff (CJCS) Instructions and Manuals.\n(5) Development of related Universal Joint Tasks (UJT) and Additional Task Detail (ATD).\n(6) Updates and revisions to doctrine, TTP, and Joint publications.\n(7) Development\/refinement of analytical tools (i.e. Data Collection Architecture for Analytical Feedback (DCAAF), Track Event Reconstruction Application (TERA), and Joint Windows-based Warfare Assessment Model (JWinWAM)).\n(8) Recommended solutions integrated within the Joint Requirements Oversight Council (JROC) Joint Capabilities Integration and Development System (JCIDS). \n(9) Identification of specific Key Performance Parameters (KPPs) and Key System Attributes (KSAs) for new systems that meet Joint warfighter operational requirements to ensure Services and Agencies field interdependent and interoperable systems. \n(10) Increased effectiveness\/confidence in combat identification processes and reduction in fratricide. \n(11) Increased effectiveness and confidence in C2 information systems and associated procedures."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.541"
                                            },
                                            "Text": {
                                                "val": "(1) Provided analytical support to a Military Utility Assessment of coalition and U.S. C2 information systems and procedures at Bold Quest 13.  Provided instrumentation, data collection, data capture, real-time mission monitoring, and feedback to participants via daily debriefings.  Benefits included improved ability to assess various participating coalition and U.S. systems, improved joint task execution, and effective Military Utility Assessment of U.S. C2 information systems, while greatly reducing the timeline required to provide fact-based recommendations.\n\n(2) Assisted Commander, Operational Test and Evaluation Force (COMOPTEVFOR) with Identification Friend or Foe (IFF) Mode 5 Level 1 Joint Operational Test Approach (JOTA) analysis to validate integration and interoperability of fielded systems. Developed data collection and analysis methodologies, designed and implemented data collection architectures, and conducted analysis requisite to meet JOTA objectives.  Determined any gaps or shortfalls in integration and interoperability of Mode 5 systems.  Provided Service Operational Test Agencies and Program Managers with fact-based findings.\n\n(3) Provided analytical support to assess technology integration and interoperability during Joint Integrated Air & Missile Defense Organization (JIAMDO) Joint Tactical Air Picture assessment event.  Provided data collection, analysis, and display using JDAT developed tools.  Benefits included improvements in a Joint Common Operational Picture to battlespace managers.\n\n(4) Led analytical efforts for the DOT&E-directed and Joint Staff J6-supported Enterprise Cyberspace Range Environment Event 1, phase I, and II demonstrations.  Developed assessment plans, provided demonstration leadership\/exercise control, coordinated and synchronized activities of JS J6, JS J7, USA Threat Systems Management Office, DoD Test Resource Management Center’s National Cyberspace Range, John Hopkins University\/Applied Physics Laboratory and USA Test and Evaluation Command, provided observations and recommendations for improving the integration of tools, processes, and environments allowing quantifiable measurements of cyberspace detection and prevention tools, cyberspace effects on CCMD C4I mission capabilities, and the effectiveness of CCMD cyberspace response actions in operationally realistic environments.\n\n(5) Provided an objective, third-party assessment of the 4G LTE capability, known as Joint Operational Long Term Evolution Deployable (JOLTED) Tactical Cellular system (TACTICS) for USSOCOM (JCTD Operational Manager), including test planning, data collection, test control, and reporting.\n\n(6) Assessed the performance of the Personnel Recovery Single Card Solution (SCS) handheld radio during a proof-of-concept for the Joint Personnel Recovery Agency, Joint Staff J3, which included test planning, data collection, test control, and reporting.\n\n(7) Provided C2 data collection and analytical support to the Joint Fires Support Executive Steering Committee, Lead Engineering Change Implementation Group. Conducted Digitally Aided Close Air Support (DACAS) coordinated implementation risk reduction assessments to validate service compliance with requisite engineering change proposals.  Benefits included recommendations for Tactics, Techniques, and Procedures in the areas of standardization and digital interoperability and development of associated Universal Joint Tasks.\n\n(8) Chaired the Joint Close Air Support Executive Steering Committee (JCAS ESC) chartered Digitally Aided Close Air Support (DACAS) Engineering Change Implementation Group.  Planned and executed testing and validation of DACAS engineering change proposals and coordinated implementation across the DoD and partner nations.\n\n(9) Updated Joint Windows-based Warfare Assessment Model (JWinWAM), Data Collection Architecture for Analytical Feedback (DCAAF), and Multi-Interface Gateway (MIG) software development to support JDAT assessment activities and the efforts of other government agencies as directed.\n\n(10) Defined Universal Joint Task (UJT) Additional Task Detail (ATD) for tactical task TA 3.3.2 Control Tactical Airspace and refined ATD for TA 3.2.2 Conduct Close Air Support (CAS), and TA 3.2.1 Conduct Joint Fires.\n\n(11) Provided subject matter expertise and tier 2 architecture products on development and assessment of the Joint Close Air Support (CAS) Joint Mission Thread (JMT), and Joint Fires JMT."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.506"
                                            },
                                            "Text": {
                                                "val": "(1) Continue providing analytical support to a demonstration of U.S.\/Coalition C2 information systems and procedures at JS J6 Bold Quest 14.  Provide instrumentation, data collection, data management, real-time mission monitoring, and feedback to participants via daily debriefings.  Benefits will include improved ability to assess various participating coalition and U.S. systems, improved joint task execution, and an effective demonstration of U.S.\/Coalition C2 information systems.\n\n(2) Provide analytical support to assess DoD, Inter-Agency, and Industry’s counter-unmanned aircraft systems (C-UAS) capabilities across the Integrated Air and Missile Defense (IAMD) joint engagement sequence during JS J8 Joint Integrated Air and Missile Defense Organization (JIAMDO) Black Dart 2014 demonstration.  Provide data collection, analysis, display, and feedback using JDAT developed tools.  Benefits will include improvements to surveillance, detection, tracking, identification, and engagement of counter-unmanned aircraft systems.\n\n(3) Team with U.S. Army Test and Evaluation Command to conduct the Director of Operational Test & Evaluation's (DOT&E) information assurance (cyberspace) assessment for USNORTHCOM during Exercise Vigilant Shield 2014.  Provide C2 information system data collection and analysis using JDAT developed tools and correlate with red team network penetrations and actions using USA Threat Systems Management Office developed tools.  Benefits will include improvements in CCMDs joint cyber center defensive cyberspace operations through improved situational awareness and understanding the impact on procedures supporting the commander’s decision cycle.\n\n(4) Team with USAF Operational Test and Evaluation Center to conduct DOT&E interoperability and information assurance (cyberspace) assessments for USSTRATCOM during Exercise Global Thunder 2014.  Provide C2 information system data collection and analysis using JDAT developed tools and correlate with red team network penetrations and actions using USA Threat Systems Management Office developed tools.  Benefits will include improvements in combatant command’s joint cyber center defensive cyberspace operations through improved situational awareness and understanding the impact on procedures supporting the commander’s decision cycle.\n\n(5) Continue teaming with DOT&E for FY 2014 CCMD's interoperability assessments.  Provide data collection, analysis and display using JDAT developed tools.  Benefits will include improvements in U.S. and Coalition C2 information systems interoperability, processes, and procedures in support of the commander’s decision cycle.\n\n(6) Continue providing analytical support to the Joint Personnel Recovery Agency by assessing selected engineering change proposals, identifying interoperability shortfalls, and recommending solutions.  Benefits include an end-to-end digitized joint personnel recovery process.\n\n(7) Provide C2 information and weapon systems data collection and feedback\/reporting support to OSD CAPE for the VCJCS initiative on leveraging real-world operations to identify current deficiencies and opportunities for improving Joint Integrated Air and Missile Defense interoperability and effectiveness.\n\n(8) Continue providing C2 data collection and analytical support to the Joint Fires Support Executive Steering Committee.  Chair the Engineering Change Implementation Group.  Conduct Digitally Aided Fires (DACAS and Fires) Coordinated Implementation risk reduction assessments to validate service compliance with requisite Engineering Change Proposals (ECPs).  Plan and execute testing and validation of ECPs and coordinate implementation across the DoD and partner nations.  Benefits will include recommendations in the areas of interoperability, standardization, and development of associated Universal Joint Tasks, and TTP.\n\n(9) Continue to update JWinWAM, DCAAF, MIG, and TERA analysis software to support DOD-wide test and evaluation through the Joint Mission Essential Task List (JMETC) program.\n\n(10) Continue to define UJT ATD for tactical task (TA) 3.3.2 Control Tactical Airspace and refine ATD for TA 3.2.2 Conduct CAS and TA 3.2.1 Conduct Joint Fires.\n\n(11) Continue to provide subject matter expertise and architecture products on development of the Joint CAS JMT and Joint Fires JMT.\n\n(12) Partner with JS J8, JS J7, and other agencies to address persistent integrated air and missile defense interoperability issues."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.102"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.102"
                                            },
                                            "Text": {
                                                "val": "(1) Continue providing analytical support to a demonstration of U.S.\/Coalition C2 information systems and procedures at JS J6 Bold Quest 15.  Provide instrumentation, data collection, data management, real-time mission monitoring, and feedback to participants via daily debriefings.  Benefits will include improved ability to assess various participating coalition and U.S. systems, improved joint task execution, and an effective demonstration of U.S.\/Coalition C2 information systems.\n\n(2) Analytical support to assess DoD, Inter-Agency, and Industry’s counter-unmanned aircraft systems (C-UAS) capabilities across the IAMD joint engagement sequence during JS J8 Joint Integrated Air and Missile Defense Organization (JIAMDO) Black Dart 2015 demonstration.  Provide data collection, analysis, display, and feedback using JDAT developed tools.  Benefits will include improvements to surveillance, detection, tracking, identification, and engagement of counter-unmanned aircraft systems.\n\n(3) Team with USN Operational Test and Evaluation Force to conduct DOT&E information assurance (cyberspace) assessments for USPACOM during Exercise Terminal Fury 2015.  Provide C2 information system data collection and analysis using JDAT developed tools and correlate with red team network penetrations and actions using USA Threat Systems Management Office developed tools.  Benefits will include improvements in CCMDs joint cyber center defensive cyberspace operations through improved situational awareness and understanding the impact on procedures supporting the commander’s decision cycle.\n\n(4) Continue teaming with DOT&E for FY 2015 CCMD's interoperability assessments.  Provide data collection, analysis, and display using JDAT developed tools.  Benefits will include improvements in U.S. and Coalition C2 information systems interoperability, processes, and procedures in support of the commander’s decision cycle.\n\n(5) Continue providing analytical support to the Joint Personnel Recovery Agency by assessing selected engineering change proposals, identifying interoperability shortfalls, and recommending solutions.  Benefits include an end-to-end digitized Joint personnel recovery process.\n\n(6) Continue providing C2 information and weapon systems data collection and feedback\/reporting support to OSD CAPE for the VCJCS initiative on leveraging real-world operations to identify current deficiencies and opportunities for improving Joint Integrated Air and Missile Defense interoperability and effectiveness.\n\n(7) Continue providing C2 data collection and analytical support to the Joint Fires Support ESC.  Chair the Engineering Change Implementation Group.  Conduct Digitally Aided Fires (DACAS and Fires) Coordinated Implementation risk reduction assessments to validate service compliance with requisite ECPs.  Plan and execute testing and validation of ECPs and coordinate implementation across the DoD and partner nations.  Benefits will include recommendations in the areas of interoperability, standardization, and development of associated Universal Joint Tasks and TTP.\n\n(8) Continue to update JWinWAM, DCAAF, MIG, and TERA analysis software to support DOD-wide test and evaluation through the JMETC program.\n\n(9) Continue to define UJT ATD for tactical task (TA) 3.3.2 Control Tactical Airspace and refine ATD for TA 3.2.2 Conduct CAS and TA 3.2.1 Conduct Joint Fires.\n\n(10) Continue to provide subject matter expertise and architecture products on development of the Joint CAS JMT and Joint Fires JMT.\n\n(11) Partner with JS J8, JS J7, and other agencies to address persistent integrated air and missile defense interoperability issues."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable for this item."
                        },
                        "PerformanceMetrics": {
                            "val": "JDAT delivers joint solutions for operational and tactical forces deployed to Combatant Commands (CCMDs) and Joint and Service Program managers.  Deliverables may include: discrete improvements to training processes, doctrine; Tactics, Techniques, & Procedures (TTPs), and\/or technical system performance specifications and standards, validated Doctrine, Organization, Training, Material, Leadership, Personnel, Facilities, and Policy (DOTmLPF-P) recommendations, timely delivery of quality feedback to exercise participants, and developers for systems under test or improvements to joint context of testing and training venues.  JDAT works with Joint Staff, CCMDs, and Services to approve the annual agenda of work and validate results."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Evaluation Other Costs"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "JDAT"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Eglin AFB"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.725"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.530"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.535"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.535"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Operational Test and Evaluation"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SAIC, Miratek, NDGI"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Eglin AFB"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "5.816"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "6.776"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "6.359"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "6.359"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Travel"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various DoD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.208"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.208"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}