{
    "id": "256430a066e86998e7a0b6c949a9ba0f6a6ebadc",
    "meta": {
        "filename": "dod-2015_RDTE_2015_OSD_RDTE_JustificationBook_Office_of_Secretary_Of_Defense_PB_2015.zzz_unzipped_RDTE_JustificationBook_Office_of_Secretary_Of_Defense_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0603920D8Z"
        },
        "ProgramElementTitle": {
            "val": "Humanitarian De-mining"
        },
        "R1LineNumber": {
            "val": "99"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "14.540"
            },
            "PriorYear": {
                "val": "11.741"
            },
            "CurrentYear": {
                "val": "11.688"
            },
            "BudgetYearOne": {
                "val": "10.194"
            },
            "BudgetYearOneBase": {
                "val": "10.194"
            },
            "BudgetYearTwo": {
                "val": "9.192"
            },
            "BudgetYearThree": {
                "val": "9.548"
            },
            "BudgetYearFour": {
                "val": "10.080"
            },
            "BudgetYearFive": {
                "val": "10.712"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Humanitarian Demining Research and Development (HD R&D) program element rapidly develops, demonstrates and validates new technologies for DoD-supported nations to detect and clear landmines and unexploded ordnance (UXO), and to contribute to US military countermine R&D.  The HD R&D Program focuses on development of new technologies to improve the efficiency and safety of indigenous nation-conducted, post-conflict clearance of residual mines and UXO, which pose a serious threat to US forces conducting stability operations, and to the host nation’s population and economy.  \n\nEvaluations of HD R&D Program-developed technologies in actual minefields are conducted by host nation demining partners (foreign military, non-governmental organizations and mine action centers) and provide valuable data for US military countermine R&D and next generation HD technology developments while directly contributing to world-wide mine and UXO clearance.  Since 1995 the program has fielded technologies for 166 evaluations in 36 countries, including Thailand, Cambodia, Vietnam, Afghanistan and Iraq.  The program’s technologies have cleared 23 million sq meters of the world’s toughest minefields, and found or destroyed 109,000 mines and UXO\n\nUnder the Office of the Assistant Secretary of Defense for Special Operations and Low-Intensity Conflict (OASD SO\/LIC), the HD R&D Program works closely with the COCOMS and the Humanitarian Demining Training Center (HDTC) to support the Warfighter by developing and implementing mine\/UXO detection and clearance technologies; speeding improvements to technologies used by U.S. forces in support of USG operations; reducing the threat to host nation population and US forces; reducing insurgent access to explosives (landmines and UXO); enhancing mine action capacity of non-governmental organizations and mine action centers in mine-affected countries; and providing engagement opportunities for DoD personnel in mine-affected countries. \n \nAreas of emphasis are identified and validated at a biennial Requirements Workshop held by OASD SO\/LIC.  The Requirements Workshop involves representatives from Department of State (DoS), U.S. combatant commands (COCOMS) and mine-affected nations.  \n\nThe program element’s work is consistent with the Department of Defense’s strategic guidance to address instability and reduce the demand for significant US force commitments to stability operations; with DODI 3000.05 to foster security, economic security and development, and build indigenous capacity; and with § 407 and CJCSI 3207.01C to reduce the social, economic and environmental impact of landmines, unexploded ordnance and small arms ammunition."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "13.231"
                },
                "CurrentYear": {
                    "val": "11.704"
                },
                "BudgetYearOne": {
                    "val": "11.607"
                },
                "BudgetYearOneBase": {
                    "val": "11.607"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "11.741"
                },
                "CurrentYear": {
                    "val": "11.688"
                },
                "BudgetYearOne": {
                    "val": "10.194"
                },
                "BudgetYearOneBase": {
                    "val": "10.194"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.490"
                },
                "CurrentYear": {
                    "val": "-0.016"
                },
                "BudgetYearOne": {
                    "val": "-1.413"
                },
                "BudgetYearOneBase": {
                    "val": "-1.413"
                }
            },
            "AdjustmentDetails": {
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "-1.490"
                    },
                    "CurrentYear": {
                        "val": "-0.016"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Strategic Efficiency Reduction"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-1.413"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.413"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The FY 2015 budget was reduced due to fiscal constraints and higher priorities within the Department ."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "920"
                    },
                    "ProjectTitle": {
                        "val": "Humanitarian De-mining"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "14.540"
                        },
                        "PriorYear": {
                            "val": "11.741"
                        },
                        "CurrentYear": {
                            "val": "11.688"
                        },
                        "BudgetYearOne": {
                            "val": "10.194"
                        },
                        "BudgetYearOneBase": {
                            "val": "10.194"
                        },
                        "BudgetYearTwo": {
                            "val": "9.192"
                        },
                        "BudgetYearThree": {
                            "val": "9.548"
                        },
                        "BudgetYearFour": {
                            "val": "10.080"
                        },
                        "BudgetYearFive": {
                            "val": "10.712"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Humanitarian Demining Research and Development (HD R&D) program element rapidly develops, demonstrates and validates new technologies for DoD-supported nations to detect and clear landmines and unexploded ordnance (UXO), and to contribute to US military countermine R&D.  The HD R&D Program focuses on development of new technologies to improve the efficiency and safety of indigenous nation-conducted, post-conflict clearance of residual mines and UXO, which pose a serious threat to US forces conducting stability operations, and to the host nation’s population and economy.  \n\nEvaluations of HD R&D Program-developed technologies in actual minefields are conducted by host nation demining partners (foreign military, non-governmental organizations and mine action centers) and provide valuable data for US military countermine R&D and next generation HD technology developments while directly contributing to world-wide mine and UXO clearance.  Since 1995 the program has fielded technologies for 163 evaluations in 36 countries, including Iraq and Afghanistan.  The program’s technologies have cleared 21+ million sq meters of the world’s toughest minefields; found or destroyed 101,000+ mines and UXO; and provided 306,000 mine\/UXO disposal charges with 36 tons of explosive recovered from stockpiles and abandoned munitions in PACOM.\n\nUnder the Office of the Assistant Secretary of Defense for Special Operations and Low-Intensity Conflict (OASD SO\/LIC), the HD R&D Program works closely with the COCOMS and the Humanitarian Demining Training Center (HDTC) to support the Warfighter by developing and implementing mine\/UXO detection and clearance technologies; speeding improvements to technologies used by U.S. forces in support of USG operations; reducing the threat to host nation population and US forces; reducing insurgent access to explosives (landmines and UXO); enhancing mine action capacity of non-governmental organizations and mine action centers in mine-affected countries; and providing engagement opportunities for DoD personnel in mine-affected countries. \n \nAreas of emphasis are identified and validated at a biennial Requirements Workshop held by OASD SO\/LIC.  The Requirements Workshop involves representatives from Department of State (DoS), U.S. combatant commands (COCOMS) and mine-affected nations.  \n\nThe program element’s work is consistent with the Department of Defense’s strategic guidance to address instability and reduce the demand for significant US force commitments to stability operations; with DODI 3000.05 to foster security, economic security and development, and build indigenous capacity; and with § 407 and CJCSI 3207.01C to reduce the social, economic and environmental impact of landmines, unexploded ordnance and small arms ammunition."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "0603920D8Z - SO\/LIC Humanitarian De-mining"
                                    },
                                    "Description": {
                                        "val": "The HD R&D Program adapts commercial-off-the-shelf equipment, integrates mature technologies, and leverages R&D activity within DoD, particularly in the Army's Night Vision and Electronic Sensors Directorate (NVESD) Tactical Countermine mission area.  The program aims to improve existing technologies for: mine\/UXO detection, technical survey\/area reduction, mechanical mine\/UXO clearance, vegetation clearance, mine neutralization, and post-clearance quality assurance (QA)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.741"
                                            },
                                            "Text": {
                                                "val": "In FY13 the HD R&D Program’s technologies cleared 3.3 million square meters of the world’s toughest minefields, removing or destroying 7,529 mines and 13,764 UXO.  The HD R&D Program completed ongoing equipment developments\/modifications and continued operational evaluations from FY2012.  The HD R&D program also continued to support 50 on-going operational field evaluations in 12 countries.  New evaluations included the Mini MineWolf technical survey system Thailand; HSTAMIDS mine detection system  in Mozambique and Sri Lanka; the Minehound mine detection system in Afghanistan, Angola and Cambodia; Scout mine\/UXO detection system in Cambodia; and excavator mine sifting attachments in Iraq; and the Mine Stalker vehicle-mounted AT mine detection system in Angola.  The HD R&D Program supported the combatant commands and Embassy staffs by conducting site surveys and country assessments.  The program continued development, test and evaluation of prototype technologies in the following areas: individual mine\/UXO and minefield detection, mechanical mine\/UXO and vegetation clearance, mine neutralization, and post-clearance quality assurance (QA)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.688"
                                            },
                                            "Text": {
                                                "val": "The HD R&D Program will deploy new technology to several countries, including the Raptor II and Rotary Mine Comb to Afghanistan, the Loader to Chile, the Rebel Crusher to Iraq, and the Piranha and Bearcat to Cambodia.  The program element will continue to support ongoing FY2013 operational field evaluations in 12 countries and will support the combatant commands and Embassy staffs by conducting site surveys or country assessments.  The program will develop, test and evaluate new prototype technologies in the following areas: individual mine\/UXO and minefield detection, mechanical mine\/UXO and vegetation clearance, mine neutralization, and post-clearance quality assurance (QA)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.194"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.194"
                                            },
                                            "Text": {
                                                "val": "The HD R&D Program will complete ongoing equipment developments\/modifications, and continue operational evaluations from FY2014.  The HD R&D will support the combatant commands and Embassy staffs by conducting new site surveys or country assessments.  The program will develop, test and evaluate new prototype technologies based on feedback from the field in the following areas: individual mine\/UXO and minefield detection, mechanical mine\/UXO and vegetation clearance, mine neutralization, and post-clearance quality assurance (QA)."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Following a rapid prototyping strategy, the program emphasizes the use\/modification of existing, commercially-available items and components to build functional prototype equipment suited for humanitarian demining operations.  This approach is required due to the immediate need for new demining technologies in the face of ongoing U.S. forces and host nation citizen casualties in mine-affected countries.  The program evaluates prototype equipment by acquiring it off-the-shelf from industry using competition to the extent possible, by leveraging ongoing countermine R&D efforts in other U.S. and foreign R&D activities, and by taking advantage of extensive in-house fabrication capabilities at the Army's Night Vision and Electronic Sensors Division (NVESD)."
                        },
                        "PerformanceMetrics": {
                            "val": "Long Term Strategies:  Obtain adequate funding to support critical shortfalls; prioritize proposals that are deemed acceptable and allocate funding accordingly; and establish outreach programs to leverage institutional knowledge and expertise. \n\nPerformance Indicator and Rating:\nFY 2013 Target:\n90% of currently funded research technologies are completed on time and within budget\nComplete scheduled R&D project tasks\nTransition field-ready technologies to host nation demining partners\n\nFY 2014 Target:\n90% of currently funded research technologies are completed on time and within budget\nComplete scheduled R&D project tasks\nTransition field-ready technologies to host nation demining partners\nConduct biennial Humanitarian R&D Program Requirements Workshop\n\nBasis of FY 2013 to Date Performance Rating: Currently the number of funded research technologies is on track to be completed per the target.\n\nVerification: The Humanitarian Demining Program performs program reviews with other USG agencies (DOS PM WRA, DTRA SA\/LW, DSCA, HDTC, CENTCOM, PACOM, SOUTHCOM, AFRICOM, EUCOM) and has oversight from OSD SO\/LIC.\n\nValidation: Completed R&D products increase the capabilities of the DoD to effectively perform demining missions."
                        }
                    }
                }
            ]
        }
    }
}