{
    "id": "283b6ae2786df39e9474de36e13dc10f924bd005",
    "meta": {
        "filename": "dod-2015_RDTE_2015_NAVY_BA7_RDTE_JustificationBook_Navy_PB_2015.zzz_unzipped_RDTE_JustificationBook_Navy_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0305204N"
        },
        "ProgramElementTitle": {
            "val": "Tactical Unmanned Aer Vehicles"
        },
        "R1LineNumber": {
            "val": "214"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "173.929"
            },
            "PriorYear": {
                "val": "6.956"
            },
            "CurrentYear": {
                "val": "8.381"
            },
            "BudgetYearOne": {
                "val": "8.505"
            },
            "BudgetYearOneBase": {
                "val": "8.505"
            },
            "BudgetYearTwo": {
                "val": "8.624"
            },
            "BudgetYearThree": {
                "val": "8.873"
            },
            "BudgetYearFour": {
                "val": "8.977"
            },
            "BudgetYearFive": {
                "val": "9.148"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Tactical Unmanned Aerial Vehicle is a Joint Military Intelligence Program \n\nThis Program Element (PE) includes joint tactical Unmanned Aerial Vehicle system support for DoD to provide the warfighters with the capability for day\/night aerial Reconnaissance, Surveillance and Target Acquisition, intelligence, communications\/data relay, and minefield detection. This PE includes the Tactical Control System (TCS) which provides a multi-level, scalable, and flexible control of the air vehicles and payloads, as well as direct receipt and dissemination of unmanned aerial vehicles sensor data."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "9.066"
                },
                "CurrentYear": {
                    "val": "8.381"
                },
                "BudgetYearOne": {
                    "val": "8.513"
                },
                "BudgetYearOneBase": {
                    "val": "8.513"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "6.956"
                },
                "CurrentYear": {
                    "val": "8.381"
                },
                "BudgetYearOne": {
                    "val": "8.505"
                },
                "BudgetYearOneBase": {
                    "val": "8.505"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.110"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.008"
                },
                "BudgetYearOneBase": {
                    "val": "-0.008"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.008"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.008"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.610"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional Directed Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-1.500"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Schedule:\nUpdated Tactical Control System schedule to coincide with MQ-8 Fire Scout schedule milestones.    \n\nVTUAV related milestones\nRevised milestone terminology:  Aligns with Navy decision to transition MQ-8 Endurance Upgrade, Radar, and Weapons capabilities into the MQ-8 Program of Record.  Added schedule events for Anti Submarine Warfare\/Mine Counter-Measure\/Surface Warfare to support Littoral Combat Ship mission package integration, Quick Reaction Assessments, DDG-51 Test, and updated production and delivery schedules across FYDP.\n\nTechnical: None"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "2478"
                    },
                    "ProjectTitle": {
                        "val": "Tactical Control System"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "173.929"
                        },
                        "PriorYear": {
                            "val": "6.956"
                        },
                        "CurrentYear": {
                            "val": "8.381"
                        },
                        "BudgetYearOne": {
                            "val": "8.505"
                        },
                        "BudgetYearOneBase": {
                            "val": "8.505"
                        },
                        "BudgetYearTwo": {
                            "val": "8.624"
                        },
                        "BudgetYearThree": {
                            "val": "8.873"
                        },
                        "BudgetYearFour": {
                            "val": "8.977"
                        },
                        "BudgetYearFive": {
                            "val": "9.148"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This program supports the Tactical Control System (TCS), a standards-based system, that provides interoperability and commonality for Command and Control, Communications, Computers, Intelligence, Surveillance, and Reconnaissance interfaces of Unmanned Aircraft Systems (UAS). TCS software, operating on Ground Control Station hardware, utilizes North Atlantic Treaty Organization (NATO) Standardization Agreements (STANAG)-4586 architecture communicating across a Tactical Common Data Link.  \n\nTCS provides a full range of scalable UAS capabilities from passive receipt of air vehicle and payload data to full air vehicle and payload command and control. TCS offers the war fighter a common core operating environment to simultaneously receive, process, and disseminate data from different UAS types for intelligence, reconnaissance, surveillance, and combat assessment.\n\nThis program supports enhancements and updates to TCS in order to continue to meet supported air vehicle enhancements, incorporation of new technologies that will be used to enhance overall system performance, incorporate new payloads and payload capabilities (such as advanced sensors and weapons), incorporate multi-vehicle control, incorporate NATO  STANAG-4586 and Command, Control, Communications, Computers and Intelligence enhancements, and alignment with OSD direction for UAS control segments.\n\nTCS software is incorporated into the MQ-8 Fire Scout system and fields in conjunction with MQ-8. TCS software addresses MQ-8 requirements validated by the Joint Requirements Oversight Council in the VTUAV Capability Production Document (May 2007) and multiple Joint Emergent Operational Need\/Urgent Operational Needs statements.  TCS supported by a Operational Requirements Document (Feb 2000).  \n\nTCS maximizes the use of contractor and government off-the-shelf hardware and software whenever possible and incorporates software\/hardware enhancements where appropriate to maintain growth potential and minimize hardware and operating system dependence.  TCS software is interoperable and is compliant with the OSD Command and Control, Communications, Intelligence Joint Technical Architecture, Distributed Common Ground System standards, Global Command and Control System (GCCS), and NATO standards.  TCS hardware and software upgrades will support the Navy's Common Control System migration."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "TCS Development and Integration"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.211"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue TCS integration with MQ-8 development and Rapid Deployment Capability efforts.  Continue new TCS capabilities to support requirements for Littoral Combat Ship Integration.  Continue TCS NATO STANAG 4586 compliance.  Continue TCS C4ISR interface integration & testing.  Complete flight testing of hardware and operating system independence initiatives.  Complete UAS weapons control and continue RADAR, Special Operation Forces (SOF) payloads, Navy payload integration, and MQ-8 Endurance Upgrade integration.  Continue technology refresh, LINUX transition, and move to service oriented architecture."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.727"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue Tactical Control System (TCS) integration with MQ-8 development.  Continue new TCS capabilities to support requirements for Littoral Combat Ship (LCS) efforts.  Continue TCS STANAG 4586 compliance. Continue TCS C4ISR interface integration and testing for MQ-8 systems.  Continue hardware and operating system independence initiatives.  Continue RADAR, SOF payloads, Navy payload integration, MQ-8 Endurance Upgrade Integration, and commence Common Control Software Integration."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.846"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.846"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue TCS integration and test with MQ-8 development.  Continue new TCS capabilities to support requirements for LCS efforts.  Continue TCS STANAG 4586 compliance. Continue TCS C4ISR interface integration and testing for MQ-8 systems.  Continue hardware and operating system independence initiatives.  Continue Radar, SOF payloads, Navy payload integration, MQ-8 Endurance Upgrade Integration, and continue Common Control System integration and demonstrations.  Continue technology refresh, LINUX transition, and move to service oriented architecture."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Technical and Engineering Services"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.745"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue government engineering support, contractor support, program support, and travel for the TCS program."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.654"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue government engineering support, contractor support, program support, and travel for the TCS program."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.659"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.659"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue government engineering support, contractor support, program support, and travel for the TCS program."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Tactical Control System (TCS) program is Government owned, non-proprietary software that currently supports the Fire Scout program.  The TCS program continues to focus on Navy requirements and standards based on interoperability.  Government-owned TCS software development toolkit is available to all UAS developers and manufacturers that allows a low-cost integration into the open architecture non-proprietary TCS system.  TCS will provide software modules to the Navy Common Control System (CCS) and the TCS tech refresh hardware will support migration to CCS software."
                        },
                        "PerformanceMetrics": {
                            "val": "Successfully complete the Coastal Battlefield Reconnaissance and Analysis Navy payload integration.  Support MQ-8C Endurance Upgrade, Radar, and Weapons Rapid Deployment Capabilities and transition of those capabilities into the MQ-8 Program of Record.  Successfully complete Littoral Combat Ship Integration. Complete Developmental and Operational Test. Successfully complete MQ-8 Weapons Rapid Deployment Capability Integration."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0305204N_2478_FILE1.PNG"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0305204N_2478_FILE2.PNG"
                                }
                            }
                        ]
                    }
                }
            ]
        }
    }
}