{
    "id": "33bd45adaf9f290759632e8c9d6f738da8a7492f",
    "meta": {
        "filename": "dod-2015_RDTE_2015_OSD_RDTE_JustificationBook_Office_of_Secretary_Of_Defense_PB_2015.zzz_unzipped_RDTE_JustificationBook_Office_of_Secretary_Of_Defense_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603618D8Z"
        },
        "ProgramElementTitle": {
            "val": "Joint Electronic Advanced Technology"
        },
        "R1LineNumber": {
            "val": "46"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "6.108"
            },
            "CurrentYear": {
                "val": "8.996"
            },
            "BudgetYearOne": {
                "val": "10.965"
            },
            "BudgetYearOneBase": {
                "val": "10.965"
            },
            "BudgetYearTwo": {
                "val": "11.969"
            },
            "BudgetYearThree": {
                "val": "11.998"
            },
            "BudgetYearFour": {
                "val": "12.098"
            },
            "BudgetYearFive": {
                "val": "12.693"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Department of Defense must be ready to meet the widespread and growing asymmetric electronic threats that are proliferating at an alarming rate, enabled by widely available commercial electronic components and devices.  These range from improvised devices constructed from commercially available electronic and industrial components to dedicated military devices that could be used in ways that diminish our technological advantage in conflicts with nation-states.  The surprisingly fast appearance of these threats is accelerating and is now happening quicker than the requirements and acquisition process can respond.\n\nThe use of asymmetric devices is well understood by terrorists and nation-states alike.  Using man portable air defense systems, mortars, and improvised explosive devices actuated by electronic components terrorists have attacked both air and ground forces and pose a threat in any region due to their portability.  Unmanned aircraft systems, also strongly enabled by electronic components are proliferating and pose a threat both as military capability and as potential terrorist weapons delivery mechanism.  \n\nTechnological surprise and speed of appearance are two asymmetries that highlight the need to rapidly develop and field Electronic Warfare, Information Operations, and Asymmetric Warfare capabilities capable of neutralizing such threats in ways that are both fiscally and temporally responsive.  This program element investigates means to rapidly mitigate asymmetric threats by integrating advanced commercial and military off-the-shelf technologies in innovative ways and rapidly demonstrating new technological capabilities to augment and\/or reduce risk when inserted into service programs of record.  Efforts will also look for methods to employ asymmetric principles against our adversaries.\n\nBeginning in FY 2014, the Joint Electronic Advanced Technology (JEAT) project reorganized to be in better alignment with Assistant Secretary of Defense for Research and Engineering electronic warfare research priorities.  Particularly, JEAT established three pillars that will support the JEAT approach to innovation:  1) experimentation\/demonstration, 2) advanced technology development\/verification, and 3) innovative technology exploration.  The overarching JEAT philosophy is to be adaptive and to help lead the pace of rapid electronic systems development and the evolving threat picture."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "6.983"
                },
                "CurrentYear": {
                    "val": "9.009"
                },
                "BudgetYearOne": {
                    "val": "14.196"
                },
                "BudgetYearOneBase": {
                    "val": "14.196"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "6.108"
                },
                "CurrentYear": {
                    "val": "8.996"
                },
                "BudgetYearOne": {
                    "val": "10.965"
                },
                "BudgetYearOneBase": {
                    "val": "10.965"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.875"
                },
                "CurrentYear": {
                    "val": "-0.013"
                },
                "BudgetYearOne": {
                    "val": "-3.231"
                },
                "BudgetYearOneBase": {
                    "val": "-3.231"
                }
            },
            "AdjustmentDetails": {
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "-0.588"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "-0.009"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.170"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.105"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FFRDC Adjustment"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "-0.013"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Strategic Efficiency Savings"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-3.231"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-3.231"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.003"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The reduction is a strategic efficiency approach to reduce funding and staffing.  As a result, we provide a better alignment of funding and provide support to a smaller military force."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P619"
                    },
                    "ProjectTitle": {
                        "val": "Joint Electronic Advanced Technology"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.108"
                        },
                        "CurrentYear": {
                            "val": "8.996"
                        },
                        "BudgetYearOne": {
                            "val": "10.965"
                        },
                        "BudgetYearOneBase": {
                            "val": "10.965"
                        },
                        "BudgetYearTwo": {
                            "val": "11.969"
                        },
                        "BudgetYearThree": {
                            "val": "11.998"
                        },
                        "BudgetYearFour": {
                            "val": "12.098"
                        },
                        "BudgetYearFive": {
                            "val": "12.693"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Department of Defense (DoD) must be ready to meet the widespread and growing asymmetric electronic threats that are proliferating at an alarming rate, enabled by widely available commercial electronic components and devices.  These range from improvised devices constructed from commercially available electronic and industrial components to dedicated military devices that could be used in ways that diminish our technological advantage in conflicts with nation-states.  The surprisingly fast appearance of these threats is accelerating quicker than the requirements and acquisition process can respond.\n\nThe use of asymmetric devices is well understood by terrorists and nation-states alike.  Using man portable air defense systems, mortars, and improvised explosive devices actuated by electronic components terrorists have attacked both air and ground forces and pose a threat in any region due to their portability.  Unmanned Aircraft Systems (UAS), also strongly enabled by electronic components are proliferating and pose a threat both as a military capability and as a potential terrorist weapons delivery mechanism.  \n\nTechnological surprise and speed of appearance are two asymmetries that highlight the need to rapidly develop and field Electronic Warfare, Information Operations, and Asymmetric Warfare capabilities capable of neutralizing such threats in ways that are both fiscally and temporally responsive.  This program element investigates means to rapidly mitigate asymmetric threats by integrating advanced commercial and military off-the-shelf technologies in innovative ways; rapidly demonstrating new technological capabilities to augment and\/or reduce risk when inserted into service programs of record.  Efforts will also look for methods to employ asymmetric principles against our adversaries.\n\nBeginning in FY 2014, the Joint Electronic Advanced Technology (JEAT) project reorganized to be in better alignment with Assistant Secretary of Defense for Research and Engineering (ASD(R&E)) electronic warfare research priorities.  Particularly, JEAT established three pillars that will support the JEAT approach to innovation:  1) experimentation\/demonstration, 2) advanced technology development\/verification, and 3) innovative technology exploration.  The overarching JEAT philosophy is to be adaptive and to help lead the pace of rapid electronic systems development and the evolving threat picture.\n\nExperimentation\/Demonstration:\n\nVigilant Hammer - A recurring multi-year, multi-agency, live, virtual, and constructive (LVC) venue of increasing complexity and difficulty which advances the state of the art for the detection, classification, geolocation and prosecution of electromagnetic signals of interest using DoD and national resources.  The event will be modeled after the BLACK DART and Trident Spectre venues, and will include scripted and free play scenarios intended to give participants an opportunity to identify synergies and incrementally build capabilities to engage threats.  Engagement (Hammer) payloads will be developed and vetted through distributed electronic effects development. \n\nAdvanced Technology Development\/Verification:\n\nDistributed electronic effects development – A laboratory and developmental construct that will assess emerging Electronic Warfare (EW) technologies, allowing more effective coordination of sensor and electronic attack capabilities to deliver multi-point, collaborative EW services to warfighters. Distributed electronic effects development will seek to identify and match technologies together that have natural synergies and produce more capability than the sum of the individual capabilities.  \n\nSoftware Programmable\/Spectrum Diverse Electronic Attack (EA) Capability – Opportunities exist to adapt existing technology used for communication and other purposes into highly configurable EA capability.  This technology will help counter adversary movement into advanced military purpose digital electronic systems.  Beginning in FY 2014, JEAT began to adapt software configurable communications technology to be used as part of a distributed, networked, EA capability that can be readily adapted for installation in a wide variety of host platforms.\n\nInnovative Technology Exploration:\n\nAdaptive\/Asymmetric Technology – This effort directly supports ASD(R&E), Director EW and Countermeasures (EW&C) by performing analyses and studies of emerging asymmetric threats.  Past efforts under this JEAT project include the Aircraft Survivability Equipment Joint Analysis Team and the Helicopter Survivability Task Force, both of which resulted in significant strategic technology investments by the Department."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Integrated Situational Awareness and Countermeasures (FY 2013 effort)"
                                    },
                                    "Description": {
                                        "val": "DoD aircraft currently use a federated architecture of sensors and countermeasures to protect themselves against guided and unguided hostile threats while simultaneously avoiding collisions with the ground and other obstacles.  These sensors typically provide the pilot with separate displays of radar warning and missile warning to guide the pilot in selecting automatic or manual countermeasures against radar, laser, or radio frequency guided threats.  These unfused sensors create a serial information stream which can induce an inadequate response to the threat.  Federated systems consume weight, space, and power which are at a premium in small platforms.  Additionally, there currently is no coordinated effort to develop integrated situational awareness or control countermeasures that include off-board systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.875"
                                            },
                                            "Text": {
                                                "val": "Demonstrated free space laser communications capability based upon magnetically actuated optics during Trident Spectre.  This technology leveraged off of technology related to the Hostile Fire Detection \/ countermeasures with the magnetically actuated optics.  \n\nRotorcraft Aircraft Survivability Equipment (ASE) Experiment (RASE) – JEAT completed its objectives during a RASE experiment in FY 2013, conducting the third and final annual RASE event.  Objectives for this event included geo-location of the point of origin of a hostile projectile, networking the point of origin information off-board and exploring the technical feasibility of delivering non-lethal countermeasures to the shooter."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Low Cost\/Near Term Counter Asymmetric Systems (FY 2013 effort)"
                                    },
                                    "Description": {
                                        "val": "Low cost, near term technologies solutions to asymmetric EW threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.146"
                                            },
                                            "Text": {
                                                "val": "Initiated JEAT funded efforts to gather information necessary to develop countermeasures against an advanced category of missile seekers threatening all military aircraft.  \n\nBased upon the Office of the Secretary of Defense Advanced Threat study, completed in FY 2010, JEAT continued to study possible solutions to emerging threats.  JEAT evaluated techniques to rapidly develop countermeasures to advanced, fourth and fifth generation missile seekers.  This effort supported signature measurements, modeling, and evaluation as well as laboratory trials and joint collaboration."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Disruptive Technology Defeat and Utilization (FY 2013 effort)"
                                    },
                                    "Description": {
                                        "val": "Emerging and disruptive technologies analysis; rapid prototyping of technologies required to adapt counter-terrorism techniques to threats in Overseas Contingency Operations (OCO).  Primary payoff is an assessment of current system capabilities and limitations against the threat and capture of baseline system performance against the threat set for developing technologies.  Trident Spectre provides a venue for various members of Special Forces, Conventional Forces and Intelligence Community to collaborate on and evaluate technologies and techniques related to “Tactical Intelligence” in a technical, operational, and safe environment.  Trident Spectre provides an opportunity for capability developers (scientists, engineers, designers) to interact directly with tactical operators, collectors and analysts; and a process that correctly and efficiently reviews potential Tactical Intelligence technologies and techniques that will enhance the operational capability of the DoD activities in OCO.  Primary payoff is improved connectivity and more efficient collection and dissemination of Tactical Intelligence.  Customers include United States Central Command, Special Operations Command (SOCOM), ASD(R&E), DoD Conventional\/Special Forces, and members of the Intelligence Community.  Products include an after action report and a transition plan moving management activities from ASD(R&E)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.087"
                                            },
                                            "Text": {
                                                "val": "JEAT sponsored a portion of the Trident Spectre demonstration for the final time before it transitions to SOCOM sponsorship in FY 2014.  Trident Spectre 2013 included more than 100 experiments and produced technical solutions that transition directly and nearly immediately into the hands of warfighters and intelligence professionals."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Experimentation\/Demonstration"
                                    },
                                    "Description": {
                                        "val": "FY 2015 efforts will leverage the methodologies of past, successful JEAT experimentation\/demonstration efforts including the BLACK DART counter Unmanned Aircraft Systems (UAS) demonstration and the Rotorcraft Aircraft Survivability Equipment (ASE) Experiment (RASE) to establish a new venue to investigate ways of providing distributed delivery of electronic effects.  This new venue called Vigilant Hammer will evaluate the ability to provide Electronic Warfare (EW) effects using a collaborative, distributed set of electronic systems which can provide a robust, adaptive and effective network of electronic attack delivery methods.  Vigilant Hammer participation will emphasize UAS at first with future years adding surface and other delivery platforms."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.376"
                                            },
                                            "Text": {
                                                "val": "Distributed Electronic Effects Delivery (DEED) – Assess emerging EW technologies that allow more effective coordination of sensor and electronic attack capabilities to deliver multi-point, collaborative EW services to warfighters.  DEED will issue a call to government organizations for proposals to bring new EW technology forward for laboratory evaluations that lead to eventual use in live, virtual, and constructive demonstrations.  The goal is to identify and match technologies together that have natural synergies and produce more capability than the sum of the individual components.\n\nUAV Payload Demonstration and Experimentation – Avenues to either own or secure assured access to six UAVs to support Electronic Attack (EA) payload experimentation and testing will be pursued.  UAVs will be used to support EA payload evaluation in a series of experiments\/demonstrations executed over several short, discrete events."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.143"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.143"
                                            },
                                            "Text": {
                                                "val": "Vigilant Hammer – Formally known as DEED, Vigilant Hammer is a  recurring multi-year, multi-agency, live, virtual, and constructive (LVC) venue of increasing complexity and difficulty which advances the state of the art for the detection, classification, geolocation and prosecution of electromagnetic signals of interest using DoD and national resources.  The event will be modeled after the BLACK DART and Trident Spectre venues, and will include scripted and free play scenarios intended to give participants an opportunity to identify synergies and incrementally build capabilities to engage threats.  Engagement (Hammer) payloads will be developed and vetted through a laboratory environment under the distributed electronic effects development effort.  In this first year of JEAT sponsorship of Vigilant Hammer, demonstration activities will focus on potentially game changing tactical applications of several signal location techniques."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Technology Development\/Verification"
                                    },
                                    "Description": {
                                        "val": "Investigate low cost, near term technologies that could solve rapidly emerging, asymmetric EW problems and provide new advanced capabilities to United States forces.  Foci include threats, technological opportunity space and approaches that are not covered by existing programs of record, and include, but will not be limited to: assessment of existing military systems vulnerability to degradation by electronic attack (both air and surface domain) and UAS electronic attack vulnerability assessments."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "Advanced Threat Countermeasures – Focuses on the development of innovative, low cost, near-term countermeasures solutions that can be rapidly fielded to counter new classes of advanced missile seekers.  Builds on prior collaborative work with the Services (signature collections and analyses of countermeasures techniques) to begin the process of assessing potential countermeasure solutions.  In FY 2014, we will apply unique signature management techniques to representative surfaces and evaluate their effectiveness with respect to reducing the effectiveness of advanced seekers.\n\nSoftware Programmable\/Spectrum Diverse Electronic Attack (EA) Capability – Opportunities exist to adapt existing technology used for communication and other purposes into highly configurable EA capability.  This technology will help counter adversary movement into advanced military purpose digital electronic systems.  In FY 2014 JEAT will begin to adapt software configurable communications technology for use as part of a distributed, networked, EA capability that may be readily adapted for installation in a wide variety of host platforms.  One technology will be brought to a Preliminary Design Review level of development."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.799"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.799"
                                            },
                                            "Text": {
                                                "val": "Advanced Technology Development\/Verification – This effort will seek new and innovative EW technologies.  These technologies will be created by combining two or more existing components to produce a new and unique capability that provides more warfighting value than the sum of its parts.  Laboratory evaluation of these capabilities will seek to integrate and quantify the benefits of the new approaches, and will ultimately prepare products for evaluation in venues like Vigilant Hammer.  Specific technologies of interest will be identified via a government proposal process conducted at the beginning of FY 2015."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Innovative Technology Exploration"
                                    },
                                    "Description": {
                                        "val": "This effort directly supports ASD(R&E), Director EW&C through analyses and studies of emerging asymmetric threats.  Past efforts under this JEAT project include the Aircraft Survivability Equipment Joint Analysis Team and the Helicopter Survivability Task Force, both of which resulted in significant strategic technology investments by the Department."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.620"
                                            },
                                            "Text": {
                                                "val": "Innovative Technology Exploration efforts will focus on creating an adjunct to the DEED venue which seeks to provide more direct and immediate use of Intelligence Community technology and capability in spectrum warfare.  Of particular emphasis is the use of near-real time analysis of an environment full of diverse commercial and military purpose emitters to quickly produce actionable, decision quality information that allows us to use the spectrum to our advantage.  The objective of this effort is to encourage better collaboration and capability development including the military services and the Intelligence Community.  In this first year of effort, JEAT will study opportunities for better utilization of Intelligence Community derived information and capability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.023"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.023"
                                            },
                                            "Text": {
                                                "val": "Innovative Technology Exploration efforts in FY 2015 will focus on analysis of alternative courses of action related to packaging and deploying advanced EW technology, particularly that which is of interest in related development efforts.  Evaluation of complex spectrum environments, system-to-system interactions, link budget analyses, size, weight and power analysis, and other relevant analytic studies will be accomplished under this effort."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}