{
    "id": "3caddab23507803d03aed6dbd7af41507ffcc25e",
    "meta": {
        "filename": "dod-2015_RDTE_2015_ARMY_BA5A_RDTE_JustificationBook_Army_PB_2015.zzz_unzipped_RDTE_JustificationBook_Army_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605018A"
        },
        "ProgramElementTitle": {
            "val": "Integrated Personnel and Pay System-Army (IPPS-A)"
        },
        "R1LineNumber": {
            "val": "117"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "122.168"
            },
            "CurrentYear": {
                "val": "69.253"
            },
            "BudgetYearOne": {
                "val": "138.465"
            },
            "BudgetYearOneBase": {
                "val": "138.465"
            },
            "BudgetYearTwo": {
                "val": "141.521"
            },
            "BudgetYearThree": {
                "val": "123.112"
            },
            "BudgetYearFour": {
                "val": "121.261"
            },
            "BudgetYearFive": {
                "val": "12.126"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "727.906"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Integrated Personnel and Pay System - Army (IPPS-A) provides the Army with an integrated, multi-Component, personnel and pay system which streamlines Army Human Resources (HR), enhances the efficiency and accuracy of Army personnel and pay procedures, and supports Soldiers and their families. IPPS-A will subsume approximately 50 Army legacy systems across the Army, Army Reserve, and National Guard, into an integrated system.  IPPS-A will be a web-based tool, available 24 hours a day, accessible to HR professionals, combatant commanders, personnel and pay managers, and other authorized users throughout the Army. IPPS-A addresses major deficiencies in the delivery of military personnel and pay services and also provides internal controls and audit procedures that prevent erroneous payments and loss of funds."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "158.646"
                },
                "CurrentYear": {
                    "val": "137.290"
                },
                "BudgetYearOne": {
                    "val": "147.273"
                },
                "BudgetYearOneBase": {
                    "val": "147.273"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "122.168"
                },
                "CurrentYear": {
                    "val": "69.253"
                },
                "BudgetYearOne": {
                    "val": "138.465"
                },
                "BudgetYearOneBase": {
                    "val": "138.465"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-36.478"
                },
                "CurrentYear": {
                    "val": "-68.037"
                },
                "BudgetYearOne": {
                    "val": "-8.808"
                },
                "BudgetYearOneBase": {
                    "val": "-8.808"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-22.100"
                    },
                    "CurrentYear": {
                        "val": "-68.037"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments 1"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-10.503"
                                },
                                "BudgetYearOne": {
                                    "val": "-8.808"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-8.808"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments 2"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-3.875"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "ED9"
                    },
                    "ProjectTitle": {
                        "val": "Integrated Personnel and Pay System Army Inc 2"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "138.465"
                        },
                        "BudgetYearOneBase": {
                            "val": "138.465"
                        },
                        "BudgetYearTwo": {
                            "val": "141.521"
                        },
                        "BudgetYearThree": {
                            "val": "123.112"
                        },
                        "BudgetYearFour": {
                            "val": "121.261"
                        },
                        "BudgetYearFive": {
                            "val": "12.126"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "536.485"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Please note that effective from PB15 and beyond, Project HR5 has realigned to IPPS-A Increment I; all funding under PE 0605018A prior to FY14 has realigned to Project HR5 and all funding under PE 0605018A from FY15 and beyond has realigned to IPPS-A Increment II under Project ED9, respectively."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Integrated Personnel and Pay System - Army (IPPS-A) Increment II will deliver full integrated personnel and pay services for all Army Components, building on the trusted database delivered by the IPPS-A Increment I program. Increment II will be able to link the personnel and pay functions for all Army personnel, eliminating duplicate data entry, reducing complex system maintenance, and minimizing pay discrepancies. IPPS-A Increment II will account for status changes between Active, Reserve, and National Guard components to ensure accurate service time minimizing impact on individual pay, credit for service, and other benefits as well as enable disciplined human resource management."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Analysis and Design, Development, and Integration of IPPS-A Increment II"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following efforts:"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "138.465"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "138.465"
                                            },
                                            "Text": {
                                                "val": "IPPS-A will complete critical activities to obtain Limited Fielding Decision for Release 2.0.  Major activities will include completion of Primary Design Review, Critical Design Review, as well as development and integration associated critical activities and proceed to Government Acceptance Test (GAT). IPPS-A will also initiate critical activities to support an Authority to Proceed Decision for Both Releases 3.0 and 4.0.  IPPS-A will complete the Primary Design Review and Critical Design Review for Release 3.0 and will continue support the data management activities to include data call from legacy systems, data analysis, data cleansing, and data conversion; design and build out the system technical architecture for IPPS-A; and configure the Enterprise Resource Planning system against functional personnel specifications.  IPPS-A will complete the Limited User Testing (LUT) for Increment 1 Wave 3 in Q1 FY2015 and begin sustainment of Increment I."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "Sustainment and Support"
                                    },
                                    "Title": {
                                        "val": "OMA - Army Integrated Personnel and Pay System - Army (IPPS-A)"
                                    },
                                    "Funding": {
                                        "BudgetYearOne": {
                                            "val": "5.080"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "5.080"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "5.245"
                                        },
                                        "BudgetYearThree": {
                                            "val": "6.004"
                                        },
                                        "BudgetYearFour": {
                                            "val": "5.600"
                                        },
                                        "BudgetYearFive": {
                                            "val": "40.133"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "62.062"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "System Implementation\/Fielding"
                                    },
                                    "Title": {
                                        "val": "OPA -  Army Integrated Personnel and Pay System - Army (IPPS-A)"
                                    },
                                    "Funding": {
                                        "BudgetYearOne": {
                                            "val": "32.970"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "32.970"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "18.383"
                                        },
                                        "BudgetYearThree": {
                                            "val": "17.083"
                                        },
                                        "BudgetYearFour": {
                                            "val": "11.483"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.370"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "80.289"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "0308610A (OMA): Funding will be used for the operations and maintenance support of IPPS-A which includes civilian salaries, program office contractor support, travel and training for program office personnel, software license renewal, and Help Desk support.\n\nB66706000 (OPA): Funding will be used for initial system implementation and fielding of IPPS-A, to include New Equipment Training (NET) as well as procurement of hardware and software which is required to build out the infrastructure of IPPS-A Data Centers."
                        },
                        "AcquisitionStrategy": {
                            "val": "On September 8, 2009, the USD(AT&L) issued an Acquisition Decision Memorandum (ADM) directing the Services to develop Service-specific integrated personnel and pay systems (IPPSs).  The ADM also directed the Services to use the DIMHRS IT Investment to the maximum extent practical to develop their IPPS system from a DoD program to a Service-specific program.  As a result of this decision, on October 1, 2009, the DoD Business Transformation Agency (BTA) began to transition the work done on DIMHRS to the Services.  The Army G-1 and Program Executive Office Enterprise Information Systems (PEO EIS) are partnered to develop the Integrated Personnel and Pay System - Army (IPPS-A), leveraging the IT investment to the maximum extent practical.  This new direction for the program will ensure the system meets Army specific requirements while also feeding a planned DoD Enterprise Data Warehouse to satisfy joint Services and Office of the Secretary of Defense (OSD) information requirements.  The Army will address personnel and pay management requirements by implementing a COTS Enterprise Resource Planning (ERP) product using the Oracle PeopleSoft software and building on the DIMHRS solution delivered by BTA.\n\nThe Army will employ a hybrid solution using ERP software and Agile Development to deliver integrated personnel and pay capabilities, capitalizing on the PeopleSoft product delivered by BTA as part of the DIMHRS program.  The Army plans to use current Army upgraded PeopleSoft 9.1 ERP and Oracle 11g database capabilities, along with Application Technologies outside of the core ERP to meet user requirements.\n\nIPPS-A will be developed in two Increments with multiple releases.  The Army will follow the new DoDI 5000.02 Defense Acquisition Program Model 3 dated 26 Nov 2013 to develop each release with the goal of fielding capabilities every year. Each Release will include Fit\/Gap analysis, development, testing, training and fielding.  Fielding of Increment I will lay the foundation for the authoritative database in Increment II and will allow for development of Increment II functionalities.  Increment I will build out the infrastructure to provide Increment II with the ability to support all three Army components with accurate and timely data needed to track the movement of Active, Reserve, and National Guard personnel from location to location in support of operational requirements.  Increment II will be able to link the personnel and pay functions for all Army personnel eliminating duplicate data entry, reducing complex system maintenance, and minimizing pay discrepancies.  IPPS-A will account for status changes between Active, Reserve, and National Guard components to ensure accurate service time minimizing impact on individual pay, credit for service, and other benefits as well as enable disciplined human resource management.  \n\nIncrement II will deliver total integrated personnel and pay capabilities across four releases: SIDPERS Functionality in FY2015 (Release 2.0), Accountability and Essential Personnel Services in FY2016 (Release 3.0), Pay Services in FY2017 (Release 4.0), and remaining Personnel Services in FY2017 (Release 5.0).  The Army is on-track to obtain Increment II MS B in Q3 FY2014.  The Army will begin the Design, Development and Integration efforts for Increment II, Release 2.0 and plans to obtain Limited Fielding Decision in FY2016."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management Contract Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.327"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.327"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Independent Verification and Validation (IV&V)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.570"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.570"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "In-house Government Management Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Allot"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Program oversight, resource justification, budget and programming, milestone and schedule tracking"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Alexandria, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.190"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.190"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Software Licenses - All Others"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Software Licenses - IBM"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Immixtechnology, INC."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Mclean, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.558"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.558"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Software Lincenses - GRC"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Mythics"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Virginia Beach, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.906"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.906"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Software Licenses - PeopleSoft Enterprise Licenses"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Oracle America, INC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Reston, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.437"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.437"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Software Licenses -  CA"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ImmixTechnology"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "McLean, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.872"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.872"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Software Licenses -  Actuate eReport\/BIRT"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Actuate Corp"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Mateo, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.512"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.512"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Software Product Level SME Consulting Service"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.500"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.500"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "In-house contract support of system development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "14.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "14.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Functional In-house contract support of system development - Army National Guard\/Army Reserve\/FMD"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "5.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Design, Development, and Integration - Increment II"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "70.465"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "70.465"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Network Support\/Production Hosting Services\/Hardware Leasing (SLAs)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Network support from various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "10.966"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "10.966"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Facilities\/Lease\/Rents"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Facilities\/Lease\/ Rents"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Equipment and Supplies, MISC"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.832"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.832"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Increment II - Government Acceptance Testing\/Operational Test and Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various Government Agencies"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "10.070"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "10.070"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Increment II - Capability Acceptance Testing (CAT)\/DT"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Government & Support Contractors"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "4.260"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "4.260"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Milestone B (MS B) - Increment II"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "HR5"
                    },
                    "ProjectTitle": {
                        "val": "Integrated Personnel And Pay System - Army Inc 1"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "122.168"
                        },
                        "CurrentYear": {
                            "val": "69.253"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "191.421"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Please note the name of Army Integrated Military Human Resources System (A-IMHRS) has changed to Integrated Personnel and Pay System - Army (IPPS-A) effective 22 September 2010.  IPPS-A more accurately identifies the program as the military personnel and pay solution for the Army.\n\nPlease note that effective from PB15 and beyond, Project HR5 has realigned to IPPS-A Increment I; all funding under PE 0605018A prior to FY14 has realigned to Project HR5 and all funding under PE 0605018A from FY15 and beyond has realigned to IPPS-A Increment II under Project ED9, respectively."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Integrated Personnel and Pay System - Army (IPPS-A) Increment I will provide a single, multi-Component trusted database with a single record for all Army Soldiers, and serve as a trusted data source for personnel and human resources data for the entire Army. Increment I will provide Soldiers with 24\/7, web-based access to their personnel data from a single source, enabling them to better manage their careers and ensure accuracy of information through generation of new multi-Component reports, including a Soldier Record Brief. Overall, IPPS-A Increment I will provide three capabilities not currently available within the Army: consolidation of personnel data from all Components into a single, trusted source, enhanced visibility of personnel across all Components, and a Soldier Record Brief for all Army Component Soldiers (Active, Guard and Reserve)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Analysis and Design, Development, and Integration of IPPS-A"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following efforts:"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "122.168"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "IPPS-A completed the following critical activities for an Increment I Milestone C Decision and an Increment II Milestone B decision: (1) Built-out of the Production environment and data centers. (2) developed interfaces with legacy systems to support data management activities (3) Developed acquisition documentation for Increment II Milestone B and conducted Source Selection activities to award the Increment II System Integrator contract. (4) Finalized Increment II System Integrator solicitation package and complete all source selection activities for award in FY14."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "69.253"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "IPPS-A anticipates a Increment I MS C and Full Deployment Decision (FDD) in Q2 FY2014 and Full Deployment in Q4 FY2014.  IPPS-A Increment I critical activities include loading and testing all Army Components (Active, National Guard, and Reserve) data in three waves and meets the established Full Deployment Decision exit criteria for full deployment.  IPPS-A also anticipates a MS B Decision for Increment II and begin preliminary design efforts to support the Preliminary Design Review.  Major activities include: development of regulatory and statutory acquisition documentation to support Increment II Milestone B Decision; award the Increment II System Development and Integration Services contract; continue data management activities to include legacy systems data calls, data analysis, data cleansing and data conversion."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "Sustainment and Support"
                                    },
                                    "Title": {
                                        "val": "OMA - Army Integrated Personnel and Pay System - Army (IPPS-A)"
                                    },
                                    "Funding": {
                                        "CurrentYear": {
                                            "val": "11.346"
                                        },
                                        "BudgetYearOne": {
                                            "val": "20.460"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "20.460"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "20.712"
                                        },
                                        "BudgetYearThree": {
                                            "val": "20.968"
                                        },
                                        "BudgetYearFour": {
                                            "val": "21.228"
                                        },
                                        "BudgetYearFive": {
                                            "val": "21.493"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "System Implementation\/Fielding"
                                    },
                                    "Title": {
                                        "val": "OPA -  Army Integrated Personnel and Pay System - Army (IPPS-A)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.460"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "0308610A (OMA): Funding will be used for the operations and maintenance support of IPPS-A which includes civilian salaries, program office contractor support, travel and training for program office personnel, software license renewal, and Help Desk support.\n\n0219900A (OPA): Funding will be used for procurement of hardware and software which is required to build out the infrastructure of IPPS-A Data Centers, as well as Hardware lifecycle refresh."
                        },
                        "AcquisitionStrategy": {
                            "val": "On September 8, 2009, the USD(AT&L) issued an Acquisition Decision Memorandum (ADM) directing the Services to develop Service-specific integrated personnel and pay systems (IPPSs).  The ADM also directed the Services to use the DIMHRS IT Investment to the maximum extent practical to develop their IPPS system from a DoD program to a Service-specific program.  As a result of this decision, on October 1, 2009, the DoD Business Transformation Agency (BTA) began to transition the work done on DIMHRS to the Services.  The Army G-1 and Program Executive Office Enterprise Information Systems (PEO EIS) are partnered to develop the Integrated Personnel and Pay System - Army (IPPS-A), leveraging the IT investment to the maximum extent practical.  This new direction for the program will ensure the system meets Army specific requirements while also feeding a planned DoD Enterprise Data Warehouse to satisfy joint Services and Office of the Secretary of Defense (OSD) information requirements.  The Army will address personnel and pay management requirements by implementing a COTS Enterprise Resource Planning (ERP) product using the Oracle PeopleSoft software and building on the DIMHRS solution delivered by BTA.\n\nThe Army will employ a hybrid solution using ERP software and Agile Development to deliver integrated personnel and pay capabilities, capitalizing on the PeopleSoft product delivered by BTA as part of the DIMHRS program.  The Army plans to use current Army upgraded PeopleSoft 9.1 ERP and Oracle 11g database capabilities, along with Application Technologies outside of the core ERP to meet user requirements.\n\nIPPS-A will be developed in two Increments with multiple releases.  The Army will follow the new DoDI 5000.02 Defense Acquisition Program Model 3 dated 26 Nov 2013 to develop each release with the goal of fielding capabilities every year. Increment I will provide a multi-component Trusted Database with single record for all Army Soldiers.  Fielding of Increment I will lay the foundation for the authoritative database in Increment II and will allow for development of Increment II functionalities.  Increment I will build out the infrastructure to provide Increment II with the ability to support all three Army components with accurate and timely data needed to track the movement of Active, Reserve, and National Guard personnel from location to location in support of operational requirements. On July 29, 2011, the Deputy Chief Management Officer (DCMO) granted an ADM for IPPS-A Increment I to enter the Engineering and Manufacturing Development (EMD) phase of the acquisition life-cycle.\n\nIncrement I will deliver a Trusted Database with reporting capabilities. The Army is on-track to obtain Increment I MS C and Full Deployment Decision (FDD) in Q2 FY2014 and Full Deployment (FD) in Q4 FY2014."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management Contract Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Booz Allen Hamilton INC."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Mclean, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "5.449"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.891"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-07"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.327"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "10.667"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Independent Verification and Validation (IV&V)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Capgemini Government Solutions LLC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Herndon, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.634"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.634"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "In-house Government Management Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Program oversight, resource justification, budget and programming, milestone and schedule tracking"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Alexandria, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "7.573"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.995"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.012"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "13.580"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Software Licenses - All Others"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "FP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "9.737"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "13.927"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.719"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "27.383"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Software Licenses - IBM"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Immixtechnology, INC."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Mclean, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "5.344"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.263"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.610"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "9.217"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Software Lincenses - GRC"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Mythics"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Virginia Beach, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "5.069"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.822"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-05"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.836"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "6.727"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Software Licenses - PeopleSoft Enterprise Licenses"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Oracle America, INC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Reston, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "4.654"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.327"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.327"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "9.308"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Software Licenses -  CA"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ImmixTechnology"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "McLean, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.993"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.810"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-08"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.816"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.619"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Software Licenses -  Actuate eReport\/BIRT"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Actuate Corp"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Mateo, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.200"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.423"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-08"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.465"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.088"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "In-house contract support of system development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Booz Allen Hamilton INC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Mclean, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "23.063"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "15.259"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-07"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "15.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "53.322"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Functional In-house contract support of system development - Army National Guard\/Army Reserve\/FMD"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "6.074"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.887"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.002"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "11.963"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Design, Development, and Integration - Increment I"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "EDC Consulting, LLC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Washington, DC"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "13.415"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "15.651"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "29.066"
                                                    },
                                                    "TargetValue": {
                                                        "val": "27.849"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Design, Development, and Integration of Increment II"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "52.084"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-09"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "16.793"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "68.877"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Design, Development, and Integration"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Northrop Grumman Information Technology"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Mclean, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "16.070"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "16.070"
                                                    },
                                                    "TargetValue": {
                                                        "val": "16.070"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Network Support\/Production Hosting Services\/Hardware Leasing (SLAs)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Network support from various activities"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "15.695"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "5.689"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "10.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "31.384"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Facilities\/Lease\/Rents"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Facilities\/Lease\/Rents"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "4.750"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.060"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "9.810"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Equipment and Supplies, MISC"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.400"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.400"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.000"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Increment I - Government Acceptance Testing\/Operational Test and Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various Government Agencies"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.780"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.330"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "4.887"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "6.997"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Increment I - Capability Acceptance Testing (CAT)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Booz Allen Hamilton INC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Mclean, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.060"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.550"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.059"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.669"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Increment I, Release 1.0 - Trusted Database and Reports"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Increment I, Release 1.0 - Design, Development, and Integration"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Increment I, Release 1.0 -  T & E"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Milestone C - Release 1.0"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Full Deployment Decision (FDD) - Increment I"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Full Deployment (FD)- Increment I"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}