{
    "id": "3e23440096aac44e7735f8c0279df8e52e544f7e",
    "meta": {
        "filename": "dod-2015_RDTE_2015_ARMY_BA6_RDTE_JustificationBook_Army_PB_2015.zzz_unzipped_RDTE_JustificationBook_Army_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605326A"
        },
        "ProgramElementTitle": {
            "val": "Concepts Experimentation Program"
        },
        "R1LineNumber": {
            "val": "140"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "24.720"
            },
            "CurrentYear": {
                "val": "22.246"
            },
            "BudgetYearOne": {
                "val": "19.439"
            },
            "BudgetYearOneBase": {
                "val": "19.439"
            },
            "BudgetYearTwo": {
                "val": "22.149"
            },
            "BudgetYearThree": {
                "val": "42.062"
            },
            "BudgetYearFour": {
                "val": "38.152"
            },
            "BudgetYearFive": {
                "val": "40.876"
            }
        },
        "ProgramElementNote": {
            "val": "FY13 adjustments attributed to Congressional General Reductions (-41 thousand); SBIR\/STTR transfers (-715 thousand); and Sequestration reductions (-2.426 million).\nFY14 adjustments attributed to Congressional General Reductions (-12 thousand) and Congressional Directed Reductions (-14.9 million).\nFY15 reduction attributed to realignment to other higher priority Army programs."
        },
        "ProgramElementMissionDescription": {
            "val": "Army Experimentation mission enables integrated examinations with Army Test and Evaluation Command (ATEC), Research, Development and Experimentation Command (RDECOM), Army battle laboratories, operational units, research labs materiels developers, industry and academia to collaborate in the development, refinement, and assessment of future force concepts.  The intended outcome of this integrative effort is to develop concept capability plans that inform the Capabilities Integration Development System (CIDS) process and define future requirements, enabling identification and acquisition of critical Doctrine, Organization, Training, Materiel, Leader Development, Personnel and Facilities (DOTMLPF) capabilities for the future force to provide land power capabilities needed by Army commanders.  Due to significant reductions in funding, beginning in FY15, Research, Development, Test, and Evaluation (RDT&E) funding will focus on Simulated Experiments (SIMEX) to integrate and assess Army Concepts, Force Designs, and Capabilities.  Experimentation enables enhanced situational awareness, planning requirements, employment and management of accelerated decision cycles in a network-enabled force, and training requirements of new and emerging technologies.\n\nARCIC, Accelerated Capabilities Division (ACD) (formerly Asymmetric Warfare Division) develops immediate capability solutions in support of the Chief of Staff of the Army (CSA) prioritized Current Force capability gaps (i.e. Force Protection, Networked Battle Command, Logistics and Medical in Counterinsurgency Operations (COIN) and Soldier Protection).  ACD conducts Concept of Operations (CONOPS) and DOTMLPF analysis required to ensure capability gap candidate solutions are properly integrated prior to being equipped to deployed forces.  Supports pre-deployment and in-theater assessments to ensure candidate solution meet identified requirements, support tactics, techniques and procedures development for use by deployed forces, and ensure equipped systems provide the necessary capability to fill an identified gap.  These assessments support determination of a path forward for equipped system by identifying them as a potential Program of Record (POR) or sustain in theater.  CONOPS, DOTMLPF-Cost analysis and assessment assist deployed forces by ensuring they are able to properly employ equipped systems and assist senior Army leadership in determining how best to resource solution to high priority capability gaps."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "27.902"
                },
                "CurrentYear": {
                    "val": "37.158"
                },
                "BudgetYearOne": {
                    "val": "53.324"
                },
                "BudgetYearOneBase": {
                    "val": "53.324"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "24.720"
                },
                "CurrentYear": {
                    "val": "22.246"
                },
                "BudgetYearOne": {
                    "val": "19.439"
                },
                "BudgetYearOneBase": {
                    "val": "19.439"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-3.182"
                },
                "CurrentYear": {
                    "val": "-14.912"
                },
                "BudgetYearOne": {
                    "val": "-33.885"
                },
                "BudgetYearOneBase": {
                    "val": "-33.885"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.041"
                    },
                    "CurrentYear": {
                        "val": "-0.012"
                    }
                },
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-14.900"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.715"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-33.885"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-33.885"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-2.426"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "312"
                    },
                    "ProjectTitle": {
                        "val": "Army\/Joint Experimentation"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7.361"
                        },
                        "CurrentYear": {
                            "val": "5.791"
                        },
                        "BudgetYearOne": {
                            "val": "2.455"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.455"
                        },
                        "BudgetYearTwo": {
                            "val": "0.509"
                        },
                        "BudgetYearThree": {
                            "val": "0.518"
                        },
                        "BudgetYearFour": {
                            "val": "0.525"
                        },
                        "BudgetYearFive": {
                            "val": "0.536"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "Army Experimentation is the conduct of experiments involving Soldiers and Leaders within live, virtual, and constructive environments of exploring concepts, capability requirements and solutions across Doctrine, Organization, Training, Materiel, Leadership and Education, Personnel, and Facilities (DOTMLPF) domains in order to learn and mitigate risk for current and future forces.  Experiments inform Army future concepts and assess high-risk conceptual assumptions in order to focus required capabilities and represent the user's requirements in the future Army.  TRADOC's partnership with ASA(ALT) in connecting Soldiers to the ideas and capabilities earlier rather than later, provides essential user feedback and assists the acquisition community with informing the Army's investment portfolio and decreasing the number of engineering design changes.  Army experiments use the combined resources of Army battle laboratories, operational units, research labs, materiel developers, industry and academia to collaborate in the development, refinements, and assessment of future force concepts - to inform capability developments and validate concepts for current and future force.  Due to significant reduction in funding, beginning in FY15, Research, Development, Test and Evaluation (RDT&E) funding will focus on Simulated Experiments (SIMEX) to integrate and assess Army Concepts, Force Designs, and Capabilities.  In the near-term, Army experimentation will focus on Prevent, Shape, and Win as foundational elements for this campaign, assessed across all joint campaign phases, with Army level issues across the breadth of a champaign that highlights integration of Army 2020 initiatives."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Experimentation - World Class Blue Force (WCBLUFOR) Analysts"
                                    },
                                    "Description": {
                                        "val": "Experimentation with future concepts requires commanders who understand those concepts, but military personnel are generally proficient in current doctrine, not future Army concepts.  The WCBLUFOR bridge this gap with experienced commanders who are versed in future Army concepts.  These subject matter experts provide technical and tactical expertise, play senior blue roles in experiments, develop orders, train and mentor staff, and provide analytic expertise.  Requisite skill sets that are not available on our TDAs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.524"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "WCBLUFOR assisted and mentored planning, execution and evaluation of experiments supporting Army capstone, operational and functional concepts to provide credible incorporation of concepts into experiments.  WCBLUFOR also supported analysis and coordination for the Army's Campaign of Learning - both what we have learned and what remains to be learned."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.400"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "WCBLUFOR assists and mentors planning, execution and evaluation of experiments supporting Army capstone, operational and functional concepts to provide credible incorporation of concepts into experiments.  WCBLUFOR also supports analysis and coordination for the Army's Campaign of Learning - both what we have learned and what remains to be learned."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Experimentation - Maneuver Brigade Experiments"
                                    },
                                    "Description": {
                                        "val": "Perform maneuver brigade experiments that will address 1) integration of Army in 2020 initiatives;  2) development of future Infantry Bridgade Combat Team (IBCT), Stryker Bridgade Combat Team (SBCT), and Airborne Brigade Combat Team (ABCT) capability Doctrine, Organization, Training, Materiel, Leadership and Education, Personnel and Facilities (DOTMLPF)  requirements and DOTMLPF solutions; and  3) acceleration and integration of capabilities for current force Brigade Combat Teams (BCTs)."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.200"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct experiments to address learning demands supporting assigned Army Warfighting Challenges (AWFC).  Results will inform the Integrated Learning Plan for each AWFC; specifically supporting concepts and Formation Based Analysis."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Experimentation - High-Fidelity Live-Virtual-Constructive Experiments"
                                    },
                                    "Description": {
                                        "val": "Experiments address concept and capability developments including integration of capabilities for all BCT types; development of future Doctrine, Organization, Training, Materiel, Leadership and Education, Personnel and Facilities (DOTMLPF) requirements and solutions; and acceleration and integration of capabilities for current force Brigade Combat Teams (BCTs) and above brigade."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.837"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Experiments continued to address learning demands supporting critical Army Warfighting Challenges (AWFC); capstone, operational and concepts; and Formation Based Analysis.  Experiments supported learning in order to mitigate risk to Soldiers and developments providing tangible insurance against acquisition failure as well as a means to win the first battle of the next war."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.191"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Experiments continue to address learning demands supporting critical Army Warfighting Challenges (AWFC); capstone, operational and concepts; and Formation Based Analysis.  Experiments support learning in order to mitigate risk to Soldiers and developments providing tangible insurance against acquisition failure as well as a means to win the first battle of the next war."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.455"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.455"
                                            },
                                            "Text": {
                                                "val": "Simulated Experiments (SIMEX) will become the focus to integrate and assess Army Concepts, Force Designs, and Capabilities."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "317"
                    },
                    "ProjectTitle": {
                        "val": "Current Force Capability Gaps"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "15.619"
                        },
                        "CurrentYear": {
                            "val": "14.581"
                        },
                        "BudgetYearOne": {
                            "val": "15.870"
                        },
                        "BudgetYearOneBase": {
                            "val": "15.870"
                        },
                        "BudgetYearTwo": {
                            "val": "20.443"
                        },
                        "BudgetYearThree": {
                            "val": "40.339"
                        },
                        "BudgetYearFour": {
                            "val": "36.413"
                        },
                        "BudgetYearFive": {
                            "val": "39.089"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "Training and Doctrine Command (TRADOC) lead for Accelerated Capability Developments (ACD) to address current critical operational needs.  Enable development and deployment\/employment of accelerated capabilities (both materiel and non-materiel) to the current force.  Serve as TRADOC central coordinating organization for Headquarters Department of the Army (HQDA) staff support requirements related to accelerated capabilities developments.  Integrate ACD activities to ensure unity and priority of effort and synchronization and optimization of resources.  Integrate accelerated capabilities development activities between proponent force modernization domains to include Joint\/Service coordination.  Provide specialized capabilities development and integration at TRADOC Centers of Excellence."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Counter Improvised Explosive Device Adapt the Force (AtF) (formerly Improvised Explosive Device (IED) Integrated Concept Development Team (ICDT))"
                                    },
                                    "Description": {
                                        "val": "The IED ICDT is responsible for conducting Doctrine, Organization, Training, Materiel, Leadership and Education, Personnel, and Facilities (DOTMLPF) assessments; performs gap analyses identified by HQDA and Joint Urgent Operational Needs Statement (JUONS)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.447"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Lead the Adapt the Force efforts under Army Counter-IED (CIED) Strategy supporting development and maintenance of AtF CIED database and resolution of DOTMLPF issues associated with integration of various CIED initiatives.  Was responsible for coordination and faciliating IED-Defeat Council of Colonels and General Officer Steering Committees producing guidance and directives for Army-wide IED-Defeat Training initiative and systems.  Supported TRADOC CoEs with CIED SMEs and products for all CIED Lines of Effort."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.800"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Lead the Adapt the Force efforts under Army Counter-IED (CIED) Strategy supporting development and maintenance of AtF CIED database and resolution of DOTMLPF issues associated with integration of various CIED initiatives.  Responsible for coordination and facilitating IED-Defeat Council of Colonels and General Officer Steering Committees producing guidance and directives for Army-wide IED-Defeat Training initiative and systems.  Support TRADOC CoEs with CIED SMEs and products for all CIED Lines of Effort."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Will lead the Adapt the Force efforts under Army Counter-IED (CIED) Strategy supporting development and maintenance of AtF CIED database and resolution of DOTMLPF issues associated with integration of various CIED initiatives.  Will be responsible for coordination and facilitating IED-Defeat Council of Colonels and General Officer Steering Committees producing guidance and directives for Army-wide IED-Defeat Training initiative and systems.  Will support TRADOC CoEs with CIED SMEs and products for all CIED Lines of Effort."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aerial Sensor Portfolio"
                                    },
                                    "Description": {
                                        "val": "Funding is needed to support the Aerial Sensor Portolio."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.280"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Aerial Sensor Portfolio (excluding Task Force Observe, Detect, Indentify, and Neutralize - TF ODIN systems) supported the accelerated developments of directed, ONS-based, quick reaction aerial sensor capabilities (Desert Owl I and II, Radiant Falcon, Copperhead II, Black Kite).  Supported improved Aerial Intelligence, Surveillance, and Reconnaissance (ISR) Information System processing.  Consisted of aerial sensor and command control systems organized to defeat assigned threats in current operational environments by integrating collection and analysis of intelligence data, shorten sensor to responder timelines, and facilitate planning, sensor cueing, data collection, and communications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Communications and Networks Portfolio"
                                    },
                                    "Description": {
                                        "val": "Funding is needed for Communications and Networks Portfolio."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.535"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Communications and Network Portfolio capabilities include Intelligence, Surveillance, and Reconnaissance (ISR) Net, Trojan Swarm, Heterogeneous Aerial Reconnaissance Team (HART), Enroute Mission Planning and Rehearsal System (EMPRS), Army Cellular Capability Development and Connecting Soldiers to Digital Applications (CSDA).  Task was to support development, deployment, and assessment of communications and networking of these and other directed systems to provide the Warfighter a network connectivity with mission command applications.  Network provides single user interface, including aerial tier, capable of assessing all required data applications, and service via the common operating environment.  Network supported distributed and small unit operations beyond line-of-sight with focus on Company and below Brigade and Battalion mission command on-the-move capabilities.  Additionally network reduced dependence on satellite communications when connectivity is lost."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Operational Energy (formerly Demo\/Assess Operational Power and Energy)"
                                    },
                                    "Description": {
                                        "val": "Funding is needed for Operational Power and Energy"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.846"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "TRADOC Accelerated Capability Developments supported TRADOC Power and Energy staff management and integration responsibilities.  Supported proponents with their responsibilities relative to doctrine, organization, training, material, leader development and education, personnel, and facilities plus related matters.  Leveraged Proponent input to Joint Capabilities Integration and Development System, Science and Technology, Concept Development, Capability Development for Rapid Transition, and Capability Gap Analysis Army."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue acceleration of Operational Energy initiative for remote Combat Outposts and Soldier Power initiatives.  Operational Energy provides the warfighter with increased levels of agility, flexibility, and interoperability when operating in the expeditionary environment.  Operational energy solutions approach extend combat and tactical system's mission endurance and resilence, ensure uninterrupted and optimal energy to systems within the mission command network, and mitigate force risk by reducing energy demand.  Phase two of multi-phased approached supports development of integrated operational energy solutions will require a system-of-systems engineering approach.  This approach ensures that designs identify and address effects on the force when delivering solutions provide necessary employment guidance and assess impacts on operational effectiveness."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Will continue acceleration of Operational Energy initiative for remote Combat Outposts and Soldier Power initiatives.  Operational Energy will provide the warfighter with increased levels of agility, flexibility, and interoperability when operating in the expeditionary environment.  Operational energy solutions will approach extend combat and tactical systems' mission endurance and resilence, ensure uninterrupted and optimal energy to systems within the mission command network, and mitigate force risk by reducing energy demand.  Phase two of multi-phased approached will support development of integrated operational energy solutions will require a system-of-systems engineering approach.  This approach will ensure that designs identify and address effects on the force when delivering solutions provide necessary employment guidance and assess impacts on operational effectiveness."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Integrated Protection Initiative (IPI)"
                                    },
                                    "Description": {
                                        "val": "Funds are needed for Integrated Protection Initiative."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.468"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "TRADOC Accelerated Capability Developments initiative provided integration and assessment support across DOTMLPF domains to equip, train, and deploy capability support for OEF problem of isolated maneuver elements at Command Outposts (COPs)\/Forward Operating Bases (FOBs) which have difficulty locating ground targets and lack timely response to engage these targets in organic, lethal, effects while minimizing collateral damage and exposure of Soldiers to unnecessary risk."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Army Expeditionary Warrior Experiment (AEWE) (formerly Prototype Solution Demonstrations)"
                                    },
                                    "Description": {
                                        "val": "AEWE addresses live, prototype experimentation requirements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.200"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "AEWE addresses live, prototype experimentation requirements with a primary focus on the Soldier and Small Unit, examining concepts and capabilities for the current and future force.  AEWE provided Capability Developers, the S&T community and industry a repeatable, credible, rigorous, and validated operational experiment venue to support DOTMLPF concepts and materiel development efforts.  FY13 focussed on Spiral H and J support."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.760"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "This campaign of experiments is critical at the Maneuver Center as we conduct research, development, and experimentation to ensure our future Maneuver Force is prepared and equipped to fight and win in a complex operating environment.  Through doctrine development, leveraging emerging technology and partnering with industry, the Maneuver Center in an advocate for the Maneuver Force.  FY14 campaign of experiments, Spiral I, is focused on technologies to support five primary study areas: Cellular Communications, Robotics, Solider Load and Protection, Power Solutions and Resupply."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "This campaign of experiments will be critical at the Maneuver Center as we conduct research, development, and experimentation to ensure our future Maneuver Force is prepared and equipped to fight and win in a complex operating environment.  Through doctrine development, leveraging emerging technology and partnering with industry, the Maneuver Center in an advocate for the Maneuver Force.  FY15 campaign of experiments, Spiral J, will be focused on technologies to support five primary study areas: Cellular Communications, Robotics, Solider Load and Protection, Power Solutions and Resupply."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Capability Packages (CP)"
                                    },
                                    "Description": {
                                        "val": "Capability Packages are a key element of the Army's transition to a brigade combat team (BCT) modernization strategy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.800"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Capability Packages are the key element of the Army's transition to a brigade combat team (BCT) modernization strategy to build a versatile mix of mobile, networked and combat effective BCTs. Following the Defense Secretary's guidance to accelerate proven solutions, these packages upgrade our units every few years so the best capabilities available at that time go to the Soldiers who need them most, based on the continually evolving combat environment. These bundles of capabilities include doctrine, organization, and training in conjunction with materiel to fill the highest priority shortfalls and mitigate risk for Soldiers. The incremental deliveries are build upon one another as the Army continually adapts and modernizes."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Robotics"
                                    },
                                    "Description": {
                                        "val": "Testing and demonstration of increased unmanned ground vehicle capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.325"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Tested and demonstrated increasingly capable unmanned ground vehicles in four separate categories (soldier transportable, self transportable, vehicle transportable, and applique) through venues such as the Robotics Rodeo, Mounted Maneuver Battle Lab (MMBL), and Brigade Modernization Command (BMC) events.  Successful robotic systems was considered for in theater usage and DOTMLPF assessments for transition decisions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.650"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Support the Army robotics Campaign Plan development, and resolution of DOTMLPF issues associated with integration of various Robotics initiatives.  Responsible for participation as member of Joint Ground Robotics Integration Team meetings and in producing guidance and directives for Army-wide Robotic SMEs and products for applicable initiative being resourced and assessed.  Includes initiatives directly related to robotics such as operational control units (OCUs) like Tactical Robotic Controller and systems linked to the controllers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Will support the Army robotics Campaign Plan development, and resolution of DOTMLPF issues associated with integration of various Robotics initiatives.  Will be responsible for participation as member of Joint Ground Robotics Integration Team meetings and in producing guidance and directives for Army-wide Robotic SMEs and products for applicable initiative being resourced and assessed.  Will include initiatives directly related to robotics such as operational control units (OCUs) like Tactical Robotic Controller and systems linked to the controllers."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tunnel Detection (TD)"
                                    },
                                    "Description": {
                                        "val": "Test and demonstration of sensor technology."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.175"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Tested and demonstrated a suite of sensor technology systems capable of detecting, exploiting, and remediating, clandestine purpose-built tunnels."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Will test and demonstrate a suite of sensor technology systems capable of detecting, exploiting, and remediating, clandestine purpose-built tunnels."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Exploitation"
                                    },
                                    "Description": {
                                        "val": "Document and Media Exploitation (DOMEX) is the collection and exploitation of captured equipment, documents, and media."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.400"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Document and Media Exploitation (DOMEX) Tactical, operational, and strategic leaders are enabled with accurate information about enemy forces through the rapid and accurate extraction, exploitation, and analysis of captured enemy documents, media, and materiel. Tactically, DOMEX is the collection and exploitation of captured equipment, documents, and media to generate actionable intelligence. The DOMEX is a critical part of target exploitation, especially as it relates to actions on the objective during site exploitation activities. Efforts in exploitation also support Special Operations Command (SOCOM) with DOTMLPF assessments of classified solutions supporting technical reconnaissance, and information operations associated with exploitation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Document and Media Exploitation (DOMEX) Tactical, operational, and strategic leaders are enabled with accurate information about enemy forces through the rapid and accurate extraction, exploitation, and analysis of captured enemy documents, media, and materiel. Tactically, DOMEX is the collection and exploitation of captured equipment, documents, and media to generate actionable intelligence. The DOMEX is a critical part of target exploitation, especially as it relates to actions on the objective during site exploitation activities. Efforts in exploitation also support Special Operations Command (SOCOM) with DOTMLPF assessments of classified solutions supporting technical reconnaissance, and information operations associated with exploitation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Non Standard Training Gap Initiative (formerly Non-Standard Capability Training Gaps)"
                                    },
                                    "Description": {
                                        "val": "Training for accelerated capabilites is accomplished primarily through mandated New Equipment Training (NET) with no process for follow on efforts.  This incongruity is detrimental to effective and consistent training for the force."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.143"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The Army has not established an approved mechanism to train non-standard equipment within operational formations or CoEs.  This deficiency compels training independent of evaluated\/verifiable methods.  There is minimal assistance in the development of Training Support Packages (TSP) and varying levels of oversight to validate if the maximum benefit of the training and capability has been attained.  This incongruity is detrimental to effective and consisitent training for the force.  Training for accelerated capabilities is accomplished primary through mandated New Equipment Training (NET) with no process for follow on efforts.  Supported TRADOC CoEs in development of Pilot Training Programs to establish process for the integration on non-standard capability training."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.129"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Lead the Non Standard Equipment (NSE) training process initiative supporting the development, execution, evaluation, and maintenance of the 2nd pilot program to develop a standardized and effective NSE training process for deployed units.  ARCIC Accelerated Capabilities Division (ACD) is responsible for facilitating and coordinating stakeholders in the execution, evaluation, and maintenance of Pilot Program 2 on the NSE training process."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.170"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.170"
                                            },
                                            "Text": {
                                                "val": "Will lead the Non Standard Equipment (NSE) training process initiative supporting the development, execution, evaluation, and maintenance of the 2nd pilot program to develop a standardized and effective NSE training process for deployed units.  ARCIC Accelerated Capabilities Division (ACD) will be responsible for facilitating and coordinating stakeholders in the execution, evaluation, and maintenance of Pilot Program 2 on the NSE training process."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tower Hawk"
                                    },
                                    "Description": {
                                        "val": "Provides support to development, integration, and equiping of solutions to the field for integrated base defense while providing long range pinpoint offensive action."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.500"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Provides support to  development, integration, and equiping of solutions to the field for integrated base defense while providing long range pinpoint offensive action against insurgents identified in hostile acts.  ACD provides the integration efforts across DOTMLPF as part of coordination and facilitation efforts between Project Offices, TRADOC CoEs, and test agencies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Small Unit Learder Situational Awareness Tool (SULSAT)"
                                    },
                                    "Description": {
                                        "val": "Supports the Army Robotics Campaign Plan initiatives by addressing DOTMLPF issues associated with integration of emerging Robotics initiatives."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.002"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Provides support to the Army Robotics Campaign Plan initiatives by addressing DOTMLPF issues associated with integration of emerging Robotics initiatives such as Small Unit Leader Situational Awareness Tools (SULSAT).  This requires cutting-edge technology in multiple fields, including high speed graphics computing, 3-D imaging, virtual reality, and visualization.  This capability will be able to visualize internal and external structures of buildings as well as potential threats, and then disseminate that information to soldiers and small-unit leaders."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Black Kite"
                                    },
                                    "Description": {
                                        "val": "Micro Air Vehicle (MAV) with increased sensor capability in support of Army Counter-IED (CIED) Strategy."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.740"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Micro Air Vehicle (MAV) with increased sensor capability in support of Army Counter-IED (CIED) Strategy associated with integration of various (CIED initiatives.  Supports Army-wide IED-Defeat Training initiatives and systems.  Coordinated and integrated with TRADOC CoEs with CIED SMEs and products for all CIED Line of Efforts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Contractor Year Equivalent (CME) Support to TRADOC Capability Development and Integration Directorates (CDIDs)"
                                    },
                                    "Description": {
                                        "val": "Provides CMEs to CDIDs across TRADOC to develop and integrate capabilities."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.700"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.700"
                                            },
                                            "Text": {
                                                "val": "Will provide approximately 45 CMEs to CDIDs across TRADOC to develop and integrate the capabilities for which the ASA(ALT) community is developing and fielding materiel solutions.  FY14 would have been the first year of incremental funding until 100% of the requirement is funded in FY 2017 and beyond."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Squad Dismounted Non-Network Enabled"
                                    },
                                    "Description": {
                                        "val": "Provides integration and assessment support across DOTMLPF."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "TRADOC Accelerated Capability Developments initiative provides integration and assessment support across DOTMLPF domains to equip, train, and deploy capability support for OEF problem of isolated maneuver elements at Command Outposts (COPs)\/Forward Operating Bases (FOBs) which have difficulty locating ground targets and lack timely response to engage these targets in organic, lethal, effects while minimizing collateral damage and exposure of Soldiers to unnecessary risk."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "33B"
                    },
                    "ProjectTitle": {
                        "val": "Soldier-Centered Analyses For Future Force"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.740"
                        },
                        "CurrentYear": {
                            "val": "1.874"
                        },
                        "BudgetYearOne": {
                            "val": "1.114"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.114"
                        },
                        "BudgetYearTwo": {
                            "val": "1.197"
                        },
                        "BudgetYearThree": {
                            "val": "1.205"
                        },
                        "BudgetYearFour": {
                            "val": "1.214"
                        },
                        "BudgetYearFive": {
                            "val": "1.251"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project will provide early application of human performance and human figure modeling tools in the development of Soldier-focused requirements to shape technology for Future Force development. Design analyses, constructive simulations and Soldier-in-the-loop assessments will ensure that manpower requirements and workload and skill demands are considered to avoid information and physical task overloads, and take optimum advantage of aptitudes, individual and collective training, and numbers of Soldiers for an affordable Future Force. The cited work is consistent with the Strategic Planning Guidance, the Army Science and Technology Master Plan (ASTMP), the Army Modernization Plan, and the Defense Technology Area Plan (DTAP). Work in this project is performed by the Army Research Laboratory (ARL)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Manpower and Personnel Integration (MANPRINT)"
                                    },
                                    "Description": {
                                        "val": "Provide dedicated modeling and analysis cell for early and accurate MANPRINT estimates to Army Materiel Command (AMC), Research, Development, and Engineering Command (RDECOM) and its Research, Development, and Engineering Centers (RDECs), TRADOC Centers, Schools and Centers of Excellence (CoEs), Army Test and Evaluation Command (ATEC) and other service laboratories."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.740"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed analysis methodology to link Human Systems Integratino (HSI) risk mitigation (i.e. specific system design changes) to manpower and health care cost avoidance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.874"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop and demonstrate model based links between Systems Engineering (SE) and MANPRINT tools and methods to leverage common data elements and resources to better inform acquisition tradeoff decisions.Develop analysis methodology to link Human Systems Integratino (HSI) risk mitigation (i.e. specific system design changes) to manpower and health care cost avoidance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.114"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.114"
                                            },
                                            "Text": {
                                                "val": "Will develop analysis methodologies to quantitatively predict (in dollars and\/or mission success) the effect of manpower, personnel, and training issues in system acquisition to inform optimization of Soldier-system performance and affordability."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}