{
    "id": "3e45e0cc4d00497f840252b265b664884bcc60d1",
    "meta": {
        "filename": "dod-2015_RDTE_2015_DLA_RDTE_JustificationBook_Defense_Logistics_Agency_PB_2015.zzz_unzipped_RDTE_JustificationBook_Defense_Logistics_Agency_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Defense Logistics Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0708011S"
        },
        "ProgramElementTitle": {
            "val": "Industrial Preparedness Manufacturing Technology (IP ManTech)"
        },
        "R1LineNumber": {
            "val": "239"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Defense Logistics Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "43.601"
            },
            "PriorYear": {
                "val": "24.191"
            },
            "CurrentYear": {
                "val": "22.291"
            },
            "BudgetYearOne": {
                "val": "22.366"
            },
            "BudgetYearOneBase": {
                "val": "22.366"
            },
            "BudgetYearTwo": {
                "val": "22.729"
            },
            "BudgetYearThree": {
                "val": "23.137"
            },
            "BudgetYearFour": {
                "val": "23.543"
            },
            "BudgetYearFive": {
                "val": "24.197"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Defense Logistics Agency (DLA) Industrial Preparedness Manufacturing Technology (IP ManTech) Program supports the development of a responsive, world-class manufacturing capability to affordably meet the warfighters’ needs throughout the defense system life cycle.  IP ManTech: Provides the crucial link between invention and product application to speed technology transitions.  Matures and validates emerging manufacturing technologies to support low-risk implementation in industry and Department of Defense (DoD) facilities, e.g. depots and shipyards.  Addresses production issues early by providing timely solutions.  Reduces risk and positively impacts system affordability by providing solutions to manufacturing problems before they occur.  \n\nDLA ManTech includes Combat Rations Network for Technology Implementation (CORANET), Customer Driven Uniform Manufacturing (CDUM), Procurement Readiness Optimization—Advanced Casting Technology (PRO-ACT), Procurement Readiness Optimization—Forging Advance System Technology (PRO-FAST), and Material Acquisition Electronics (MAE) and Battery Network (BATTNET).  As well as, Other Congressional Add (OCA) programs that are Congressionally Directed efforts."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "27.044"
                },
                "CurrentYear": {
                    "val": "24.691"
                },
                "BudgetYearOne": {
                    "val": "25.021"
                },
                "BudgetYearOneBase": {
                    "val": "25.021"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "24.191"
                },
                "CurrentYear": {
                    "val": "22.291"
                },
                "BudgetYearOne": {
                    "val": "22.366"
                },
                "BudgetYearOneBase": {
                    "val": "22.366"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.853"
                },
                "CurrentYear": {
                    "val": "-2.400"
                },
                "BudgetYearOne": {
                    "val": "-2.655"
                },
                "BudgetYearOneBase": {
                    "val": "-2.655"
                }
            },
            "AdjustmentDetails": {
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-2.400"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.067"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.978"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Program Changes"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.036"
                                },
                                "BudgetYearOne": {
                                    "val": "-2.655"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.655"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Sequestration"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-1.772"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Other Program Changes (Budget Control Act 2011): \nFY2015 - $2.655M\n\nLower funding will cause a significant disruption and delay for critical DLA Manufacturing Technology projects.  Reductions to the Combat Rations Program means microwave technology processing which more efficiently processes combat rations will not be ready for industrial implementation driving up support costs.  Reductions to the Customer Driven Uniform Manufacturing means the needed collaboration capability the GAO identified among the Services, DLA and the industrial base not be in place leading to non-conforming products and excess costs.  Casting Program reductions will result in cancellation of efforts that lowers costs and improves environmental compliance.  Other casting projects' schedules will be extended which will increase DOD costs.  The reduction to the forging program means new forging technology will not be implemented in the industrial base causing weapon systems' support costs to increase and readiness levels reduced.  Reductions to the Battery Network project means that new battery technology vital to operational forces may not be available in the quantities needed for emergencies at a reasonable cost."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "1"
                    },
                    "ProjectTitle": {
                        "val": "Combat Rations (CORANET)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "3.269"
                        },
                        "PriorYear": {
                            "val": "1.735"
                        },
                        "CurrentYear": {
                            "val": "1.880"
                        },
                        "BudgetYearOne": {
                            "val": "1.593"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.593"
                        },
                        "BudgetYearTwo": {
                            "val": "1.621"
                        },
                        "BudgetYearThree": {
                            "val": "1.654"
                        },
                        "BudgetYearFour": {
                            "val": "1.681"
                        },
                        "BudgetYearFive": {
                            "val": "1.739"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "In FY 2010, DLA Troop Support Subsistence sold $4.7 billion in subsistence goods and services to the Department of Defense and other customers.  The Rations portion of this business was $702M in FY 2010.  The Combat Rations R&D funding request is .002% of sales. The Combat Rations Program is focused on improving the manufacturing technologies related to the production and distribution of the combat rations that are at the forefront of these operations, including Meals Ready to Eat (MREs) as well as Unitized Group Rations (UGR).  The objectives are increased readiness, improved quality, optimum sizing for transportation and storage; and better ration variety.  CORANET research efforts also help control the cost of the combat rations.  The CORANET program engages all elements of the supply chain including the producers, military Services, Army Natick Soldier Research Development and Engineering Center, United States Department of Agriculture (USDA), US Army Veterinary Command, US Army Public Health Command, DLA Logistics R&D, DLA Troop Support Subsistence and academia to research and transition improved technologies for operational rations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Combat Rations Accomplishments\/Plans"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.735"
                                            },
                                            "Text": {
                                                "val": "Transitioned STPs 3009, Temperature Sensitivity of Frozen Foods; 3012, Knurled Seat Bar Implementation; 3013, Test Methodology Directional Tear; and 3014, Non-destructive Test for Measuring Tray Compressibility. \n\nDeveloped new Short Term Projects for MRE Menu Bag Assembly Line Automation, Process Validation projects for tray pack food, institutional-sized and individual-sized packages using Microwave Assisted Thermal Sterilization (MATS); and energy conservation for manufacturing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.880"
                                            },
                                            "Text": {
                                                "val": "Transition STPs 3006, MRE Assembly Improvement: Optimization Model for Packaging; Transition STP 3008, Improved Thermal Processing of Foods Sealed in Polymeric Trays; and 3015, Continuous Retort Processing.    STP 3012, Implementation Knurled Heat Seal Bar and Destructive Test Protocol; STP 3013, Test Methodology Directional Tear; STP 3014, Measuring Tray Compressibility during Non-Destructive Seal Strength Test.   \n\nDevelop new Short Term Projects for MRE Menu Bag Assembly Line Automation, Process Validation projects for tray pack food, institutional-sized and individual-sized packages using Microwave Assisted Thermal Sterilization (MATS); and focus on energy conservation for manufacturing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.593"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.593"
                                            },
                                            "Text": {
                                                "val": "Complete Phase II of STP 3015, Continuous Retort Processing.  Supply Chain Process Validation and Efficiency Improvement projects, incorporation of new USDA regulations into process improvement or enhancement projects, and evaluate energy reduction project options for reducing manufacturing costs.  Develop innovated packaging and packaging methods and reduce production lead times and improve production capacity."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics include improved quality, decreased cost and improved acceptance of military combat rations.  The performance objective is to transition 50% of completed projects to the industrial base.   Cost benefit analysis is performed on the CORANET portfolio annually."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2"
                    },
                    "ProjectTitle": {
                        "val": "Customer Driven Uniform Manufacturing (CDUM) (Previously called Apparel Research Network)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "7.199"
                        },
                        "PriorYear": {
                            "val": "4.032"
                        },
                        "CurrentYear": {
                            "val": "4.039"
                        },
                        "BudgetYearOne": {
                            "val": "3.421"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.421"
                        },
                        "BudgetYearTwo": {
                            "val": "3.481"
                        },
                        "BudgetYearThree": {
                            "val": "3.553"
                        },
                        "BudgetYearFour": {
                            "val": "3.612"
                        },
                        "BudgetYearFive": {
                            "val": "3.735"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Department of Defense, through the Defense Logistics Agency, purchased over $1.9 billion of clothing and textile items in FY 2012. The lead-time is up to 15 months for these items. The MUST Program will form a community of practice to research and develop knowledge based technologies for a common approach that could be used by the Services, DLA and Industry in the development of item requirements, and production of military uniform and individual equipment items.   Starting in FY 15, the MUST program will be initiated. The major focus will be to develop knowledge based capability to access and collaborate on requirements among Services, DLA and Industrial Base.  The objective is to reduce the lead time and cost of developing and fielding new combat uniforms and individual equipment."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Customer Driven Uniform Manufacturing Accomplishments\/Plans"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.032"
                                            },
                                            "Text": {
                                                "val": "•  DLA Troop Support Clothing & Textiles continued to implement the CDUM developed Item level RFID technology at the Navy and Army Recruit Training centers through 2014.\n•  Item RFID Technology for Government Furnished Material (GFM) successfully completed at and transitioned to Peckham 3PL.\n•  GFM Reconciliation Module for audit readiness completed and transitioned to Troop Support Clothing & Textiles."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.039"
                                            },
                                            "Text": {
                                                "val": "CDUM II transition to MUST with the continuation of the TDP project.  This new initiative, MUST, addresses gaps in product specifications by exploring a flexible environment that integrates multiple input and output formats to improve management, configuration control and communication between the Government and Defense Industrial Base manufacturers. Technical initiatives include developing a semantic data driven product data environment. Data mining will be adapted to populate the data models. The primary benefit will be a significant reduction in TDP errors and improved data access by the multiple tiers of industrial base.  \nThe MUST BAA closed in early FY 14.  Contract actions are underway and awards to MUST Partners are anticipated by the third quarter of 2014.  The MUST Roadmap is being developed."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.421"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.421"
                                            },
                                            "Text": {
                                                "val": "MUST will initiate new projects with MUST Partners as defined by the MUST Roadmap."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "The CDUM program focus is on clothing and individual equipment (CIE).  The cost benefit analysis for the RFID initiative has demonstrated improvements in inventory accuracy through reductions in adjustments.  \n\nCost benefit analyses are performed on CDUM initiatives on an ongoing basis."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3"
                    },
                    "ProjectTitle": {
                        "val": "Procurement Readiness Optimization-Advanced System Technology (PRO-ACT)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "4.835"
                        },
                        "PriorYear": {
                            "val": "2.447"
                        },
                        "CurrentYear": {
                            "val": "2.506"
                        },
                        "BudgetYearOne": {
                            "val": "2.139"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.139"
                        },
                        "BudgetYearTwo": {
                            "val": "2.176"
                        },
                        "BudgetYearThree": {
                            "val": "2.220"
                        },
                        "BudgetYearFour": {
                            "val": "2.257"
                        },
                        "BudgetYearFive": {
                            "val": "2.333"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Weapon system spare parts which use castings are responsible for a disproportionate share of backorders.  Cast parts are 2% of National Stock Numbered parts but represent 4% of all backorders, and when only the oldest backorders are considered, up to 10% of them are castings.  This program develops innovative technologies and processes to improve the procurement, manufacture, and design of weapon system spare parts that use castings.  The Procurement Readiness Optimization-Advanced Casting Technology (PRO-ACT) program takes a systems view and considers not only the Defense Logistics Agency (DLA) perspective but also the Military Service Engineering Support Activities (ESA) which DLA works with to solve technical issues, as well as the industrial supply base.  The program has three components:  Rapid Acquisition, Quality, and Cost Effectiveness."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Procurement Readiness Optimization-Advanced Casting Technology Accomplishments\/Plans"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.447"
                                            },
                                            "Text": {
                                                "val": "Continued development of the new projects under the three major R&D initiatives for castings: 1) improved castings inspection methods such as Digital Radiography for magnesium & copper based castings; 2) improved casting materials & processes such as rapid tooling & prototyping using on demand melting and lightweight high strength cast alloys process; additive manufacturing of airfoil investment casting cores by ceramic stereolithography; and 3) process modeling for lube-free die casting, steel casting performance and refinement of cast part performance in the presence of discontinuities. Conducted technical review in conjunction with the annual JDMTP Metals Subpanel review of all ManTech projects."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.506"
                                            },
                                            "Text": {
                                                "val": "Continue work on projects, reviewing progress. Conduct technical review in conjunction with the annual JDMTP Metals Subpanel review of all ManTech projects."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.139"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.139"
                                            },
                                            "Text": {
                                                "val": "Continue work on projects, reviewing progress. Complete work on Ceramic Sterolithography to build Casting cores for jet engine airfoil such as blades and vanes. Conduct technical review in conjunction with the annual JDMTP Metals Subpanel review of all ManTech projects."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Awarded two base task order contracts competitively through a Broad Agency Announcement (BAA).  Task order contracts for projects have also been awarded."
                        },
                        "PerformanceMetrics": {
                            "val": "This program has a business case that justifies the investment in terms of economic and readiness benefits."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "4"
                    },
                    "ProjectTitle": {
                        "val": "Procurement Readiness Optimization-Forging Advanced System Technology (PRO-FAST)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "2.288"
                        },
                        "PriorYear": {
                            "val": "1.172"
                        },
                        "CurrentYear": {
                            "val": "1.201"
                        },
                        "BudgetYearOne": {
                            "val": "1.026"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.026"
                        },
                        "BudgetYearTwo": {
                            "val": "1.043"
                        },
                        "BudgetYearThree": {
                            "val": "1.064"
                        },
                        "BudgetYearFour": {
                            "val": "1.082"
                        },
                        "BudgetYearFive": {
                            "val": "1.119"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Weapon system spare parts that use forgings are responsible for a disproportionate share of DLA backorders.  Forged parts are ~2% of National Stock Numbered parts but represent ~4% of all backorders, and when only the oldest backorders are considered, up to 10% of them are forgings. This program develops methods and technology to improve the supply of forged parts.  This program takes a holistic view of the problem and attacks root causes inside DLA, at DLA’s engineering support activity partners in the Services, and at DLA forging suppliers.  The program has three thrusts:  Business Enterprise Integration to improve supply support approaches; FORGE-IT to develop and improve technical problems; and R&D which develops new technology for forging suppliers, including new methods for making forge dies (typically the longest lead time item) and for simulation of metal flow inside the forge die (to eliminate trial and error development of the die)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Procurement Readiness Optimization-Forging Advanced System Technology Accomplishments\/Plans"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.172"
                                            },
                                            "Text": {
                                                "val": "Finalized projects under current initiative, such as software for lean six sigma process improvements at forges; deployed theMaterial Process Optimization software, which is a multi-material, multi-method evaluation tool. Posted new Broad Agency Announcement (BAA) in FedBizOps on August 20, 2013 requesting proposals for new R&D projects for next tasks and projects. Conducted a technical review in conjunction with the annual JDMTP Metals Subpanel review of all ManTech projects."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.201"
                                            },
                                            "Text": {
                                                "val": "The open Broad Agency Announcement (BAA) requesting proposals for new R&Dprojects closed October 7, 2013.  On December 23, 2013 the BAA was re-opened with an Area of Interest added and one deleted.  The BAA closed again on February 6, 2014.  Will evaluate proposals and award contract(s) for any promising and appropriate projects. Plan to begin work on new projects as soon as they're awarded. Will conduct a technical review in conjunction with the annual JDMTP Metals Subpanel review of all new ManTech projects."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.026"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.026"
                                            },
                                            "Text": {
                                                "val": "Continue work on projects, reviewing progress. Conduct technical review in conjunction with the annual JDMTP Metals Subpanel review of all ManTech projects."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "A Broad Agency Announcement (BAA) is planned."
                        },
                        "PerformanceMetrics": {
                            "val": "This program has a business case which justifies the investment in terms of economic and readiness benefits."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "5"
                    },
                    "ProjectTitle": {
                        "val": "Material Acquisition Electronics (MAE)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "23.341"
                        },
                        "PriorYear": {
                            "val": "13.002"
                        },
                        "CurrentYear": {
                            "val": "10.789"
                        },
                        "BudgetYearOne": {
                            "val": "12.185"
                        },
                        "BudgetYearOneBase": {
                            "val": "12.185"
                        },
                        "BudgetYearTwo": {
                            "val": "12.373"
                        },
                        "BudgetYearThree": {
                            "val": "12.576"
                        },
                        "BudgetYearFour": {
                            "val": "12.804"
                        },
                        "BudgetYearFive": {
                            "val": "13.112"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Develop a capability to emulate most obsolete digital integrated circuits (ICs) in the Federal catalog using a single, flexible manufacturing line.  DoD has estimated $2.9 billion is spent every five years redesigning circuit card assemblies.  Many of these circuit card redesigns are performed to mitigate IC obsolescence.  Commercial ICs have short Product Life Cycles (often only 18 months).  IC Manufacturers subsequently move on to later generations of ICs, leaving little to no sources for their previous IC products.  DoD maintains weapons systems much longer than IC lifecycles, resulting in an obsolescence problem.  In order to avoid costs and potential readiness issues associated with buying\/carrying excess inventories acquired before commercial availability ceases, or redesigning the next higher assembly to mitigate the obsolete IC, DLA (as the manager of 88% of the IC Federal Stock Class) must have the capability to manufacture needed IC devices."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Material Acquisition Electronics Accomplishments\/Plans"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.002"
                                            },
                                            "Text": {
                                                "val": "MAE has transitioned additional fully-developed and verified high speed emitter-coupled logic production capability to source critical high demand NSNs lacking supply. MAE continued to formulate device family targets for a Linear Emulation thrust.  It continued a 250 nanometer Emulation fabrication process (High Performance (speed) and Density) development providing additional FSC 5962 coverage.  It continued 350 nanometer Emulation fabrication process development, bringing new capabilities to the Customers and Agency.  It incorporated more advanced Integrated Circuit Characterization tool advancements into the Emulation flow, enabling supply for non-procurables.  The tool also provided a value-added capability for our Customers’ technical data packages."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.789"
                                            },
                                            "Text": {
                                                "val": "MAE will continue specific process, design, and test verification developments in its new Linear Emulation thrust, augmenting our span of FSC 5962. MAE will transition additional A flexible NMOS\/PMOS Digital Microcircuit Emulation capability into full-scale production increasing DLA’s ability to re-establish sourcing of non-procurable microcircuit NSNs.  MAE will also transition higher density Read-Only and Random-Access Memory Emulation capability into full-scale production further increasing DLA’s ability to re-establish sourcing of non-procurable microcircuit NSNs. The newly transitioned Emulation capabilities will address several discontinued device families and will increase the potential Emulation production envelope by several hundred NSNs. MAE will continue 350 and 250 nanometer Emulation fabrication process development, bringing new capabilities to the Customers and Agency."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.185"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.185"
                                            },
                                            "Text": {
                                                "val": "MAE will continue specific process, design, and test verification developments in its Linear Emulation thrust. It will continue planning for the specific Emulation technology implementations to support specific device family groups in consonance with Customer and Agency requirements. It will continue prototyping 350 nanometer Emulation circuitry, bringing Emulation capability that re-establishes sources for additional NSNs.  It will continue 250 nanometer Emulation fabrication process development providing additional FSC 5962 coverage in its Digital Emulation thrust."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Transition of one technology implementation (base array) to low-rate initial production or full-scale production."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "6"
                    },
                    "ProjectTitle": {
                        "val": "Battery Network (BATTNET)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "2.669"
                        },
                        "PriorYear": {
                            "val": "1.803"
                        },
                        "CurrentYear": {
                            "val": "1.876"
                        },
                        "BudgetYearOne": {
                            "val": "2.002"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.002"
                        },
                        "BudgetYearTwo": {
                            "val": "2.035"
                        },
                        "BudgetYearThree": {
                            "val": "2.070"
                        },
                        "BudgetYearFour": {
                            "val": "2.107"
                        },
                        "BudgetYearFive": {
                            "val": "2.159"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "BATTNET is focused on improving the supply and reducing the cost of procured batteries used in fielded weapon systems, such as communication radios and armored vehicles. Batteries exhibit dynamic challenges for military logistics. BATTNET is a community of practice of battery supply chain members, engineering support activities, researchers, and users. BATTNET conducts R&D to address sustainment gaps and bridge technical solutions into higher MRLs for specific groups of batteries. For FY2013, DLA received 130,600 orders for 2.76 million batteries at $177M net value - compared to FY12 $216M and FY11 $234M."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "BATTNET Accomplishments\/Plans"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.803"
                                            },
                                            "Text": {
                                                "val": "BATTNET developed production capabilities in higher performance Li-CFx soldier batteries with Ultralife (Newark, NY), BCF Solutions (Hollywood, MD) and EaglePicher (Joplin, MO); partnered with IBIF program for advanced military lithium-ion battery production capabilities at Quallion LLC (Sylmar, CA) and Saft America (Cockeysville, MD); started initiatives with US Army to extend lead-acid battery life and conduct lithium-ion battery manufacturing study at Navitas Systems LLC (Woodridge, IL and Ann Arbor, MI); pursued battery manufacturing advances with DLA SBIR projects."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.876"
                                            },
                                            "Text": {
                                                "val": "BATTNET has identified several Short Term Projects: Expanding low cost electrode production capabilities (Eskra Technical Products, Saukville, WI) and innovative manufacturing methods for low cost battery materials. A new BAA will be issued to refresh partnerships."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.002"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.002"
                                            },
                                            "Text": {
                                                "val": "R&D will continue to be performed through identification and awards of new Short Term Projects (STP) with an expected duration of 18-24 months and an average funding of $200K-$500K per year.  STP proposals are required to include a business case with specific metrics and transition plan for success. BATTNET will also pursue additional battery manufacturing advances from successful DLA SBIR projects."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The BATTNET R&D partners were established by contract September 2009 through a competitive Broad Area Announcement (BAA) allowing for maximum competition. Partner Contracts were based upon proposals that demonstrated knowledge, experience, and expertise in the following areas of interest: Automation, Battery Maintenance, Competition & Contracting Requirements, Diminishing Manufacturing & Supply, Lithium Battery Safety, Reducing Acquisition Costs, Shelf Life, Supply Chain Logistics, Surge\/Sustainment, and Technology Transition\/Insertion. The BATTNET, which includes a Government Steering Group (GSG) of power source technical experts from the military services R&D groups, is informed of general R&D requirements for supply chain improvement. The partners develop among themselves related R&D projects, which are then formally evaluated by the GSG. Selected projects are then chartered within DLA and planned for contract STP awards when funds are available."
                        },
                        "PerformanceMetrics": {
                            "val": "Each Short Term Project (STP) will have performance metrics appropriate to its scope. Also all STPs will include a business case to demonstrate return on investment, or a readiness case to calculate warfighter impact versus costs."
                        }
                    }
                }
            ]
        }
    }
}