{
    "id": "3e7b6c002608626c7f1d2dec9555c5b174fb024e",
    "meta": {
        "filename": "dod-2015_RDTE_2015_NAVY_BA7_RDTE_JustificationBook_Navy_PB_2015.zzz_unzipped_RDTE_JustificationBook_Navy_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0708011N"
        },
        "ProgramElementTitle": {
            "val": "Industrial Preparedness"
        },
        "R1LineNumber": {
            "val": "228"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "209.057"
            },
            "PriorYear": {
                "val": "64.411"
            },
            "CurrentYear": {
                "val": "50.933"
            },
            "BudgetYearOne": {
                "val": "37.169"
            },
            "BudgetYearOneBase": {
                "val": "37.169"
            },
            "BudgetYearTwo": {
                "val": "54.987"
            },
            "BudgetYearThree": {
                "val": "55.741"
            },
            "BudgetYearFour": {
                "val": "56.749"
            },
            "BudgetYearFive": {
                "val": "57.850"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Manufacturing Technology (ManTech) program is intended to improve the productivity and responsiveness of the U.S. defense industrial base by funding the development and transition of leading edge manufacturing technologies.  The ManTech program is executed through a Center of Excellence (COE) strategy.  A majority of the COEs are consortium based with only a small group of technical and management personnel at the center.  ManTech projects are primarily performed by industry participants that bill the COE which, in turn, bills the Navy which causes a non-traditional financial execution profile for the program.  The program therefore does not meet traditional execution benchmarks.  The ManTech program, by providing seed funding for the development of moderate to high risk process and equipment technology, permits contractors to upgrade their manufacturing capabilities.  Ultimately, the program aims to produce high-quality weapon systems with shorter lead times and reduced acquisition costs.\n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "54.879"
                },
                "CurrentYear": {
                    "val": "50.933"
                },
                "BudgetYearOne": {
                    "val": "51.269"
                },
                "BudgetYearOneBase": {
                    "val": "51.269"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "64.411"
                },
                "CurrentYear": {
                    "val": "50.933"
                },
                "BudgetYearOne": {
                    "val": "37.169"
                },
                "BudgetYearOneBase": {
                    "val": "37.169"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "9.532"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-14.100"
                },
                "BudgetYearOneBase": {
                    "val": "-14.100"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.256"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.129"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.284"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.284"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.001"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-13.816"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-13.816"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-6.082"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional Add Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "18.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Not applicable.\n\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "1050"
                    },
                    "ProjectTitle": {
                        "val": "Manufacturing Tech"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "209.057"
                        },
                        "PriorYear": {
                            "val": "47.911"
                        },
                        "CurrentYear": {
                            "val": "50.933"
                        },
                        "BudgetYearOne": {
                            "val": "37.169"
                        },
                        "BudgetYearOneBase": {
                            "val": "37.169"
                        },
                        "BudgetYearTwo": {
                            "val": "54.987"
                        },
                        "BudgetYearThree": {
                            "val": "55.741"
                        },
                        "BudgetYearFour": {
                            "val": "56.749"
                        },
                        "BudgetYearFive": {
                            "val": "57.850"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The ManTech Program is intended to improve the productivity and responsiveness of the U.S. defense industrial base by funding the development of manufacturing technologies.  Major areas of endeavor both underway and planned include:  advanced manufacturing technology for metalworking, joining, electronics and electro-optics, composites, shipbuilding, and above-the-factory-floor business operations technology.  The ManTech Program is aimed at assisting acquisition programs in meeting performance and affordability goals by inserting manufacturing process solutions early into the design phase.\n\nThe budget levels for FY13, FY14 and particularly FY15 are lower than they have traditionally been due to DON decisions to re-baseline programs. For FY16 and beyond the budget returns to the prior profile."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "COMPOSITES PROCESSING AND FABRICATION"
                                    },
                                    "Description": {
                                        "val": "The primary technical goal of the Composites Processing and Fabrication activity is improving weapon systems affordability, enhancing weapon system effectiveness and improving reliability \/ war-fighter readiness through the increased utilization of composite materials and structures. This is being achieved through the development and maturation of affordable, robust manufacturing and assembly processes that fully exploit the benefits of composite materials. Concentration is on affordability for the following platforms: DDG-51, CVN-78 Class Carrier, VIRGINIA Class Submarine (VCS) \/ OHIO Replacement Program(ORP), and Littoral Combat Ship (LCS), and the Joint Strike Fighter (JSF). \n\nReductions from FY 14 to FY 15 reflect DON decisions to re-baseline programs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.335"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued Composite Materials and Process Improvement Thrust for VCS Shipbuilding Affordability Initiative. Includes continuation of efforts to develop \/ optimize composite materials fabrication technology for reduced cost VCS construction.\n- Continued Composite Materials and Process Improvement Thrust for DDG-51 Shipbuilding Affordability Initiative.\n- Continued Composite Materials and Process Improvement Thrust for CVN-78 Shipbuilding Affordability Initiative.\n- Continued Composite Materials and Process Improvement Thrust for Air Platforms,  including the Joint Strike Fighter (JSF). \n- Continued Composite Materials and Process Improvement Thrust for LCS Shipbuilding Affordability Initiative"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.669"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue efforts of FY 2013."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.750"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.750"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete Composite Materials and Process Improvement Thrust for VCS Shipbuilding Affordability Initiative. Includes continuation of efforts to develop \/ optimize composite materials fabrication technology for reduced cost VCS construction. \nContinue all FY 2014 efforts unless otherwise noted as complete.\nInitiate - Composite Materials and Process Improvement Thrust for VCS\/ORP Shipbuilding Affordability Initiative."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "CORPORATE INVESTMENTS"
                                    },
                                    "Description": {
                                        "val": "The Corporate Investments activity is focused on accelerating defense industrial enterprise progress toward implementation of world-class industrial practices as well as advanced design and information systems that support weapon system development, production, and sustainment. Key emphasis areas include: 1) Benchmarking and accelerating the implementation of world-class industrial practices throughout the contractor base; 2) Demonstrating and validating advanced business practices and information technologies capable of streamlining management functions in all industrial base tiers; and 3) Leveraging information technologies in pursuit of tighter coupling of all defense industrial enterprise elements. Corporate Investment efforts create improvements to cost and cycle time for weapon system development, production, and repair. Additionally, Corporate Investments include the funding of recently identified near-term high priority affordability efforts for the following affordability platforms:  DDG-51, CVN-78 Class Carrier, VIRGINIA Class Submarine (VCS), Littoral Combat Ship (LCS), as well as the Joint Strike Fighter (JSF). \n\nFunding increase from FY13 to FY14 supports additional investments in the advanced manufacturing enterprise area focused on above the shop floor and production planning activities.\n\nReductions from FY 14 to FY 15 reflect DON decisions to re-baseline programs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.997"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued Near-Term High Priority Shipbuilding Affordability Thrust for CVN-78.\n- Continued Near-Term High Priority Shipbuilding Affordability Thrust for LCS.\n- Continued efforts to improve the Navy industrial base through above-the-factory-floor enhancements and supply chain processes\/technology improvements for Navy weapon system acquisition programs such as the DDG-51, CVN-78, LCS, VCS, and others.\n- Continued Near-Term, High Priority Shipbuilding Affordability Thrust for DDG-51.\n- Continued Near-Term High Priority Shipbuilding Affordability Thrust for VCS.\nInitiate Near-Term High Priority Affordability Thrust for JSF."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.764"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue efforts of FY 2013."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.319"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.319"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete Near-Term High Priority Shipbuilding Affordability Thrust for VCS. \nContinue all FY 2014 efforts unless otherwise noted as complete. \nInitiate Near-Term High Priority Shipbuilding Affordability Thrust for VCS\/ORP."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "ELECTRONICS PROCESSING AND FABRICATION"
                                    },
                                    "Description": {
                                        "val": "Electronics Processing and Fabrication efforts develop and deploy affordable, robust manufacturing processes and capabilities for electronics critical to defense applications over their full life cycle. Efforts create new and improved manufacturing processes on the shop floor, as well as repair and maintain facilities such as depots and logistics centers, with a strong emphasis on process maturation. Emphasis is on affordability for the following shipbuilding platforms: DDG-51, CVN-78 Class Carrier, VIRGINIA Class Submarine (VCS) \/ OHIO Replacement Program (ORP), and Littoral Combat Ship (LCS), with some funding geared towards toward electronics \/ electro-optics improvements for high priority air platforms such as the Joint Strike Fighter (JSF).\n\nReductions from FY 14 to FY 15 reflect DON decisions to re-baseline programs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.526"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued Electronics\/Electro-Optics Thrust for VCS Affordability Initiative. Includes continuation of improved affordable electronics\/electro-optics efforts.\n- Continued Electronics\/Electro-Optics Thrust for LCS Shipbuilding Affordability Initiative.\n- Continued Electronics\/Electro-Optics Thrust for Air Platforms, including the Joint Strike Fighter (JSF). Includes continuation of electronics\/electro-optics efforts to improve affordability for Air Platforms.\n- Continued Electronics\/Electro-Optics Thrust for DDG-51 Shipbuilding Affordability Initiative. Includes radar\/communications efforts to impact DDG-51 affordability.\n- Continued Electronics\/Electro-Optic Thrust for CVN-78 Shipbuilding Affordability Initiative. Includes continuation of electronics\/electro-optics efforts to improve affordability for CVN-78 Class Carrier."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue efforts of FY 2013."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.050"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.050"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete Electronics\/Electro-Optics Thrust for VCS Affordability Initiative. Includes continuation of improved affordable electronics\/electro-optics efforts. \nContinue all FY 2014 efforts unless otherwise noted as complete. \nInitiate Electronics\/Electro-Optics Thrust for VCS\/ORP Affordability Initiative.  Includes electronics\/electro-optics efforts to improve affordability for VCS\/ORP."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "METALS PROCESSING AND FABRICATION"
                                    },
                                    "Description": {
                                        "val": "The objective of the Metals Processing and Fabrication activity is to develop affordable, robust manufacturing processes and capabilities for metals and special materials critical to defense weapon system applications. Major areas that support this objective include: processing methods, special materials, joining, and inspection and compliance. These efforts directly impact the cost and performance of future aircraft, rotorcraft, land combat vehicles, surface and subsurface naval platforms, space systems, artillery and ammunition, and defense industry manufacturing equipment. Emphasis is on affordability for the following shipbuilding platforms: DDG-51, CVN-78 Class Carrier, VIRGINIA Class Submarine (VCS) \/ OHIO Replacement Program (ORP), and Littoral Combat Ship (LCS), with some funding geared toward metals processing and fabrication improvements for high priority air platforms such as the Joint Strike Fighter (JSF). \n\nFunding decrease from FY13 to FY14 reflects ramp up of the  JSF project portfolio with less emphasis on metals processing technology.\n\nReductions from FY 14 to FY 15 reflect DON decisions to re-baseline programs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.146"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued schedule Compression\/Production Engineering Thrust for VCS Shipbuilding Affordability Initiative.\n- Continued outfitting Thrust for VCS Shipbuilding Affordability Initiative.\n- Continued rapid response efforts.\n- Continued Metals Materials and Process Improvement Thrust for DDG-51 Shipbuilding Affordability Initiative. Metallic materials and process efforts for DDG-51 include material characterization for optimum processing and fabrication as well as process optimization (welding, bonding, machining, etc.) resulting in reduced cost of fabrication for DDG-51 components.\n- Continued Metals Materials and Process Improvement Thrust for CVN-78 Shipbuilding Affordability Initiative. Metallic materials and process efforts for CVN 78 include material characterization for optimum processing and fabrication as well as process optimization (welding, bonding, machining, etc.) resulting in reduced cost of fabrication for CVN 78 components.\n- Continued Metals Thrust for Littoral Combat Ship (LCS) Shipbuilding Affordability Initiative.\n- Continued Metals Materials and Process Improvement Thrust for VCS Shipbuilding Affordability Initiative. Metallic materials and process efforts for VCS include material characterization for optimum processing and fabrication as well as process optimization (welding, bonding, machining, coating\/cladding, etc.) resulting in reduced cost of fabrication for VCS components.\n- Continued Metal Materials and Process Improvements Thrust for Other Ship\/NAVSEA Platforms.\n- Continued Metals Materials and Process Improvement Thrust for Air Platforms.\n- Continued Metal Materials and Process Improvements Thrust for Marine Corps Systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.100"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue efforts of FY 2013."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.950"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.950"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete Metals Materials and Process Improvement Thrust for VCS Shipbuilding Affordability Initiative.\nContinue all FY 2014 efforts unless otherwise noted as complete.  Initiate Metals Materials and Process Improvement  Thrust for VCS\/ORP initiative."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "OTHER (SHIPBUILDING, REPAIR TECH, ENERGETICS, AND TECHNICAL ENGINEERING SUPPORT)"
                                    },
                                    "Description": {
                                        "val": "The \"Other\" activity includes shipbuilding technology, repair technology, energetics, and technical engineering support. Shipbuilding technology primarily addresses the development of manufacturing process improvements for shipyards and is geared towards affordability efforts for the following shipbuilding platforms: DDG-51, CVN-78 Class Carrier, VIRGINIA Class Submarine (VCS) \/ OHIO Replacement Program (ORP), and Littoral Combat Ship (LCS). Repair technology addresses repair, overhaul, and sustainment functions that emphasize remanufacturing processes and advancing technology. Energetics efforts concentrate on developing energetics solutions to ensure the availability of safe, affordable, and quality energetics products largely in support of Program Executive Office (PEO) Integrated Warfare Systems (IWS)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.907"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued Shipbuilding Affordability Thrust for CVN-78.\n- Continued Shipbuilding Affordability Thrust for VCS.\n- Continued Shipbuilding Affordability Thrust for LCS.\n- Continued Shipbuilding Affordability Thrust for DDG-51.\n- Continued Shipbuilding Thrust for Other Ship\/NAVSEA Platforms.\n- Continued Repair Technology Thrust for repair and sustainment of Navy weapons systems. Includes continuation of Repair Technology projects based on high priority depot needs.\n- Continued Energetics Thrust for PEO IWS and Other Acquisition Programs. Includes continuation of energetics efforts to support PEO IWS and other acquisition programs.\n- Continued to provide technical engineering support for the ManTech Program."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.400"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue efforts of FY 2013."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.100"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.100"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete Shipbuilding Affordability Thrust for VCS.\nContinue all FY 2014 efforts unless otherwise noted as complete.  Initiate Shipbuilding Affordability Thrust for VCS\/ORP."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Efforts are focused on affordability reduction for the following: DDG Family, CVN-78 Class Carrier, Littoral Combat Ship (LCS), the VIRGINIA Class Submarine (VCS) \/ OHIO Replacement Program (ORP), and the Joint Strike Fighter (JSF)."
                        },
                        "PerformanceMetrics": {
                            "val": "The ManTech program's overall goal is to transition production technology to reduce the cost of Navy weapons systems. Metrics are currently collected on the cost savings per hull or per aircraft for each of the five primary affordability platforms: DDG-51, CVN-78 Class Carrier, VIRGINIA Class Submarine\/OHIO Replacement Program (VCS\/ORP), Littoral Combat Ship (LCS), and Joint Strike Fighter (JSF)."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0708011N_1050_FILE1.PNG"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0708011N_1050_FILE2.PNG"
                                }
                            }
                        ]
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "9999"
                    },
                    "ProjectTitle": {
                        "val": "Congressional Adds"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "16.500"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "16.500"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional interest items not included in other projects."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Industrial Preparedness (Cong)"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "16.500"
                                        },
                                        "Text": {
                                            "val": "The purpose of the funding is to accelerate Navy ManTech shipbuilding affordability initiatives and is to be allocated proportionally to the following major shipbuilding categories: aircraft carriers, large surface combatants, small surface combatants, attack submarines and amphibious warfare ships.  Progress executing this funding includes soliciting affordability project ideas from the shipbuilding industry producing these platforms via the Navy ManTech COEs, prioritizing project candidates based on overall proposal strength and combined ranking by the acquisition program office and industry.  A project portfolio has been developed for each platform totaling approximately the $3.3M allocated and is ready for final approval and execution."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Congressional add"
                        }
                    }
                }
            ]
        }
    }
}