{
    "id": "3ed1fd0f6ed8ab399ab333309192120b0156675c",
    "meta": {
        "filename": "dod-2015_RDTE_2015_AIRFORCE_V2_RDTE_JustificationBook_Air_Force_PB_2015.zzz_unzipped_RDTE_JustificationBook_Air_Force_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604617F"
        },
        "ProgramElementTitle": {
            "val": "Agile Combat Support"
        },
        "R1LineNumber": {
            "val": "71"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "21.145"
            },
            "CurrentYear": {
                "val": "17.036"
            },
            "BudgetYearOne": {
                "val": "46.340"
            },
            "BudgetYearOneBase": {
                "val": "46.340"
            },
            "BudgetYearTwo": {
                "val": "58.060"
            },
            "BudgetYearThree": {
                "val": "50.350"
            },
            "BudgetYearFour": {
                "val": "17.280"
            },
            "BudgetYearFive": {
                "val": "17.483"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "In FY15, Project 652895, CE Readiness, includes a New Start for Airfield Protection.\nIn FY15, Project 654910, Aeromedical Readiness, includes a New Start for Non-Invasive Warming and Cooling Device (NIWCD)."
        },
        "ProgramElementMissionDescription": {
            "val": "This program supports the vision of Agile Combat Support (ACS), which is to provide an integrated and interoperable mission-ready total force capable of delivering responsive, persistent, effective, and affordable support across the range of military operations to achieve joint effects. To this end, ACS is challenged to provide lighter, leaner, rapidly-deployable and technologically-advanced materiel and forces; timelier planning and execution capabilities; and more agile, responsive, and efficient sustainment capabilities to the warfighter. Consequently, this program provides capabilities to field, base, protect, support, and sustain air, space, and cyberspace forces with an intentional focus on efficiency and effectiveness. Current projects in this program provide Civil Engineering Readiness (BPAC 652895) and Aeromedical Readiness (BPAC 654910). Civil Engineering Readiness projects enable rapid deployment, defense, and sustainment of airfield operations within established timelines anywhere in the world. Aeromedical Readiness projects provide aerospace medical systems and treatment equipment to meet unique, worldwide warfighter medical operational requirements.   \n\nBA 5 - This program is in Budget Activity 5, Engineering and Manufacturing Development (EMD) because it has passed Milestone B approval and is conducting engineering and manufacturing development tasks aimed at meeting validated requirements prior to full-rate production."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "13.059"
                },
                "CurrentYear": {
                    "val": "17.036"
                },
                "BudgetYearOne": {
                    "val": "24.109"
                },
                "BudgetYearOneBase": {
                    "val": "24.109"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "21.145"
                },
                "CurrentYear": {
                    "val": "17.036"
                },
                "BudgetYearOne": {
                    "val": "46.340"
                },
                "BudgetYearOneBase": {
                    "val": "46.340"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "8.086"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "22.231"
                },
                "BudgetYearOneBase": {
                    "val": "22.231"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.034"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "13.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-2.275"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.327"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-2.278"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "22.231"
                                },
                                "BudgetYearOneBase": {
                                    "val": "22.231"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY13 adjustments include a $13M Congressional add for power generation and storage research, -$2.275M for internal Air Force reprogramming and -$2.278M for sequestration reductions.\nFY15 increase is to accelerate Airfield Damage Repair and Airfield Protection efforts."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "652895"
                    },
                    "ProjectTitle": {
                        "val": "CE Readiness"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "19.245"
                        },
                        "CurrentYear": {
                            "val": "14.175"
                        },
                        "BudgetYearOne": {
                            "val": "44.903"
                        },
                        "BudgetYearOneBase": {
                            "val": "44.903"
                        },
                        "BudgetYearTwo": {
                            "val": "56.585"
                        },
                        "BudgetYearThree": {
                            "val": "48.771"
                        },
                        "BudgetYearFour": {
                            "val": "15.670"
                        },
                        "BudgetYearFive": {
                            "val": "15.843"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "In FY15, Project 652895, CE Readiness, includes a New Start for Airfield Protection."
                        },
                        "ProjectMissionDescription": {
                            "val": "This Civil Engineering (CE) Readiness project develops airfield assessment, repair, and unexploded ordnance identification, removal, disposal, and mitigation capabilities to enable rapid recovery and regeneration of airfield operations within established time limits.  This project develops and transitions infrastructure design criteria, construction methods and materials, and evaluation tools for both main operating bases and forward operating locations.  This project also provides efficient and effective Basic Expeditionary Airfield Resources (BEAR) capabilities to support forward deployed airfields in bare-base locations or augment existing airfield infrastructure in support of joint operations.  All of these efforts enable air superiority.\n\nBA 5 - This program is in Budget Activity 5, Engineering and Manufacturing Development (EMD) because it has passed Milestone B and is conducting engineering and manufacturing development tasks aimed at meeting validated requirements prior to full-rate production."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Power Generation and Storage Research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "11.847"
                                        },
                                        "Text": {
                                            "val": "Develop Basic Expeditionary Airfield Resources (BEAR) System for Load and Installation Management (BSLIM) and Waste-to-Energy Systems. This effort includes autonomous and manual power grid management power grid situational awareness; contingency base waste-to-energy system; power outage management; thermal comfort energy reduction; and evaluation of overall energy consumption to spread demand more evenly."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Airfield Damage Repair"
                                    },
                                    "Description": {
                                        "val": "This effort develops, tests, and certifies equipment, materials, and Tactics, Techniques, and Procedures (TTPs) for the rapid assessment and repair of airfield damage, which includes identification, mitigation or removal of unexploded ordnance and expedient repairs for fuel and utility systems. This effort also intends to accelerate the transition of proven technologies in expedient and sustained protection of critical infrastructure, including operating surfaces, shelters, fuel storage and distribution systems, and command and control (C2) systems. This effort focuses on the resiliency of airbase infrastructure as well as the timely repair and regeneration of airfield operations within established time limits in order to gain and maintain air superiority."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.475"
                                            },
                                            "Text": {
                                                "val": "Develop rapid airfield damage assessment capabilities; update Geospatial Expeditionary Planning Tool; develop damage plotting tools; automate tools for Minimum Airfield Operating Surface (MAOS) determination and repair quality; develop advanced procedures employing asphalt to repair large craters; improve job mix formula for calculation of locally procured materials; update TTPs as necessary; develop command and control (C2) training products."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "36.778"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "36.778"
                                            },
                                            "Text": {
                                                "val": "Develop rapid assessment and repair of airfield damage, which includes automated identification, mitigation or removal of unexploded ordnance, and rapid setting material storage and transfer capability; develop expeditionary fuel and utility restoration capability; develop aircraft performance data for MAOS selection criteria; conduct detailed engineering development, prototyping, and prototype testing of new systems for expeditionary lighting, fuel storage, fuel distribution, and aircraft shelters."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Recovery of Airbase Denied by Ordnance (RADBO)"
                                    },
                                    "Description": {
                                        "val": "This effort provides capability in support of the Air Force Central Command (AFCENT) need for clearance of Unexploded Ordnance (UXO) during runway and air base recovery operations. It integrates a laser, a robotic arm, and a clearance blade to an existing Air Force Cougar Mine-Resistant Ambush Protected (MRAP) vehicle, for use by AFCENT Explosive Ordnance Disposal (EOD) personnel."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.398"
                                            },
                                            "Text": {
                                                "val": "Successfully demonstrated the dual alternator design required for laser system power. Completed development and optimization of the Zeus laser system. Approved Preliminary and Critical Design Reviews for the RADBO system integration. Fabrication initiated on all parts required to build the prototype RADBO vehicle to be tested in FY14 and FY15."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Basic Expeditionary Airfield Resources (BEAR) Energy Initiatives"
                                    },
                                    "Description": {
                                        "val": "This effort develops, tests, and evaluates BEAR technologies in support of air bases at austere locations and augmentation of bed-down at fixed installations. The BEAR initiative, a joint effort with the Army, focuses on efficiency and economy of resources. This program includes development of smart shelter energy management.  The smart shelter project will develop an autonomous, in-shelter smart control system for expeditionary structures."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.700"
                                            },
                                            "Text": {
                                                "val": "Initiate development of an end-to-end system of BEAR energy reduction technologies by developing BEAR smart shelter system. The smart shelter energy project will reduce deployed base fuel consumption by 25%."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Airfield Protection - New Start"
                                    },
                                    "Description": {
                                        "val": "This effort advances and transitions various solutions for protecting airfield infrastructure (not associated with airfield surfaces) from penetrating threats, whether ballistic and guided.  Included within this effort are structural solutions, expeditionary and expedient hardening and protection solutions, rapid restoration of fuels distribution and storage, hardening criteria, implementation costs, and updated Tactics, Techniques and Procedures (TTPs).  Airfield infrastructure includes buildings, hangars, aircraft and ground equipment, fuels distribution and storage, as well as all other assets on or near airfields.  This effort is designed to advance solutions developed under the Hardened Installation Protection for Persistent Operations (HIPPO) Joint Capability Technology Demonstration (JCTD) and transition for implementation at fixed and expeditionary locations, providing improved resiliency and rapid restoration of airbase and airfield operations following an attack."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.125"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.125"
                                            },
                                            "Text": {
                                                "val": "Begin EMD of technology solutions developed under the HIPPO JCTD.  Correct deficiencies identified in HIPPO.  Define and develop fully integrated solution(s) for hardening and protection identified in HIPPO JCTD.  Begin test and evaluation planning; conduct test and evaluation of new panel designs.  Advance fuel distribution restoration and recovery equipment and methods.  Develop retrofit of sunshades for fighter aircraft.  Advance expedient protection systems for small scale equipment and facilities."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPAF:BA04:845100:PE 0280028F"
                                    },
                                    "Title": {
                                        "val": "Other Base Maintenance Equipment Procurement"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "45.748"
                                        },
                                        "CurrentYear": {
                                            "val": "20.056"
                                        },
                                        "BudgetYearOne": {
                                            "val": "47.726"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "47.726"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "33.382"
                                        },
                                        "BudgetYearThree": {
                                            "val": "11.507"
                                        },
                                        "BudgetYearFour": {
                                            "val": "34.262"
                                        },
                                        "BudgetYearFive": {
                                            "val": "34.879"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The majority of efforts in this project employ a streamlined acquisition approach.  Whenever practical and appropriate, commercial-off-the-shelf (COTS) and modified-COTS will be procured to address mission capability requirements.  Existing contracts will be used, including contracts of other services or agencies; new contracts will be used as appropriate for the type and scope of work needed."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_05_PE_0604617F_BPAC_652895_0.jpg"
                                }
                            }
                        ]
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "654910"
                    },
                    "ProjectTitle": {
                        "val": "Aeromedical Readiness"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.900"
                        },
                        "CurrentYear": {
                            "val": "2.861"
                        },
                        "BudgetYearOne": {
                            "val": "1.437"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.437"
                        },
                        "BudgetYearTwo": {
                            "val": "1.475"
                        },
                        "BudgetYearThree": {
                            "val": "1.579"
                        },
                        "BudgetYearFour": {
                            "val": "1.610"
                        },
                        "BudgetYearFive": {
                            "val": "1.640"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "In FY15, Project 654910, Aeromedical Readiness, includes a New Start for Non-Invasive Warming and Cooling Device (NIWCD)."
                        },
                        "ProjectMissionDescription": {
                            "val": "This program provides tactical and strategic management of combat casualties by further developing and optimizing existing technologies for ground Expeditionary Medical Systems (EMEDS) and Aeromedical evacuation systems.  The program also supports capabilities development in the multi-disciplinary area of aerospace medicine, provides command and control, and supports the collection of medical information via deployable medical automated information systems that provide light-weight, durable, and rapidly deployable medical treatment equipment to meet Air Force medical readiness and operational requirements.\n\nBA 5 - This program is in Budget Activity 5, Engineering and Manufacturing Development (EMD) because it has passed Milestone B and is conducting engineering and manufacturing development tasks aimed at meeting validated requirements prior to full-rate production."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Deployable Oxygen Generation System - Small (DOGS-S)"
                                    },
                                    "Description": {
                                        "val": "This effort designs, develops, and engineers manufacturing capability for a portable oxygen generation system, which provides medical grade, gaseous oxygen for Expeditionary Medical Systems (EMEDS) hospitals and mobile aeromedical staging facilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.306"
                                            },
                                            "Text": {
                                                "val": "Conducted Preliminary Design Review and Critical Design Review."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.242"
                                            },
                                            "Text": {
                                                "val": "Conduct and complete Developmental and Operational Test & Evaluation. Submit approval package for Food & Drug Administration clearance. Initiate Milestone C."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.120"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.120"
                                            },
                                            "Text": {
                                                "val": "Conduct program office oversight and EMD completion."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Field Intravenous Fluid Reconstitution (FIVR)"
                                    },
                                    "Description": {
                                        "val": "This effort designs, develops, and tests the FIVR system, which produces intravenous fluids for treating critical casualties in Expeditionary Medical Systems (EMEDS) hospitals and mobile aeromedical staging facilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.017"
                                            },
                                            "Text": {
                                                "val": "Completed Developmental Test & Evaluation. Conduct rampdown and closeout."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Non-Invasive Warming and Cooling Device (NIWCD) - New Start"
                                    },
                                    "Description": {
                                        "val": "Single device to provide therapeutic temperature control (hyperthermia\/hypothermia) during treatment and movement of patient from point of injury through the continuum of care. The mortality in combat casualties with hypothermia is double that of normothermic casualties with similar injuries. Cooling the patient is required to treat hyperthermia and is also advantageous when treating brain injuries."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.610"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.610"
                                            },
                                            "Text": {
                                                "val": "Conduct concept activities and development."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aeromedical Systems Planning, Studies, and Analysis"
                                    },
                                    "Description": {
                                        "val": "This effort is for foundational studies, requirements analysis, and product demonstrations to satisfy aeromedical operational needs. Define acquisition strategies and baselines for potential system solutions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.577"
                                            },
                                            "Text": {
                                                "val": "Conducted Shelter Vestibule testing for Collective Protection in contaminated environments. War Reserve Materiel (WRM) Modernization Study identified operational gaps in current technology and business processes and identified courses of action (COA) to improve information technology (IT) management and leverage modern business practices, software, hardware, and infrastructure to efficiently support the execution of Expeditionary Medical Systems (EMEDS) missions. Field Intravenous Fluid Reconstitution (FIVR) follow-on technical study identified manufacturing processes to reduce the cost of producing intravenous bags in theater."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.619"
                                            },
                                            "Text": {
                                                "val": "Conduct foundational studies, requirements analysis, and product demonstrations to satisfy aeromedical operational needs. Define acquisition strategies and baselines for potential system solutions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.707"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.707"
                                            },
                                            "Text": {
                                                "val": "Conduct foundational studies, requirements analysis, and product demonstrations to satisfy aeromedical operational needs. Define acquisition strategies and baselines for potential system solutions."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "NA"
                                    },
                                    "Title": {
                                        "val": "NA"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Programs will consider a streamlined acquisition approach. Whenever practical, commercial items are tested and evaluated as candidates for providing solutions to user needs. This normally involves characterization, verification, and qualification testing to ensure commercial off-the-shelf equipment is properly evaluated to identify any capability gaps that may require minor modifications for military use."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_05_PE_0604617F_BPAC_654910_0.jpg"
                                }
                            }
                        ]
                    }
                }
            ]
        }
    }
}