{
    "id": "405216635759c04e99e0352a754461bd114c057d",
    "meta": {
        "filename": "dod-2015_RDTE_2015_AIRFORCE_V1_RDTE_JustificationBook_Air_Force_PB_2015.zzz_unzipped_RDTE_JustificationBook_Air_Force_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602204F"
        },
        "ProgramElementTitle": {
            "val": "Aerospace Sensors"
        },
        "R1LineNumber": {
            "val": "8"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "115.568"
            },
            "CurrentYear": {
                "val": "127.419"
            },
            "BudgetYearOne": {
                "val": "118.343"
            },
            "BudgetYearOneBase": {
                "val": "118.343"
            },
            "BudgetYearTwo": {
                "val": "145.655"
            },
            "BudgetYearThree": {
                "val": "181.374"
            },
            "BudgetYearFour": {
                "val": "179.506"
            },
            "BudgetYearFive": {
                "val": "185.176"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program develops the technology base for Air Force aerospace sensors and electronic combat.  Advances in aerospace sensors are required to increase combat effectiveness by providing anytime, anywhere surveillance, reconnaissance, precision targeting, and electronic warfare capabilities.  To achieve this progress, this program pursues simultaneous advances in:  1) generating, controlling, receiving, and processing electronic and photonic signals for radio frequency (RF) sensor aerospace applications; 2) electro-optical (EO) aerospace sensor technologies for a variety of offensive and defensive uses; 3) RF antennas and associated electronics for airborne and space surveillance, together with active and passive EO sensors; 4) technologies to manage and fuse on-board sensor information for timely, comprehensive situational awareness; and 5) technology for reliable, all-weather surveillance, reconnaissance, and precision strike RF sensors and electronic combat systems.  This program has been coordinated through the Department of Defense (DoD) Science and Technology (S&T) Executive Committee process to harmonize efforts and eliminate duplication.  This program is in Budget Activity 2, Applied Research, since it develops and determines the technical feasibility and military utility of evolutionary and revolutionary sensor, electronics, and electronic combat technologies."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "127.637"
                },
                "CurrentYear": {
                    "val": "127.539"
                },
                "BudgetYearOne": {
                    "val": "130.587"
                },
                "BudgetYearOneBase": {
                    "val": "130.587"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "115.568"
                },
                "CurrentYear": {
                    "val": "127.419"
                },
                "BudgetYearOne": {
                    "val": "118.343"
                },
                "BudgetYearOneBase": {
                    "val": "118.343"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-12.069"
                },
                "CurrentYear": {
                    "val": "-0.120"
                },
                "BudgetYearOne": {
                    "val": "-12.244"
                },
                "BudgetYearOneBase": {
                    "val": "-12.244"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.283"
                    },
                    "CurrentYear": {
                        "val": "-0.120"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.257"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-10.529"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-12.244"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-12.244"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Decrease in FY13 Other Adjustments was due to Sequestration.\nDecrease in FY15 is due to higher DoD priorities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "622002"
                    },
                    "ProjectTitle": {
                        "val": "Electronic Component Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "28.677"
                        },
                        "CurrentYear": {
                            "val": "36.188"
                        },
                        "BudgetYearOne": {
                            "val": "27.169"
                        },
                        "BudgetYearOneBase": {
                            "val": "27.169"
                        },
                        "BudgetYearTwo": {
                            "val": "34.149"
                        },
                        "BudgetYearThree": {
                            "val": "37.253"
                        },
                        "BudgetYearFour": {
                            "val": "38.317"
                        },
                        "BudgetYearFive": {
                            "val": "39.890"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project focuses on generating, controlling, receiving, and processing electronic signals for RF sensor aerospace applications.  The enabling technologies developed under this project will be used for intelligence, surveillance, reconnaissance (ISR), electronic warfare, battlespace access, and precision engagement capabilities.  The technologies developed include exploratory device concepts; solid state power devices and amplifiers; low noise and signal control components; photonic components; high-temperature electronics; signal control and distribution; signal processing; multi-function monolithic integrated circuits; high-speed analog-to-digital and digital-to-analog mixed mode integrated circuits; reconfigurable electronics; power distribution; multi-chip modules; and high density packaging and interconnect technologies.  This project also designs, develops, fabricates, and evaluates techniques for integrating combinations of these electronic component technologies.  The project aims to demonstrate significantly improved military sensors of smaller size, lower weight, lower cost, lower power dissipation, higher reliability, and improved performance.  The device and component technology developments under this project are military unique; they are based on Air Force and other Department of Defense weapon systems requirements in the areas of radar, communications, electronic warfare, navigation, and smart weapons."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Multifunction Sensor Subsystems"
                                    },
                                    "Description": {
                                        "val": "Develop, analyze, demonstrate, and perform engineering trade studies for technologies for compact, affordable, multi-function subsystems for aerospace sensors."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.432"
                                            },
                                            "Text": {
                                                "val": "Completed second round of demonstrations. Using engineering trade analysis, started development of optimized sensor system technology previously demonstrated."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.681"
                                            },
                                            "Text": {
                                                "val": "Develop and demonstrate a capability to predict performance versus lifetime in military relevant environments for a large variety of emerging electronic devices.  Initiate engineering trade analysis, continue development of optimized sensor system technology.  Develop initial trade space models for advanced sensing and electronic warfare front-ends."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.120"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.120"
                                            },
                                            "Text": {
                                                "val": "Continue to develop, refine and demonstrate advanced trade space and prediction tools for emerging devices. Complete engineering trade analysis for baseline sensing system technologies. Continue development of trade space models for advanced system of systems sensing and electronic warfare simulations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Microelectronic\/Optoelectronic Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop and assess new microelectronic\/optoelectronic material, device and fabrication technologies for next generation imaging, precision strike, and battlespace access across all Air Force domains."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.050"
                                            },
                                            "Text": {
                                                "val": "Developed optimized device concepts for multi-use cyber, sensing, warfare and communication applications. Developed and demonstrated a capability to predict performance versus lifetime in military relevant environments for a large variety of emerging electronic devices. Identified key failure mechanisms for electronic device technologies and their corresponding accelerants and chemistry."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.622"
                                            },
                                            "Text": {
                                                "val": "Continue the development of optimized device concepts for multi-use cyber, sensing, warfare and communication applications.  Identify and evaluate concepts for compact, high-performance electro-optic and electronic devices and components.  Synthesize test articles, characterize behavior, and optimize fabrication methods for enhanced devices and components.  Develop tools and methods for analysis and efficient design of game-changing components."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.036"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.036"
                                            },
                                            "Text": {
                                                "val": "Complete device concept baseline for multi-use (sense environments and counter threat) applications. Continue to identify and evaluate concepts for compact, high-performance devices and components. Demonstrate projected gains through characterization of test articles in relevant environments. Continue to develop tools and methods to design and analyze game-changing components."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mixed-Signal Component Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop integrated design, modeling and simulation tools, and integration techniques for complex mixed-signal component development in advanced electronic component technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.526"
                                            },
                                            "Text": {
                                                "val": "Demonstrated microsystem prototypes. Refined trade analysis."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A.  Effort terminated due to higher DoD priorities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Antennas"
                                    },
                                    "Description": {
                                        "val": "Design and develop antennas for airborne and space-based surveillance.  Develop novel and advanced antennas for lightweight, conformal arrays."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.669"
                                            },
                                            "Text": {
                                                "val": "Developed novel antenna concepts for wideband applications. Integrated and demonstrated lightweight conformal phased array aperture."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.305"
                                            },
                                            "Text": {
                                                "val": "Initiate development of optimized antenna concepts for multi-use sensing, electronic warfare and communication applications.  Fabricate and characterize innovative electronic device concepts for wideband, reconfigurable and tunable, and trusted applications.  Demonstrate prototype hardware for agile\/affordable advanced detector arrays with emphasis on combined spectro-polarimetric filtering. Design and fabricate high-brightness and agile waveform sources for integration into components and subsystems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.763"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.763"
                                            },
                                            "Text": {
                                                "val": "Continue to fabricate and characterize innovative devices to extend bandwidth, reconfigurability, tunability and trustworthiness. Continue demonstrations of multi-wavelength, agile and affordable advanced detectors and arrays with emphasis on integrated filtering. Continue the design and fabrication of high-brightness and agile waveform sources to integrate into microsystems and subsystems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Trusted Systems for ISR and Avionics Systems"
                                    },
                                    "Description": {
                                        "val": "Investigate and develop designs of trusted electronic and optoelectronic systems when integrating commercially available solutions (commercial-off-the-shelf(COTS)) with emerging government-off-the-shelf (GOTS) advanced technologies. Areas of development include: multi-function RF and EO subsystems, metamaterials, data compression, high-frequency power modules, EO\/IR sources, EO\/IR detectors, beam control and waveguides, and trusted and reliable electronics."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.580"
                                            },
                                            "Text": {
                                                "val": "Initiate development of optimized device concepts for multi-use cyber, sensing, warfare and communication applications. Fabricate and characterize innovative electronic device concepts for wideband, reconfigurable and tunable, and trusted applications. Demonstrate prototype hardware for agile\/affordable advanced detector arrays with emphasis on combined spectropolarimetric filtering. Design and fabricate high-brightness and agile waveform sources for integration into components and subsystems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.250"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.250"
                                            },
                                            "Text": {
                                                "val": "Continue to identify COTS and GOTS technologies nearly ready or ready for integration into microsystem and subsystem demonstration. Develop, mature and demonstrate solutions utilizing COTs\/GOTs technology that enable  cyber-hardness, rad-hardness and resistance to tampering."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "622003"
                    },
                    "ProjectTitle": {
                        "val": "EO Sensors & Countermeasures Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "21.491"
                        },
                        "CurrentYear": {
                            "val": "23.052"
                        },
                        "BudgetYearOne": {
                            "val": "27.980"
                        },
                        "BudgetYearOneBase": {
                            "val": "27.980"
                        },
                        "BudgetYearTwo": {
                            "val": "34.697"
                        },
                        "BudgetYearThree": {
                            "val": "44.384"
                        },
                        "BudgetYearFour": {
                            "val": "39.842"
                        },
                        "BudgetYearFive": {
                            "val": "42.768"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project determines the technical feasibility of advanced electro-optical aerospace sensor technologies for a variety of offensive and defensive uses.  The sensor technologies under development range from the ultraviolet through the infrared portion of the spectrum.  Related efforts include improvements in avionics integration, digital processing, analysis tools, and sensor architectures.  One of the project's main goals is to improve electro-optical and related technologies for the detection, tracking, and identification of non-cooperative and difficult targets, such as those obscured by camouflage.  This project also develops the passive and active imaging sensors and algorithms needed to enable precision targeting in severe weather. These technologies are critical to future aerospace surveillance and targeting.  Other project goals include advanced electro-optical threat warning and countermeasures."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Non-cooperative Detection and Identification Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop innovative optical sensing technology for non-cooperative detection and identification of airborne and ground-based targets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.124"
                                            },
                                            "Text": {
                                                "val": "Conducted sensor concept demonstrations for long-range target identification using innovative passive and active techniques. Performed longwave hyperspectral change detection experiments to assess model-based algorithms. Conducted laboratory and began field demonstrations of agile multifunction waveforms for long-range, combined temporal synthetic aperture and remote vibrometry waveforms.  Began buildup of linear frequency modulation testbed to support long range performance quantification. Developed signal processing and automated signature recognition algorithms for remote vibrometry."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.076"
                                            },
                                            "Text": {
                                                "val": "Develop innovative sensor concepts to increase long range image quality for passive electro-optical and infrared reconnaissance sensors for high altitude platforms.  Assess fundamental geometrical environmental and atmospheric limitations to system performance. Develop approaches for image restoration.  Continue longwave infrared hyperspectral phenomenology and change detection research."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.435"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.435"
                                            },
                                            "Text": {
                                                "val": "Evaluate, via modeling and simulation, innovative sensor concepts to increase long range image quality for passive electro-optical and infrared reconnaissance sensors for high altitude platforms.  Mature longwave infrared hyperspectral imaging to achieve operationally useful radiometric sensitivity and area coverage rate with a sensor system that is practical and affordable."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Innovative Optical Sensing Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop innovative optical sensing technology to support military operations in dynamic and urban environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.672"
                                            },
                                            "Text": {
                                                "val": "Developed processing methods and sensor requirements for spectral-aided tracking and relocation of targets. Conducted tower demonstrations of multi-aperture transceivers with wavelength and transmitter location diversity. Developed signal processing and automated signature recognition algorithms for remote vibrometry."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "This effort moves to EO\/IR Sensors and Threat Countermeasures in this project to better align efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "EO\/IR Sensors and  Threat Countermeasure Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop optical and infrared sensors for airborne and space situational awareness and threat warning. Develop countermeasure technologies for use against infrared and electro-optical guided missile threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.758"
                                            },
                                            "Text": {
                                                "val": "Conducted the assessment of advanced infrared missiles and infrared acquisition sensors. Developed system requirements for Proactive Infrared Countermeasures (PIRCM) to defeat advance infrared (IR) guided missile and IR acquisition and tracking sensors operating in the near to mid-IR bands. Developed and integrated advanced missile warning sensors to demonstrate situational awareness and countermeasure hand-off capabilities. Developed simulation and hardware-in-the-loop test capability to characterize hardware and evaluate\/test threat warning and countermeasure concepts. Performed technology development of laser IRCM hardware suitable in size, weight and performance for fighter and mobility aircraft."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.215"
                                            },
                                            "Text": {
                                                "val": "Refine modeling and simulations for multiple ladar modes.  Conduct laboratory testing of initial foundry runs of focal planes optimized for three dimensional and holographic imaging.  Continue development of optical materials and devices for improved reliability and performance of mid-infrared lasers operating in harsh environments. Begin test of prototype Silicon Gallium (SiGa) detectors. Start design and fabrication of SiGa focal plane array."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.813"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.813"
                                            },
                                            "Text": {
                                                "val": "Initiate synthetic aperture ladar (SAL) techniques based on modeling and simulation previously conducted  to enhance spatial resolution beyond the diffraction limit of conventional optics through the coherent collection and processing of laser-illuminated scene radiance.  Research the problem of improving system capabilities to provide high confidence target identification at standoff ranges for both reconnaissance and targeting platforms.  Continue evaluation of prototype Silicon Gallium (SiGa) detectors.   Continue design and fabrication of SiGa focal plane array."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Optical Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop optical spectrum transmitter, detector and agile aperture technologies capable of sensing multiple target characteristics for robust non-cooperative target identification and future infrared countermeasure systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.271"
                                            },
                                            "Text": {
                                                "val": "Demonstrated high speed and random access optical phased array scanning with photon counting arrays. Demonstrated increased mid-infrared power and efficiency in waveguide and fiber media to reduce use of coupling optics for improved reliability, and reduced cost of laser sources operating in harsh environments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.761"
                                            },
                                            "Text": {
                                                "val": "Refine and demonstrate candidate component technologies for image stabilization and restoration.  Determine the utility of non-traditional sensor architectures in improving image quality and the operational range of passive imagers.  Initiate prototyping of a flexible, next generation long wave infrared hyperspectral imaging spectrometer."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.732"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.732"
                                            },
                                            "Text": {
                                                "val": "Initiate research in the use of vibrometry and range-Doppler sensing technology to aid in target identification and decoy discrimination at ranges at which the imaging performance is insufficient.  Research will also supports phenomenology understanding, signature collection, sensor product visualization, and automatic target recognition in collaboration with other AFRL directorates. Continue prototyping of a flexible, next generation long wave infrared hyperspectral imaging spectrometer."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Next Generation EO Sensor Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop and fabricate new semiconductor components, materials and techniques with capability to identify military and urban threats, to provide threat warning, and precisely engage targets in cluttered environments. Develop emerging optoelectronic materials, devices and circuits for next generation EO sensors exploiting advanced operational modes such as plasmonics, metamaterials, non-linear optics and quantum optics."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.666"
                                            },
                                            "Text": {
                                                "val": "Developed new semiconductor materials and devices for military-specific applications such as biological agent detection and covert communications, as well as phase-only correlation techniques for automatic target recognition (ATR)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "This effort moves to EO\/IR Sensors and Threat Countermeasure Technologies in this Project to better align efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "626095"
                    },
                    "ProjectTitle": {
                        "val": "Sensor Fusion Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "25.969"
                        },
                        "CurrentYear": {
                            "val": "25.432"
                        },
                        "BudgetYearOne": {
                            "val": "23.486"
                        },
                        "BudgetYearOneBase": {
                            "val": "23.486"
                        },
                        "BudgetYearTwo": {
                            "val": "26.932"
                        },
                        "BudgetYearThree": {
                            "val": "31.500"
                        },
                        "BudgetYearFour": {
                            "val": "34.334"
                        },
                        "BudgetYearFive": {
                            "val": "32.258"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops the technologies required to perform management and fusion of sensor information for timely, comprehensive situational awareness, automatic target recognition, integrated fire control, and bomb damage assessment.  This project determines the feasibility of technologies and concepts for fire control that help to precisely locate, identify, and target airborne and surface targets.  The project emphasizes finding reduced signature targets and targets of opportunity.  It will enable new covert tactics for successful air-to-air and air-to-surface strikes.  This project also develops the technologies required to create trusted autonomic, distributed, collaborative, and self-organizing sensor systems that provide anticipatory and persistent intelligence, surveillance, and reconnaissance (ISR), situational awareness, and decision support for multi-layered sensing.  This program provides the technologies for:  1) trusted sensors and trusted sensor systems that will deter reverse engineering and exploitation of our critical hardware and software technology and impede unwanted technology transfer, alteration of system capability, and prevent the development of countermeasures to U.S. systems; 2) collaborative tasking of our own distributed heterogeneous sensor networks across a region and co-opted tasking of both traditional and non-traditional adversary sensors; 3) secure sensor web backbone technologies, sensor web physical topologies, and related protocols to assure reliable trusted sensor interactions; and 4) defining architectures for distributed trusted collaborative heterogeneous sensor systems and semantic sensor networks, developing new methodologies for system of systems sensor engineering and analysis, and new techniques for sensor network situation awareness and predictive analytics."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Automatic Target Recognition Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop automatic target recognition (ATR), sensor management, and sensor fusion technologies for target detection, tracking, and identification in ISR, and combat identification applications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.139"
                                            },
                                            "Text": {
                                                "val": "Enhanced and assessed physics-based techniques to meet the autonomous target detection and identification requirements for ISR applications. Enhanced multisensor, pixel-level registration techniques as necessary to support requirements. Assessed and developed capabilities to represent and utilize sensor parameters and errors, along with other uncertainty reference information, for improved fused geo-location accuracy and autonomous sensor, processor, and bandwidth management. Researched bio-inspired automatic target recognition technologies, and assessed and evaluated these techniques for all missions with emphasis on urban applications. Conducted assessment in Planning & Direction, Collection, Processing and Exploitation, Analysis and Production, and Dissemination and Experimentation (PCPAD-X) integrative and virtual environments of automatic target recognition, sensor management, and sensor fusion algorithms for urban ISR."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.599"
                                            },
                                            "Text": {
                                                "val": "Assess and enhance physics-based techniques to meet the autonomous target detection and identification, sensor management, and sensor fusion requirements for intelligence, surveillance, and reconnaissance applications, combat identification applications, and PCPAD-X in contested and uncontested environments. Continue to assess and develop capabilities to represent and utilize sensor parameters and errors to improved fused geo-location accuracy. Continue research of bio-inspired automatic target recognition technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.500"
                                            },
                                            "Text": {
                                                "val": "Develop advanced object recognition methods which correlate data from multiple sensors from air, space and cyber domains.  Continue to assess and enhance physics-based techniques to meet the autonomous target detection and identification, sensor management, and sensor fusion requirements for intelligence, surveillance, and reconnaissance applications, combat identification applications, and PCPAD-X in contested and uncontested environments. Continue to assess and develop capabilities to represent and utilize sensor parameters and errors to improved fused geo-location accuracy."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Target Signature Modeling"
                                    },
                                    "Description": {
                                        "val": "Develop, evaluate, and demonstrate target signature models to support  sensor exploitation algorithm development and testing for reconnaissance and strike mission applications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.845"
                                            },
                                            "Text": {
                                                "val": "Matured target signature models for signature exploitation of RF sensors, EO multi-spectral systems, and signals intelligence sensors, emphasizing one target model for application to all parts of the spectrum. Developed signatures, algorithms, and modeling support for multiple radio-frequency and electro-optical phenomenology for automated sensor exploitation of ground targets. Developed signatures, target modeling, and phenomenological modeling of other phenomenological features not previously exploited. Generated synthetic air and ground target signatures with sufficient fidelity to support development and assessment of automatic recognition of targets in realistic mission environments. Developed automatic target recognition algorithm-driven RF sensor design, new modes of operation for existing sensors, and signal processing\/exploitation for high-diversity data."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.180"
                                            },
                                            "Text": {
                                                "val": "Continue to mature target signature models for signature exploitation of multi-spectral systems and signals intelligence sensors emphasizing one target model for application to all parts of the spectrum. Continue the development of signatures, algorithms, target modeling, and phenomenological modeling of features not previously exploited. Continue development of automatic target recognition algorithm-driven radio-frequency sensor design."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.080"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.080"
                                            },
                                            "Text": {
                                                "val": "Continue development of all-source target models for emerging threat systems in contested environments. Create and assess methods for validating all-source signature models. Continue to mature target signature models for signature exploitation of multi-spectral systems and signals intelligence sensors.  Mature promising approaches to develop a single target model for application to all parts of the spectrum."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Sensor Exploitation Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop technical methods required for algorithm performance models, performance driven sensing, layered sensing and other sensing and exploitation technologies impacted by automated exploitation capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.282"
                                            },
                                            "Text": {
                                                "val": "Developed a capability to model the performance of sensor exploitation technologies.  Conducted validation of algorithm performance models to be used in the PCPAD-X integrative and virtual environments. Developed databases and tools required to support performance modeling and assessment. Enhanced development of an integrated, unified automatic target recognition methodology, building upon the modeling and assessment tools developed."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.778"
                                            },
                                            "Text": {
                                                "val": "Continue development of performance models for sensor exploitation technologies, and associated databases and tools.  Continue validation of algorithm performance models to be used in the PCPAD-X integrative and virtual environments.  Continue to enhance development of an integrated, unified ATR methodology."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.500"
                                            },
                                            "Text": {
                                                "val": "Develop novel techniques for analysis of large sensor data sets to discover, characterize, and identify threatening activities in contested environments.  Continue development of sensor resource optimization enablers for autonomous sensor employment.  Continue development and validation of performance models for sensor exploitation technologies.  Demonstrate application of sensor and algorithm performance models in the PCPAD-X integrative and virtual environments.  Continue to enhance development of an integrated, unified ATR methodology through industry and university outreach."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Trusted Sensing Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop, evaluate, and demonstrate methodologies, techniques, and strategies to instill trust in distributed, heterogeneous sensing systems within air, space, and cyber domains."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.267"
                                            },
                                            "Text": {
                                                "val": "Developed advanced trusted sensing services, middleware, and frameworks for multilayered sensing and spectrum warfare.   Developed methods, tools, and processes to determine and assess vulnerability and mission assurance as a function of system scale in complex system-of-systems. Developed methods, tools, and processes to determine and assess vulnerability and mission assurance for complex system-of-systems for spectrum warfare."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.875"
                                            },
                                            "Text": {
                                                "val": "Continue development of advanced trusted sensing services, middleware, and frameworks for multilayered sensing and spectrum warfare. Continue development of methods, tools, and processes to determine and assess vulnerability and mission assurance for complex system-of-systems for spectrum warfare.  Continue development of autonomic trusted sensor technologies to address self-aware, self-healing, and self-organizing sensor systems.  Continue development of detect and response mechanism to remedy software and hardware supply chain vulnerabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.406"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.406"
                                            },
                                            "Text": {
                                                "val": "Initiate research in trusted exploitation algorithms and tools for PC-PAD, defining and quantifying metrics.  Build upon previous work in PCPAD-X to research application of trust metrics in the evaluation of COTs, GOTs, and contractor owned exploitation algorithms and tools to assure the mission."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Anti-Tamper Sensing Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop technologies that enable autonomic trusted features in sensor systems to deter reverse engineering and exploitation of critical military hardware and software systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.779"
                                            },
                                            "Text": {
                                                "val": "Developed integrated software protection and anti-tamper systems for multilayered ISR sensing systems and spectrum warfare applications.  Developed autonomic trusted sensor technologies to address self-aware, self-healing, and self-organizing sensor systems.  Initiated development of detect and response mechanisms to remedy software and hardware supply chain vulnerabilities.  Initiated development of software protection and anti-tamper solutions that integrate universal situational awareness to improve attack monitoring and prediction capabilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Efforts move to Trusted Sensing Technologies in this Project to better align efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi-Layered Sensing Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop trusted and assured avionics system network and integration technology, physical topologies, and protocols to support multi-layered sensing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.657"
                                            },
                                            "Text": {
                                                "val": "Developed avionics system vulnerability testbed.  Completed development of advanced avionics bus technologies for trusted sensing.  Conducted analysis to exploit wired and wireless avionics sensor systems and began analysis of technologies to protect and defend sensor systems.  Initiated assessment of susceptibilities of commercial derivative avionics systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Efforts move to Trusted Sensing Technologies in this Project to better align efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "627622"
                    },
                    "ProjectTitle": {
                        "val": "RF Sensors & Countermeasures Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "39.431"
                        },
                        "CurrentYear": {
                            "val": "42.747"
                        },
                        "BudgetYearOne": {
                            "val": "39.708"
                        },
                        "BudgetYearOneBase": {
                            "val": "39.708"
                        },
                        "BudgetYearTwo": {
                            "val": "49.877"
                        },
                        "BudgetYearThree": {
                            "val": "68.237"
                        },
                        "BudgetYearFour": {
                            "val": "67.013"
                        },
                        "BudgetYearFive": {
                            "val": "70.260"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops and assesses affordable, reliable all weather radio frequency (RF) sensing and countermeasure concepts for aerospace applications covering the range of RF sensors including communications, navigation, intelligence, surveillance, reconnaissance (ISR), and radar, both active and passive, across the air, land, sea, space and cyber domains.  This project also develops and evaluates technology for ISR sensors, fire control radars, electronic warfare, integrated radar and electronic warfare systems, and offensive information operations systems.  It emphasizes the detection and tracking of surface and airborne targets with RF signatures that are difficult to detect due to reduced radar cross sections, concealment and camouflage measures, severe clutter, or heavy jamming.  Techniques exploited include the use of multiple RF phenomenologies, multi-dimensional adaptive processing, advanced waveforms and knowledge-aided processing techniques.  This project also develops the RF warning and countermeasure technology for advanced electronic warfare and information operations applications. Specifically, it develops techniques and technologies to detect and counter the communications links and sensors of threat air defense systems and hostile command and control networks.  The project also exploits emerging technologies and components to provide increased capability for offensive and defensive RF sensors, including radar warning, RF electronic warfare, and electronic intelligence applications."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Hybrid Sensor Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop hybrid sensor solutions to be responsive to needs and detect difficult targets. Develop jam-resistant time, position, and velocity sensors."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.524"
                                            },
                                            "Text": {
                                                "val": "Developed strategies to optimize reference technologies for distributed sensing missions.  Explored alternatives when Global Positioning System (GPS) is degraded or denied.  Reduced size, weight, and power of inertial components, while pursuing near navigation grade performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.839"
                                            },
                                            "Text": {
                                                "val": "Continue to develop strategies to optimize reference technologies for distributed sensing mission. Expand research of alternatives when GPS is degraded or denied in contested environments. Continue to reduce size, weight, and power of inertial components, while pursuing near navigation grade performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.939"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.939"
                                            },
                                            "Text": {
                                                "val": "Mature GPS augmentation technologies that take advantage of distributed platforms relaying Global Navigation Satellite Systems (GNSS) signals and geo-referenced real-time imaging to improve GPS accuracy in GPS sparse or denied environments.  Develop technologies that expand the ability to incorporate GNSS signals into GPS user equipment as a means to improve navigation signal reliability and availability."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "RF Sensor Technologies"
                                    },
                                    "Description": {
                                        "val": "Conduct applied research and development for the advancement of passive and active RF sensors; including phenomenology, modeling and simulation, algorithm development, and experimentation.  Plan, execute, and maintain state-of-the-art RF sensor research and development facilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.175"
                                            },
                                            "Text": {
                                                "val": "Conducted research and development in dismount detection, sparse arrays, polarization diversity, RF tomography, multiple-inputs and multiple-outputs (MIMO) for electronic protection (EP), and Along Track Interferometry (ATI) for ground moving target indicator (GMTI). Conducted outdoor range experimentation for concept verification and validation.  Refined and implemented Outdoor Range Open System Architecture.  Established new measurement capabilities at low (UHF) and high (Ku\/Ka) frequency bands."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.778"
                                            },
                                            "Text": {
                                                "val": "Continue research and development in dismount classification, waveform diversity, MIMO for electronic protection and ATI for GMTI radar.  Continue model development for MIMO and waveform diverse distributed sensing networks, and for airborne multi-static radar, illumination management and bi-static airborne early warning systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.614"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.614"
                                            },
                                            "Text": {
                                                "val": "Continue research and development of agile waveforms, adaptive spectrum utilization techniques, and electromagnetic forensics sensing of the signal environment for robust adaptive RF sensing in contested spectrums and persistent stand-in RF sensing in denied environments.  Continue research and development of RF sensor technology, including: signals inteligence (SIGINT) hardware, algorithms, and techniques, passive radar techniques, and advanced receive array antenna technology with wideband and high dynamic range, for passive multimode radars and efficient combat identification capabilities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Passive RF Sensor Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop advanced techniques and prototype passive RF sensors to intercept, collect, locate and track enemy RF sensor systems for ISR of air and ground targets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.518"
                                            },
                                            "Text": {
                                                "val": "Developed signal obstacle course to verify tunable RF architecture using dynamic RF signals. This program used in-house facilities, and state-of-art RF hardware deliverables from the Defense Advanced Research Projects Agency and Air Force contracts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Efforts move to RF Sensor Technologies in this Project to better align efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Optimize RF Sensing Technology"
                                    },
                                    "Description": {
                                        "val": "Develop technology to reduce size, weight, and power of RF sensors. Develop technology to enable affordable upgrades and optimally control RF and multi-intelligence sensors."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.821"
                                            },
                                            "Text": {
                                                "val": "Developed distributed and layered electronic warfare (EW) effects. Explored and analyzed future\/on-coming RF-based threats for potential counters and performed vulnerability assessments.  Researched advanced electronic support (ES) concepts.  Completed research and exploration of an adaptable ES\/electronic attack (EA) capability."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.895"
                                            },
                                            "Text": {
                                                "val": "Initiate development of distributed and layered EW effects to maintain spectrum dominance for assured operations and position, navigation, and timing (PNT) in contested environments.  Continue to explore and analyze next generation  RF-based threats for potential counters and perform vulnerability assessments. Continue to research advanced ES concepts. Complete research and exploration of an adaptable ES\/EA capability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.195"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.195"
                                            },
                                            "Text": {
                                                "val": "Conduct Electro-Magnetic\/Electronic Warfare Battle Management (EM\/EWBM) research to optimize use of EW assets against current and future integrated air defense systems and RF threats.  Identify, develop and integrate improved electronics that reduce cost, size, weight and power of current EW systems to facilitate development of distributed EW jammers\/sensor systems.  Develop new approaches to protection of aircraft avionics systems and on-board data networks."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi-Band\/Multi-Beam Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop multi-band and multi-beam forming technologies.  Address technologies for antenna array operations in dynamic sensor networks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.093"
                                            },
                                            "Text": {
                                                "val": "Developed RF\/EO subsystem concept prototype and began its development to validate trade space tools. Refined trade space analysis."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.891"
                                            },
                                            "Text": {
                                                "val": "Continue to develop RF\/EO subsystem concept prototype and begin its development to validate trade space tools. Initiate trade space analysis for RF\/EO subsystem and device concepts.  Continue the development of MIMO and waveform-diverse system models for multi-sensor networks operating in contested environments containing complex clutter and multi-path.  Continue the development of cognitive and phenomenology-based algorithm.  Continue development of  GPS and non-GPS navigation schemes for hypersonic vehicles."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.616"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.616"
                                            },
                                            "Text": {
                                                "val": "Identify advanced RF\/EO subsystem concepts to refine and update trade space capability. Complete the MIMO and waveform-diverse models for system and system of systems analysis. Initiate highly integrated, mostly digital microsystems for reconfigurable and tunable capabilities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Complex Clutter Environments"
                                    },
                                    "Description": {
                                        "val": "Investigate detection of difficult airborne and ground-based targets in clutter from airborne or space-based surveillance platforms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.800"
                                            },
                                            "Text": {
                                                "val": "Developed models applicable to MIMO and waveform-diverse systems for multi-sensor networks operating in complex clutter and multi-path environments, and further developed cognitive and phenomenology-based algorithm theory for the detection and classification of difficult targets and dismount activities for persistent and ubiquitous coverage using multi-platform configurations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Efforts move to Multi-Band\/Multi-Beam Technologies in this Project to better align efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Counter RF Threat Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop aerospace platform jamming technologies and techniques to counter advanced radio-frequency (RF)threats associated with current and future aerospace weapons systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.500"
                                            },
                                            "Text": {
                                                "val": "Initiated research on distributed and layered EW effects. Explored and analyzed RF-based threats for potential counters, and performed vulnerability assessments. Initiated research for advanced EW concepts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.344"
                                            },
                                            "Text": {
                                                "val": "Continue to develop technologies that ensure unfettered access to the electromagnetic spectrum while denying the same to adversaries.  Continue  long-term research on integrating bio-inspired decision-making and cognitive capabilities to EW and EW battle management systems to improve responses in ambiguous EM environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.344"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.344"
                                            },
                                            "Text": {
                                                "val": "Develop multi-faceted approaches to countering RF threats.  Efforts include development of machine learning, autonomous systems to identify frequency agile and changing waveforms. Develop counter-countermeasures to digital radio frequency memory (DRFM) based jammers.  Develop Electromagnetic\/Electronic Warfare Battle Management (EM\/EWBM) tools, and distributed EW techniques to counter state-of-the-art integrated air defense systems.  Develop novel disruptive technologies that leverage cyber, directed energy, and machine learning to counter RF, EO\/IR threats."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}