{
    "id": "42eeb4e55410ba37e05b6f5f1d79bf2cb098efc8",
    "meta": {
        "filename": "dod-2015_RDTE_2015_DARPA_RDTE_JustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2015.zzz_unzipped_RDTE_JustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0603287E"
        },
        "ProgramElementTitle": {
            "val": "SPACE PROGRAMS AND TECHNOLOGY"
        },
        "R1LineNumber": {
            "val": "41"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "136.427"
            },
            "CurrentYear": {
                "val": "142.546"
            },
            "BudgetYearOne": {
                "val": "179.883"
            },
            "BudgetYearOneBase": {
                "val": "179.883"
            },
            "BudgetYearTwo": {
                "val": "169.626"
            },
            "BudgetYearThree": {
                "val": "227.139"
            },
            "BudgetYearFour": {
                "val": "231.935"
            },
            "BudgetYearFive": {
                "val": "242.587"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Space Programs and Technology program element is budgeted in the Advanced Technology Development budget activity because it addresses high payoff opportunities to dramatically reduce costs associated with advanced space systems and provides revolutionary new system capabilities for satisfying current and projected military missions.\n\nA space force structure that is robust against attack represents a stabilizing deterrent against adversary attacks on space assets.  The keys to a secure space environment are situational awareness to detect and characterize potential threats, a proliferation of assets to provide robustness against attack, ready access to space, and a flexible infrastructure for maintaining the capabilities of on-orbit assets.  Ready access to space requires the delivery of defensive systems, replenishment of supplies into orbit, and rapid manufacturing of affordable space capabilities.  An infrastructure to service the mission spacecraft allows defensive actions to be taken without limiting mission lifetime.  In addition, developing space access and spacecraft servicing technologies will lead to reduced ownership costs of space systems and new opportunities for introducing technologies for the exploitation of space.\n\nSystems development is also required to increase the interactivity of space systems, space-derived information and services with terrestrial users.  Studies under this project include technologies and systems that will enable satellites and microsatellites to operate more effectively by increasing maneuverability, survivability, and situational awareness; enabling concepts include novel propulsion\/propellants, unique manufacturing processes; precision control of multi-payload systems, and payload isolation and pointing systems."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "159.704"
                },
                "CurrentYear": {
                    "val": "172.546"
                },
                "BudgetYearOne": {
                    "val": "169.757"
                },
                "BudgetYearOneBase": {
                    "val": "169.757"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "136.427"
                },
                "CurrentYear": {
                    "val": "142.546"
                },
                "BudgetYearOne": {
                    "val": "179.883"
                },
                "BudgetYearOneBase": {
                    "val": "179.883"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-23.277"
                },
                "CurrentYear": {
                    "val": "-30.000"
                },
                "BudgetYearOne": {
                    "val": "10.126"
                },
                "BudgetYearOneBase": {
                    "val": "10.126"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.211"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "-12.738"
                    },
                    "CurrentYear": {
                        "val": "-30.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-6.194"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-4.134"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "10.126"
                                },
                                "BudgetYearOneBase": {
                                    "val": "10.126"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2013:  Decrease reflects Congressional reductions for Sections 3001 & 3004, sequestration adjustments,  reprogrammings, and the SBIR\/STTR transfer. \nFY 2014: Decrease reflects program termination of System F6.\nFY 2015:  Increase reflects expansion of funding for the XS-1 Experimental Spaceplane."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "SPC-01"
                    },
                    "ProjectTitle": {
                        "val": "SPACE PROGRAMS AND TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "136.427"
                        },
                        "CurrentYear": {
                            "val": "142.546"
                        },
                        "BudgetYearOne": {
                            "val": "179.883"
                        },
                        "BudgetYearOneBase": {
                            "val": "179.883"
                        },
                        "BudgetYearTwo": {
                            "val": "169.626"
                        },
                        "BudgetYearThree": {
                            "val": "227.139"
                        },
                        "BudgetYearFour": {
                            "val": "231.935"
                        },
                        "BudgetYearFive": {
                            "val": "242.587"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Space Programs and Technology program element is budgeted in the Advanced Technology Development budget activity because it addresses high payoff opportunities to dramatically reduce costs associated with advanced space systems and provides revolutionary new system capabilities for satisfying current and projected military missions.\n\nA space force structure that is robust against attack represents a stabilizing deterrent against adversary attacks on space assets.  The keys to a secure space environment are situational awareness to detect and characterize potential threats, a proliferation of assets to provide robustness against attack, ready access to space, and a flexible infrastructure for maintaining the capabilities of on-orbit assets.  Ready access to space requires the delivery of defensive systems, replenishment of supplies into orbit, and rapid manufacturing of affordable space capabilities.  An infrastructure to service the mission spacecraft allows defensive actions to be taken without limiting mission lifetime.  In addition, developing space access and spacecraft servicing technologies will lead to reduced ownership costs of space systems and new opportunities for introducing technologies for the exploitation of space.\n\nSystems development is also required to increase the interactivity of space systems, space-derived information and services with terrestrial users.  Studies under this project include technologies and systems that will enable satellites and microsatellites to operate more effectively by increasing maneuverability, survivability, and situational awareness; enabling concepts include novel propulsion\/propellants, unique manufacturing processes; precision control of multi-payload systems, and payload isolation and pointing systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Airborne Launch Assist Space Access (ALASA)"
                                    },
                                    "Description": {
                                        "val": "The goal of the Airborne Launch Assist Space Access (ALASA) program is to mature and demonstrate technologies for cost effective, routine, reliable, access to low earth orbit (LEO).  ALASA seeks improvements in cost, responsiveness, flexibility, and resilience with a single approach.  ALASA will enable small satellites to be deployed to orbit from an airborne platform, allowing performance improvement, reducing range costs, and flying more frequently, which drives cost per event down.  The ability to relocate and launch from virtually any major runway around the globe reduces the time needed to deploy a satellite system.  Launch point offset permits essentially any possible orbit direction to be achieved without concerns for launch direction imposed by geography.  Finally, launch point offset allows the entire operation to be moved should a particular fixed airfield become unavailable due to natural phenomena or other issues.  Challenges include, but are not limited to: in-air separation of aircraft and orbit-insertion launch stages, development of alternatives to current range processes, control of weight and margin under a hard gross weight limit, and achieving a cost per flight of $1 million, including range support costs, to deploy satellites on the order of 100 lb.  The anticipated transition partners are the Air Force and Army."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "29.237"
                                            },
                                            "Text": {
                                                "val": "-  Completed initial test plans for flight demonstrator.\n-  Completed risk management plan.\n-  Conducted preliminary design review and selected enabling and enhancing technologies for incorporation into system concepts.\n-  Conducted critical design review and initiated detailed design.\n-  Integrated selected enabling and enhancing technologies on launch assist aircraft."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "42.500"
                                            },
                                            "Text": {
                                                "val": "-  Conduct trade studies of additional enabling technology to include propellants, manufacturing, mission planning and range support software, and tracking and flight termination software.\n-  Conduct critical design review of demonstration system and develop flight demonstrator.\n-  Complete ALASA vehicle flight readiness review.\n-  Perform propulsion and system risk reduction testing.\n-  Conduct captive carry and aircraft compatibility flight tests."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "55.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "55.000"
                                            },
                                            "Text": {
                                                "val": "-  Initiate demonstration of ALASA vehicle launches including launch readiness reviews.\n-  Conduct launches to demonstrate program goals, including 100 pounds into low earth orbit.\n-  Conduct analysis of launch performance metrics and identify opportunities for system design and integration optimization.\n-  Continue transition coordination."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space Domain Awareness (SDA)"
                                    },
                                    "Description": {
                                        "val": "The goal of the Space Domain Awareness (SDA) program is to develop and demonstrate an operational framework and responsive defense application to enhance the availability of vulnerable space-based resources.  Current space surveillance sensors cannot detect, track, or determine the future location and threat potential of small advanced technology spacecraft in deep space orbits, where a majority of DoD spacecraft are located.  Additionally, servicing missions to geosynchronous (GEO) orbits will require exquisite situational awareness, from ultra-high-accuracy debris tracking for mission assurance at GEO orbits to high resolution imaging of GEO spacecraft for service mission planning.  The SDA program will develop a space management system that allows cognitive reasoning and decision support to execute space operations with current and proposed assets within real and synthetic environments.\n\nSDA will investigate revolutionary technologies in two areas: 1) advanced space surveillance sensors to better detect, track, and characterize space objects, with an emphasis on deep space objects, and 2) space surveillance data collection and data processing\/ fusion to provide automated data synergy.  The resulting increase in space domain awareness will enhance overall space safety of flight, and allow space operators to make informed, timely decisions.  The SDA program will leverage data fusion and advanced algorithms developed under the Space Surveillance Telescope (SST) program, as well as seek to exploit new ground-breaking technologies across the electromagnetic spectrum and utilize already existing sensor technology in non-traditional or exotic ways, to bring advanced capabilities to the space domain.  SDA will correlate a wide range of operational support and space system user data to rapidly identify threat activities, propose mitigating countermeasures, and verify the effectiveness of selected responses.  Critical technologies include accessing disparate sources of relevant data, model-based situational awareness, and candidate response generation and evaluation.  Particular emphasis will be placed on the ability to continuously adapt to changes in defended system components and usage patterns as well as validation of system integrity.  SDA will demonstrate new approaches to collection of data utilizing a variety of collection modalities, ranging from fusion of observations from non-traditional sources, such as amateur astronomers, to evaluation of sparse aperture imaging techniques.\n\nAlso funded within this program is the Galileo effort which, will develop technology to image a Geosynchronous Earth Orbit (GEO) satellite from the ground.  Galileo will utilize fixed mobile telescopes, each with adaptive optics and a guide star, to create multiple baselines that can be used to reconstruct the image through an inverse Fourier transform.  The potential transition customer is the Air Force."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.000"
                                            },
                                            "Text": {
                                                "val": "-  Commenced radiometric data processing efforts.\n-  Completed SpaceView initial demonstration, providing Space Situational Awareness (SSA) data from amateur astronomer sources.\n-  Developed requirements performance models for the Galileo imaging system.\n-  Developed plans for risk-reduction experiments necessary to complete a detailed Galileo system design."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate the advantages of a having a collaborative network of users with access to data from numerous distributed sensors over the traditional sensor-centric architecture.\n-  Expand SpaceView amateur network.\n-  Initiate and demonstrate StellarView network of academic astronomy data providers.\n-  Initiate novel dynamic database to collect networked source information for validation.\n-  Demonstrate intuitive applications and adaptive understanding capabilities of the next-generation space information fusion center.\n-  Complete risk reduction experiments and begin preliminary system design for the Galileo interferometer.\n-  Study the application of quantum optical sensing methods to Space Domain Awareness challenges of object detection and imaging.\n-  Commence Phase 1 of an un-cued low inclined LEO object detection capability.\n-  Demonstrate preliminary capability of the Allen Telescope Array to passively detect and track satellites.\n-  Commence astrometric data processing and validation efforts.\n-  Commence Galileo Phase 2A risk reduction experiments to lead to possible future comprehensive demonstration.\n-  Commence SpaceView Phase 2 to demonstrate additional amateur nodes including Australia locations.\n-  Conduct a survey of operational management systems for Real-Time Space Domain Awareness."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.883"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.883"
                                            },
                                            "Text": {
                                                "val": "-  Perform database verification on collected data; demonstrate metric and radiometric accuracy.\n-  Continue SpaceView and StellarView data collections.\n-  Complete preliminary system design of the Galileo interferometer.\n-  Continue utilizing the OrbitOutlook Data Archive to dynamically archive diverse datasets.  \n-  Set-up for comprehensive demonstration in FY 2016.\n-  Initiate Real-Time Space Domain Awareness design development."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space Surveillance Telescope (SST)"
                                    },
                                    "Description": {
                                        "val": "The Space Surveillance Telescope (SST) program has developed and demonstrated an advanced ground-based optical system to enable detection and tracking of faint objects in space, while providing rapid, wide-area search capability.  A major goal of the SST program, to develop the technology for large curved focal surface array sensors to enable an innovative telescope design combining high detection sensitivity, short focal length, wide field of view, and rapid step-and-settle to provide orders of magnitude improvements in space surveillance has been achieved.  This capability enables ground-based detection of un-cued objects in deep space for purposes such as asteroid detection and space defense missions.  The initial program is transitioning to Air Force Space Command.\n\nIn addition, the program is investigating data fusion and advanced algorithms for correlation of unknown objects.  SST is expected to generate a large number of uncorrelated targets (UCTs), and new methods will need to be employed to rapidly characterize and attribute the new objects.  Furthermore, the data fusion effort is investigating methods which combine observations from disparate sensors (such as optical and radar installations) to more rapidly, accurately, and completely provide positive identification of orbital objects, rapidly characterize them, and maintain a catalog of determined characteristics.\n\nThe SST Australia effort will provide a further operational demonstration of the SST at the Naval Communication Station Harold E. Holt near Exmouth, Western Australia.  Such a location presents a more operationally relevant demonstration, with a richer and more interesting population of SSA targets in geosynchronous orbit.  A demonstration in Australia will investigate telescope performance and observe objects and orbits not visible from the current site in New Mexico.  In addition, the demonstration will generate data for analysis and fusion efforts, which will be used to further refine and evaluate data processing techniques, such as those developed under the data fusion effort.  This program will address technical challenges which may arise from an Australian site, including adaptations to a different telescope environment, and the logistical and communications challenges presented by a site significantly more remote than the current SST location."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.204"
                                            },
                                            "Text": {
                                                "val": "-  Transitioned data fusion services to users.\n-  Completed operational testing to enable military utility assessment of SST.\n-  Completed investigation and selection of the SST location in Australia.\n-  Completed SST relocation plan."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.000"
                                            },
                                            "Text": {
                                                "val": "-  Continue evaluation of operational strategies, technology studies, and hardware demonstrations in order to optimize SST performance at Australia site.\n-  Continue research at Atom site into technical challenges facing the system after relocation.\n-  Complete MOA with Australia.\n-  Refine SST relocation plan, jointly with the Australia Department of Defense partners.\n-  Initiate enclosure subsystem design."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.000"
                                            },
                                            "Text": {
                                                "val": "-  Disassemble SST in New Mexico.\n-  Ship SST to Australian site.\n-  Begin site preparation in Australia.\n-  Complete enclosure subsystem design."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Phoenix"
                                    },
                                    "Description": {
                                        "val": "To date, servicing operations have never been conducted on spacecraft beyond low earth orbit (LEO).  A large number of national security and commercial space systems operate at geosynchronous earth orbit (GEO) altitudes, furthermore, many end-of-life or failed spacecraft drift without control through portions of the GEO belt, creating a growing hazard to operational spacecraft.  Technologies for servicing of spacecraft with the expectation that such servicing would involve a mix of highly autonomous and remotely (i.e., ground-based) teleoperated robotic systems have been previously pursued.  The Phoenix servicing program will build upon these legacy technologies, tackling the more complex GEO environment and expanding beyond pure traditional servicing functions.  The program seeks to validate robotics operations in GEO suitable for a variety of potential servicing tasks with a Servicer\/Tender, in full collaboration and cooperation with existing satellite owners.  The program will examine utilization of ride-along capability to GEO supporting upgrading, repairing, assembling, and reconfiguring satellites.  The program will include an early LEO flight experiment focused on satlets, as a path of risk reduction for modular assembly on orbit.  Key challenges include robotic tool\/end effector requirements, efficient orbital maneuvering of a servicing vehicle, robotic arm systems, and integration and efficient and low cost transportation of robotic tools.  The anticipated transition partners are the Air Force and commercial spacecraft servicing providers."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "40.475"
                                            },
                                            "Text": {
                                                "val": "-  Completed preliminary design of robotic servicing payload architecture and systems for Phoenix vehicle.\n-  Developed payload orbital delivery systems (PODS) designs for commercial satellite ride-along as well as first working prototype for dispensement.\n-  Initiated flight scale build of first satlets and demonstrated aggregation of performance functions in a ground testbed.\n-  Initiated development and build of robotic servicing components including tools and toolbelt systems and selected a complete complement of tools for Phoenix.\n-  Initiated six degree of freedom testbed on ground; began virtual system testing with the primary and secondary robotic arms.\n-  Initiated telepresence simulation and began test qualification and training standards for Phoenix robotic operations.\n-  Built first prototype of sensor suite for guidance and control on servicer and evaluated it with actual flight software algorithms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "60.046"
                                            },
                                            "Text": {
                                                "val": "-  Complete critical design of robotic servicing system including primary and secondary robotic arms and toolbelt.\n-  Deliver prototypes of various servicing tasks to robotic testbed for validation and integration with tools.\n-  Complete mission validation testing inside a six degree of freedom testbed.\n-  Complete critical design of tele-operations system.\n-  Conduct pre-ship review for early LEO satlet experiment equipment and deliver to launch integrator."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "65.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "65.000"
                                            },
                                            "Text": {
                                                "val": "-  Launch early LEO satlet experiment and conduct experiment operations.\n-  Complete delta critical design of satlets per lessons learned from LEO experiment.\n-  Complete delta critical design of PODs.\n-  Validate specific servicing mission types that maximize commercial and DoD operations.\n-  Validate primary and secondary robotic hardware and software."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Experimental Spaceplane One (XS-1)*"
                                    },
                                    "Description": {
                                        "val": "*Formerly Small Responsive Space Access X-Plane\nThe XS-1 program will mature the technologies and operations for low cost, persistent and responsive space access and global reach.  Past efforts have identified and demonstrated critical enabling technologies including composite or light weight structures, propellant tanks, thermal protection systems, rocket propulsion and advanced avionics\/software.  A critically important technology gap is integration into a flight demonstration able to deliver aircraft-like operability.  The program will validate key technologies on the ground, and then fabricate an X-Plane to demonstrate: 1) 10 flights in 10 days, 2) Mach 10+ flight, and 3) 10X lower cost space access for cargoes 3,000-5,000 lbs to low earth orbit.  A key goal is validating the critical technologies for a wide range of next generation high speed aircraft enabling new military capabilities including worldwide reconnaissance, global transport, small responsive space access aircraft and affordable spacelift.  The anticipated transition partners are the Air Force, Navy and commercial sector."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop a conceptual design for the XS-1 demonstration system including detailed structural analysis and mass properties.\n-  Perform system level trade studies to identify alternative configurations and define the tradespace for XS-1.\n-  Accomplish planning activities to prepare for contract award."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "27.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "27.000"
                                            },
                                            "Text": {
                                                "val": "-  Perform analysis on risk mitigation strategies for the propulsion system, thermal protection system and composite materials.\n-  Conduct a mid-phase Conceptual Design and Systems Requirements Review.\n-  Conduct component and subsystem testing and verification.\n-  Conduct a Preliminary Design Review (PDR) and select a single vendor for final design, fabrication and flight test."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Optical Aperture Self-Assembly in Space (OASIS)"
                                    },
                                    "Description": {
                                        "val": "The Optical Apertures Self-assembling in Space program seeks to demonstrate the feasibility of constructing large optical apertures in orbit from a number of smaller modular components that self-organize in space.  The program will demonstrate the technologies needed to assemble a large (>5m) and near-diffraction limited optical aperture from modular components that are launched as separate payloads.  The program will include a scalable zero-g demonstration of a functional optical system that maintains the precision and large-scale physical stability required, and utilizes at least one segmented optical surface.  This program will address technical challenges of precision mechanical assembly from modular components, multiple object rendezvous and coupling in space, and active surface measurement, compensation and control.  Modular construction in space is intrinsically more challenging than ground-based assembly in that there is not necessarily any measurement and support infrastructure and equipment available, such as interferometer test towers.  Therefore, the modular pieces and system design must include self-contained measurement and alignment capabilities to be employed after or during assembly.  The OASIS program will demonstrate the feasibility of assembling complex and highly precise structures in space which, in assembled form, are larger than the capacity of any existing or planned space launch vehicle.  This capability could enable a number of surveillance and communications instruments in orbit that are not possible today or in the near future under the current paradigm.  The anticipated transition partners are the Air Force, Navy and commercial sector."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Investigate essential technologies to facilitate self-organizing robotic construction in space.\n-  Conduct ground-based risk reduction experiments for critical path technologies.\n-  Identify potential effort to provide high resolution capability with light weight optics by leveraging a precision interferometric approach combined with novel image reconstruction algorithm and photonic integrated circuit."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "System F6"
                                    },
                                    "Description": {
                                        "val": "The objective of the System F6 program is to demonstrate the feasibility and benefits of satellite architecture technologies which facilitate a fractionated architecture wherein the functionality of a traditional \"monolithic\" spacecraft is replaced by a cluster of wirelessly-interconnected spacecraft modules.  Each such \"fractionated\" module could contribute a unique capability, for example, computation and data handling, communications relay, guidance and navigation, payload sensing, or it can replicate the capability of another module; the cluster would deliver a comparable mission capability to a monolithic spacecraft.  The fractionated modules would fly in a loose, proximate cluster orbit capable of semi-autonomous reconfiguration or a rapid defensive scatter\/re-gather maneuver.  The System F6 program will develop key technologies to facilitate fractionated and disaggregated architectures.  The F6 Technology Package (F6TP), a suite of technologies, components, and algorithms that enables semi-autonomous multi-body cluster flight and secure, distributed, real-time sharing of various spacecraft resources at the cluster level will also be developed.  Multiple versions of the F6 Technology Package will be developed on the basis of open-source interface standards, software, and reference designs termed the F6 Developer's Kit (FDK).  The utility of the architecture in low earth orbit (LEO) is significantly enabled by persistent broadband connectivity to the ground which allows resource sharing between space-based modules and terrestrial network nodes.  A solution to enable high-availability, low-latency, persistent, high-bandwidth communication with LEO spacecraft will be developed in the course of the F6 program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "30.000"
                                            },
                                            "Text": {
                                                "val": "-  Completed initial version of FDK software and demonstrated functionality in representative orbital conditions.\n-  Completed initial release of the FDK.\n-  Conducted preliminary design review (PDR) for the F6TP.\n-  Conducted critical design review (CDR) for the F6TP.\n-  Took delivery of the F6TP breadboards.\n-  Completed FDK documentation for the wireless intermodule communications and information assurance platform architectures."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete F6TP engineering development units.\n-  Complete flight unit of the persistent broadband terrestrial connectivity terminal for LEO fractionated clusters.\n-  Complete a fully-functional, well-documented, value-centric architecture and design tool for adaptable space systems.\n-  Complete cluster flight application software development and testing.\n-  Complete academic research in the areas of theoretical exploration of value-centric design impacts as well as architectures for distributed real-time and embedded systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SeeMe"
                                    },
                                    "Description": {
                                        "val": "The Army, Air Force, intelligence community, and other potential users require affordable support to the tactical warfighter via space.  The goal of the SeeMe program is to demonstrate the ability to get near-real-time, i.e., no older than ~90 minutes, images directly to individual users' handheld devices from space.  This will be accomplished via a very low cost constellation of inexpensive, disposable small satellites routinely and inexpensively put in orbit through low cost horizontal (aircraft-released) launches.  The current methodology for satisfying imagery needs from space is to build multipurpose systems with very high reliability and long life, at very high costs, and launch them on expensive vertical launch boosters.  In most cases, commercial or military, the time to deliver an already built space intelligence, surveillance, and reconnaissance system suitable to meet tactically desired ground sample distance is on the order of 20+ months, and the data delivery mechanism is typically more than several days (and up to weeks) to the end user.  SeeMe intends to radically shorten the entire cycle: ground development time, launch cadence, and on-orbit request-to-image-delivery time through new satellite manufacturing techniques, advanced low-cost aperture technologies, leveraging alternative launch concepts, and a novel direct-to-user command and data exfiltration architecture.  The anticipated transition partners are the Air Force and the Army."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.511"
                                            },
                                            "Text": {
                                                "val": "-  Completed trade studies on hardware design and constellation options that show trades between altitude, resolution and delivery time after request to ground user.\n-  Executed technical prototype integration options for hardware level development.\n-  Demonstrated applicability to commercial production environment using commercial off the shelf (COTS) based hardware.\n-  Began verification of radio frequency and optical aperture template and began prototype construction.\n-  Completed ground user hardware interface study\/development, including specific ConOps with warfighter in the field.\n-  Completed hardware- and system-level risk reduction tests, including thermal cycling tests, initial field tests, and balloon flight tests for enabling technologies for optics, deployable antennas, radio communication and high performance computing and algorithms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "-  Prepare critical design of system hardware and software for the satellites.\n-  Complete prototype hardware field demonstrations (through balloon testing) to support radio link and downlink direct to user handhelds.\n-  Complete technology prototype units, perform functional and environmental tests, and demonstrate operation."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                }
            ]
        }
    }
}