{
    "id": "458152872e7c013c39380d84342c055ff0f1fa90",
    "meta": {
        "filename": "dod-2015_RDTE_2015_OSD_RDTE_JustificationBook_Office_of_Secretary_Of_Defense_PB_2015.zzz_unzipped_RDTE_JustificationBook_Office_of_Secretary_Of_Defense_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604165D8Z"
        },
        "ProgramElementTitle": {
            "val": "Prompt Global Strike Capability Development"
        },
        "R1LineNumber": {
            "val": "117"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "649.147"
            },
            "PriorYear": {
                "val": "176.390"
            },
            "CurrentYear": {
                "val": "65.393"
            },
            "BudgetYearOne": {
                "val": "70.762"
            },
            "BudgetYearOneBase": {
                "val": "70.762"
            },
            "BudgetYearTwo": {
                "val": "79.348"
            },
            "BudgetYearThree": {
                "val": "185.649"
            },
            "BudgetYearFour": {
                "val": "207.527"
            },
            "BudgetYearFive": {
                "val": "226.342"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The level of resourcing for the Prompt Global Strike Capability Development program reflects iterative reductions from efficiencies and budget reductions, which reduces the Department's ability to develop flexible responsive solutions to emerging war fighter needs.  This Program Element (PE) was established to develop and demonstrate technologies and applications that advance conventional prompt global strike (CPGS) warfighting capabilities. The program uses a national team with coordination between the Services, Agencies and national research laboratories to pursue integrated portfolio objectives of the acquisition and operation of a CPGS system.  This program funds the design, development, and experimentation of boosters, payload delivery vehicles (PDVs), non-nuclear warheads, guidance systems, and mission planning and enabling capabilities. To support these development activities, the program procures modeling and simulation capabilities, command and control interfaces, test range support, and launch system infrastructure.  Additionally, expert resources address strategic policy and treaty issues. Program emphasis is on demonstrating component and subsystem technology maturity with risk reduction initiatives.  Program timing will be driven by the outcome of flight test events and DoD budgets.  In FY 2015, funding for the individual service initiatives will be contingent upon their abilities to execute and achieve satisfactory progress towards project goals as determined by the CPGS portfolio manager."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "110.383"
                },
                "CurrentYear": {
                    "val": "65.440"
                },
                "BudgetYearOne": {
                    "val": "82.590"
                },
                "BudgetYearOneBase": {
                    "val": "82.590"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "176.390"
                },
                "CurrentYear": {
                    "val": "65.393"
                },
                "BudgetYearOne": {
                    "val": "70.762"
                },
                "BudgetYearOneBase": {
                    "val": "70.762"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "66.007"
                },
                "CurrentYear": {
                    "val": "-0.047"
                },
                "BudgetYearOne": {
                    "val": "-11.828"
                },
                "BudgetYearOneBase": {
                    "val": "-11.828"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "90.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.682"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Efficiency Reduction"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-11.828"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-11.828"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "-0.047"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FY13 Sequestration Reduction"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-18.783"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Baseline Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-2.528"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P164"
                    },
                    "ProjectTitle": {
                        "val": "Hypersonic Glide Experiment and Concepts Demonstration Support"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "341.970"
                        },
                        "PriorYear": {
                            "val": "23.000"
                        },
                        "CurrentYear": {
                            "val": "2.000"
                        },
                        "BudgetYearOne": {
                            "val": "2.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.000"
                        },
                        "BudgetYearTwo": {
                            "val": "2.000"
                        },
                        "BudgetYearThree": {
                            "val": "2.000"
                        },
                        "BudgetYearFour": {
                            "val": "2.000"
                        },
                        "BudgetYearFive": {
                            "val": "2.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The level of resourcing for the Prompt Global Strike Capability Development program reflects iterative reductions from efficiencies and budget reductions, which reduces the Department's ability to develop flexible responsive solutions to emerging war fighter needs.  This Program Element (PE) was established to develop and demonstrate technologies and applications that advance conventional prompt global strike (CPGS) warfighting capabilities. The program uses a national team with coordination between the Services, Agencies and national research laboratories to pursue integrated portfolio objectives of the acquisition and operation of a CPGS system.  This program funds the design, development, and experimentation of boosters, payload delivery vehicles (PDVs), non-nuclear warheads, guidance systems, and mission planning and enabling capabilities. To support these development activities, the program procures modeling and simulation capabilities, command and control interfaces, test range support, and launch system infrastructure.  Additionally, expert resources address strategic policy and treaty issues. Program emphasis is on demonstrating component and subsystem technology maturity with risk reduction initiatives.  Program timing will be driven by the outcome of flight test events and DoD budgets.  In FY 2014 and FY 2015, funding for the individual service initiatives will be contingent upon their abilities to execute and achieve satisfactory progress towards project goals as determined by the CPGS portfolio manager."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Hypersonic Glide Experiments and Concept Demonstration Development\/Support"
                                    },
                                    "Description": {
                                        "val": "This sub-project develops technologies and applications that could lead to a system with the following characteristics: effects on targets in a very short-period of time from execution order; non-ballistic flight over the majority of the flight path; positive control from launch to impact; adequate cross-range\/ maneuverability to avoid overflight issues; controlled stage drop over Broad Ocean Area (BOA), and  provides for in-flight target updates.  This sub-project also develops warhead technologies to defeat time-sensitive targets for near and longer-term CPGS applications.  The technologies developed will have cross-service and cross-concept applicability and will be developed through close coordination among DoD components. This activity will support both ground and flight tests, and provide all national data to the competitive acquisition program.\n\nThe objectives of this sub-project are to: \n- Assess boost-glide technologies in light of ground and flight test events and associated modeling and simulation.\n-Analyze the military utility of multiple, 3-axis stabilized vehicles performance with respect to thermal protection materials, aerodynamics and control surfaces, navigation, guidance, control (NG&C), boosters and weapons performance.\n-Assess the feasibility of producing an affordable solution to fill the CPGS capability gap.\n-Continue systems definition\/engineering\/development of integrated weaponized payload delivery vehicles and subsystems in order to identify and reduce risks and mature technologies for a global range competitive acquisition program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "23.000"
                                            },
                                            "Text": {
                                                "val": "- Led national team in risk reduction and technology maturation efforts for CPGS non-nuclear KEP, Penetrator and other warhead concepts \n- Completed KEP arena and sled pre and post tests analyses, completing Sled Test#2 CDR and mono-rail dry run test \n- Planned and conducted penetrator weapon design test series for the weapon case, high explosive, fuze, and instrumentation   \n- Collaboration with national CPGS team to plan, develop and perform subsystems ground and subscale flight tests for evaluation and analysis of military utility\n- Conducted system engineering studies to characterize effectiveness of updated weapons concepts, vehicles survivability against foreign systems and flight paths to optimized vehicles and boosters performance \n- Continuation of the modification of launch test pad for future flight tests, completing pad hard point alignment and testing, power, and communications systems upgrades\n- Completed a preliminary systems engineering study of delivery vehicle shape analysis to assess best performance against a variety of range, speed, maneuver, booster configurations, basing and cost\n- Completed the design and delivery of wind tunnel design models for a representative 3 axes stabilized biconic delivery vehicle, beginning initial wind tunnel testing to validate biconic and related shape design models and potential for future concept use\/experiments \n- Conducted a mission planning table-top exercise for STRATCOM to enhance early user assessment of operational employment concepts and interfaces to existing\/planned STRATCOM\/COCOM mission planning tool suites"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "- Complete enhanced developmental testing in the areas of aerodynamics, aerothermodynamics, guidance, navigation, and control, instrumentation, vehicle recovery, and propulsion. \n- Conduct planning of flight tests in coordination with other Services to validate knowledge base garnered from enhanced developmental testing.\n- Complete trade studies to evaluate system alternatives, affordability, end-to-end system concepts and industrial manufacturing readiness.\n- Continue risk reduction and technology maturation efforts through ground tests to improve modeling and simulation capabilities and technology readiness to subsystems.\n- Complete Technology Development Strategy and System Engineering documentations incorporating CPGS community data, trade studies and on-going risk reduction\/technology development efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "- Update service concepts for intermediate and global range CPGS concepts in preparation for JROC and acquisition milestone authority review\n- Conduct trade studies to evaluate system alternatives, affordability, end-to-end system concepts that will study a weaponized integrated system complete with system architecture, and industrial manufacturing readiness \n- Continue aerodynamic and weapon risk reduction and technology maturation efforts through ground and wind tunnel tests to improve modeling and simulation capabilities and technology readiness, assessing readiness to conducted integrated penetrator component technology tests\n- Update the Technology Development Strategy and System Engineering documentations based on updated CPGS community engineering and test data, trade studies and on-going risk reduction\/technology development efforts\nComplete KEP sled test analysis and disseminate test data\/analysis to CPGS  community\n-Complete planning for low cost terminal phase delivery vehicle testing to include analysis of guidance, navigation, control, aerodynamic, and materials performance to CPGS mission terminal area requirements"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P166"
                    },
                    "ProjectTitle": {
                        "val": "Alternate Re-Entry System\/Warhead Engineering"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "213.486"
                        },
                        "PriorYear": {
                            "val": "147.790"
                        },
                        "CurrentYear": {
                            "val": "55.000"
                        },
                        "BudgetYearOne": {
                            "val": "65.200"
                        },
                        "BudgetYearOneBase": {
                            "val": "65.200"
                        },
                        "BudgetYearTwo": {
                            "val": "72.950"
                        },
                        "BudgetYearThree": {
                            "val": "176.649"
                        },
                        "BudgetYearFour": {
                            "val": "199.500"
                        },
                        "BudgetYearFive": {
                            "val": "218.342"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Global Strike Capability Development program reflects iterative reductions from efficiencies and budget reductions, which reduces the Department's ability to develop flexible responsive solutions to emerging war fighter needs.  This Program Element (PE) was established to develop and demonstrate technologies and applications that advance conventional prompt global strike (CPGS) warfighting capabilities. The program uses a national team with coordination between the Services, Agencies and national research laboratories to pursue integrated portfolio objectives of the acquisition and operation of a CPGS system.  This program funds the design, development, and experimentation of boosters, payload delivery vehicles (PDVs), non-nuclear warheads, guidance systems, and mission planning and enabling capabilities. To support these development activities, the program procures modeling and simulation capabilities, command and control interfaces, test range support, and launch system infrastructure.  Additionally, expert resources address strategic policy and treaty issues. Program emphasis is on demonstrating component and subsystem technology maturity with risk reduction initiatives.  Program timing will be driven by the outcome of flight test events and DoD budgets.  In FY 2015, funding for the individual service initiatives will be contingent upon their abilities to execute and achieve satisfactory progress towards project goals as determined by the CPGS portfolio manager."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Alternative Re-Entry System\/Warhead Engineering and Delivery Vehicle Options\/Development"
                                    },
                                    "Description": {
                                        "val": "This sub-project will test and evaluate alternative booster and delivery vehicle options and will assess the feasibility of producing an affordable alternate solution to fill the CPGS capability gap.  It will mature technologies that could lead to advanced systems with the following characteristics: effects on targets in a very short-period of time from execution order; non-ballistic flight over the majority of the flight path; positive control from launch to impact; adequate cross-range\/maneuverability to avoid over flight issues; and controlled stage drop over BOA.  The technologies developed will have cross-service and cross-concept applicability and will be developed through close coordination among DoD components.  This activity will support both ground and flight tests, and provide all national data to a potential acquisition program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "147.790"
                                            },
                                            "Text": {
                                                "val": "- Conducted System Requirements Review for AHW Flight Test 2 and relevance for all CPGS concepts\n- Conducted Integrated Baseline Review and Integrated Master Schedule development for AHW Flight Test 2\n- Conducted Preliminary and Critical Design Reviews in preparation for AHW Flight Test 2\n- Continued design, manufacturing, and testing of components; preliminary integration of components for bench top testing underway\n- Initiated work associated with PDV items at risk, in accordance with previous tests\n- Expanded systems engineering parameters for performance and cost assessments for all CPGS concepts\n- Completed initial Universal Documentation System (UDS) inputs for range and flight safety activities for AHW Flight Test 2\n- Executed initial survey of Launch Complex in preparation for upcoming flight test\n-Conducted Kick-off Review for the first in the new series of demonstrations being demonstrated by Navy SSP \n-Created Navigation, Guidance and Control hardware-in-the loop facility to support Navy Flight Test 1 with additional broad applicability across all CPGS concepts \n-Conducted design and wind tunnel testing for Intermediate Range Glide Body \n-Initiated low cost thermal protection system development\n -Conducted Conceptual Design Review for Navy Flight Test1\n-Developed a competitive Request for Proposal for industry technical trade study and prepared for release"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "55.000"
                                            },
                                            "Text": {
                                                "val": "- Complete manufacturing and testing of Hypersonic Glide Body and Booster to be used in AHW Flight Test 2\n- Conduct pre-shipment and pre-launch reviews for AHW Flight Test 2\n- Deploy to range, conduct pre-launch testing and training, and execute AHW Flight Test 2\n- Begin post-Flight Test Data analysis for AHW Flight Test 2 for distribution to the CPGS community for use across projects\n- Continue ground testing and development of advanced thermal protection materials and concepts\n-Conduct System Requirements Review through collaboration with the national CPGS team for Navy Flight Test 1 \n-Conduct Preliminary Design Reviews through collaboration with the national CPGS team for Navy Flight Test 1\n-Fabricate prototype miniaturized hardware in support of Navy Flight Test 1 with broad applicability across all CPGS concepts"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "65.200"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "65.200"
                                            },
                                            "Text": {
                                                "val": "- Continue AHW Flight Test 2 post-Flight test data analysis with special emphasis on applicability to future CPGS testing\n- Support development of future flight test systems for alternative CPGS concepts as required\n- Conduct Critical Design Review for Navy Flight Test 1 through collaboration with national CPGS team\n- Begin integrated system-level test, evaluation, and assembly for Navy Flight Test 1"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P167"
                    },
                    "ProjectTitle": {
                        "val": "Test Range Development"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "62.446"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "4.953"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "1.000"
                        },
                        "BudgetYearThree": {
                            "val": "2.000"
                        },
                        "BudgetYearFour": {
                            "val": "2.000"
                        },
                        "BudgetYearFive": {
                            "val": "2.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The level of resourcing for the Prompt Global Strike Capability Development program reflects iterative reductions from efficiencies and budget reductions, which reduces the Department's ability to develop flexible responsive solutions to emerging war fighter needs.  This Program Element (PE) was established to develop and demonstrate technologies and applications that advance conventional prompt global strike (CPGS) warfighting capabilities. The program uses a national team with coordination between the Services, Agencies and national research laboratories to pursue integrated portfolio objectives of the acquisition and operation of a CPGS system.  This program funds the design, development, and experimentation of boosters, payload delivery vehicles (PDVs), non-nuclear warheads, guidance systems, and mission planning and enabling capabilities. To support these development activities, the program procures modeling and simulation capabilities, command and control interfaces, test range support, and launch system infrastructure.  Additionally, expert resources address strategic policy and treaty issues. Program emphasis is on demonstrating component and subsystem technology maturity with risk reduction initiatives.  Program timing will be driven by the outcome of flight test events and DoD budgets.  In FY 2014 and FY 2015, funding for the individual service initiatives will be contingent upon their abilities to execute and achieve satisfactory progress towards project goals as determined by the CPGS portfolio manager."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Test Range Development"
                                    },
                                    "Description": {
                                        "val": "This sub-project will complete design, assembly and delivery of power\/telemetry subsystems; assemble and integrate components to check command\/control and verify range safety functions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "-Improved telemetry collection and infrastructure in prep for DOTE\/IOTE testing of contractor developed system concepts.\n- Assisted test range infrastructure for long term use\n-"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.953"
                                            },
                                            "Text": {
                                                "val": "- Improve telemetry collection and infrastructure in prep for DOTE\/IOTE testing of contractor developed system concepts.\n- Assist test range infrastructure for long term use,\n-Collaboration with Missile Defense, Ballistic Missile, and Space programs for test range capability modernization."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P168"
                    },
                    "ProjectTitle": {
                        "val": "OSD CPGS Studies"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "31.245"
                        },
                        "PriorYear": {
                            "val": "5.600"
                        },
                        "CurrentYear": {
                            "val": "3.440"
                        },
                        "BudgetYearOne": {
                            "val": "3.562"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.562"
                        },
                        "BudgetYearTwo": {
                            "val": "3.398"
                        },
                        "BudgetYearThree": {
                            "val": "5.000"
                        },
                        "BudgetYearFour": {
                            "val": "4.027"
                        },
                        "BudgetYearFive": {
                            "val": "4.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The level of resourcing for the Prompt Global Strike Capability Development program reflects iterative reductions from efficiencies and budget reductions, which reduces the Department's ability to develop flexible responsive solutions to emerging war fighter needs.  This Program Element (PE) was established to develop and demonstrate technologies and applications that advance conventional prompt global strike (CPGS) warfighting capabilities. The program uses a national team with coordination between the Services, Agencies and national research laboratories to pursue integrated portfolio objectives of the acquisition and operation of a CPGS system.  This program funds the design, development, and experimentation of boosters, payload delivery vehicles (PDVs), non-nuclear warheads, guidance systems, and mission planning and enabling capabilities. To support these development activities, the program procures modeling and simulation capabilities, command and control interfaces, test range support, and launch system infrastructure.  Additionally, expert resources address strategic policy and treaty issues. Program emphasis is on demonstrating component and subsystem technology maturity with risk reduction initiatives.  Program timing will be driven by the outcome of flight test events and DoD budgets.  In FY 2015, funding for the individual service initiatives will be contingent upon their abilities to execute and achieve satisfactory progress towards project goals as determined by the CPGS portfolio manager."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "OSD CPGS Studies"
                                    },
                                    "Description": {
                                        "val": "This sub-project supports emergent CPGS study efforts.  In addition, it also supports application of the Prompt Global Strike Analysis of Alternatives results, requirements development, CPGS basing alternatives, analysis and defining of mission enabling technologies, measures to avoid conventional missile launch ambiguity.  Finally, it supports administrative activities associated with the management and execution of this PE."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.600"
                                            },
                                            "Text": {
                                                "val": "- Initiated Command and control overlay study in parallel with planned CPGS Flight Tests\n- Initiated CPGS concept assessment of alternative technologies and associated costs\n- Conducted booster system integration studies\n- Conducted Warhead fusing studies\n- Continued thermal modeling and simulation"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.440"
                                            },
                                            "Text": {
                                                "val": "-Conduct mid-term demonstrations in support of AHW Flight Test 2 to include operational overlay\n-Continue Command and control overlay study in parallel with planned CPGS Flight Tests\n-Continue CPGS concept assessment of alternative technologies and associated costs\n-Continue booster system integration studies\n-Continue Warhead fusing and lethality studies\n-Continue thermal modeling and simulation"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.562"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.562"
                                            },
                                            "Text": {
                                                "val": "- Conduct cost assessment studies for future system development\n- Conduct booster system integration studies\n- Conduct lethality and warhead fusing studies\n- Continue thermal modeling and simulation"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}