{
    "id": "4630ae1d9b76c38f4ccc5258fc686ca7bd63b00a",
    "meta": {
        "filename": "dod-2015_RDTE_2015_OSD_RDTE_JustificationBook_Office_of_Secretary_Of_Defense_PB_2015.zzz_unzipped_RDTE_JustificationBook_Office_of_Secretary_Of_Defense_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602670D8Z"
        },
        "ProgramElementTitle": {
            "val": "Human Social Culture Behavior (HSCB) Modeling Applied Research"
        },
        "R1LineNumber": {
            "val": "19"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "5.049"
            },
            "CurrentYear": {
                "val": "2.000"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The OSD HSCB Modeling Program is a vertically integrated effort to research, develop, and transition technologies, tools, and systems to programs of record and users in need.  The program exists to optimize U.S. forces’ ability to perform population-centric sensing, understand behaviors driven by social and cultural variables, and select effective courses of action in the full range of military operations.  Program research will enhance population-centric intelligence, surveillance, and reconnaissance (ISR) capabilities for understanding the increasingly complex global environment to address national strategic challenges such as instability, aggression, proliferation of weapons of mass destruction, and violent extremism.  In three integrated program elements (PE), the program will conduct applied research, mature and demonstrate advanced technology, and develop transitionable methods, technology, tools, and prototypes.  Work under PE 0602670D8Z will focus on developing an applied science base, to include validated theory and methods, along with knowledge products and resources to support sociocultural behavior data collection, analysis and forecasting of sociocultural behavior, course of action planning, and effects analysis.  Research will address needs in two areas:  modeling and data.  It will develop and validate theoretical constructions, generate knowledge products, and develop stand-alone computational models of sociocultural behavior; and improve methods for collecting data that will facilitate model development and enhance forecasting and analysis capabilities.  The program will ensure that supported research is clearly tied to warfighters and their needs. \n\nHuman behavior based theory, knowledge products, and stand-alone models will support development of software to help users represent, understand, and forecast sociocultural behavior at strategic, operational, and tactical levels.\n\nImproved data collection methods will help build the sociocultural science base, facilitate subsequent model development and validation, and address emerging data types and sources."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "6.771"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "5.049"
                },
                "CurrentYear": {
                    "val": "2.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.722"
                },
                "CurrentYear": {
                    "val": "2.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "-0.548"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "-0.009"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "2.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.978"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.184"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.003"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P270"
                    },
                    "ProjectTitle": {
                        "val": "Human Social Culture Behavior (HSCB) Modeling Applied Research"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.049"
                        },
                        "CurrentYear": {
                            "val": "2.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The OSD HSCB Modeling Program is a vertically integrated effort to research, develop, and transition technologies, tools, and systems to programs of record and users in need.  The Program exists to optimize U.S. forces’ ability to perform population-centric sensing, understand behaviors driven by social and cultural variables, and select effective courses of action in the full range of military operations.  Program research will enhance population-centric intelligence, surveillance, and reconnaissance (ISR) capabilities for understanding the increasingly complex global environment to address national strategic challenges such as instability, aggression, proliferation of weapons of mass destruction, and violent extremism.  In three integrated program elements (PEs), the Program will conduct applied research, mature and demonstrate advanced technology, and develop transitionable methods, technology, tools, and prototypes.  Work under PE 0602670D8Z will focus on developing an applied science base, to include validated theory and methods, along with knowledge products and resources to support sociocultural behavior data collection, analysis and forecasting of sociocultural behavior, course of action planning, and effects analysis.  Research will address needs in two areas:  modeling and data.  It will develop and validate theoretical constructions, generate knowledge products, and develop stand-alone computational models of sociocultural behavior; and improve methods for collecting data that will facilitate model development and enhance forecasting and analysis capabilities.  The Program will ensure that supported research is clearly tied to warfighters and their needs. \n\nHuman behavior based theory, knowledge products, and stand-alone models will support development of software to help users represent, understand, and forecast sociocultural behavior at strategic, operational, and tactical levels.\n\nImproved data collection methods will help build the sociocultural science base, facilitate subsequent model development and validation, and address emerging data types and sources."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Human Behavior Based Theory and Model Development"
                                    },
                                    "Description": {
                                        "val": "Conduct the research necessary to develop and refine theoretical constructs and validate them using empirical data.  Develop knowledge products including conceptual models, decision frameworks, and ontologies that will support population-centric sensing.  Apply validation techniques to quantitative models of sociocultural factors in coalition warfare and sociocultural factors of military significance for emerging conflicts.  Develop stand-alone models that instantiate social science theoretical constructs to address mission-specific needs to support population centric sensing and warning."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.005"
                                            },
                                            "Text": {
                                                "val": "Completed the development and demonstration of model-based tools for understanding adversarial networks and tracking the impacts of adversary communications.  Completed the development of several advanced methods for tracking narrative to monitor and mitigate violent extremism.  Used empirical data to develop a model that estimates mobility (for example (e.g.) commuting trips) and communication (e.g. number of phone calls) fluxes between any two regions (e.g. cities, counties, etc.) under normal conditions.  Utilized unclassified commercial satellite imagery and raw survey data from Afghanistan to develop models for predicting survey responses of villages based on imagery features.  Delivered several models to detect indicators of instability at levels below country\/state using geographically clustered data.  Built cross-national comparative sets of data on the relationship between attitudes toward Western values, access to emerging media, and tolerance for extremism and violence."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Develop “Big Data” modeling and analysis tools that support construction of intelligence-driven operational views providing decision makers with the ability to make better decisions faster.  Social, broadcast, and print media data sources could then be used to identify “tripwires” that indicate adversarial activity, including non-State actors\/terrorists and criminal organizations.  Develop understanding of how the Master Narratives of Islamic Extremism differ between the Middle East and the Asia-Pacific region."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Data Collection Methods"
                                    },
                                    "Description": {
                                        "val": "Develop scientifically validated strategies to collect cultural and societal information in denied or difficult to penetrate areas.  Develop methodologies and supporting technologies capable of extracting relevant data into databases for further modeling to support denied, restricted, or unavailable area sociocultural data.  Develop technologies capable of leveraging extracted data, and processing and validating it, with a particular focus on data from social media."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.044"
                                            },
                                            "Text": {
                                                "val": "Developed and validated several new natural language processing (NLP) techniques to extract eight features of bi-directional sentiment expressions from blog discussions and news sources (i.e. evoker, reactor, sentiment phrase, date, magnitude, direction, modality, and issue).  These techniques serve as a viable alternative to surveys or polling in denied or difficult-to-penetrate areas.  Delivered assessment of the HSCB factors that can be inferred from overhead imagery and the limitations of imagery-derived data.  Developed automated methods for determining sentiment in social media\/news to support military operations.  Validated new methods for collection of data from open sources, including emerging media."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Develop data collection tools that allow analysts to quickly aggregate information based on model output recommendations (“tripwires”).  These tools will allow easy aggregation of information including people of international interest infrastructure documentation, and data from physical sensors."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "PE 0603670D8Z BA 3"
                                    },
                                    "Title": {
                                        "val": "HSCB Advanced Development"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "6.994"
                                        },
                                        "CurrentYear": {
                                            "val": "2.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "PE 0604670D8Z BA 4"
                                    },
                                    "Title": {
                                        "val": "HSCB Research and Engineering"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "4.492"
                                        },
                                        "CurrentYear": {
                                            "val": "2.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}