{
    "id": "464c72957ef8ca1af7a8e689975b8d0fb4942506",
    "meta": {
        "filename": "dod-2015_RDTE_2015_ARMY_BA2_RDTE_JustificationBook_Army_PB_2015.zzz_unzipped_RDTE_JustificationBook_Army_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602270A"
        },
        "ProgramElementTitle": {
            "val": "Electronic Warfare Technology"
        },
        "R1LineNumber": {
            "val": "9"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "13.838"
            },
            "CurrentYear": {
                "val": "17.575"
            },
            "BudgetYearOne": {
                "val": "18.502"
            },
            "BudgetYearOneBase": {
                "val": "18.502"
            },
            "BudgetYearTwo": {
                "val": "19.383"
            },
            "BudgetYearThree": {
                "val": "20.555"
            },
            "BudgetYearFour": {
                "val": "21.124"
            },
            "BudgetYearFive": {
                "val": "21.430"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) designs and validates electronic warfare (EW) components that deny, disrupt, or degrade the enemy's use of the electromagnetic spectrum for offensive or defensive operations. This is accomplished through the investigation of electronic support measures (ESM); countermeasures against communications systems and networks; the design and fabrication of sensors used to identify and locate threat forces in an asymmetric environment; and threat warning and electronic countermeasures (ECM) against munitions sensors, missile guidance systems, targeting systems, and booby traps. Project 906 supports protection of high-value ground platforms, aircraft and the Soldier from threat surveillance and tracking systems, imaging systems, and advanced radio frequency (RF)\/electro-optical (EO)\/infrared (IR) missiles, artillery, and smart munitions. Information fusion research addresses sensor correlation and fusion, relationship discovery, and management services through use of automated processing, as well as software that applies higher level reasoning techniques to support automated combat assessment. Project 906 also supports research and application of key EW sensors, direction finders and jammers to intercept, locate, and disrupt current and emerging communications and non-communications threat emitters to provide vital quality combat information directly to users in a timely and actionable manner. Specifically, it focuses on detection of threat sensors and emitters associated with weapon systems, targeting systems and command, control, communications, computers, and intelligence systems and networks. \n\nWork in this PE is complimentary of PE 0602120A (Sensors and Electronic Survivability), PE 0603270A (Electronic Warfare Technology), and PE 0603772A (Advanced Tactical Computer Science and Sensor Technology); and fully coordinated with PE 0603008A (Command, Control, Communications Advanced Technology) and PE 0603710A (Night Vision Advanced Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork is performed by the Army Research, Development and Engineering Command, Communications-Electronics Research, Development, and Engineering Center (CERDEC),  Aberdeen Proving Ground, MD."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "15.068"
                },
                "CurrentYear": {
                    "val": "17.585"
                },
                "BudgetYearOne": {
                    "val": "18.459"
                },
                "BudgetYearOneBase": {
                    "val": "18.459"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "13.838"
                },
                "CurrentYear": {
                    "val": "17.575"
                },
                "BudgetYearOne": {
                    "val": "18.502"
                },
                "BudgetYearOneBase": {
                    "val": "18.502"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.230"
                },
                "CurrentYear": {
                    "val": "-0.010"
                },
                "BudgetYearOne": {
                    "val": "0.043"
                },
                "BudgetYearOneBase": {
                    "val": "0.043"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.042"
                    },
                    "CurrentYear": {
                        "val": "-0.010"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "0.043"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.043"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments 1"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-1.188"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "906"
                    },
                    "ProjectTitle": {
                        "val": "Tactical Electronic Warfare Applied Research"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "13.838"
                        },
                        "CurrentYear": {
                            "val": "17.575"
                        },
                        "BudgetYearOne": {
                            "val": "18.502"
                        },
                        "BudgetYearOneBase": {
                            "val": "18.502"
                        },
                        "BudgetYearTwo": {
                            "val": "19.383"
                        },
                        "BudgetYearThree": {
                            "val": "20.555"
                        },
                        "BudgetYearFour": {
                            "val": "21.124"
                        },
                        "BudgetYearFive": {
                            "val": "21.430"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project designs, fabricates, evaluates, and applies key electronic warfare (EW)\/information operations technologies to enhance platform survivability (to include ground combat vehicles, aircraft, and the dismounted Soldier) and to intercept, track and locate current and emerging threat munitions, communications and non-communications threat emitters. This project applies recent advances in radio frequency (RF), infrared (IR), and electro-optical (EO) sensors and jamming sources to detect, locate, deceive, and jam threats (to include radar directed target acquisition systems, target-tracking sensors, surface-to-air missiles (SAMs), air-to-air missiles (AAMs), top attack weapons, and electronically fuzed munitions). This project also pursues the ability to neutralize booby traps. This project designs information systems to provide vital, quality combat information directly to users in a timely, actionable manner in accordance with concepts for future force intelligence operations. This project investigates RF collection and mapping technologies to offer real time emitter detection, location, and identification. In addition, this project enables a remote capability to disrupt, deny, or destroy threat communication signals and enables fusion (automated assimilation and synthesis) of battlefield intelligence data to enable interpretation of current threats and future enemy activities. This allows commanders to develop operational courses of action in time to act decisively and in a pre-emptive manner.\n\nThis project supports Army science and technology efforts in the Command, Control, Communications and Intelligence, Ground Maneuver, Soldier\/Squad and Air portfolios.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Army Research, Development, and Engineering Command, Communications-Electronics Research, Development, and Engineering Center (CERDEC), Aberdeen Proving Ground, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Multi-Intelligence Data Fusion and Targeting"
                                    },
                                    "Description": {
                                        "val": "This effort investigates, designs and codes advanced automated exploitation and fusion analysis tools, applications, and software services for the creation of improved intelligence products, common information management and information dissemination systems to facilitate collaboration between intelligence and mission command functions. This will provide relevant and timely information in support of command decisions, such as high value identification and targeting in an asymmetric environment. Work being accomplished under PE 0603772A\/project 243 compliments this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.994"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Created and populated non-cooperative biometrics database and assessed effectiveness of near-real-time matching and fusion algorithms and data templates; interfaced cooperative and non-cooperative biometrics databases together to permit sharing and fusion of data; evaluated ability to simultaneously collect, query and match biometrics data in near-real-time using representative tactical communications system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.777"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigate cultural, psychological, social and physical environment and time variables for improving automated reasoning and analysis software ability to track and make associations between persons, places and events of interest; research political, military, economic, social, infrastructure and information (PMESII) data standards and develop models to assess how cultural and PMESII factors can influence support or alter decisions during military planning and execution."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.720"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.720"
                                            },
                                            "Text": {
                                                "val": "Will investigate methods to fuse biometric enabled intelligence analysis results with other forms of intelligence data to improve the overall quality of data products; design methods and analysis software tools and algorithms to extract biometric and contextual data from streaming video sources; begin design and coding of software tools to assign quality scores to data gathered from non-dedicated biometric sources."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Offensive Information Operations Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort deigns, codes and evaluates cyber software, tools and techniques that identify and capture data traversing targeted networks for the purpose of computer network operations (CNO) or otherwise countering adversary communications. Cyber capabilities include detection, identification, exploitation, direction finding (DF), geolocation, and denial of service. Work being accomplished under PE 0603270A\/project K15 compliments this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.146"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigated denial of service\/offensive cyber techniques to counter new threat devices; extended capabilities developed for legacy threat devices to enable a coordinated tactical cyber capability against multiple targets and threat devices simultaneously; designed and evaluated offensive denial of service techniques on tactical cyber-capable platforms, to include software defined radios and other ground\/air-based sensors and transmitters."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.061"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Refine cyber effects and situational awareness techniques for various protocols and signals-of-interest (SOIs); enhance current electronic warfare networking protocol extensions as applicable to enable tactical cyber capabilities; develop advanced cyber techniques."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.901"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.901"
                                            },
                                            "Text": {
                                                "val": "Will investigate the impacts on cyber\/EW techniques of converging disparate RF devices into a common hardware and software platform; develop coordinated cyber\/EW techniques to exploit tactically relevant targets; analyze and develop performance predictions for various techniques being employed on different cyber and EW platforms."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multispectral Threat Warning"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and evaluates software and sensor\/countermeasure components to increase probability of detection of small arms and probability of detection and defeat of man-portable air defense system (MANPADS) type threats for aviation platforms using modeling and simulation (M&S) and hardware in the loop (HIL) simulations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.269"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Created an end-to-end M&S environment to develop countermeasures against advanced imaging missiles consisting of realistic representations of the missile digital seekers, their rotorcraft targets, likely countermeasures, effects and atmospheric effects; used this environment to assess effectiveness of known countermeasures and explore new countermeasure techniques to use against these threats; integrated digital seeker hardware surrogates into this M&S environment for use in HIL simulations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.678"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Validate M&S environment and new countermeasure techniques; validate digital seeker hardware surrogate performance in the modeling environment and HIL simulations; evaluate known countermeasures in the M&S environment to assess effectiveness; investigate new countermeasure techniques to use against advanced threats."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.332"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.332"
                                            },
                                            "Text": {
                                                "val": "Will evaluate effectiveness of current countermeasures techniques against additional classes of emerging multi-spectral threats required by Common IR Countermeasures program of record; expand laboratory and M&S environment to accommodate assessment of advanced threat countermeasures; initiate design, fabrication and encoding of techniques and technologies that provide countermeasures against multi-spectral IR and RF threats; investigate multi-band signature management exploitation and design correlation techniques for improved threat detection, identification and countermeasures."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi-Function Intelligence, Surveillance and Reconnaissance (ISR) Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and codes software algorithms and techniques to intelligently integrate tactical ISR sensors, improve their individual performance and increase the effectiveness of battlespace awareness\/intelligence data in an area of operations. Efforts focus on networking of sensors in support of area\/base camp protection and investigating an open, scalable architecture adaptable for multiple base sizes and environments and other ISR sensors. Work being accomplished under PE 63772\/243 complements this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.429"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Designed and validated radar waveforms to enable communication and coordination between similar radar sensors without the need for a central node; designed and implemented noise correlation algorithms to mitigate signal interception and compromise, reduce co-site interference and preserve high resolution target detection capability."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.759"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Assess radar waveforms designed to coordinate radar sensors without the need for a central interface node, facilitating radar data sharing and cross cueing; investigate and analyze the performance of noise correlation radar algorithms in operationally relevant hardware platforms to assess their ability to mitigate signal interception and compromise, reducing co-site interference and preserving high resolution target detection capability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.349"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.349"
                                            },
                                            "Text": {
                                                "val": "Will study the feasibility of combining a series of synthetic aperture radar (SAR) images to develop a motion video-like data product for more reliable entity resolution and real time tracking; establish metrics for measuring and judging the quality of SAR motion video products; investigate techniques to identify and mitigate the impact of intentional red force interference sources on friendly ISR assets."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Electronic Warfare Architectures and Countermeasures"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and evaluates the technical specifications of a family of threats to develop nonkinetic countermeasures. Work being accomplished under PE 0603270A\/project K16 compliments this effort."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.300"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Analyze existing EW system components to determine if they may be dual use to address multiple threats or types of threats; develop extensions to traditional EW system architecture to enable a new EW architecture comprised of distributed peripheral components that can be centrally controlled and managed; identify and assess critical components associated with known and emerging threat devices to support laboratory assessments through component and\/or surrogate experiments; design and code modeling and simulation resources to enable live, virtual and constructive electronic warfare laboratory assessments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.200"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.200"
                                            },
                                            "Text": {
                                                "val": "Will analyze existing blue force ground EW systems to determine potential deficiencies or weaknesses in the system design and implementation that could be exploited by red forces; investigate emerging red force EW system architectures to identify design characteristics that can be exploited by blue force EW systems to limit their effectiveness."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}