{
    "id": "4ce450284a5f161cc51a783f09b37bec0bf083bc",
    "meta": {
        "filename": "dod-2015_RDTE_2015_ARMY_BA2_RDTE_JustificationBook_Army_PB_2015.zzz_unzipped_RDTE_JustificationBook_Army_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602712A"
        },
        "ProgramElementTitle": {
            "val": "Countermine Systems"
        },
        "R1LineNumber": {
            "val": "20"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "28.875"
            },
            "CurrentYear": {
                "val": "30.563"
            },
            "BudgetYearOne": {
                "val": "25.939"
            },
            "BudgetYearOneBase": {
                "val": "25.939"
            },
            "BudgetYearTwo": {
                "val": "25.251"
            },
            "BudgetYearThree": {
                "val": "26.677"
            },
            "BudgetYearFour": {
                "val": "26.842"
            },
            "BudgetYearFive": {
                "val": "27.180"
            }
        },
        "ProgramElementNote": {
            "val": "FY13 adjustments atttributed to increases for Congressional Add funding (13.0 million); and SBIR\/STTR transfers (-415 thousand); Congressional General reductions (-49 thousand); and Sequestration reductions (-2.5 million)\nFY 14 adjustments attributed to increase for Congressional Add funding (10.0 million) and FFRDC reductions (-11 thousand) \nFY15 increase for counter explosive hazard phenomenology."
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) investigates, designs, and evaluates technologies to improve countermine, signature management and counter-sensors capabilities. The focus is on sensor components, sub-components and software algorithms to improve detection of mines, explosive threats and directed energy; ballistic methods to defeat mines and explosive threats; and signature management technologies to reduce reconnaissance capabilities of the enemies. This PE also supports DoD's Center of Excellence for Unexploded Ordnance, which coordinates and standardizes land mine signature models, maintains a catalogue of mine signatures, supports the evaluation of mine detection sensors and algorithms, and working in conjunction with the US Army Engineer, Research and Development Center (ERDC), examines countermine phenomenology of surface and buried mines, and explosive threats. Project H24 advances state of the art Countermine technologies to accurately detect threats with a high probability, reduce false alarms, and enable an increased operational tempo. Project H35 evaluates and develops advanced signature management and deception techniques for masking friendly force capabilities and intentions.  \n\nWork in this PE is related to and fully coordinated with PE 0602120A (Sensors and Electronic Survivability), PE 0602622A (Chemical, Smoke and Equipment Defeating Technology), PE 0602624A (Weapons and Munitions Technology), PE 0602709A (Night Vision Technology), PE 0602784A (Military Engineering Technology), PE 0603004A (Weapons and Munitions Advanced Technology), PE 0603606A (Landmine Warfare and Barrier Advanced Technology), and PE 0603710A (Night Vision Advanced Technology). \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy. \n\nWork in this PE is performed by the U.S. Army Research, Development and Engineering Command (RDECOM)\/Communications-Electronics Research, Development and Engineering Center (CERDEC)\/Night Vision and Electronic Sensors Directorate(NVESD), Fort Belvoir, VA."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "18.850"
                },
                "CurrentYear": {
                    "val": "20.574"
                },
                "BudgetYearOne": {
                    "val": "21.542"
                },
                "BudgetYearOneBase": {
                    "val": "21.542"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "28.875"
                },
                "CurrentYear": {
                    "val": "30.563"
                },
                "BudgetYearOne": {
                    "val": "25.939"
                },
                "BudgetYearOneBase": {
                    "val": "25.939"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "10.025"
                },
                "CurrentYear": {
                    "val": "9.989"
                },
                "BudgetYearOne": {
                    "val": "4.397"
                },
                "BudgetYearOneBase": {
                    "val": "4.397"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.049"
                    },
                    "CurrentYear": {
                        "val": "-0.011"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "13.000"
                    },
                    "CurrentYear": {
                        "val": "10.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.415"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "4.397"
                                },
                                "BudgetYearOneBase": {
                                    "val": "4.397"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Sequestration"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-2.511"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "H24"
                    },
                    "ProjectTitle": {
                        "val": "Countermine Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "14.220"
                        },
                        "CurrentYear": {
                            "val": "17.499"
                        },
                        "BudgetYearOne": {
                            "val": "20.909"
                        },
                        "BudgetYearOneBase": {
                            "val": "20.909"
                        },
                        "BudgetYearTwo": {
                            "val": "19.587"
                        },
                        "BudgetYearThree": {
                            "val": "20.961"
                        },
                        "BudgetYearFour": {
                            "val": "21.069"
                        },
                        "BudgetYearFive": {
                            "val": "21.382"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project investigates, designs and evaluates new countermine components, sub-components and software algorithms for detection, discrimination and neutralization of individual mines, minefields and other explosive threats. The goal of this project is to accurately detect threats with a high probability, reduce false alarms and enable an increased operational tempo.  \n\nThis project supports Army science and technology efforts in the Ground, Command, Control, Communications and Intelligence, Air and Soldier portfolios. \n         \nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the U.S. Army Communications-Electronics Research, Development and Engineering Center (CERDEC)\/Night Vision and Electronic Sensors Directorate, Fort Belvoir, VA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Department of Defense Unexploded Ordnance (UXO) Center of Excellence (UXOCOE)"
                                    },
                                    "Description": {
                                        "val": "The Army serves as executive agent of the Unexploded Ordnance (UXO) Center of Excellence (COE), which provides for the coordination of UXO activities across the Department of Defense (DoD) Army, Navy, Air Force and Marine Corps programs. The UXOCOE serves as the focal point for research, development, testing and evaluation (RDT&E) for UXO detection, clearance technologies, remediation and sensor\/signature\/DOD program database development. Technologies investigated for mitigating UXO are oriented to land and underwater approaches."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.360"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigated various UXO detection sensors, performed field data collections against UXO surrogates and real targets in realistic background environments and updated the signature database."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.453"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Research a high power laser neutralization source that enables safe standoff removal of wire obstacles while on the move."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Standoff Sensors for Explosive Hazard Detection"
                                    },
                                    "Description": {
                                        "val": "This effort investigates all-terrain standoff detection using novel sensors and detection algorithms, including low grazing angle algorithms for forward looking Electro-Optic\/Infrared (EO\/IR) and RADAR sensors, to increase identification and reduce false alarm rates (FAR) of explosive hazards. This effort also investigates new sensor phenomenologies to confirm buried threats at deeper depths (up to 1.5 meters deep) such as those from multispectral, low frequency electro-magnetic (EM), and low parity doppler interferometric sensors."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.065"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Designed and fabricated a multi-band ground penetrating radar (GPR) demonstrator integrating both downward looking and forward projecting antennas; began field data collections and evaluations using GPR demonstrator, based on the results, refined hardware and improved software target recognition algorithms to improve probability of detection and lower false alarm rates; investigated phenomenological standoff vibration technology in combination with the EM, electromagnetic interference (EMI) and EO based sensors for detection of shallow and more deeply buried explosive hazards; improved software to automatically adapt to available sensor inputs in real time."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.559"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Validate designs of component antenna arrays and conduct experiments for a multi-band forward looking GPR demonstrator; investigate EO forward projecting laser radar (LADAR) to assist forward looking radar; develop advanced detection algorithms utilizing high resolution surface terrain information obtained from the integration with LADAR; conduct field data collections of standoff vibration technology in combination with the EM, EMI and EO based sensor for detection of shallow and more deeply buried explosive hazards; enhance visualization workstation software to incorporate available sensor inputs in real time."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.409"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.409"
                                            },
                                            "Text": {
                                                "val": "Will integrate dual band Forward Looking Ground Penetrating Radar (FLGPR) and EO\/IR sensors on a brassboard demonstrator; conduct phenomenology studies to determine feasibility of fusion of multiple sensor modalities for improved detection; extend detection depth of low parity Doppler interferometer using seismic sources."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Chemically Specific Detection of Explosive Threats"
                                    },
                                    "Description": {
                                        "val": "This effort investigates emerging chemically-specific explosive hazards (to include Home Made Explosives (HMEs)) and detection technologies to address Warfighter needs. The effort will provide technologies for standoff detection and confirmation of emerging threats and production facilities and is complimentary to the work being accomplished under PE 0602622A\/Poject 552."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.532"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigated and validated emerging technologies capable of detecting explosive related threats including HME production facilities; conducted technical experiments in technologies for HME detection to include Ultraviolet (UV) laser-based Raman spectroscopy to exploit conventional and HME signatures in complex backgrounds and polymer-based sensors to exploit residues and vapors at ultra trace amounts; investigated and validated point confirmation technologies that exploit conventional and HME residues and vapors at ultra-trace amounts for classification and identification purposes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigate and validate standoff spectroscopic technologies capable of detecting explosive hazards and HME  production facilities; conduct technical experiments using eye safe, low-SWaP, Quantum Cascade Laser (QCL) technology to effectively sample the residues for trace amounts of explosives for identification and standoff illumination for disturbed earth detection."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.815"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.815"
                                            },
                                            "Text": {
                                                "val": "Will improve algorithms and signal processing to maximize discrimination and reduce false alarms of explosive components; conduct data collections in various conditions to determine detection and identify capabilities against explosive compounds using quantum dots for close proximity sensing and QCLs for stand-off trace detection."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Dismounted Explosive Hazard Detection Technology"
                                    },
                                    "Description": {
                                        "val": "This effort investigates emerging technologies enabling the dismounted Soldier to detect explosive hazards. In addition to landmine threats, explosive hazards include: IEDs, HMEs, explosively formed penetrators (EFPs) and antitank\/antipersonnel landmines (metal and non-metallic). Emphasis will be on rate-of-advance, high detection probability and low false alarm rates. SWaP issues will be considered and studied to ensure solutions are viable for Soldier-portable applications. This effort investigates the processing and fusion of GPR and metal detector signals coupled with novel algorithms for increased real-time feedback on threat identification and sensor control."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.263"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigated emerging electromagnetically-based sensor technology and novel helmet-mounted electro-optical sensors; explored front-end physical and explosive materials sampling approaches oriented towards enhancing short-range standoff explosive hazard detection technologies as a component of a conceptual plug-and-play sensor suite for dismounted operations; leveraged emerging technologies, such as advanced ground penetrating radar antennas, hyperspectral imaging electro-optics, target polarization detection, compact metal detection with target identification, sensor position measurement techniques, explosives sensing materials and virtual display concepts, in combination as part of a portable handheld sensor suite for detection of a broad spectrum of explosive hazards."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.487"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Optimize and validate emerging technologies such as advanced ground penetrating radar antennas; compact metal detectors with target identification; position measurement sensors and see-thru displays as part of a portable handheld sensor suite for detection of explosive hazards."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.495"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.495"
                                            },
                                            "Text": {
                                                "val": "Will conduct laboratory data collections using GPR, wide bandwidth metal detectors, and position measurement sensors mounted in a handheld emulation platform to establish a correlated dataset; conduct experiments to determine highly accurate sensor position to improve display of sweep location and subsurface threats; develop near real-time detection and processing capability; conduct trade studies to determine the best combination of novel components and sensors for real-time detection and identification of buried explosive hazard threats using nuclear quadrupole resonance (NQR), GPR and frequency domain metal detectors."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Explosive Hazard Neutralization Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort investigates emerging neutralization technologies and techniques to effectively neutralize explosive hazards (to include HMEs) to address Warfighter needs."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.190"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.190"
                                            },
                                            "Text": {
                                                "val": "Will investigate fiber laser based techniques for low or high-order neutralization of explosive threats at standoff ranges."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Counter Explosive Hazard Phenomonology"
                                    },
                                    "Description": {
                                        "val": "This effort investigates potential long term solutions to the asymmetric explosive hazard threats. It leverages recent lessons learned to investigate new ideas and emerging technologies to counter explosive hazards through better understanding, detection, neutralization and mitigation of the threat."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "Will instigate a series of knowledge capture events with industry and academia; develop novel and innovative research  efforts in counter-Improvised Explosive Device detection; begin analysis of research areas focusing on non-traditional approaches (such as crowd sourcing and novel sensors) identified as having high potential for significant breakthroughs."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H35"
                    },
                    "ProjectTitle": {
                        "val": "Camouflage  & Counter-Recon Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.697"
                        },
                        "CurrentYear": {
                            "val": "3.064"
                        },
                        "BudgetYearOne": {
                            "val": "5.030"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.030"
                        },
                        "BudgetYearTwo": {
                            "val": "5.664"
                        },
                        "BudgetYearThree": {
                            "val": "5.716"
                        },
                        "BudgetYearFour": {
                            "val": "5.773"
                        },
                        "BudgetYearFive": {
                            "val": "5.798"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project investigates, designs and evaluates advanced signature management and deception techniques for masking friendly force capabilities and intentions. Technologies pursued under this effort reduce the cross section of sensor systems. Technologies such as decentered field lens, wavefront coding and spectral filtering and threat sensing algorithms are investigated along with next generation camouflage coatings and paints. \n\nThis project supports Army science and technology efforts in the Command, Control, Communications and Intelligence and Ground portfolios.  \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the U.S. Army Communications-Electronics Research, Development and Engineering Center (CERDEC)\/Night Vision and Electronic Sensors Directorate, Fort Belvoir, VA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Camouflage and Counter-Reconnaissance Technology for Advanced Spectral Sensors"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and advances new techniques to reduce electro-optical (EO) susceptibility of sensors and camouflage. The two primary objectives are to reduce the optical cross section of currently fielded and emerging EO and infrared (IR) sensors and investigate technologies that will enable enhanced spectral signature reduction for next generation camouflage."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.697"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Leveraged previous funded efforts to design new approaches to reduce the optical cross section of emerging staring sensors, including large format arrays in the visible, near IR, shortwave IR, thermal and uncooled longwave IR (LWIR); conducted thermal signature studies for future development of IR signature reduction techniques, approaches included modified optics, computational imaging, polarization control and antireflection coatings. Investigated two sided camouflage netting for the Ultra Lightweight Camouflage and Netting System program; performed laboratory and field evaluations from FY12 developed prototypes and developed specifications for the next generation Army netting."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.064"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue development of solutions to reduce optical cross section of large format (EO\/IR) arrays; develop and investigate hardware\/software, filters and coatings for currently fielded large format EO and uncooled IR sensors; camouflage effort focuses on implementation of thermal signature reduction coatings and methodologies suitable for nets and uniforms."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.030"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.030"
                                            },
                                            "Text": {
                                                "val": "Will investigate uncooled focal plane array vulnerabilities and exploitation against multiple laser threats; conduct initial studies into adaptive protection for LWIR sensors; incorporate large format array sensor protection solution into hardware\/software demonstrators; evaluate multispectral camouflage to include thermal signature reduction technology."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "HB2"
                    },
                    "ProjectTitle": {
                        "val": "COUNTERMINE COMPONENT TECHNOLOGY (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "11.958"
                        },
                        "CurrentYear": {
                            "val": "10.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding for Countermine Systems applied research."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Unexploded Ordinance and Landmine Detection Research"
                                    },
                                    "Description": {
                                        "val": "This is a Congressional Interest Item."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.958"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigated advanced sensor and component technologies for vehicular mounted explosive hazard detection, using fast response standoff sensors to increase rates of advance. Sensors exploited disturbed earth and explosive specific signatures while on-the-move.  Investigated advanced technologies that enable low size, weight, and power sensors for Soldier portable, handheld, and dismounted explosive hazard detection for current and future unexploded ordnance (UXO) threats incorporating position sensing, augmented displays, wire detection, and advanced explosive specific sensors."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "This is a Congressional Interest Item."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}