{
    "id": "4dc4d577d2185d5645498d81ec33b1eeaf7a8281",
    "meta": {
        "filename": "dod-2015_RDTE_2015_NAVY_BA5_RDTE_JustificationBook_Navy_PB_2015.zzz_unzipped_RDTE_JustificationBook_Navy_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604378N"
        },
        "ProgramElementTitle": {
            "val": "Nav Integrated Fire Control-Counter Air Sys Eng"
        },
        "R1LineNumber": {
            "val": "111"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "94.687"
            },
            "PriorYear": {
                "val": "35.872"
            },
            "CurrentYear": {
                "val": "21.413"
            },
            "BudgetYearOne": {
                "val": "15.263"
            },
            "BudgetYearOneBase": {
                "val": "15.263"
            },
            "BudgetYearTwo": {
                "val": "26.167"
            },
            "BudgetYearThree": {
                "val": "21.647"
            },
            "BudgetYearFour": {
                "val": "17.319"
            },
            "BudgetYearFive": {
                "val": "17.647"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "3159 Naval Integrated Fire Control - Counter Air (NIFC-CA) Systems Engineering Integration and Test (SEI&T) project is a systems engineering effort to extend the Naval Theater Air and Missile Defense battlespace out to the maximum kinematic range of our weapons. This includes targets beyond the detection range of the shooter, including Engage On Remote (EoR) and Over the Horizon (OTH) targets. The NIFC-CA project exploits capabilities inherent in existing systems, optimizes current and emerging technologies in component system upgrades, integrates them together, and performs kill chain tests, forming an interoperable System of Systems (SoS) to maximize future air defense capabilities. As directed by OPNAV, the project is focused on SEI&T efforts to integrate the From The Sea (FTS) kill chain consisting of the E-2D Advanced Hawkeye, Cooperative Engagement Capability (CEC), AEGIS, and SM-6 missile. This PE will support efforts including system definition and architecture development, performance prediction, performance assessment, system test and risk reduction efforts, system analysis, modeling and simulation, and capability demonstrations for the FTS kill chain. The project also facilitates the development of the concept of operations with the warfighter to maximize effectiveness when deployed with the Fleet."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "39.974"
                },
                "CurrentYear": {
                    "val": "21.413"
                },
                "BudgetYearOne": {
                    "val": "21.414"
                },
                "BudgetYearOneBase": {
                    "val": "21.414"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "35.872"
                },
                "CurrentYear": {
                    "val": "21.413"
                },
                "BudgetYearOne": {
                    "val": "15.263"
                },
                "BudgetYearOneBase": {
                    "val": "15.263"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-4.102"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-6.151"
                },
                "BudgetYearOneBase": {
                    "val": "-6.151"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.763"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-6.151"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-6.151"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-3.339"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY13 Congressional General Reduction (Sequestration)\nFY15 decrease in funding from the previous President's Budget submit is due to the Department's decision to reduce contracted services as well as to realign resources to match expected expenditures."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "3159"
                    },
                    "ProjectTitle": {
                        "val": "Naval Integrated Fire Control-Counter Air SE&I"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "94.687"
                        },
                        "PriorYear": {
                            "val": "35.872"
                        },
                        "CurrentYear": {
                            "val": "21.413"
                        },
                        "BudgetYearOne": {
                            "val": "15.263"
                        },
                        "BudgetYearOneBase": {
                            "val": "15.263"
                        },
                        "BudgetYearTwo": {
                            "val": "26.167"
                        },
                        "BudgetYearThree": {
                            "val": "21.647"
                        },
                        "BudgetYearFour": {
                            "val": "17.319"
                        },
                        "BudgetYearFive": {
                            "val": "17.647"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "3159 Naval Integrated Fire Control - Counter Air (NIFC-CA) Systems Engineering Integration and Test (SEI&T) project is a systems engineering effort to extend the Naval Theater Air and Missile Defense battlespace out to the maximum kinematic range of our weapons.  This includes targets beyond the detection range of the shooter, including Engage On Remote (EoR) and Over the Horizon (OTH) targets.  The NIFC-CA project exploits capabilities inherent in existing systems, optimizes current and emerging technologies in component system upgrades, integrates them together, and performs kill chain tests, forming an interoperable System of Systems (SoS) to maximize future air defense capabilities.  NIFC-CA consists of three kill chains called From the Air (FTA), From the Sea (FTS), and From the Land (FTL).  As directed by OPNAV, the project is focused on SEI&T efforts to integrate the From The Sea (FTS) kill chain consisting of the E-2D Advanced Hawkeye, Cooperative Engagement Capability (CEC), AEGIS, and SM-6 missile.  This PE will support efforts including system definition and architecture development, performance prediction, performance assessment, system test and risk reduction efforts, system analysis, modeling and simulation, and capability demonstrations for the FTS kill chain.  The project also facilitates the development of the concept of operations with the warfighter to maximize effectiveness when deployed with the Fleet."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Integration and Test (I&T) Integrated Product Team"
                                    },
                                    "Description": {
                                        "val": "The Integration and Test (I&T) Integrated Product Team (IPT) develops and executes the test plan to assess the FTS operational capability, performs risk reduction testing leveraging various component system tests.  Test data will be used over time to verify, validate, and accredit the FTS simulation federation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.422"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed 38 successful over land simulated engagements (Trackex) and projects Over land FTS live-fire test at White Sands Missile Range (WMSR), NM.  Completed 16 successful over sea simulated engagements (Trackex) and first ever at sea FTS live-fire demonstration at Pacific Missile Test Center (PMTC), Point Mugu, CA using CG-62 USS CHANCELLORSVILLE, tactical CEC and SM-6.  Verified System of Systems performance using remote sensor data to meet NIFC-CA Objectives."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.987"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue execution of test program including 18 successful over land simulated engagements leading up to FTS live-fire test at WSMR planned in March.  Plan execution of numerous at sea simulated engagements leading to 3 FTS live-fire test at PMTC planned in June on board DDG-53 JOHN PAUL JONES."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.344"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.344"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue execution of test program, support post mission analysis, and provide input and analysis of tracking exercises (TrackEx) leading to 2 FTS live fire test (LFT) events to further define the battlespace.  Continue employment of Fleet Training in order to deploy capability on the Theodore Roosevelt Carrier Strike Group (TR CSG) during 2Q FY 2015."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "ENGINEERING MANAGMENT AND SYSTEM DEFINITION"
                                    },
                                    "Description": {
                                        "val": "Engineering management and system definition including the development of the Systems Performance Document (SPD), SoS functional allocations, requirements, traceability, SoS trades studies, SoS information exchange requirements, interface specifications, and sensor network capability analysis.  Provides for complete FTS kill chain performance analysis and interface verification through development of a federation of simulations provided directly from the FTS Programs of Record.  Federated SoS simulations support architecture development, scenario development, predictive analysis for testing, and define capabilities and limitations of FTS kill chain performance analysis and interface verification through development of a federation of simulations provided directly from the FTS Programs of Record. Federated SoS simulations support architecture development, scenario development, predictive analysis for testing, and define capabilities and limitations of FTS kill chain for deployment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.450"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued integration of updated Pillar program models into the NIFC-CA Federation to support pre-mission and post-mission analysis for NIFC-CA test events for overland and over sea testing.  Conducted verification and validation efforts.  Provided feedback to Pillar programs on performance deltas following Trackex and live fire scenarios overland and sea.  Continues to ensure that Measure of Effectiveness (MOEs) and Measure of Performance (MOPs) are validated in test plans and interface with Pillar programs to maintain and update interface and\tperformance specifications. Updated and maintained NIFC-CA Risk\tRegister."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.426"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue integration of Pillar program models into the NIFC-CA\tFederation to support pre-mission and post-mission analysis for NIFC-CA test events for upcoming over land and over sea trackex and live fire events scheduled for March (overland) and June (over sea). Conduct  verification and initial validation efforts.  Continue to ensure that MOEs and MOPs are validated in test plans and interface withPillar programs to maintain and update interface and performance specifications.  Update NIFC-CA Architecture.  Update and maintain NIFC-CA Risk Register."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.919"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.919"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue integration of Pillar program models into the NIFC-CA Federation to support pre-mission and post-mission analysis for NIFC-CA test events for upcoming over land and over sea trackex and live fire events scheduled for March. Conduct verification and initial validation efforts.  Continue to ensure that MOEs and MOPs are validated in test plans and interface withPillar programs to maintain and update interface and performance specifications. Update NIFC-CA Architecture. Update and maintain NIFC-CA Risk Register. Continue employment of Fleet Training in order to deploy capability on the TR-CSG during 2Q FY 2015."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0603658N"
                                    },
                                    "Title": {
                                        "val": "CEC"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "2.313"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0604366N"
                                    },
                                    "Title": {
                                        "val": "Standard Missile SM-6"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "7.072"
                                        },
                                        "CurrentYear": {
                                            "val": "5.775"
                                        },
                                        "BudgetYearOne": {
                                            "val": "2.821"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "2.821"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "2.685"
                                        },
                                        "BudgetYearThree": {
                                            "val": "1.746"
                                        },
                                        "BudgetYearFour": {
                                            "val": "1.779"
                                        },
                                        "BudgetYearFive": {
                                            "val": "1.853"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0604307N"
                                    },
                                    "Title": {
                                        "val": "AEGIS"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "8.826"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable"
                        },
                        "PerformanceMetrics": {
                            "val": "Test Program and analysis conducted using the NIFC-CA Federation will provide data to verify NIFC-CA performance with respect to NIFC-CA MOEs, MOPs, and requirements being tracked as NIFC-CA related in the Pillar Programs.  NIFC-CA Federation, once validated using test event data, will be used to update the expected performance of NIFC-CA, as required, and provide feedback to Pillar programs."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0604378N_3159_FILE1.GIF"
                                }
                            }
                        ]
                    }
                }
            ]
        }
    }
}