{
    "id": "54333563aeaf78f24c815f7f23b9c50b96d1c249",
    "meta": {
        "filename": "dod-2015_RDTE_2015_NAVY_BA5_RDTE_JustificationBook_Navy_PB_2015.zzz_unzipped_RDTE_JustificationBook_Navy_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604504N"
        },
        "ProgramElementTitle": {
            "val": "Air Control"
        },
        "R1LineNumber": {
            "val": "115"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "58.697"
            },
            "PriorYear": {
                "val": "5.231"
            },
            "CurrentYear": {
                "val": "10.754"
            },
            "BudgetYearOne": {
                "val": "29.037"
            },
            "BudgetYearOneBase": {
                "val": "29.037"
            },
            "BudgetYearTwo": {
                "val": "69.486"
            },
            "BudgetYearThree": {
                "val": "58.328"
            },
            "BudgetYearFour": {
                "val": "70.671"
            },
            "BudgetYearFive": {
                "val": "57.863"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element provides for the development, integration, and testing of Automated Air Traffic Control (ATC)  hardware and software required to provide improved flight safety and more reliable all-weather ATC and landing system capabilities at Naval Air Stations (NASs) and Marine Corps Air Stations (MCASs) and Fleet Area Control and Surveillance Facilities (FACSFAC) worldwide.  Funded programs are required to upgrade or replace aging ATC and landing system equipment on aircraft, aircraft carriers, amphibious ships, NASs, MCASs and Navy\/Marine Corps tactical\/expeditionary airfields and remote landing sites.\n\nJUSTIFICATION FOR BUDGET ACTIVITY: This program is funded under SYSTEM DEVELOPMENT AND DEMONSTRATION because it includes those projects that have passed Milestone B approval and are conducting engineering and manufacturing development tasks aimed at meeting validated requirement prior to full-rate production decision."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "5.633"
                },
                "CurrentYear": {
                    "val": "13.754"
                },
                "BudgetYearOne": {
                    "val": "41.603"
                },
                "BudgetYearOneBase": {
                    "val": "41.603"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "5.231"
                },
                "CurrentYear": {
                    "val": "10.754"
                },
                "BudgetYearOne": {
                    "val": "29.037"
                },
                "BudgetYearOneBase": {
                    "val": "29.037"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.402"
                },
                "CurrentYear": {
                    "val": "-3.000"
                },
                "BudgetYearOne": {
                    "val": "-12.566"
                },
                "BudgetYearOneBase": {
                    "val": "-12.566"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-3.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-12.307"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-12.307"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.259"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.259"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.402"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Schedule: \nProject 0718 - has been updated to reflect additional requirements for Ground\/Air Task Oriented Radar System.  \n\nProject 0993 - has been updated due to technical delays noted below under \"technical\".  \n\nProject 3372 - (new project) schedule has been added to begin development of AN\/SPN-46 and AN\/SPN-35 Block Upgrade development program as part of the Department's precision approach landing capability (PALC) changes. \n\nFunding: \nFY13 reduction reflects sequestration and Congressional general reductions.  \nProject 0718 - In FY15, $1.2M has been added for G\/ATOR Block 4 and $2.3M has been added for Mode 5\/S integration into ATNAVICS and for Expeditionary ATC Towers upgrades.\n  \nProject 0993 - In FY14, funding reduced by $3.0M for Congressional reduction.  The Department reduced FY15 funding by $27.5M to account for schedule delays.\n  \nProject 3372 - Added funding to address the new efforts discussed under \"schedule\" above. \n\nTechnical: \nProject 0993 - has experienced delays in certifying the requirements document for the AN\/SPN-50(V)1 radar, thereby delaying the execution of the acquisition program."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0718"
                    },
                    "ProjectTitle": {
                        "val": "MATCALS"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.600"
                        },
                        "PriorYear": {
                            "val": "0.629"
                        },
                        "CurrentYear": {
                            "val": "3.624"
                        },
                        "BudgetYearOne": {
                            "val": "4.103"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.103"
                        },
                        "BudgetYearTwo": {
                            "val": "2.418"
                        },
                        "BudgetYearThree": {
                            "val": "0.632"
                        },
                        "BudgetYearFour": {
                            "val": "0.637"
                        },
                        "BudgetYearFive": {
                            "val": "0.656"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This program provides for continued development, integration, and testing of hardware and software to meet requirements for all-weather operations and improved flight safety of Air Traffic Control (ATC) and Landing Systems at Marine Corps expeditionary airfields.  An Acquisition Decision Memorandum from Jan 2005 approved the use of the U.S. Army AN\/TPN-31 Air Traffic Navigation, Integration, and Coordination System (ATNAVICS) to fulfill the Air Surveillance and Precision Approach Radar and Control System (ASPARCS) requirement for Jul 2006.  The ATNAVICS will replace the legacy ATC Precision Approach Radar (PAR), Airport Surveillance Radar (ASR), and Command and Control Subsystem with a High Mobility Multipurpose Wheeled Vehicle based PAR, ASR and Command and Control Subsystem.  The MROC Decision Memorandum 11-2005 of Dec 2004 outlines the evolutionary improvements required by Headquarters Marine Corps (HQMC).  This program works with the Marine ATC Working Group identifying the requirements to implement the P3I and evolutionary product improvements as required for G\/ATOR, ATNAVICS, Expeditionary ATC Towers, and Navigational Aids that support Marine Air Traffic Control Detachments (MATCD)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "ASPARCS Improvements"
                                    },
                                    "Description": {
                                        "val": "Investigate and resolve obsolescence issues.  Perform studies and analyses to implement P3I and other evolutionary improvements.  Develop criteria for existing ASPARCS software to achieve Defense Information Infrastructure-Common Operating Environment Level 5 compliance, Information Assurance, Radar Range Extension and Mapping functionality, and enhanced simulation and training into the existing ASPARCS software. Perform Mode 5\/S integration, operational functionality study and analyses with AN\/TPN-31(V)7 ATNAVICS System."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.629"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed ATC Remote Capability Part 1 Engineering Change Proposal (ECP).  Conducted investigation on Air Traffic Control (ATC) tower remote capability that will be compatible with both the AN\/TSQ-120C and AN\/TSQ-216 ATC towers."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.634"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete Tactical Air Navigation Modernization Part 1 ECP to reduce operational footprint and increase supportability and transportability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.913"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.913"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop Expeditionary Air Traffic Control (ATC) Tower capability improvements via the ECP process as assessed by the Decision Analysis Support (DAS) study conducted by NAVAIR 4.10.  A Data Information Part 1 ECP will be performed to address mobility, alternate power source, and locate communication (radar, visual, weather, links, Non-Classified Internet Protocol Router & Secret Internet Protocol Router) enhancing products that will provide greater situational awareness for the air traffic controller in an expeditionary environment. Perform Mode 5\/S integration, operational functionality study and analyses with AN\/TPN-31(V)7 ATNAVICS System."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ground\/Air Task Oriented Radar System (G\/ATOR) Block 4"
                                    },
                                    "Description": {
                                        "val": "G\/ATOR is multi-role, ground-based, expeditionary radar that replaces five legacy radar systems for the Marine Air Ground Task Force.  It satisfies the Marine Air Command and Control System and the Ground Counter Fire\/ Counter Battery capabilities.  The G\/ATOR replaces the AN\/TPS-63 and complements the AN\/TPS-59 long range radar and will provide mobile, multi-functional, three-dimensional surveillance of air breathing targets, detection of cruise missiles and Unmanned Arial Systems (UAS), and the cueing of air defense weapons.  The G\/ATOR contributes to the extension of Sea Shield\/Sea Strike by surveillance and detection of enemy air threats not seen by Navy sensors in the littorals by participating in a cooperative engagement network of sensors and shooters; G\/ATOR enables integrated fire control (IFC) and provides engage\/fire on remote capability. G\/ATOR surveillance coverage with IFC will provide unprecedented reach, volume and precision in the execution of Operational Maneuver From The Sea allowing Naval forces to project and sustain power deep inland.\n\nG\/ATOR Block 4, scheduled for an Initial Operating Capability in 2QFY19, will add military air traffic control functionality, development of Mode 5\/S capability, Federal Aviation Administration (FAA) flight certification requirements, and the ability to integrate with AN\/TPN-31(V) Air Traffic Navigation, Integration, and Coordination System (ATNAVICS) for Precision Approach Radar. This increment of G\/ATOR replaces the Marine Corps' AN\/TPS-73 radar and the Airport Surveillance Radar portion of the ATNAVICS also known as Air Surveillance and Precision Approach Radar Control System (ASPARCS)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.990"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Begins software development of the Mode 5\/S capability and integration of Command & Control functionality with AN\/TPN-31(V) ATNAVICS. Begin efforts to achieve FAA flight certification for G\/ATOR."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.190"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.190"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to achieve FAA flight certification for G\/ATOR.  Commence Command & Control (C2) and AN\/TPN-31(V)7 integration requirements.  Commence Mode 5\/S development for G\/ATOR."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPN\/2815"
                                    },
                                    "Title": {
                                        "val": "MATCALS"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "5.542"
                                        },
                                        "CurrentYear": {
                                            "val": "7.461"
                                        },
                                        "BudgetYearOne": {
                                            "val": "16.999"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "16.999"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "10.112"
                                        },
                                        "BudgetYearThree": {
                                            "val": "9.041"
                                        },
                                        "BudgetYearFour": {
                                            "val": "6.281"
                                        },
                                        "BudgetYearFive": {
                                            "val": "6.424"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTE\/0204460M"
                                    },
                                    "Title": {
                                        "val": "G\/ATOR"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "70.217"
                                        },
                                        "CurrentYear": {
                                            "val": "78.208"
                                        },
                                        "BudgetYearOne": {
                                            "val": "99.106"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "99.106"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "79.595"
                                        },
                                        "BudgetYearThree": {
                                            "val": "82.416"
                                        },
                                        "BudgetYearFour": {
                                            "val": "32.849"
                                        },
                                        "BudgetYearFive": {
                                            "val": "20.431"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "PMC\/4650"
                                    },
                                    "Title": {
                                        "val": "RADAR SYSTEMS"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "134.813"
                                        },
                                        "CurrentYear": {
                                            "val": "101.941"
                                        },
                                        "BudgetYearOne": {
                                            "val": "19.595"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "19.595"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "42.612"
                                        },
                                        "BudgetYearThree": {
                                            "val": "31.178"
                                        },
                                        "BudgetYearFour": {
                                            "val": "28.921"
                                        },
                                        "BudgetYearFive": {
                                            "val": "29.775"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "An Acquisition Decision Memorandum was signed in Jan 2005 approving the procurement of the Army AN\/TPN-31 Air Traffic Navigation, Integration, and Coordination System (ATNAVICS) to fulfill the Air Surveillance and Precision Approach Radar and Control System (ASPARCS) requirement for July 2006. The MROC Decision Memorandum 11-2005 of December 2004 outlined the evolutionary improvements required by Headquarters Marine Corps (HQMC). This program has joined with the Army to implement Pre-Planned Product Improvements (P3I) and evolutionary product improvements.  G\/ATOR Block IV, scheduled for an Initial Operating Capability in 2018, will add military air traffic control Federal Aviation Administration flight certification requirements, and the ability to integrate with AN\/TPN-31 (ATNAVICS) for Precision Approach Radar. The Marine Air Traffic Control (ATC) Working Group identified requirements to address obsolescence issues with ATC Expeditionary Towers.  These requirements were validated by APX-25 and a Decision Analysis Study was conducted by NAVAIR 4.10.  Funding will address development of expeditionary ATC Tower capability improvements via the Engineering Change Proposal (ECP) process."
                        },
                        "PerformanceMetrics": {
                            "val": "The MATCALS RDTEN funding will be utilized to continue development of evolutionary improvements envisioned by HQMC for the MATCALS Family of Systems."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0604504N_0718_FILE1.PNG"
                                }
                            }
                        ]
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "0993"
                    },
                    "ProjectTitle": {
                        "val": "Carrier ATC"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "57.024"
                        },
                        "PriorYear": {
                            "val": "4.205"
                        },
                        "CurrentYear": {
                            "val": "6.728"
                        },
                        "BudgetYearOne": {
                            "val": "12.818"
                        },
                        "BudgetYearOneBase": {
                            "val": "12.818"
                        },
                        "BudgetYearTwo": {
                            "val": "50.981"
                        },
                        "BudgetYearThree": {
                            "val": "38.685"
                        },
                        "BudgetYearFour": {
                            "val": "39.149"
                        },
                        "BudgetYearFive": {
                            "val": "35.017"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Shipboard Air Traffic Control (SATC) systems, interfacing with versions of the AN\/TPX-42A(V) Direct Altitude and Identity Readout (DAIR), allow shipboard Air Traffic Controllers to identify, marshal, and direct aircraft within a 50 Nautical Mile (NM) radius of the ship.  At closer range (8NM) a ship's Automatic Carrier Landing System (ACLS) and Independent Landing Monitor (ILM) are operationally required to affect safe landing on the moving decks of ships.  The AN\/SPN-41 ILM and AN\/SPN-46 ACLS provide verification of aircraft approach glideslope position and precise aircraft automatic control respectively during its final approach and landing sequence to an aircraft carrier.  Dual efforts are underway to improve the AN\/SPN-46 system availability and supportability until at least September 2020.  These efforts include various Engineering Change Proposals (ECPs), and the Life Cycle Extension (LCE) program transitional changes include a re-architecture of its radar control group process with Commercial Off the Shelf (COTS) technology, replacement of the computer group processing hardware, and conversion of system program software from CMS-2 to the more commonly used 'C' programming language.  In recent years, the top 25 percent of the AN\/SPN-43C frequency band has been reallocated to the Fixed Wireless Access Community prohibiting Air Traffic Control (ATC) Air Search Radar (ASR) operation within 50NM of the coast.  Because the Navy requires an air traffic control radar, this project unit will include engineering efforts to identify requirements and develop a suitable replacement and bridging ECPs before the AN\/SPN-43 becomes operationally ineffectual.  Finally, the AN\/TPX-42A(V) Direct Altitude and Identity Readout (DAIR) underwent several phased upgrades that have resulted in three field changes.  System improvements include replacing militarized front-end equipment in the track processor with open architecture COTS technology, converting the operational program software to more commonly used and flexible \"C\" language, providing the \"hooks\" for potential interface with Mode 5 Identification Friend or Foe, and integrating a flat panel monitor into the controller work station.  The development of an ATC common console will reduce operational costs, improve reliability, and provide compatible interfaces and commonality for all ATC workstations.  The addition of an embedded trainer within AN\/TPX-42A(V) will improve controller training and increase flight safety."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "AN\/SPN-43C"
                                    },
                                    "Description": {
                                        "val": "This project funds the development of the AN\/SPN-43C replacement program and the development of sustainment Engineering Change Proposals (ECP) for the existing system.  The sustainment effort will ensure the capabilities provided by the AN\/SPN-43C remain available to CVN, LHA and LHD type ships until the replacement system is fielded."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.870"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued Capability Development Document and commenced Systems Requirement Document development.  Developed replacement system Life Cycle Requirements Funding Summary, Life Cycle Cost Estimate, and Request for Proposal (RFP).  Prepared documentation and requested Material Development Decision from designated Milestone Decision Authority."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.986"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Prepare documentation for AN\/SPN-43 replacement program (AN\/SPN-50(V)1) MS B decision.  Prepare for source selection."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.932"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.932"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Release RFP and initiate source selection for AN\/SPN-50(V)1 contract award.  Continue sustainment ECPs for the AN\/SPN-43C."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "AN\/TPX-42"
                                    },
                                    "Description": {
                                        "val": "This project funds the ongoing modernization of the AN\/TPX-42 system through engineering changes and technology refresh. Specific engineering changes are:  Development of a Multi Function Console (MFC) which will consolidate and replace the AN\/SPN-46\/35 as well as AN\/TPX-42 displays with a single multifunction air traffic control display configuration;  Replacement of the AN\/TPX-42 proprietary Radar Data Processor with an open architecture design and replacement of the system's obsolete voice recorder.  It is expected that the MFC will lead to a nomenclature change for this system."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.335"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Began multi-function console part 1 Engineering Change Proposal (ECP) for Air Traffic Control console development.  Take delivery of prototype and test AN\/TPX-42A(V) embedded trainer."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.742"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete part 1 AN\/TPX-42A(V) embedded trainer ECP, develop the part 2 ECP and conduct critical design review for AN\/TPX-42A(V) embedded trainer."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.886"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.886"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete Multi Function Console Part 1 ECP and develop the Part 2 ECP."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPN\/2831"
                                    },
                                    "Title": {
                                        "val": "Shipboard Air Traffic Control"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "7.769"
                                        },
                                        "CurrentYear": {
                                            "val": "9.140"
                                        },
                                        "BudgetYearOne": {
                                            "val": "9.366"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "9.366"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "9.407"
                                        },
                                        "BudgetYearThree": {
                                            "val": "9.634"
                                        },
                                        "BudgetYearFour": {
                                            "val": "9.640"
                                        },
                                        "BudgetYearFive": {
                                            "val": "9.831"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "OPN\/2832"
                                    },
                                    "Title": {
                                        "val": "Automatic Carrier Landing Systems"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "12.731"
                                        },
                                        "CurrentYear": {
                                            "val": "20.798"
                                        },
                                        "BudgetYearOne": {
                                            "val": "21.357"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "21.357"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "21.487"
                                        },
                                        "BudgetYearThree": {
                                            "val": "27.954"
                                        },
                                        "BudgetYearFour": {
                                            "val": "38.686"
                                        },
                                        "BudgetYearFive": {
                                            "val": "42.619"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "AN\/SPN-46 Computer Group replacement subprojects are part of the AN\/SPN-46 Life Cycle Extension (LCE) project, which is an Engineering Change Proposal (ECP).  Initial contract was awarded in November 2003 for the Radar Control Group, and the contract for the Computer Group was awarded in December 2005.  AN\/TPX-42 Voice\/Video recorder replacement, JPALS Interface, Shipboard trainer, and Air Traffic Control (ATC) Console are all anticipated ECPs, with improvements being incorporated into the production of AN\/TPX-42 upgrade kits.  AN\/SPN-43 replacement program will be an ACAT IVT program.\n\nAll other projects are non-ACAT upgrades to existing systems.  An evolutionary acquisition approach is being used to introduce these technology advancements that either satisfy user requirements, such as all weather operation, or address supportability and cost of ownership problems."
                        },
                        "PerformanceMetrics": {
                            "val": "Configuration Control Board for AN\/TPX-42A(V) will occur in fourth quarter FY2014."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0604504N_0993_FILE1.PNG"
                                }
                            }
                        ]
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "1657"
                    },
                    "ProjectTitle": {
                        "val": "ATC Improvement"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "1.073"
                        },
                        "PriorYear": {
                            "val": "0.397"
                        },
                        "CurrentYear": {
                            "val": "0.402"
                        },
                        "BudgetYearOne": {
                            "val": "0.404"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.404"
                        },
                        "BudgetYearTwo": {
                            "val": "0.401"
                        },
                        "BudgetYearThree": {
                            "val": "0.406"
                        },
                        "BudgetYearFour": {
                            "val": "0.414"
                        },
                        "BudgetYearFive": {
                            "val": "0.423"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This program provides for engineering development, integration, adaptation, and testing of new and\/or modernized Air Traffic Control (ATC) systems, air navigational aids, landing systems, and ATC communication systems for Naval and Marine Corps Air Stations (NAS\/MCAS) and Fleet ATC Systems.  These systems are critical to Naval Aviation and provide for safe, efficient air operations.  Additionally, the Federal Aviation Administration (FAA) is affecting major modernization of the National Airspace System (NAS).  The Navy must maintain compatibility with FAA-developed ATC systems in order to ensure seamless interoperability within the NAS.  NAS modernization initiatives in Project 1657 include the Visual Information Display System (VIDS) and follow-on Pre-Planned Product Improvements, with additional RDT&E efforts required for modified commercial-off-the-shelf ATC systems and equipment for modernization and recapitalization of these systems at our NAS, MCAS & Fleet Area Control & Surveillance Facilities (FACSFACs) worldwide.  Landing Systems initiatives include re-engineering and technology insertion efforts for the Precision Approach Radar, Tactical Air Navigation System, and other landing systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "NAS MOD VIDS"
                                    },
                                    "Description": {
                                        "val": "Continue engineering development of pre-planned product improvements for the VIDS and initiate efforts to incorporate VIDS into the FACSFACs.  Research display alternatives for Navy ATC systems, and evaluate alternatives for future communication and radar systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.199"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued engineering development of Pre-Planned Product Improvements for VIDS to incorporate multiple weather source inputs.  Continued Standard Terminal Automation Replacement System and VIDS engineering development for technology insertion.  Continued engineering efforts to maintain interoperability with the FAA's next generation air traffic control system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.202"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue engineering development of Pre-Planned Product Improvements for VIDS to incorporate multiple weather source inputs.  Continue Standard Terminal Automation Replacement System and VIDS engineering development for technology insertion.  Continue engineering efforts to maintain interoperability with the FAA's next generation air traffic control system."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.202"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.202"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue engineering development of Pre-Planned Product Improvements for Visual Information Display System (VIDS) to incorporate multiple weather source inputs.  Continue Standard Terminal Automation Replacement System and VIDS engineering development for technology insertion.  Continue engineering efforts to maintain interoperability with the Federal Aviation Administration's next generation air traffic control system."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Fleet ATC Systems"
                                    },
                                    "Description": {
                                        "val": "Research efforts to determine the best technical approach to integrate various data link and communication system upgrades into Navy\/Marine Corps ATC Systems including but not limited to the Digital Airport Surveillance Radar (DASR) into the Fleet Area Control and Surveillance Facilities (FACSFAC) Fleet Area Control Tracking System (FACTS) 3200 system.  Evaluate alternatives for future processor\/display, sensor and communication systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.198"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued engineering development for NAVSKED\/FACTS Technology Refresh and engineering efforts to maintain interoperability with the FAA's next generation air traffic control system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.200"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue engineering development for NAVSKED\/FACTS Technology Refresh and engineering efforts to maintain interoperability with the FAA's next generation air traffic control system."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.202"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.202"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue engineering development for Navy Scheduling (NAVSKED)\/FACTS Technology Refresh and engineering efforts to maintain interoperability with the Federal Aviation Administration's (FAA's) next generation air traffic control system."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPN\/2840"
                                    },
                                    "Title": {
                                        "val": "National Air Space System Modernization"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "14.201"
                                        },
                                        "CurrentYear": {
                                            "val": "19.754"
                                        },
                                        "BudgetYearOne": {
                                            "val": "26.639"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "26.639"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "26.463"
                                        },
                                        "BudgetYearThree": {
                                            "val": "28.869"
                                        },
                                        "BudgetYearFour": {
                                            "val": "31.359"
                                        },
                                        "BudgetYearFive": {
                                            "val": "31.997"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "OPN\/2845"
                                    },
                                    "Title": {
                                        "val": "Fleet Air Traffic Control Systems"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "6.270"
                                        },
                                        "CurrentYear": {
                                            "val": "8.909"
                                        },
                                        "BudgetYearOne": {
                                            "val": "9.214"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "9.214"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "8.551"
                                        },
                                        "BudgetYearThree": {
                                            "val": "8.726"
                                        },
                                        "BudgetYearFour": {
                                            "val": "8.866"
                                        },
                                        "BudgetYearFive": {
                                            "val": "9.054"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "All projects are non-ACAT upgrades to existing systems.  An evolutionary acquisition approach is being used to introduce technology advancements that either satisfy emergent requirements or address supportability and cost of ownership problems."
                        },
                        "PerformanceMetrics": {
                            "val": "The Air Traffic Control (ATC) Improvement program goal is to continue to research, evaluate and develop display and other alternatives for Navy ATC, communication and radar systems."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3372"
                    },
                    "ProjectTitle": {
                        "val": "ATC Systems"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "11.712"
                        },
                        "BudgetYearOneBase": {
                            "val": "11.712"
                        },
                        "BudgetYearTwo": {
                            "val": "15.686"
                        },
                        "BudgetYearThree": {
                            "val": "18.605"
                        },
                        "BudgetYearFour": {
                            "val": "30.471"
                        },
                        "BudgetYearFive": {
                            "val": "21.767"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "Project 3372 is a New Start in FY2015."
                        },
                        "ProjectMissionDescription": {
                            "val": "Landing System Upgrade Program (LSUP) consists of life cycle extension (LCE ) upgrades to the AN\/SPN-35C Precision Approach Radar (PAR), AN\/SPN-41B (Instrument Control Landing Systems (ICLS)) and AN\/SPN-46 Automatic Carrier Landing Systems (ACLS) systems which support Air  Traffic Control (ATC) operations on board CVN, LHA, or LHD-class ships.  This effort includes numerous commercial off-the-shelf (COTS) component refresh updates which are urgently needed to sustain the operational viability of these Naval ATC systems in order to support Fleet air operations for at least the next 15 years until the next generation ATC system is fully implemented. This COTS refresh will include analysis and upgrade of key system components that are critical to overall system operation but have become increasingly difficult to maintain over the past few years. Recent adjustments in the direction and scope of Naval ATC systems have necessitated a re-evaluation of the long-term viability and sustainability of the current Fleet ATC equipment. The result is a renewed appreciation for the value these ATC systems provide to the Fleet based on the comparative relationship between sustainment costs and overall system reliability.\n\nThis COTS Refresh is expected to include analysis and upgrade of the following components: Gearbox Stepper Motors, Logic Controller Assembly, Power Supplies, Roll Encoder Assembly, Micro Electro Mechanical Systems (MEMs) Assembly, Fiber Optic Media Converters, Touchscreen Display Assembly, Communication Assembly, Maintenance Test Drawer Assembly, and Radio Frequency RF Monitor Assembly, and upgrades of the Transmitters and Radomes are expected to ensure accurate and continuous functionality of the AN\/SPN-41B system.  Additionally, COTS refreshes will be necessary to mitigate obsolescence concerns for power supplies and various circuit card assemblies.\n\nRecent changes to the Navy's Precision Approach and Landing Capability (PALC) requirements have necessitated Life Cycle Extension (LCE) upgrades to legacy landing systems, AN\/SPN-35, AN\/SPN-41 and AN\/SPN-46.  \n\nThis is a new start in FY2015."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "AN\/SPN-46 Blk IV Upgrade"
                                    },
                                    "Description": {
                                        "val": "Blk IV consists of upgrades antenna pedestal, addresses transmitter obsolescence issues, and replacement of obsolete circuit cards."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.712"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.712"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Begin hardware and software development of the AN\/SPN-46 Blk IV upgrade.  Award development contract for addressing part\/circuit card obsolescence."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPN\/2832"
                                    },
                                    "Title": {
                                        "val": "ACLS"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "12.731"
                                        },
                                        "CurrentYear": {
                                            "val": "20.798"
                                        },
                                        "BudgetYearOne": {
                                            "val": "21.357"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "21.357"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "21.487"
                                        },
                                        "BudgetYearThree": {
                                            "val": "27.954"
                                        },
                                        "BudgetYearFour": {
                                            "val": "38.686"
                                        },
                                        "BudgetYearFive": {
                                            "val": "42.619"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Resources and Requirements Review Board (R3B) approved the Department of the Navy (DON) Precision Approach and Landing Capability (PALC) Roadmap per Decision Memorandum (DM) Ser: N8B\/13U141053 dtd 03 July 2013.  This PALC Roadmap re-scoped JPALS into a single increment.  As a result, a requirement to upgrade current SPNs has emerged.  Per Enclosure 1 of the above DM, the Landing Systems Upgrade Program will be comprised of the AN\/SPN-46, AN\/SPN-35C, and AN\/SPN-41B and is anticipated that each SPN upgrade will go through separate Material Development Decisions (MDD) and Milestones."
                        },
                        "PerformanceMetrics": {
                            "val": "MDD anticipated in FY14 for upgrade of the AN\/SPN-46"
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0604504N_3372_FILE1.PNG"
                                }
                            }
                        ]
                    }
                }
            ]
        }
    }
}