{
    "id": "55aeace7c2284dadfe5c0630bc3bf951dca4c41b",
    "meta": {
        "filename": "dod-2015_RDTE_2015_NAVY_BA5_RDTE_JustificationBook_Navy_PB_2015.zzz_unzipped_RDTE_JustificationBook_Navy_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604218N"
        },
        "ProgramElementTitle": {
            "val": "Air\/Ocean Equipment Engineering"
        },
        "R1LineNumber": {
            "val": "91"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "71.640"
            },
            "PriorYear": {
                "val": "3.658"
            },
            "CurrentYear": {
                "val": "4.026"
            },
            "BudgetYearOne": {
                "val": "2.164"
            },
            "BudgetYearOneBase": {
                "val": "2.164"
            },
            "BudgetYearTwo": {
                "val": "2.526"
            },
            "BudgetYearThree": {
                "val": "2.054"
            },
            "BudgetYearFour": {
                "val": "2.538"
            },
            "BudgetYearFive": {
                "val": "3.210"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Air\/Ocean Equipment Engineering (AOEE) Program Element provides new capabilities to support naval combat forces.  This program engineers and developmentally tests organic and remote sensors, communication interfaces, and processing and display devices.  This equipment is engineered to measure, ingest, store, process, distribute and display conditions of the physical environment that are essential to the optimum employment and performance of naval warfare systems.  AOEE also engineers capabilities for shipboard and shore-based tactical systems.  A major thrust area for the AOEE program is to provide the engineering development of specialized equipment and measurement capabilities that are intended to monitor specific conditions of the physical environment in hostile and remote areas in response to fleet demand signals for increased sensing capability and capacity to support battlespace collections and prediction on short to intermediate time scales.  With such capabilities, the war fighters' situational awareness of the operational effects of the physical environment are made more certain.\n\nMajor emphasis is on the Meteorological and Oceanographic Future Mission Capabilities (METOC FMC) project."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "4.060"
                },
                "CurrentYear": {
                    "val": "4.026"
                },
                "BudgetYearOne": {
                    "val": "4.393"
                },
                "BudgetYearOneBase": {
                    "val": "4.393"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "3.658"
                },
                "CurrentYear": {
                    "val": "4.026"
                },
                "BudgetYearOne": {
                    "val": "2.164"
                },
                "BudgetYearOneBase": {
                    "val": "2.164"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.402"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-2.229"
                },
                "BudgetYearOneBase": {
                    "val": "-2.229"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.062"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.170"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.170"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.001"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-2.059"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.059"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.339"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical:  The Littoral Battlespace Sensing Unmanned Undersea Vehicles (LBS-UUV) program's primary focus has shifted from the Engineering and Manufacturing Development phase to the Production phase."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "2345"
                    },
                    "ProjectTitle": {
                        "val": "Fleet METOC Equipment"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "52.597"
                        },
                        "PriorYear": {
                            "val": "2.380"
                        },
                        "CurrentYear": {
                            "val": "2.611"
                        },
                        "BudgetYearOne": {
                            "val": "1.224"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.224"
                        },
                        "BudgetYearTwo": {
                            "val": "1.332"
                        },
                        "BudgetYearThree": {
                            "val": "0.848"
                        },
                        "BudgetYearFour": {
                            "val": "1.310"
                        },
                        "BudgetYearFive": {
                            "val": "1.950"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project provides for the engineering and manufacturing development of sensors, communication interfaces, processing and display meteorological and oceanographic (METOC) equipment.  This equipment is designed to provide future mission capabilities for war fighters to measure, ingest, store, process, distribute and display METOC parameters and derived products.\n  \nThis project also exploits new government off-the-shelf \/commercial off-the-shelf technologies, tactical sensors and web enablement for the Navy's computer-based tactical shipboard and shore capability used to predict and assess the operational effects of the physical environment on the performance of platforms, weapons and sensor systems.  This project includes development of warfare specific mission planning modules to support unmanned systems with integration of data from environmental and tactical sensor systems, model forecast information and Geospatial Information & Services Databases.  This project also supports development of autonomous environmental sensing systems for situational awareness and tactical decision aid\/mission planner support, as well as iridium and advanced satellite communication integration in METOC sensor, vehicle control and mission planning systems that will be required to achieve Chief of Naval Operation objectives for information dominance and decision superiority.\n\nMajor emphasis areas include the Meteorological and Oceanographic Future Mission Capabilities (METOC FMC) project and the Environmental Satellite Receiver Processor (ESRP) (comprised of AN\/SMQ-11 (sea and shore configuration) and AN\/FMQ-17 (shore configuration)) program.\n\nFY 2015 request provides for the continued development of advanced software tools for METOC asset allocation, METOC decision support software applications and interfaces to tactical and strategic decision aids along with component and prototype efforts associated with acquiring environmental data, and the development of an end-to-end methodology to collect, fuse, and integrate these data into Navy and DoD networks and command and control nodes, and continue the development to support infrastructure for advanced global and regional prediction systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Meteorological and Oceanographic (METOC) Future Mission Capabilities (FMC)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.950"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued advanced software tools development for Meteorological & Oceanography (METOC) asset allocation, METOC decision support software applications, and interfaces to tactical and strategic decision aids along with component and prototype efforts associated with acquiring environmental data. Continued development of an end-to-end methodology to collect, fuse, and integrate these data into Navy and DoD networks and command & control nodes. Continued development of support infrastructure for advanced global & regional Meteorological & Oceanography (METOC) prediction systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.077"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue advanced software tools development for METOC asset allocation, METOC decision support software applications, and interfaces to tactical and strategic decision aids along with component and prototype efforts associated with acquiring environmental data. Continue development of an end-to-end methodology to collect, fuse, and integrate these data into Navy and DoD networks and command & control nodes. Continue development of support infrastructure for advanced global & regional METOC prediction systems. Develop Through-the-sensor (TTS) technologies and alternative sampling strategies for oceanographic characterization."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.839"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.839"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue advanced METOC infrastructure development for METOC decision support software applications and interfaces to tactical and strategic decision aids along with component and prototype efforts associated with acquiring environmental data. Continue development of an end-to-end methodology to collect, fuse, and integrate these data into Navy and DoD networks and command & control nodes. Continue development of support infrastructure for advanced global & regional METOC prediction systems. Continue to develop, demonstrate and assess TTS technologies and alternative sampling strategies for environmental characterization."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Littoral Battlespace Sensors - Unmanned Undersea Vehicle (LBS-UUV)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.168"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conducted Littoral Battlespace Sensors ocean Glider (LBS-G) and Littoral Battlespace Sensors Autonomous Undersea Vehicles (LBS-AUV) engineering design studies as required. Developed system upgrades via Engineering Change Proposals (ECPs), and corrected any identified software and\/or hardware deficiencies as required. Focused areas include enhanced autonomy, Glider Operations Center (GOC) automation, communications improvements, battery redesign and others as required. These are all multi-year efforts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.232"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct LBS-G and LBS-AUV engineering design studies as required. Develop system upgrades via ECPs, and correct any identified software and\/or hardware deficiencies as required.  Continue efforts on enhanced autonomy, GOC automation, communications improvements, battery redesign and others as appropriate."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.145"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.145"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct Littoral Battlespace Sensors ocean Glider (LBS-G) and Littoral Battlespace Sensors Autonomous Undersea Vehicles (LBS-AUV) engineering design studies as required. Develop system upgrades via Engineering Change Proposals (ECPs), and correct any identified software and\/or hardware deficiencies as required. Complete communications enhancements. Continue efforts on enhanced autonomy, Glider Operations Center (GOC) automation, battery redesign and others as required."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Environmental Satellite Receiver Processor (ESRP)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.262"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed and tested annual hardware and software upgrades to integrate new METOC Satellite Sensors available in the Geostationary Operational Environmental Satellite (GOES) system and the Polar Orbiting Environmental Satellite (POES) system. Continued integration of ESRP systems in support of Joint Polar-orbiting Satellite System (JPSS). Overall program efforts included investigation of emerging technologies through study, development and associated testing for feasibility of program insertion."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.302"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to develop and test annual hardware and software upgrades to integrate new METOC Satellite Sensors available in the GOES and the POES.  Continue integration of ESRP systems in support of JPSS. Overall program efforts include investigation of emerging technologies through study, development and associated testing for feasibility of program insertion."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.240"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.240"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to develop and test annual hardware and software upgrades to integrate new METOC Satellite Sensors available in the GOES and the POES.  Continue integration of ESRP systems in support of JPSS, and European Meteorology Satellites (EUMETSAT). Overall program efforts include investigation of emerging technologies through study, development and associated testing for feasibility of program insertion."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPN\/4226"
                                    },
                                    "Title": {
                                        "val": "Meteorological Equipment"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "17.790"
                                        },
                                        "CurrentYear": {
                                            "val": "19.118"
                                        },
                                        "BudgetYearOne": {
                                            "val": "12.575"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "12.575"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "14.947"
                                        },
                                        "BudgetYearThree": {
                                            "val": "15.834"
                                        },
                                        "BudgetYearFour": {
                                            "val": "16.512"
                                        },
                                        "BudgetYearFive": {
                                            "val": "16.549"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTEN\/0603207N\/2341"
                                    },
                                    "Title": {
                                        "val": "METOC Data Acquisition"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "5.793"
                                        },
                                        "CurrentYear": {
                                            "val": "6.336"
                                        },
                                        "BudgetYearOne": {
                                            "val": "2.518"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "2.518"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "4.387"
                                        },
                                        "BudgetYearThree": {
                                            "val": "4.430"
                                        },
                                        "BudgetYearFour": {
                                            "val": "5.084"
                                        },
                                        "BudgetYearFive": {
                                            "val": "5.230"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTEN\/0603207N\/2342"
                                    },
                                    "Title": {
                                        "val": "METOC Data Assimilation and MOD"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "10.242"
                                        },
                                        "CurrentYear": {
                                            "val": "10.250"
                                        },
                                        "BudgetYearOne": {
                                            "val": "4.937"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "4.937"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "8.154"
                                        },
                                        "BudgetYearThree": {
                                            "val": "8.352"
                                        },
                                        "BudgetYearFour": {
                                            "val": "8.709"
                                        },
                                        "BudgetYearFive": {
                                            "val": "9.669"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTEN\/0604218N\/2346"
                                    },
                                    "Title": {
                                        "val": "METOC Sensor Engineering"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "1.279"
                                        },
                                        "CurrentYear": {
                                            "val": "1.415"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.940"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.940"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "1.194"
                                        },
                                        "BudgetYearThree": {
                                            "val": "1.206"
                                        },
                                        "BudgetYearFour": {
                                            "val": "1.228"
                                        },
                                        "BudgetYearFive": {
                                            "val": "1.260"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Acquisition, management and contracting strategies are to support engineering and manufacturing development by providing funds to Naval Research Laboratories and miscellaneous contractors, with management oversight by the Program Executive Officer for Command, Control, Communications, Computers and Intelligence."
                        },
                        "PerformanceMetrics": {
                            "val": "Goal:  Develop and engineer equipment to acquire meteorological and oceanographic (METOC) data in order to improve the accuracy of global and regional scale Meteorological and Oceanographic forecast models.\nMetric:  Tasks will address no less than 75% of applicable capability gaps and requirements, as identified by Resource and Requirements Sponsor(s).  As tasks relate to exploitation of fleet sensors for METOC data (Through-the-Sensor), no less than 80% of approved initiatives will have a cost, schedule, performance and transition risk analysis completed within the past 12 months."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0604218N_2345_FILE1.PNG"
                                }
                            }
                        ]
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2346"
                    },
                    "ProjectTitle": {
                        "val": "METOC Sensor Engineering"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "19.043"
                        },
                        "PriorYear": {
                            "val": "1.278"
                        },
                        "CurrentYear": {
                            "val": "1.415"
                        },
                        "BudgetYearOne": {
                            "val": "0.940"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.940"
                        },
                        "BudgetYearTwo": {
                            "val": "1.194"
                        },
                        "BudgetYearThree": {
                            "val": "1.206"
                        },
                        "BudgetYearFour": {
                            "val": "1.228"
                        },
                        "BudgetYearFive": {
                            "val": "1.260"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project provides for the engineering and manufacturing development of specialized, high resolution instrumentation systems and measurement capabilities for obtaining near real-time, in-situ Meteorological and Oceanographic (METOC) data in hostile, remote, and denied areas.  The project's objectives are to engineer near-term future mission sensing capabilities that are intended to survive the harsh littoral and deep-strike environments and also to meet demanding requirements for timeliness and accuracy.  Engineering is performed within this project to ensure that air and safety certification for deployment from fleet aircraft or ships is met and that the proper data formats are engineered for electronic communications transmissions, human interface displays, and inputs to predictive models.\n\nThe major area of emphasis is the METOC Future Mission Capabilities (FMC) project.\n\nFY 2015 request provides for the continued development of advanced sensor system support hardware and software technologies for sensor deployment, data processing and performance metrics to optimize sensor performance and assess the viability of sensors and subsystems on unmanned and manned aircraft systems and autonomous undersea platforms for collection of automated METOC data and information."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Meteorological and Oceanographic (METOC) Future Mission Capabilities (FMC)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.278"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued system development and demonstration of METOC manned, unmanned and automated sensors (to include integration of environmental sensors into a larger environmental sensing strategy). Continued the development of advanced sensor system support technologies and techniques for sensor deployment, data processing and analysis to include performance metrics to optimize sensor performance. Assessed viability of sensors and subsystem sensors on unmanned and manned aircraft systems and autonomous undersea systems for collection of automated METOC data. Continued to develop infrastructure to acquire, process and distribute METOC data and products."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.415"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue system development and demonstration of METOC manned, unmanned and automated sensors (to include integration of environmental sensors into a larger environmental sensing strategy). Continue the development of advanced sensor system support technologies and techniques for sensor deployment, data processing and analysis to include performance metrics to optimize sensor performance. Assess viability of sensors and subsystem sensors on unmanned and manned aircraft systems and autonomous undersea systems for collection of automated Meteorological and Oceanographic (METOC) data. Continue to develop infrastructure to acquire, process and distribute METOC data and products."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.940"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.940"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue system development and demonstration of METOC manned, unmanned and automated sensors (to include integration of environmental sensors into a larger environmental sensing strategy). Continue the development of advanced sensor system support technologies and techniques for sensor deployment, data processing and analysis to include performance metrics to optimize sensor performance. Continue to develop infrastructure to acquire, process and distribute METOC data and products."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "RDTEN\/0603207N\/2341"
                                    },
                                    "Title": {
                                        "val": "METOC DATA ACQUISITION"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "5.793"
                                        },
                                        "CurrentYear": {
                                            "val": "6.336"
                                        },
                                        "BudgetYearOne": {
                                            "val": "2.518"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "2.518"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "4.387"
                                        },
                                        "BudgetYearThree": {
                                            "val": "4.430"
                                        },
                                        "BudgetYearFour": {
                                            "val": "5.084"
                                        },
                                        "BudgetYearFive": {
                                            "val": "5.230"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTEN\/0603207N\/2342"
                                    },
                                    "Title": {
                                        "val": "METOC DATA ASSIMILATION AND MOD"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "10.242"
                                        },
                                        "CurrentYear": {
                                            "val": "10.250"
                                        },
                                        "BudgetYearOne": {
                                            "val": "4.937"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "4.937"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "8.154"
                                        },
                                        "BudgetYearThree": {
                                            "val": "8.352"
                                        },
                                        "BudgetYearFour": {
                                            "val": "8.709"
                                        },
                                        "BudgetYearFive": {
                                            "val": "9.669"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTEN\/0604218N\/2345"
                                    },
                                    "Title": {
                                        "val": "FLEET METOC EQUIPMENT"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "2.380"
                                        },
                                        "CurrentYear": {
                                            "val": "2.611"
                                        },
                                        "BudgetYearOne": {
                                            "val": "1.224"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1.224"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "1.332"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.848"
                                        },
                                        "BudgetYearFour": {
                                            "val": "1.310"
                                        },
                                        "BudgetYearFive": {
                                            "val": "1.950"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Acquisition and contracting strategies are to support engineering and manufacturing development of specialized, high resolution instrumentation systems and measurement techniques for obtaining near real-time in-situ Meteorological and Oceanographic (METOC) data in denied or remote areas by providing funds to miscellaneous performers."
                        },
                        "PerformanceMetrics": {
                            "val": "Goal:  Develop and engineer unique sensors to acquire METOC data in order to improve the accuracy of global and regional scale meteorological and oceanographic forecast models.\nMetric:  Tasks will address no less than 75% of applicable capability gaps and requirements, as identified by Resource Sponsor and Type Commander(s).  No less than 75% of sensor engineering initiatives will be informed by an Analysis of Alternatives or market study to assess the state of the technology."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0604218N_2346_FILE1.PNG"
                                }
                            }
                        ]
                    }
                }
            ]
        }
    }
}