{
    "id": "56d3c7a7f9373c21e3141ea4472503b1f7c70864",
    "meta": {
        "filename": "dod-2015_RDTE_2015_NAVY_BA4_RDTE_JustificationBook_Navy_PB_2015.zzz_unzipped_RDTE_JustificationBook_Navy_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603562N"
        },
        "ProgramElementTitle": {
            "val": "Submarine Tactical Warfare Sys"
        },
        "R1LineNumber": {
            "val": "41"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "45.441"
            },
            "PriorYear": {
                "val": "8.505"
            },
            "CurrentYear": {
                "val": "8.764"
            },
            "BudgetYearOne": {
                "val": "8.044"
            },
            "BudgetYearOneBase": {
                "val": "8.044"
            },
            "BudgetYearTwo": {
                "val": "8.896"
            },
            "BudgetYearThree": {
                "val": "9.145"
            },
            "BudgetYearFour": {
                "val": "9.215"
            },
            "BudgetYearFive": {
                "val": "9.417"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Submarine Tactical Warfare Systems program element is comprised of the Advanced Submarine Support Equipment Program (ASSEP) and the Submarine Special Operations Support Program.  The objective is to improve submarine operational effectiveness through the development and implementation of advanced Research and Development (R&D).  In order to provide improved operational effectiveness, R&D efforts are focused on Advanced Imaging Developments and Advanced Electronic Warfare Support (ES) Developments.  A continuing need exists to improve these capabilities in view of the advancements in potential imaging counter detection, the need to support specialized missions, and the increasingly dense and sophisticated electronic environment caused by the proliferation of complex radar, communications, and navigation equipment of potential adversaries.  Ongoing developments in 360 degree imaging systems and electro-optic infra-red vulnerability signature reduction technologies are supporting these needs.  \n\nThe Submarine Arctic Warfare Development program responds to the increased threat of naval activity in the Arctic regions while continuously supporting the Navy's strategic objective of Assured Access and Combat Credibility.  The U.S. Navy Submarine Force (SUBFOR) demonstrates existing Arctic Warfare capabilities, operational and tactical proficiency while developing advanced submarine research and development technology in unique cold water environments, under-ice conditions, and ice-covered shallow water regions during Ice Exercises (ICEX).  ICEX provides the framework for various submarine research and development programs to conduct test and evaluation in Arctic regions or at periodic Ice Camps.  Particular emphasis is placed on the areas of sonar operability, tactical surveillance, weapon utility, and other submarine support missions.  Efforts include assessment of combat system effectiveness, development of Arctic specific improvements for existing sonar and weapons, development of class specific Arctic operational guidelines, and the testing of ice-capable submarine support structures.  This program also provides SUBFOR a cadre of trained Arctic Operation Specialists (AOS) and an inventory of unique Arctic sensors to optimize submarine safety during under-ice operations."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "9.368"
                },
                "CurrentYear": {
                    "val": "8.764"
                },
                "BudgetYearOne": {
                    "val": "9.690"
                },
                "BudgetYearOneBase": {
                    "val": "9.690"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "8.505"
                },
                "CurrentYear": {
                    "val": "8.764"
                },
                "BudgetYearOne": {
                    "val": "8.044"
                },
                "BudgetYearOneBase": {
                    "val": "8.044"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.863"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-1.646"
                },
                "BudgetYearOneBase": {
                    "val": "-1.646"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.092"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "-0.353"
                                },
                                "BudgetYearOne": {
                                    "val": "-1.519"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.519"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.353"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.127"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.127"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.771"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Cost\/Funding:\n\nAll Projects: FY13 funding was reduced for Sequestration.\n\nAll Projects: FY15 funding was reduced due to the Department's decision to reduce contracted services.\n\nAll Projects: FY15 funding was reduced to properly phase program requirements in accordance with expenditures.\n\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0770"
                    },
                    "ProjectTitle": {
                        "val": "Adv Sub Supp Equip Prog"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "9.406"
                        },
                        "PriorYear": {
                            "val": "3.648"
                        },
                        "CurrentYear": {
                            "val": "3.855"
                        },
                        "BudgetYearOne": {
                            "val": "3.343"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.343"
                        },
                        "BudgetYearTwo": {
                            "val": "4.077"
                        },
                        "BudgetYearThree": {
                            "val": "4.186"
                        },
                        "BudgetYearFour": {
                            "val": "4.162"
                        },
                        "BudgetYearFive": {
                            "val": "4.248"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "A continuing need exists to improve Imaging and Electronic Warfare support (EW) capabilities in view of the advancements in potential imaging counter detection and the increasingly dense electromagnetic environment caused by the proliferation of complex radar, communications, and navigation equipment of potential adversaries.  Improvements are necessary for submarine EW and Imaging to be operationally effective in the following mission areas: Joint Littoral Warfare, Joint Surveillance, Space and Electronic Warfare, Intelligence Collection, Maritime Protection, and Joint Strike.  The program is divided into two project categories: Advanced Imaging Project Development and Advanced Electronic Warfare Support Project Development.  Both of these categories will allow for the mitigation of submarine masts, periscopes, and sensors to visual, radar, and infrared detection.  Evaluation of state of the art technology to implement periscope\/mast improvements via EW electromagnetic and electro-optic sensors resulting in improved capability.  Engineering Demonstration Models (EDMs) are developed, evaluated, and validated in the lab and through at-sea testing.\n\nThe Advanced Imaging Project Development projects include the development of the Affordable Modular Panoramic Photonics Mast (AMPPM) which introduces several groundbreaking technologies such as individually replaceable capability modules (allowing a vast array of capability combinations without supporting redesign) as well as presenting live 360 degree High Definition video (greatly increasing situational awareness and reducing scope exposure time.)  Also in support of AMPPM advanced materiel Electro-Optic\/Infrared (EO\/IR) Vulnerability Signature Reduction;  Mast Test Vehicle (MTV) testing and Imaging Engineering Measurement Program.  The Advanced EW Development projects include the development of: Distant ES Support and Remote Log-In; Rapid Reprogramming Threat Libraries; Specific Emitter Identification (SEI) Improvements; Radar Vulnerability Tool; Enhanced DeInterleavers; ES Correlator; Low Probability of Intercept (LPI) Direction Finding (DF); Embedded Built-in Test (BIT); EW on-Board Trainer (OBT); Multi-function Modular Mast (MMM) Payloads and Next Generation EW Systems Algorithms and Applications.  OPNAV direction provided for Next Generation EW in reference dated 17 June 12, SER N97\/12U144401.\n\nAll programs funded in this project are non-Acquisition Category (ACAT) programs.  The test articles identified consist of critical components that will be fully developed during Engineering Manufacturing and Development phase into EDMs."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Imaging Project Development"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.025"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "360 Degree Medium Wave Infrared (MWIR) Lab Demo and Pierside Testing\n360 Degree Affordable Modular Panoramic Photonics Mast (AMPPM) Short Wave Infrared (SWIR) camera and Hyperspectral camera Critical Design Reviews (CDR)\nEO\/IR Mast Signature Reduction: Continuation of EO\/IR TDA GUI Development\t\/Multi Thread Development\nElectro-Optic\/Infrared Vulnerability Signature Reduction Lab Test\nUniversal Mast Controller S\/W & H\/W Development\/Test, EDM# 1 & 2 Delivery\t \nLPPM Initial Design Review (IDR), Final Design Review (FDR)\nHead Window Water Shedding Pierside Testing"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.434"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "LPPM Lab Test\/Sell Off\n360 Degree Imaging (ONR) Development, AMPPM - Lab Testing SWIR and Hyperspectral \nUniversal Mast Controller S\/W & H\/W Development\/Test, EDM# 3 Delivery\nElectro-Optic\/Infrared Vulnerability Signature Reduction Lab Test\nRadio Frequency over Fiber (RFoF) Lab Demo\nCovert Electronic Support Measures (ESM) FDR\/Lab Demo"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.141"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.141"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "360 Imaging (ONR) - AMPPM - FNC Lab Testing \t\t\t\t\t\t\n360 Imaging (ONR) - AMPPM - FNC Pierside Testing \nLow Profile Photonics Mast At-sea Test\nRFoF Lab Demo At Sea Test\nCovert ESM At Sea Test"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Electronic Warfare Support (EW) Project Development"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.623"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Distant Support and Remote Log-in At-Sea Testing\t\t\t\t\t\t\nRapid Reprogramming of Threat Libraries At-sea Testing\nES Server (Correlator) At-Sea Testing\t\nES Vulnerability Tool \/ Tactical Decision Aid Development CDR and Lab Demo\t\t\t\t\nEnhanced DeInterleavers Development\t\t\t\t\t\t\nLPI DF \/ Localization Development\t\t\t\t\t\t\nEmbedded Built-in Test (BIT) Development\nNext Gen EW Development\nRFoF Development\/FDR\nCovert ESM Development"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.421"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "ES Vulnerability Tool \/ Tactical Decision Aid Lab Demo\nES Server (Valkyrie) CDR\t\t\t\t\t\t\nEnhanced DeInterleavers SBIR Lab Demo\t\t\t\t\t\t\nLPI DF \/ Localization Development\/CDR\t\t\t\t\t\t\nEmbedded Built-in Test (BIT) Development\/CDR\nES Server (Valkyrie) Development"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.202"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.202"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "ES Vulnerability Tool \/ Tactical Decision Aid At-Sea Test\/Lab Demo\t\t\t\t\t\t\nES Server (Valkyrie) Lab Demo \t\t\t\t\t\t\nEnhanced DeInterleavers Lab Demo (2) \t\t\t\t\t\t\nLPI DF \/ Localization Lab Demo \t\t\t\t\t\t\nEmbedded Built-in Test (BIT) Lab Demo \t\t\t\t\t\t\nOnBoard Trainer Development"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "This project optimizes technology insertion using a build-test-build approach to support EW and Imaging operational needs.  Operational needs have been based on the tactical requirements identified in CNO letters, Serial N77\/3U629212, dated 04 Sep 03, CNO ltr Ser N772\/5U936037 dtd 13 JUN 2005, CNO ltr Ser N776\/4U786103 dtd 1 APR 2004, COMSUBLANT\/ COMSUBPAC, Virginia Class SSN Operational Requirements Documentation objectives, ORD for Photonics (ORD #365-87-94) [dtd JUL 1994], Operational Requirements Document (ORD) for ES (ORD # 570-77-00) [dtd 20 DEC 2000], ORD for ISIS (ORD #663-77-05) [dtd MAR 2005], Capability Development Document (CDD) for Submarine EW Systems (Ver-DRAFT), Common Submarine Imaging System (CSIS) (CDD# 849-87-11) dtd 22 Dec 2011 for Submarine Imaging Systems and JOINT COMMAND SUBMARINE FORCE\/COMMANDER SUBMARINE FORCE ltr Ser# N00\/00621 dtd 24 Oct 2011. Project efforts develop submarine unique improvements to mast, periscope, and EW electromagnetic spectrum and electro-optic sensors based on emerging technologies that are available from DoD Exploratory Development Programs, industry Independent Research and Development, and other sources.  Engineering Demonstration Models (EDMs) will be developed to provide a realistic method of evaluating the improvements, including deployment on submarines for testing."
                        },
                        "PerformanceMetrics": {
                            "val": "The RDD program goal is to respond to urgent operational needs within 30 days and provide for rapid development and fielding of prototype solutions within 270 days."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0603562N_0770_FILE2.PNG"
                                }
                            }
                        ]
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "1739"
                    },
                    "ProjectTitle": {
                        "val": "Submarine Arctic W\/F Development"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "36.035"
                        },
                        "PriorYear": {
                            "val": "4.857"
                        },
                        "CurrentYear": {
                            "val": "4.909"
                        },
                        "BudgetYearOne": {
                            "val": "4.701"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.701"
                        },
                        "BudgetYearTwo": {
                            "val": "4.819"
                        },
                        "BudgetYearThree": {
                            "val": "4.959"
                        },
                        "BudgetYearFour": {
                            "val": "5.053"
                        },
                        "BudgetYearFive": {
                            "val": "5.169"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Submarine Arctic Warfare Development project responds to the increased threat of submarine and surface ship activity in Arctic regions of the world through the development of advanced submarine concepts.  It places particular emphasis on submarine operability and mission support in unique, cold, ice-covered environments.  Efforts include assessment of combat system effectiveness, weapons testing, use of high frequency sonars in Arctic regions, testing of ice-capable submarine structures, and development of class-specific Arctic operational guidelines.  This project also provides the framework for various research and development programs to conduct test and evaluation in shallow water and Arctic regions."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Conduct ICEX and Arctic Transit Mission, ICEX Workup and Training, Ice Camps"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.857"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conducted ICEX mission 1-2013.  Continued planning and support for ICEX mission 1-2014 and Ice Camp 1-2014.  Supported Arctic deployments, including inter-Fleet transfers, as required by the SUBFOR Commanders.  Investigated, researched, developed and deployed new systems for Arctic submarine support.  Supported testing and tactical development required to improve submarine Arctic operability and warfighting.  Installed and tested mission\/tactical grade equipment on SSN 688I and SSN 21 Class platforms.  Developed a High Frequency Active (HFA) under-ice sonar training product.  Evaluated under-ice HFA training product during Arctic training sessions.  Procured two additional EdgeTech 220 Side Scan systems to support SSN 688I\/774 Class Submarines.  Developed and tested new display software for the Commercial Off The Shelf (COTS) SEABIRD Conductivity, Temperature, and Depth (CTD) probes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.909"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct Arctic work-up training and ICEX mission 1-2014.  Evaluate new display software for the COTS SEABIRD CTD probes.  Support Arctic deployments, including inter-Fleet transfers, as required by the SUBFOR Commanders.  Investigate, research, develop and deploy new systems for Arctic submarine support.  Support testing and tactical development required to improve submarine Arctic operability and warfighting."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.701"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.701"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Support Arctic deployments, including inter-Fleet transfers, as required by the SUBFOR Commanders.  Investigate, research, develop and deploy new systems for Arctic submarine support.  Support testing and tactical development required to improve submarine Arctic operability and warfighting."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Use sole source and competitively awarded contracts through the Fleet Logistics Center (FLC) regional contracting office for equipment and technical services.  The NAVSEA University Affiliated Research Center (UARC) omnibus contract is used for procurement of logistics support for Ice Camps and Conductivity, Temperature, and Depth (CTD) probe display software development."
                        },
                        "PerformanceMetrics": {
                            "val": "Conduct and support Arctic deployments, including inter-Fleet transfers, as required by the SUBFOR Commanders."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0603562N_1739_FILE1.PNG"
                                }
                            }
                        ]
                    }
                }
            ]
        }
    }
}