{
    "id": "5b1c128bf185aa9df037d1a65c91694b67f2cec3",
    "meta": {
        "filename": "dod-2015_RDTE_2015_NAVY_BA7_RDTE_JustificationBook_Navy_PB_2015.zzz_unzipped_RDTE_JustificationBook_Navy_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0204163N"
        },
        "ProgramElementTitle": {
            "val": "Fleet Tactical Development"
        },
        "R1LineNumber": {
            "val": "179"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "97.273"
            },
            "PriorYear": {
                "val": "14.304"
            },
            "CurrentYear": {
                "val": "23.422"
            },
            "BudgetYearOne": {
                "val": "27.281"
            },
            "BudgetYearOneBase": {
                "val": "27.281"
            },
            "BudgetYearTwo": {
                "val": "33.316"
            },
            "BudgetYearThree": {
                "val": "58.351"
            },
            "BudgetYearFour": {
                "val": "61.863"
            },
            "BudgetYearFive": {
                "val": "59.715"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Communications Automation Program - This project is a continuing program that provides for automation and communications upgrades for fleet tactical users.  It includes Battle Force Tactical Network (BFTN) and Joint Aerial Layer Network-Maritime (JALN-M). \n\nThe Battle Force Tactical Network (BFTN) on each surface, subsurface, air, or fixed US Navy platform utilizes previously installed\/existing Line of Sight (LOS)\/Extended Line of Sight (ELOS) radios (a.k.a. Radio Frequency (RF)) to create a secure gateway that inter-connects all users into a common RF Tactical Network (a.k.a. wireless). This Network separately supports US-Only and Allied\/Coalition users' tactical data information exchanges on each platform (node) between and\/or across separately dispersed RF Networks even if Satellite Communications (SATCOM) channels to shore are lost during an Anti-Access Area Denial (A2AD) event.\n\nJoint Aerial Layer Network-Maritime (JALN-M) is the Navy implementation of the JALN architecture which provides assured communications in any environment, especially A2AD.  With disruption or loss of Space tier communications, JALN-M establishes and\/or restores connectivity within the High Capacity Backbone (HCB) tier, the Distribution Access Range Extension (DARE) tier, and the Transition tier in accordance with the JALN Initial Capabilities Document and the JALN Analysis of Alternatives (AoA) Final Report.  JALN-M is a robust, assured communications capability providing joint connectivity via the HCB and Navy platform connectivity via a pseudo satellite DARE capability.  JALN-M will use the Extended Data Rate (XDR) waveform for intra-battle group DARE communications, a Common Data Link (CDL) waveform for the HCB cross-link capability, and will leverage enhanced Ultra High Frequency\/High Frequency (UHF\/HF) waveforms for coalition connectivity.     \n\nFY15 BFTN efforts will support system demonstration, operational tests, (i.e., Technical Evaluation, Initial Operational Test and Evaluation (IOT&E)), and design enhancements to the baseline system that includes higher data rates for increased network speeds to support expanded range of applications beyond email, chat correspondence and web access. The engineering change will also incorporate intelligent modems and controllers that will automatically manage flow of information, offset jamming and an increase in channel quantities that will quadruple the number of BFTN network paths; thereby, increasing speed and shore interoperation\/reliability of service. This engineering change is also intended to address obsolescence and end of life impacts of rapidly advancing network technologies.\n\nFY15 JALN-M efforts will continue to support the goal of developing six (6) JALN-M Prototype payloads through the leveraging of  the results of  both HCB and Airborne XDR flight demonstrations. Efforts will include development of capabilities to be interoperable with Automated Digital Network System (ADNS). ADNS provides routing, switching, baseband, configuration and monitoring capabilities. Funding will also facilitate the development of the design specification of JALN-M payload requirements for integration into an airborne prototype Pod."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "15.695"
                },
                "CurrentYear": {
                    "val": "46.155"
                },
                "BudgetYearOne": {
                    "val": "60.903"
                },
                "BudgetYearOneBase": {
                    "val": "60.903"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "14.304"
                },
                "CurrentYear": {
                    "val": "23.422"
                },
                "BudgetYearOne": {
                    "val": "27.281"
                },
                "BudgetYearOneBase": {
                    "val": "27.281"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.391"
                },
                "CurrentYear": {
                    "val": "-22.733"
                },
                "BudgetYearOne": {
                    "val": "-33.622"
                },
                "BudgetYearOneBase": {
                    "val": "-33.622"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.017"
                    }
                },
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-22.716"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.079"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-33.622"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-33.622"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-1.312"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Battle Force Tactical Network (BFTN) funding was reduced by $2.7M Congressional Reduction in FY14 and $1.3M DoN Contracted Services Reduction in FY15.\n\nJoint Aerial Layer Network-Maritime (JALN-M) funding was reduced by a $19.9M Congressional Reduction in FY14. PB15 restored funding across the FYDP. FY15 funding is $19.5M with the restoral for Extended Data Rate (XDR) waveform efforts, incorporating reductions for DoN Contracted Services, Fleet Tactical Endgame Balance, and Phase I Adjustments."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0725"
                    },
                    "ProjectTitle": {
                        "val": "Communication Automation"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "97.273"
                        },
                        "PriorYear": {
                            "val": "14.304"
                        },
                        "CurrentYear": {
                            "val": "23.422"
                        },
                        "BudgetYearOne": {
                            "val": "27.281"
                        },
                        "BudgetYearOneBase": {
                            "val": "27.281"
                        },
                        "BudgetYearTwo": {
                            "val": "33.316"
                        },
                        "BudgetYearThree": {
                            "val": "58.351"
                        },
                        "BudgetYearFour": {
                            "val": "61.863"
                        },
                        "BudgetYearFive": {
                            "val": "59.715"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "Maritime Aerial Layer Network (MALN) is renamed Joint Aerial Layer Network-Maritime (JALN-M)."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Battle Force Tactical Network (BFTN) on each surface, subsurface, air, or fixed US Navy platform uses previously installed\/existing Line of Sight (LOS)\/Extended Line of Sight (ELOS) radios (a.k.a. Radio Frequency (RF)) to create a secure gateway that inter-connects all users into a common RF Tactical Network (a.k.a. wireless). BFTN enables war-fighters to digitally communicate NATO and US-Only information necessary to execute and plan in a real-time operational environment without relying on ashore application server interaction. This RF Network separately supports US-Only and Allied\/Coalition users within each platform to distribute information even if Satellite Communications (SATCOM) channels to shore are lost. As a result, Carrier and Expeditionary Strike Group Commanders maintain the digital communication ability to execute and plan with other U.S. ships, submarines or aircraft, as well as with Allied\/Coalition networks; even if SATCOM channels to shore are lost. \n\nIn a satellite-denied event, adversaries covertly jam or disable communications necessary to Fleet protection and tactical operation. BFTN engineering changes will facilitate automation of communications relays and application of network aware link establishment (NA-ALE) across battle groups. The BFTN engineering change will also enable modification of the BFTN Fly Away Kit for use in Unmanned Aerial Vehicles (UAV); thereby extending BFTN Ultra High Frequency\/High Frequency (UHF\/HF) link ranges. As a result, BFTN service levels can be extended for theatre of operations sufficient to thwart contested SATCOM connectivity to shore servers. Engineering studies and related test activities will commence FY14 to support the ultimate goal of development and implementation of an engineering change for increased BFTN network data rates and link ranges (1.92Mbps - Ultra High Frequency (UHF) at 20nm and 128Kbps - High Frequency (HF) at 200nm), a quadrupling of system channel quantities for improved service, increased network performance and jam resistance in a satellite degraded\/denied environment. Design enhancements will enable the BFTN network to self-assemble Transmission Control Protocol\/Internet Protocol (TCP\/IP) delivery circuits, adapt to user proximity changes due to maneuvers or operational demands and self-heal those data delivery circuits, if they are degraded or forcefully taken from afloat forces. The engineering change will also mitigate obsolescence and end of life impacts associated with steady progression of network technology and architectures. \n\nFY15 BFTN engineering change and related test activities will continue toward the objective of increasing BFTN network data rates and link ranges (1.92Mbps - UHF at 20nm and 128Kbps - HF at 200nm), increasing channel quantities for improved service and improved network performance and jam resistance in a satellite degraded\/denied environment. Engineering activities will include tests designed to assess performance of the engineering change with range extension via an in-flight aerial relay between a shore sites to surface platforms in FY16. Testing of legacy radio modifications for wideband and modems\/controller modifications that increase data rates will authenticate expansion of RF Networking data rates\/ranges within and across at-sea forces, as well as providing access to the Global Information Grid (GIG) via long haul links to Automated Digital Network System (ADNS) routers at fixed and mobile operation centers, including satellite denied and RF jamming situations. \n\nJoint Aerial Layer Network-Maritime (JALN-M) is the Navy implementation of the JALN architecture which provides assured communications in any environment, especially Anti-Access Area Denial (A2AD). With disruption or loss of space tier communications, JALN-M establishes and\/or restores connectivity within the High Capacity Backbone (HCB) tier, the Distribution Access Range Extension (DARE) tier, and the Transition tier in accordance with the JALN Initial Capabilities Document (ICD) dated 27 August 2009 and the JALN Analysis of Alternatives (AoA) Final Report dated 31 October 2011. JALN-M is a robust, assured communications capability providing Joint connectivity via the HCB and Navy platform connectivity via a pseudo satellite DARE capability. JALN-M will use the Extended Data Rate (XDR) waveform for intra-battle group DARE communications, a Common Data Link (CDL) waveform for the HCB cross-link capability, and will leverage enhanced UHF\/HF waveforms for coalition connectivity.\n\nFY15 funding will continue to support the goal of developing six (6) JALN-M Prototype payloads through the leveraging of  the results of  both HCB and Airborne XDR flight demonstrations. Efforts will include development of capabilities to be interoperable with Automated Digital Network System (ADNS). ADNS provides routing, switching, baseband, configuration and monitoring capabilities. Funding will also facilitate the development of the design specification of JALN-M payload requirements for integration into an airborne prototype Pod."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Battle Force Tactical Network (BFTN)"
                                    },
                                    "Description": {
                                        "val": "Overall program efforts include investigation of emerging technologies through study, development and associated testing for feasibility of program insertion."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.642"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Supported the Battle Force Tactical Network (BFTN) Initial Operational Test and Evaluation (IOT&E) event in support of a Full Rate Production decision. Efforts supported research of commercial sector through internet data mining and requests for information (RFI) to determine what commercial off the shelf (COTS) technology is available in the marketplace to meet BFTN system enhancement design specifications. RFI responses were assessed and catalogued for development of BFTN engineering change RDT&E contract request for proposal (RFP)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.500"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue support to the IOT&E event in support of a Full Rate Production decision. Submit RFP for BFTN Engineering Change RDT&E contract with RFP release estimated Q4FY14. Initiate the development of acquisition and system engineering documentation, initiate efforts in planning and management of BFTN acquisition plans, logistics, milestones and schedule to support efforts toward the award of BFTN engineering change contract. Support demonstration and operational tests and studies of BFTN engineering change design i.e., jamming resistance. Reconfigure BFTN laboratory to support individual component and improved system performance test and evaluation. Support channel allocation\/saturation studies; design specifications for High Frequency (HF) and Ultra High Frequency (UHF) radio wideband modification kit and radio feasibility studies; BFTN Authority To Operate (ATO) accreditation documentation and approval process; planning for environmental and shock\/vibe testing; and developmental and demonstration test activities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.752"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.752"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue support to the IOT&E event in support of a Full Rate Production decision. Continue to develop engineering documentation, initiate efforts in management of plans, logistics, milestones and schedule to support efforts toward BFTN engineering change contract award. Award contract for development and testing efforts of BFTN engineering change, to include: initiation of system sub-component miniaturization to reduce system weight and power parameters for ready integration into a broader range of platform configurations and support MIL-STD 461E Electromagnetic Interference and MIL-STD 167 Vibration testing and certification activities. Demonstrate and document techniques and procedures for multiple 1.9Mbps UHF and 128Kbps HF RF channels with load-balancing and fail-over from Satellite Communication (SATCOM). Efforts will begin to design test of BFTN Fly Away Kit upgrade (modular relay) ashore with in-flight aerial relay bridge to ships, authenticating extension of RF Networking data rates\/ranges, within and across at-sea forces, to support BFTN Secret Internet Protocol Router Network (SIPRNET) connectivity to Automated Digital Network System (ADNS) routers ashore for GIG access. Engineering change developmental\/lab testing in preparation for demonstration and operational test; wideband modification kit design for AN\/WSC-3 UHF and AN\/URT-23 HF radios; DoD Information Assurance Certification Accreditation Plan (DIACAP) and National Protection Center (NPC) integration in one (1) simulated Unmanned Aerial Vehicles (UAV) configured with the BFTN modular relay and three (3) surface platforms (nodes). Test plan development for testing of data rates in an at-sea topologic array of four or more platforms\/nodes."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint Aerial Layer Network -Maritime (JALN-M)"
                                    },
                                    "Description": {
                                        "val": "Overall program efforts include investigation of emerging technologies through study, development and associated testing for feasibility of program insertion."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.662"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Participated in OPNAV Anti-Access Area Denial (A2AD) events to include Concept of Operations (CONOPS)\/Concept of Employment(CONEMP) development, Council of Colonels engagement, and acquisition support. Accomplished initial efforts in support of necessary modifications to the Advance Extremely High Frequency (AEHF) Extended Data Rate (XDR) waveform identified and developed for use in the airborne XDR mode, and flight demonstration of the airborne XDR relay functionality."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.922"
                                            },
                                            "Articles": {
                                                "val": "2"
                                            },
                                            "Text": {
                                                "val": "Continue participation in OPNAV Anti-Access Area Denial (A2AD) events to include Concept of Operations (CONOPS) development, Council of Colonels engagement, and continued efforts towards modifications to the Advance Extremely High Frequency (AEHF) Extended Data Rate (XDR) waveform identified and developed for use in the airborne XDR (A-XDR) mode, and to support the flight demonstration of the A-XDR relay functionality. Conduct analysis, risk reduction activities, and prototype development of the routing, navigation, cross-link, and payload requirements. Conduct flight test demonstration of A-XDR payload prototype articles at contractor site. Trade studies and risk assessments will begin in the areas of dynamic range, adjacent channel interference, XDR functionality, hardware RF options, security, information assurance, platform constraints, crosslink considerations, and acquisition and tracking. Risk reduction will include flight demonstrations employing the MIT\/Lincoln Lab satellite simulator on an aircraft communicating with a surface terminal. Initiate test planning for airborne HCB flight demonstrations to support the development of a JALN-M  payload specification document."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.529"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.529"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete A-XDR flight testing. Conduct flight test demonstrations of airborne HCB payload to establish throughput at range, anti-jamming capability verses uplink  and downlink jamming, simultaneous connections, link availability and bit error rate. Initiate the design specifications for a JALN-M prototype payload. Initiate efforts on development of six (6) JALN-M prototype payloads in a Pod, leveraging the results of  both HCB and Airborne XDR flight demonstrations."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPN\/3057"
                                    },
                                    "Title": {
                                        "val": "Battle Force Tactical Network (BFTN)."
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.285"
                                        },
                                        "CurrentYear": {
                                            "val": "1.836"
                                        },
                                        "BudgetYearOne": {
                                            "val": "1.425"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1.425"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "6.940"
                                        },
                                        "BudgetYearThree": {
                                            "val": "13.403"
                                        },
                                        "BudgetYearFour": {
                                            "val": "11.063"
                                        },
                                        "BudgetYearFive": {
                                            "val": "15.815"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "77.760"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Battle Force Tactical Network (BFTN) will follow an evolutionary acquisition approach with collegial development across activities and coalesced implementation phases at accredited facility to achieve interoperable component upgrades, system integration and automated operations that optimize Fleet implementation. Program will use awarded OMNIBUS contracts to obtain engineering and support services consistent with acquisition initiatives. Development of BFTN engineering change enhancements leverages Commercial-Off-The-Shelf (COTS) and Government-Off-The-Shelf (GOTS) products while expanding material savings by streamlining logistics, installation, integration and training concepts. Where feasible, differing types of advantageous contract vehicles will be used to provide flexibility, decrease contract administrative costs, and encourage acquisition streamlining through the use of COTS products. \n\nJoint Aerial Layer Network-Maritime (JALN-M) will address capability gaps as directed by the JALN Analysis of Alternatives (AoA) by integrating a suite of technical capabilities into a single payload. Technical and acquisition support will be provided to conduct HCB and airborne XDR demonstrations and to develop six prototype JALN-M payloads."
                        },
                        "PerformanceMetrics": {
                            "val": "BFTN - Complete successful Initial Operational Test and Evaluation (IOT&E). Legacy UHF Radios Modified for Multichannel Wideband Interoperability Verified. Successful EMC\/EMI Test & Accreditation. Continue engineering changes for Battle Force Tactical Network engineering change to increase individual High Frequency Internet Protocol (HFIP) channel data rates to 128Kbps and Ultra High Frequency Internet Protocol (UHFIP) to 1.9Mbps. Successful demonstration of engineering change over three (3) channels simultaneously, followed by successful demonstration of Spatial Multiplexing design over eight (8) channels simultaneously. Increased data rates for modem and controller are verified."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0204163N_0725_FILE7.JPG"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0204163N_0725_FILE8.JPG"
                                }
                            }
                        ]
                    }
                }
            ]
        }
    }
}