{
    "id": "5b8e79a46a473a756c142f27587b1296c074a8a6",
    "meta": {
        "filename": "dod-2015_RDTE_2015_DHRA_RDTE_JustificationBook_DoD_Human_Resources_Activity_PB_2015.zzz_unzipped_RDTE_JustificationBook_DoD_Human_Resources_Activity_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "DoD Human Resources Activity",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603769SE"
        },
        "ProgramElementTitle": {
            "val": "Distributed Learning Advanced Technology Development (ADL)"
        },
        "R1LineNumber": {
            "val": "64"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "DoD Human Resources Activity"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "27.048"
            },
            "PriorYear": {
                "val": "10.956"
            },
            "CurrentYear": {
                "val": "12.116"
            },
            "BudgetYearOne": {
                "val": "10.692"
            },
            "BudgetYearOneBase": {
                "val": "10.692"
            },
            "BudgetYearTwo": {
                "val": "10.808"
            },
            "BudgetYearThree": {
                "val": "10.900"
            },
            "BudgetYearFour": {
                "val": "10.897"
            },
            "BudgetYearFive": {
                "val": "11.063"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Established by Executive Order, with policy oversight by the Office of the Deputy Assistant Secretary of Defense\/Readiness (Training Readiness and Strategy), this program leverages emerging learning technologies to provide cost effective training and education to employees and Service members of the Federal Government.  \n\nThe mission of the ADL Initiative is to provide access to the highest-quality education, training, and performance aiding tailored to individual needs and delivered cost-effectively. The ADL Initiative is a DoD program responsible for research and development of distributed and networked learning technologies, to include: online courseware, training games, virtual worlds, and mobile technology.  ADL developed the Sharable Content Object Reference Model (SCORM, the de facto industry and internationally accepted standard for e-learning interoperability.  It is mandated for all Department of Defense (DoD) agencies through DoD Instruction 1322.26.  The ADL initiative, working with ADL Partnership Co-Labs and the NATO community, has reduced costs and increased interoperability and sharing of distributed learning content, enabling discovery, retrieval, and reuse.  Online course completions in DoD increased to 20.4 million in FY12, and will likely increase in the future. The ADL Initiative enables the migration of distributed learning content to multiple hardware platforms and software applications using the SCORM standard.  The ADL Initiative is working in collaboration with the Services, other government agencies, industry, and our international partners to develop the next generation learning architecture that will be platform agnostic and enable the use of new software applications, including mentoring, social media and experiential learning. The research project for the future is Project Aristotle.  The first phase is to develop a Personal Assistant for Learning (PAL), a ubiquitous, 24\/7 advanced concept research effort that will provide an untethered, tailored training and learning capability that will adapt to fit the learner’s specific strengths and weaknesses, learning style, and level of proficiency. As we look to the future, the PAL will become more sophisticated, intelligent and comprehensive."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "12.195"
                },
                "CurrentYear": {
                    "val": "12.116"
                },
                "BudgetYearOne": {
                    "val": "12.090"
                },
                "BudgetYearOneBase": {
                    "val": "12.090"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "10.956"
                },
                "CurrentYear": {
                    "val": "12.116"
                },
                "BudgetYearOne": {
                    "val": "10.692"
                },
                "BudgetYearOneBase": {
                    "val": "10.692"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.239"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-1.398"
                },
                "BudgetYearOneBase": {
                    "val": "-1.398"
                }
            },
            "AdjustmentDetails": {
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "-1.239"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-1.398"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.398"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "In FY 2013, reduction was due to sequestration.  \n\nIn FY 2015, reduction was due to Budget Control Act and other program adjustments."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "Project 1"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Distributed Learning"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "27.048"
                        },
                        "PriorYear": {
                            "val": "10.956"
                        },
                        "CurrentYear": {
                            "val": "12.116"
                        },
                        "BudgetYearOne": {
                            "val": "10.692"
                        },
                        "BudgetYearOneBase": {
                            "val": "10.692"
                        },
                        "BudgetYearTwo": {
                            "val": "10.808"
                        },
                        "BudgetYearThree": {
                            "val": "10.900"
                        },
                        "BudgetYearFour": {
                            "val": "10.897"
                        },
                        "BudgetYearFive": {
                            "val": "11.063"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Established by Executive Order, with policy oversight by the Office of the Deputy Assistant Secretary of Defense\/Readiness (Training Readiness and Strategy), this program leverages emerging learning technologies to provide cost effective training and education to employees and Service members of the Federal Government.  \n\nThe mission of the ADL Initiative is to provide access to the highest-quality education, training, and performance aiding tailored to individual needs and delivered cost-effectively. The ADL Initiative is a DoD program responsible for research and development of distributed and networked learning technologies, to include: online courseware, training games, virtual worlds, and mobile technology.  ADL developed the Sharable Content Object Reference Model (SCORM, the de facto industry and internationally accepted standard for e-learning interoperability.  It is mandated for all Department of Defense (DoD) agencies through DoD Instruction 1322.26.  The ADL initiative, working with ADL Partnership Co-Labs and the NATO community, has reduced costs and increased interoperability and sharing of distributed learning content, enabling discovery, retrieval, and reuse.  Online course completions in DoD increased to 20.4 million in FY12, and will likely increase in the future. The ADL Initiative enables the migration of distributed learning content to multiple hardware platforms and software applications using the SCORM standard.  The ADL Initiative is working in collaboration with the Services, other government agencies, industry, and our international partners to develop the next generation learning architecture that will be platform agnostic and enable the use of new software applications, including mentoring, social media and experiential learning. The research project for the future is Project Aristotle.  The first phase is to develop a Personal Assistant for Learning (PAL), a ubiquitous, 24\/7 advanced concept research effort that will provide an untethered, tailored training and learning capability that will adapt to fit the learner’s specific strengths and weaknesses, learning style, and level of proficiency. As we look to the future, the PAL will become more sophisticated, intelligent and comprehensive."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Distributed Learning"
                                    },
                                    "Description": {
                                        "val": "Established by Executive Order, with policy oversight by the Office of the Deputy Assistant Secretary of Defense\/Readiness (Training Readiness and Strategy), this program leverages emerging learning technologies to provide cost effective training and education to employees and Service members of the Federal Government."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.956"
                                            },
                                            "Text": {
                                                "val": "• Published multiple research articles in leading professional journals on the best practices and effectiveness of online learning compared to classroom training;\n• Began work on solving challenges associated with developing a PAL capability, a 24\/7, non-intrusive ubiquitous, advanced concept research effort that will provide an untethered, tailored training and learning capability that will adapt to fit the learner’s specific strengths and weaknesses, learning style, and level of proficiency.\n• Researched new learning technologies for possible integration into DoD educational and training programs to include the assessment and tracking of experiential training & education activities;\n• Researched structured learning content schemas and transformation technologies to modularize content, enhance semantic understanding, and improve the prospects for reuse;\n• Tested advanced instructional methods using intelligent tutors for training;\n• Established advanced concept research and prototypes for the Next Generation SCORM standard."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.116"
                                            },
                                            "Text": {
                                                "val": "• Research new learning technologies for possible integration into DoD educational and training programs to include innovative methodologies and approaches to using Social Networking for solving problems in collaborative, disparate environments;\n• Demonstrate the application of the spacing effect using current mobile technologies to reinforce learning and improve long-term retention.\n• Continue to test advanced instructional methods for intelligent tutors for training;\n• Integrate proven concepts from FY13 research into the PAL capability and move to more intelligence-based concepts;\n• Update policies, plans, and programs to support Distributed Learning Content (DLC) programs, standardization, identification, and distribution of best practices and guidelines for learning, training, and job performance aids that accommodate today’s networked learning environment;\n• Support the White House educational initiatives as the DoD representative to the Learning Registry and Federal Game Guild;\n• Continue work with the DoD training community for the purpose of sharing of DLC (metrics, best practices, etc.), standardization of common terminology and best practices for developing and implementing efficient and effective DL technologies across DoD;\n• Collaborate with the Services, other government agencies, industry, and our international partners to develop next generation learning architecture, the Training and Learning Architecture (TLA);\n• Continue to refine, in collaboration with Military Services and other government agencies to share DLC and 3D models used for immersive learning experiences;\n• Collaborate with the other Federal Agencies to share descriptive metadata about learning resources and usage information about how those resources are being used;\n• Participate and influence as Co-chair of the International Training & Education Development (IT&ED), NATO Task Group to increase the standardization and reuse of training."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.692"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.692"
                                            },
                                            "Text": {
                                                "val": "• Continue to influence industry and academia through publication of research articles in leading professional journals on the integration of emerging learning technologies to enhance training;\n• Deliver a prototype for Project Aristotle for possible integration into DoD educational and training programs. \n• Expand research into the following areas: persistent, open independent Learner Models with reasoning capability that incorporate new methods of machine learning; common sense reasoning; cognitive modeling; artificial intelligence; the use of intelligent systems designed to increase both cognitive adaptability and emotional resiliency; and domain independent intelligent system design.\n• Deliver a prototype of an instructional intelligent tutor for training;\n• Develop the next iteration of the Training & Learning architecture for the next generation learning environment."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Required."
                        },
                        "PerformanceMetrics": {
                            "val": "In FY2015, ADL will:\n1.  Deliver the next version of the Experience API, which is the first component of the new Training & Learning Architecture.\n2  Continue research and integration of the PAL application of Project Aristotle.\n3.  Continue to influence key Service and international ADL meetings and conferences reference the discovery, sharing and delivery of interoperable training content; \n4.  Promote the sharing of data among DoD, other Federal Agencies and state and local education departments throughout the U.S., by making educational resources discoverable and retrievable and also through the open source initiative.  \n5.  Prototype an Intelligent Tutor with the intent to determine the utilization of this technology across DoD and as a step toward the more comprehensive PAL. Metrics include, but are not limited to; Scalability, Generalizability, and Affordability."
                        }
                    }
                }
            ]
        }
    }
}