{
    "id": "5e4b8116beb878c2a847de8c68674b38754426d9",
    "meta": {
        "filename": "dod-2015_RDTE_2015_DTRA_RDTE_JustificationBook_Defense_Threat_Reduction_Agency_PB_2015.zzz_unzipped_RDTE_JustificationBook_Defense_Threat_Reduction_Agency_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Defense Threat Reduction Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605000BR"
        },
        "ProgramElementTitle": {
            "val": "WMD Defeat Capabilities"
        },
        "R1LineNumber": {
            "val": "121"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Defense Threat Reduction Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "13.576"
            },
            "PriorYear": {
                "val": "5.173"
            },
            "CurrentYear": {
                "val": "12.901"
            },
            "BudgetYearOne": {
                "val": "6.887"
            },
            "BudgetYearOneBase": {
                "val": "6.887"
            },
            "BudgetYearTwo": {
                "val": "7.156"
            },
            "BudgetYearThree": {
                "val": "7.397"
            },
            "BudgetYearFour": {
                "val": "7.497"
            },
            "BudgetYearFive": {
                "val": "7.625"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element supports the development of system capabilities for the Countering Weapons of Mass Destruction (CWMD) mission.  This funding specifically supports (1) the development of collaborative CWMD analysis capabilities between DoD and key interagency and international partners through a globally accessible net-centric framework in the form of the Integrated Weapons of Mass Destruction Toolset (IWMDT) and (2) technologies to meet national International Monitoring System (IMS) technology requirements in support of nuclear arms control activities under the Nuclear Arms Control Technology (NACT) program.\n\nProject RF-Detection and Forensics Technologies supports the NACT Program, conducting Research, Development, Testing, and Evaluation (RDT&E) to meet IMS technology requirements in support of implementation, compliance, monitoring, and inspection for existing and emerging nuclear arms control activities.  \n\nProject RL-Nuclear & Radiological Effects develops and provides a real-time globally accessible net-centric framework which migrates the Defense Threat Reduction Agency (DTRA) chemical, biological, radiological, nuclear, and high explosive (CBRNE) modeling and simulation codes to provide an integrated suite of Combating WMD decision support capabilities."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "5.749"
                },
                "CurrentYear": {
                    "val": "12.901"
                },
                "BudgetYearOne": {
                    "val": "12.967"
                },
                "BudgetYearOneBase": {
                    "val": "12.967"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "5.173"
                },
                "CurrentYear": {
                    "val": "12.901"
                },
                "BudgetYearOne": {
                    "val": "6.887"
                },
                "BudgetYearOneBase": {
                    "val": "6.887"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.576"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-6.080"
                },
                "BudgetYearOneBase": {
                    "val": "-6.080"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.008"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "-0.464"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.104"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Realignments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-3.951"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-3.951"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Reductions"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-2.129"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.129"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The decrease in FY 2013 from the previous President's Budget submission is predominately due to Congressional reductions and the Small Business Innovation Research (SBIR) transfer.  The decrease in FY 2015 from the previous President's Budget Submission is predominately due to decreased investment in net-centric architecture."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "RF"
                    },
                    "ProjectTitle": {
                        "val": "Detection and Forensics Technologies"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "6.906"
                        },
                        "BudgetYearOne": {
                            "val": "6.887"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.887"
                        },
                        "BudgetYearTwo": {
                            "val": "7.156"
                        },
                        "BudgetYearThree": {
                            "val": "7.397"
                        },
                        "BudgetYearFour": {
                            "val": "7.497"
                        },
                        "BudgetYearFive": {
                            "val": "7.625"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Nuclear Arms Control Technology (NACT) Program provides Research, Development, Testing, and Evaluation (RDTE) to meet International Monitoring System (IMS) technology requirements in support of Comprehensive Nuclear Test Ban Treaty (CTBT) implementation, compliance, monitoring, and inspection, and other existing and emerging nuclear arms control activities.  The project directly provides for the United States contribution to the IMS and addresses Weapons of Mass Destruction (WMD) monitoring requirements validated by the Office of the Under Secretary of Defense, Acquisition, Technology, and Logistics (OUSD AT&L).  This project conforms to the administration’s research and development priorities as related to WMD arms control and disablement.  Technical assessments are made to provide the basis for sound project development, evaluate existing programs and provide the data required to inform compliance assessments, and support US monitoring policy- and decision-makers and negotiation teams.  Technology developments and system improvements are conducted to ensure the availability of these CTBT monitoring capabilities.  \n\nPrimary program emphasis is on improving sensors sustainability, operational availability, and detection capabilities against a wide range of nuclear test phenomena and associated threat origins.  The program includes development, fielding, and sustainment of specialized monitoring and analysis equipment and capabilities, procedures, persistent monitoring and associated monitoring data in direct support to the IMS and CTBT requirements.  NACT also directly supports US and allied warfighter and national technical monitoring requirements and provides vital monitoring data that are extensively used by warfighter planners, Department of Defense (DoD) and other U.S. government agencies, and international agencies.  This project directly supports the warfighting capability area of combatting WMD.\n\nThe increase from FY 2013 to FY 2014 is due to the transfer of the NACT program to the Defense Threat Reduction Agency (DTRA).  The NACT program transferred from the United States Army Space Missile Development Command (SMDC) to DTRA in FY 2014."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RF - Detection and Forensics Technologies"
                                    },
                                    "Description": {
                                        "val": "Project RF-Detection and Forensics Technologies supports the Nuclear Arms Control Technologies (NACT) Program, conducting RDT&E to meet International Monitoring System (IMS) technology requirements in support of Comprehensive Nuclear Test Ban Treaty implementation, compliance, monitoring, and inspection and other emerging nuclear arms control activities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.906"
                                            },
                                            "Text": {
                                                "val": "-Continue support of Office of the Secretary of Defense (OSD) treaty management objectives and continue participating in joint US-International Comprehensive Test Ban Office Provisional Technical Secretariat (PTS) sponsored technology development exchanges and developmental exercises in support of technology development and IMS operations and maintenance objectives.  \n- Continue prototype sensor development, station calibration, and metrology planning. \n- Continue development of monitoring station array element calibration with focus on developing in-situ array calibration and performance monitoring capabilities.  Conduct signal capture and identification studies to reduce signal clutter, false alarms, and improve noise rejection methods and algorithms.\n- Continue planning to evaluate options for performing experiments or demonstrations to evaluate system performance to monitor a planned underground or underwater detonation.  The detonation will be non-nuclear in nature but configured to simulate the release of suitable surrogate nuclear testing signatures.  All associated signatures will be acceptable to environmental and health regulations and of a nature suitable to challenge IMS monitoring technologies.\n- Continue radio-xenon gas detection system development and research.  Study and evaluate atmospheric and subsurface xenon backgrounds and transport phenomenon.  \n- Continue a study of baseline noble gas detection schemes and select the pathway for future radio-xenon detection options providing enhanced detection and operational capabilities and reliability.  This study is paying close attention to timeline and feasibility of implementation alternatives.\n- Continue infrasound information system enhancements and development of infrasound propagation models to improve detection, identification, and discrimination of sources and signatures of interest.\n-  Continue field experiments to collect data required to constrain and validate models.  Models will include fine-scale atmospheric conditions, topography, 3-D winds and effects of non-linear propagation.\n-  Continue to develop a portable\/rapid deployable infrasound array and standard sound source for calibrating infrasound stations\/arrays.  \n- Continue on-location infrasound event calibration and metrology research at established engineering and development test centers (EDTC), continue development of EDTCs to support research, testing, and evaluation relevant to station shutdowns, configuration changes, and invasive procedures, and  use EDTCs to perform primary evaluations of prototype monitoring arrays and related new technologies and all associated field testing.   \n- Continue R&D on support system to collect and prioritize station operator requirements to inform required design-build-test activities across the monitoring system.  Focus areas continue to be improvements to radionuclide detector cooling and functionality, filtration medium and sample head, and electronic controls.\n- Continue U.S. IMS sensor event signal identification technique research and development of the transportable xenon laboratory (TXL) and associated xenon detection system and prepare for international deployment exercises and demonstrations.  Operations and maintenance performed in advance of the TXL foreign deployment will establish an operations baseline for this xenon monitoring capability and provide unique opportunities to diagnose and resolve remaining operational and technical concerns and issues, including investigating the “memory effect” recently encountered in these systems as a result of the unintended radio-xenon releases from the Fukushima reactors.  Also planned is a continuation of infrasound event clutter and false alarm reduction, and noise mitigation analyses.  \n- Continue to drive improvements in radionuclide detection and measurement, including xenon gas collection\/analysis systems research.  Evaluate detection limits, and yields.  The PTS technical requirements dictate that the US radionuclide laboratory (RL-16) gas system requires additional capability to meet required detection thresholds.  Develop test methods to increase xenon gas yields, improve detection efficiencies, and decrease dead volume.  To ensure RL-16 is making a high precision measurement, analysis samples will be peer reviewed and calibrated at certified laboratories.\n- Continue to develop a robust, high-precision method to calibrate nuclear detectors and calibration methods to obtain the absolute calibration of the system’s nuclear detector."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.887"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.887"
                                            },
                                            "Text": {
                                                "val": "- Continue to operate and maintain the 36 US IMS stations. \n- Complete PTS certification of US IMS IS monitoring station on Wake Island and AS monitoring station on Shemya Island AK.\n- Continue to improve US IMS operations efficiency, capabilities, and quality of monitoring data, and decrease false alarms. \n- Continue support of OSD treaty management objectives. \n- Continue participating in International Comprehensive Test Ban Office Provisional Technical Secretariat (PTS) sponsored technology development exchanges and field exercises. \n- Continue R&D to inform required design-build-test activities across the monitoring system.    \n- Continue IMS prototype sensor and station calibration capabilities development.\n- Continue development of monitoring station in-situ calibration and performance monitoring capabilities.\n- Continue performing experiments or field demonstrations to evaluate monitoring system performance. \n- Continue to enhance baseline radionuclide particulate and noble gas detection capabilities, efficiency and reliability.  \n- Continue development and calibration of infrasound and seismic propagation models. \n- Continue field experiments to collect data required to calibrate and constrain and validate IMS relevant propagation models.  \n- Continue US IMS sensor event signal identification technique research and development of the transportable xenon laboratory."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "23\/0602718BR"
                                    },
                                    "Title": {
                                        "val": "WMD Defeat Technologies"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "41.343"
                                        },
                                        "CurrentYear": {
                                            "val": "36.102"
                                        },
                                        "BudgetYearOne": {
                                            "val": "35.061"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "35.061"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "35.548"
                                        },
                                        "BudgetYearThree": {
                                            "val": "36.522"
                                        },
                                        "BudgetYearFour": {
                                            "val": "37.382"
                                        },
                                        "BudgetYearFive": {
                                            "val": "38.223"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "30\/0603160BR"
                                    },
                                    "Title": {
                                        "val": "Proliferation Prevention and Defeat"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "69.331"
                                        },
                                        "CurrentYear": {
                                            "val": "74.556"
                                        },
                                        "BudgetYearOne": {
                                            "val": "66.707"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "66.707"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "68.770"
                                        },
                                        "BudgetYearThree": {
                                            "val": "70.727"
                                        },
                                        "BudgetYearFour": {
                                            "val": "71.058"
                                        },
                                        "BudgetYearFive": {
                                            "val": "72.959"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Government and industrial performers are assessed and selected based upon a \"best fit for task\" criteria.  DoD Service Laboratories and DoE National Laboratories are common government awardees."
                        },
                        "PerformanceMetrics": {
                            "val": "Operate, maintain, and sustain the PTS certified waveform and radionuclide CTBT monitoring stations in accordance with the CTBT verification monitoring performance requirements and the CTBT Radionuclide and Waveform Operations Manuals.  Meet the associated CTBT IMS data availability\/timeliness performance specifications\/requirements–98% for IMS waveform and 95% for IMS radionuclide systems."
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Nuclear Arms Control Technology (NACT)"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Waveform and radionuclide monitoring capability enhancements"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "System reliability and availability enhancements"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "System operations and efficiency improvements"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Site installation and certification at Wake Island"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Site installation and certification at Shemya"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "RL"
                    },
                    "ProjectTitle": {
                        "val": "Nuclear & Radiological Effects"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "13.576"
                        },
                        "PriorYear": {
                            "val": "5.173"
                        },
                        "CurrentYear": {
                            "val": "5.995"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project supports the National Strategy for Countering Biological Threat priority\/focus areas 3) Capability Expansion and 4) Leveraging Science.  Under Project RL, the Net-Centric Architecture program integrates legacy capabilities and facilitates data sharing through a net-centric framework. It provides near-real time collaborative analysis capabilities between Department of Defense (DoD) and key interagency and international partners through a globally accessible net-centric framework known as the Integrated Weapons of Mass Destruction Toolset (IWMDT).  The IWMDT migrates Defense Threat Reduction Agency (DTRA) chemical, biological, radiological, nuclear, and high explosive (CBRNE) modeling and simulation codes to provide an integrated suite of Countering WMD decision support capabilities. The framework is the only operational CBRNE framework in the world which provides capabilities through web applications, net-centric web services, and stand-alone mobile deployments which are validated and accredited for operational use by International, National, State, and local authorities.  \n\nThe Net-Centric Architecture program includes three functional areas: 1) IWMDT, 2) IWMDT Codes, and 3) Software Assurance, Certification, and Accreditation.  The IWMDT functional area develops the architecture, defines and implements the standards to consolidate validated DTRA tools, and through this architecture, enables rapid access for planning, emergency response, and assessment capabilities.  These capabilities are used by a wide range of planners, managers, and operational and technical personnel facing the full spectrum of CBRNE threats.  The IWMDT Codes functional area develops analysis and simulation codes, and then integrates the codes into the IWMDT architecture. These activities are unique to this effort across the DoD. They directly support analysis capabilities in the Office of the Secretary of Defense (OSD) Studies and Analysis Group, and Cost Assessment and Program Evaluation (OSD CAPE), US Pacific Command and United States Forces Korea (USFK) offices, Republic of Korea (ROK) Ministry of Defense, Ministry of Defense Taiwan, as well as providing unique simulation capabilities to the Air Force Distributed Mission Operation Center.  The Software Assurance, Certification and Accreditation functional area supports all aspects of DTRA software development and fielding.  This sub-project extends research and development to system development and demonstration. \n\nThe increase from FY 2013 to FY 2014 is due to increased investment for fielding of IWMDT in FY 2014.  The decrease in FY 2015 is due to the completion of IWMDT investments based on Agency priorities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RL: Nuclear & Radiological Effects"
                                    },
                                    "Description": {
                                        "val": "Project RL-Nuclear & Radiological Effects develops and provides a real-time globally accessible net-centric framework which migrates the DTRA CBRNE modeling and simulation codes to provide an integrated suite of Combating WMD decision support capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.173"
                                            },
                                            "Text": {
                                                "val": "- Leveraged the 4th Quarter FY 2011 and FY 2012 successes across U.S. Strategic Command (USSTRATCOM), the UK and Supreme Headquarters Allied Powers Europe (SHAPE), enabling IWMDT to become the single integrated assessment CBRNE capability for nuclear targeting across, STRATCOM, UK, SHAPE (Nuclear Operations) and the U.S. Army Nuclear and Combating WMD Agency (USANCA).\n- Deployed IWMDT Version 3.3."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.995"
                                            },
                                            "Text": {
                                                "val": "- Install IWMDT version 3.4 (server based) at USFK for collaboration between US forces and the ROK forces.\n- Field IWMDT version 3.4 to USSTRATCOM, United Kingdom, SHAPE, OSD, U.S. Army Nuclear and Combating WMD Agency (USANCA), and DTRA Reachback.\n- Broad deployment of IWMDT version 3.4 to Department of Homeland Security."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "23\/0602718BR"
                                    },
                                    "Title": {
                                        "val": "WMD Defeat Technologies"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "25.395"
                                        },
                                        "CurrentYear": {
                                            "val": "31.398"
                                        },
                                        "BudgetYearOne": {
                                            "val": "32.352"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "32.352"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "33.322"
                                        },
                                        "BudgetYearThree": {
                                            "val": "34.250"
                                        },
                                        "BudgetYearFour": {
                                            "val": "34.555"
                                        },
                                        "BudgetYearFive": {
                                            "val": "35.104"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The program for IWMDT is executed through a competed Cost Plus Fixed-Fee contract.  This contract is a 3-year effort for software development, test, and integration.  Follow-on contracts will be competed for award to continue any out-year activities."
                        },
                        "PerformanceMetrics": {
                            "val": "Demonstrate and provide over 80% of the customer-required CBRNE modeling and simulation capabilities over networks, e.g. Department of Defense Global Information Grid.  Integrate mission-required legacy DTRA CBRNE codes into a net-centric architecture through a process-controlled Verification, Validation, and Accreditation standards-based method necessary to promote the National Strategy for Countering Biological Threats."
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Integrated Weapons of Mass Destruction Toolset (IWMDT)"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "IWMDT - System Development, Test, and Integration - Version 3.3"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2013"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2013"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "IWMDT - System Development, Test, and Integration - Version 3.4"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2013"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}