{
    "id": "5f7f4161e1a297c8d338643287950ea464d0bd01",
    "meta": {
        "filename": "dod-2015_RDTE_2015_NAVY_BA5_RDTE_JustificationBook_Navy_PB_2015.zzz_unzipped_RDTE_JustificationBook_Navy_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605013N"
        },
        "ProgramElementTitle": {
            "val": "Information Technology Development"
        },
        "R1LineNumber": {
            "val": "138"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "121.540"
            },
            "PriorYear": {
                "val": "64.238"
            },
            "CurrentYear": {
                "val": "47.807"
            },
            "BudgetYearOne": {
                "val": "66.317"
            },
            "BudgetYearOneBase": {
                "val": "66.317"
            },
            "BudgetYearTwo": {
                "val": "107.947"
            },
            "BudgetYearThree": {
                "val": "70.195"
            },
            "BudgetYearFour": {
                "val": "68.268"
            },
            "BudgetYearFive": {
                "val": "39.708"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "2901 DONAA IT - The Modernization Initiative includes multiple projects with RDT&E requirements:  Multiple Threat Alert Center (MTAC), Data Modernization & Analytical Tools, Knowledge Network (K-Net), Consolidated Law Enforcement Operations Center (CLEOC), and Data Modernization of the Secretariat Automated Resources Management Information System (SARMIS).  RDTEN funding will optimize DONAA's capability to make necessary improvements to various Secretariat systems.  This modernization will ensure compliance with continued financial emerging requirements.  Enhancement of financial auditability will be in compliance with DOD security system requirements.\n\n2901 BSO 39 - NAVAL JUSTICE INFORMATION SYSTEM (NJIS):  This system provides single authoritative case management information technology capability that provides end-to-end visibility into the Department of Navy (DON) criminal activity case load while reducing cost and increasing efficiency by replacing legacy systems.  Funding is required for contractor support to develop, integrate, test, train, deploy, and implement this system.\n\nMultiple Threat Alert Center (MTAC):  The Post-Cole Secretary of the Navy Anti-terrorism\/Force Protection Task Force identified the need for NCIS to enhance the Multiple Threat Alert Center (MTAC).  The MTAC provides key anti-terrorism\/force protection products in response to Fleet tasking and is critical to Fleet protection during current Overseas Contingency Operations (OCO).  This project provides funding for the development of an IT system to track the movement of NCIS special agents deployed in advance of DoN in-transit units.  The ability to track and communicate with these agents is necessary in order to forward threat data to those forward deployed agents and to task them to respond to emerging threats.  Funding is required for equipment and contractor support to modify COTS software.\n\nData Modernization & Analytical Tools:  NCIS data collection, filtering, and analysis infrastructure is unable to handle the increased flow of terrorism investigative and threat reporting of the Post 9\/11 era.  NCIS must revitalize its infrastructure and its data and investigation management capabilities to effectively counter current terrorist threats.  The three main components of this portfolio investment are data modernization, knowledge management, and investigation management.\n\nKnowledge Network (K-Net):  K-Net is a Data Modernization & analytical tool being developed and soon deployed that greatly enhances NCIS's technological arsenal.  K-Net implements an integrated NCIS approach for identifying, capturing, evaluating, retrieving, and sharing all of NCIS's knowledge and expertise.  To that end, K-Net is a knowledge management system that improves NCIS's ability to search, analyze, fuse, and distribute both national intelligence and law enforcement information.  The envisioned end state for K-Net is a secure, intuitive, web environment that is the one stop shop where applications, data, and tools are easily accessible to all of NCIS users to effectively and securely fulfill their mission regardless of when and where they operate.\n\nConsolidated Law Enforcement Operations Center (CLEOC):  The Naval Criminal Investigative Service (NCIS) enhancement of CLEOC will enable meeting Law Enforcement (LE) reporting requirements, satisfy Congressional mandates for the Defense Incident-Based Reporting System (DIBRS) and improve functionality across the Naval criminal justice community.\n\nEnterprise Procurement System (EPS):  EPS will replace the Standard Procurement System (SPS).  Program Executive Office\/Enterprise Information Systems (PEO\/EIS) will act as the Program Manager.  EPS will be modular, web based and built in a Service Oriented Architecture.\n\nDepartment of the Navy Criminal Justice Information System (DONCJIS):  The Naval Criminal Investigative Service (NCIS) is the Executive Agent (EA) for the Department of the Navy Criminal Justice Information System (DONCJIS).  This system provides a cradle to grave criminal justice and law enforcement information system.  The system enables multiple communities within the DON to share criminal justice and law enforcement information.  Funding is required for contractor support to develop, test, train, deploy and implement this application.\n\n2903 NAVAIR IT - CMIS:  The Configuration Management Information System (CMIS) Program is DoD's standard software system for complete and integrated configuration management (CM) of weapon systems from acquisition to disposal.  CMIS efficiently manages all product structure data, including complex interrelationship between assemblies and subassemblies, technical documentation and the parts that comprise the item.  CMIS is designed to manage and control configuration data to support the DoD business processes.  Accurate, complete and accessible configuration data is critical to the successful operations of DoD weapon systems or tracked assets.  Mission readiness and operational capabilities are enhanced by CMIS, as instant consistent integrated configuration data is readily available to operators, maintainers and logistics personnel.  This system is a CM tool available DoD wide to support all potential customers.  CMIS provides users with a common database infrastructure to ensure compatibility, quality, and consistency of CM processes and provides configuration managers and analysts the validated CM information necessary for accurate maintenance, spare procurements, reliability and safety analysis, and mission readiness.  Funding is budgeted to support the services of rehosting and testing of COTS upgrades to ensure objective performance of CMIS is achieved.\n\n2904 NAVSEA IT - This program includes the funding for Information Technology (IT) support at NAVSEA, managed by the NAVSEA 04 Program Management Office (PMO-IT) for the support and sustainment of maritime shore maintenance and includes multiple modernization efforts to insure effectiveness of Fleet maintenance systems as part of the current Navy Maritime Maintenance Enterprise Solution (NMMES).  These efforts include retirement and\/or replacement of costly legacy systems, transition planning and systems engineering for integration with national and enterprise interim and future solutions.  These efforts align with direction to insure that proposed interim solutions support a planned, single maintenance solution end state, as well as direction to align with data center consolidation plans proposed across the FYDP.  It includes the modernization of Naval Shipyard and Regional Maintenance Centers' Maintenance, Repair and Overhaul (MRO) production tools.  This includes modifications\/enhancements to Shipyard IT systems, such as Advanced Industrial Management (AIM); Project Scheduling and Sequencing (PSS); Workload and Performance Systems; the COST and MAT systems, and other solutions such as the Electronic Technical Working Document (eTWD) Initiative.  The goal of PMO-IT is to provide modernization, migration and consolidation of obsolete legacy systems to the next generation of centrally hosted tools supporting Fleet Maintenance and national systems for the Navy.\n\n\n2905 BUPERS IT - The Navy has developed a new strategy on the modernization of integrated personnel and pay systems.  This transfer realigns the funds to the responsible organization required to execute the strategy approved by the DON Executive Advisory Board (EAB) in July, 2011.  This strategy includes Business Process Re-engineering (BPR) defined requirements, modernization\/risk reduction of current personnel\/pay systems centered around the Navy's Standard Integrated Personnel System (NSIPS), and development of a future pay engine.  All of these efforts are aligned with the Navy's Integrated Personnel and Pay Strategy (IPPS-N) CONOPS (Concept of Operations)\n\n3167 Joint Technical Data Integration (JTDI) Program - Funding supports the evaluation, testing and integration to develop a JTDI Commercial-Off-The-Shelf (COTS) solution for installation on a Carrier (CV) and Amphibious Assault (L) class ships and up to 104 Navy\/Marine Corp aviation activities.  JTDI is a digital technical data access, delivery and local O&I level library management toolset and telemaintenance collaboration process enabler.  It improves accuracy and timeliness of technical manual and other technical data delivery and minimizes the Fleet's library management burden.  JTDI reduces maintenance work hours with saving Return on Investment (ROI) of 2.5:1.  It facilitates the transition of the Joint Distance Support and Response (JDSR) Advanced Concept Technology Demonstration (ACTD) for telemaintenance and provides for process efficiencies to support ongoing Aviation Fleet Technical Representative reductions.  Marine Aviation Logistics Support Program II (MALSP II) Expeditionary Pack up Kit (EPUK):  Funding supports the evaluation, development, testing and integration of software and hardware solutions for expeditionary requisitioning and supply chain management across all US Marine Corp Aviation activities.  Marine Aviation Logistics is changing to MALSP II to meet current and future operational requirements - in support of the NAE Strategic Plan, Marine Corps Vision & Strategy 2025, and the USMC Long War Concept.  MALSP II will allow aviation logisticians to decrease total infrastructure and resource inventories forward by moving the preponderance of the Maintenance and Supply workload to the CONUS Parent MALS, and reducing the total forward Aviation Logistics footprint (personnel, equipment, facilities and spares).  EPUK, as part of Marine Aviation Logistics Enterprise IT (MAL-EIT) system, is an automated wireless hardware \/ software solution that is a key enabler in integrating US Marine Corp Aviation Combat Element (ACE) and Logistics Combat Element (LCE) logistics systems to make the Marine Air Ground Task Force (MAGTF) more responsive, agile, flexible and lethal with the ability to support and sustain operations in austere expeditionary environments and across the Range of Military Operations (ROMO).\n\n3185 Joint Air Logistic Information System (JALIS) - A critical element of the DoD CONUS and OCONUS Air Logistics assets.  JALIS is an operational scheduling, aircraft management, and data analysis system that allows DoD organizations to submit airlift requirements for passengers and cargo; air logistics flying units to communicate their aircraft availability in a real time graphic display; and designated scheduling organizations to compare airlift requirements to available aircraft and create mission assignments.\n\n9406 Maintenance Data Warehouse\/NAVAIR DECKPLATE - The development of the Decision Knowledge Programming for Logistics Analysis and Technical Evaluation (DECKPLATE) program is the next generation data warehouse for aircraft maintenance, flight and usage data.  It provides a web-based interface to a single source of information currently being stored in multiple Naval Aviation Logistics Data Analysis (NALDA) systems.  Through the use of analysis, query and reporting tools the user has the capabilities to effectively obtain readiness data in a near real-time environment, as well as historical data for trend analysis and records reconstruction.  DECKPLATE supports the mission of the warfighter who requires a single source of near real-time aviation data in which to base critical readiness decisions.  This requires collecting data from authoritative sources into a data warehouse.  Because the warfighter only needs to access one database, the time consuming task of collecting various pieces of data form various sources will be reduced and ultimately eliminated.  This improves data quality because it reduces the possibility of two systems providing identical data elements, but slightly different data.  Data availability is improved through continuous near real-time feeds from the data sources, giving the warfighter the most current information to base decisions.  In addition, this also accomplishes a reduction in legacy systems mandated by OPNAV.  JUSTIFICATION FOR BUDGET ACTIVITY: This program is funded under SYSTEM DEVELOPMENT AND DEMONSTRATION because it includes those projects that have passed Milestone B approval and are conducting engineering and manufacturing development tasks aimed at meeting validated requirement prior to full-rate production decision."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "72.209"
                },
                "CurrentYear": {
                    "val": "69.659"
                },
                "BudgetYearOne": {
                    "val": "56.049"
                },
                "BudgetYearOneBase": {
                    "val": "56.049"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "64.238"
                },
                "CurrentYear": {
                    "val": "47.807"
                },
                "BudgetYearOne": {
                    "val": "66.317"
                },
                "BudgetYearOneBase": {
                    "val": "66.317"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-7.971"
                },
                "CurrentYear": {
                    "val": "-21.852"
                },
                "BudgetYearOne": {
                    "val": "10.268"
                },
                "BudgetYearOneBase": {
                    "val": "10.268"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.016"
                    }
                },
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-21.836"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.774"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "27.450"
                                },
                                "BudgetYearOneBase": {
                                    "val": "27.450"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-17.182"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-17.182"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-6.197"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Not applicable.\n\nSchedule Changes: 3167, Joint Technical Data Integration: \nDue to Information Assurance (IA) requirements, Release Titles for JTDI have been changed on the R-4 and R-4a.\n\nSchedule Changes:  3167, Marine Aviation Logistics Support Program II (MALSP II) Expeditionary Pack up Kit (EPUK):\nDue to delay in obtaining Internal Review Board Certification, acquisition schedule and milestones have changed.  Titles on the R-4 and R-4a have also changed due to DCA Policy Letter Revision A to MALSP II IOC Requirement dated 10 April 2012 stating title should be MAL-EIT.\n\nSchedule Changes:  PU 9406, Maintenance Data Warehouse:\nDue to Maintenance Data Warehouse\/NAVAIR Decision Knowledge Programming for Logistics Analysis and Technical Evaluation (DECKPLATE) being a new start in FY12 and CRA lasting until January 2012, the contract award has been moved from first quarter to second quarter on the R-4 and R-4a."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "2901."
                    },
                    "ProjectTitle": {
                        "val": "AAUSN IT"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "6.800"
                        },
                        "PriorYear": {
                            "val": "9.457"
                        },
                        "CurrentYear": {
                            "val": "9.993"
                        },
                        "BudgetYearOne": {
                            "val": "11.147"
                        },
                        "BudgetYearOneBase": {
                            "val": "11.147"
                        },
                        "BudgetYearTwo": {
                            "val": "33.370"
                        },
                        "BudgetYearThree": {
                            "val": "28.990"
                        },
                        "BudgetYearFour": {
                            "val": "27.211"
                        },
                        "BudgetYearFive": {
                            "val": "1.234"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "DATA MODERNIZATION & ANALYTICAL TOOLS:  The Secretariat Automated Resources Management Information System (SARMIS) is a financial tool used by the Secretariat to formulate, execute, and report changes to organizational resources.  DON\/AA employs this system to support financial and resource decisions for the entire Secretariat. The system mirrors the capabilities of PBIS, however at a more detailed UIC level. SARMIS produces budget materials, analysis that supports the Secretariat's POM, as well as to generate allocation data. In addition, SARMIS contains organizational manpower data that assists our leaders in making necessary personnel decisions for the Secretariat. Most recently, updates were requested to this module of SARMIS in order to assist with tracking of Financial Management personnel across the DON.     \nThis RDTEN funding will optimize DON\/AA's capability to make necessary modernization to various Secretariat systems in order to ensure compliance with FIAR and other financial emerging requirements of a clean financial statement. This  modernization will provide transparency and enhance the level of financial auditability in the system.  RDTEN funding is required to support all Secretariat systems technology upgrades and DOD security system requirements.\nNAVAL JUSTICE INFORMATION SYSTEM (NJIS): The system provides enterprise and process-wide visibility into the DON's unclassified criminal incident and case data throughout the lifecycle of the case, while reducing costs and increasing efficiency by replacing legacy systems. NJIS will serve as a single, authoritative data source and repository, allowing for information sharing across the entire DON criminal justice communities.\nThe system will also comply with statutory requirements that mandate that the DON populate the Department of Defense's (DoD) crime database - the Defense Incident-Based Reporting System (DIBRS). It is DoD policy that DoD Components comply with the crime reporting requirements of the Uniform Federal Crime Reporting Act of 1988 (28 U.S.C. 534 note); for victim and witness assistance notifications of the Victim's Rights and Restitution Act of 1990 (42 U.S.C. 10601 et seq.); and the Brady Handgun Violence Prevention Act (18 U.S.C. 922 note).\n\nFunding is required for contractor support to configuration, integration, testing, training, deployment, and implementation of the system.\n\nDON TRACKER:  Department of the Navy Tasking, Records and Consolidated Knowledge Enterprise Repository (DON TRACKER, formerly known as Enterprise Records and Task Management (ERTM)) is a single, auditable, compliant Records and Task Management process, implemented uniformly across all DON Divisions and Commands, and administered by DON\/AA, to enable efficient and effective execution of Records Management (RM) and Task Management (TM) policy in compliance with statute.  Funds will provide program management, development, integration, testing, training, change management, deployment and implementation of the system throughout the Department of Navy.\n\nELECTRONIC PROCUREMENT SYSTEM (EPS):  Provide DoN Solution for Electronic Contract Writing replacing the existing Standard Procurement System (SPS) and DoN Integrated Contracting Environment (DICE) capabilities and deficiencies.  EPS aligns Contract Writing System (CWS) with Financial Management Office\/Financial Improvement Project (FMO\/FIP) goals for auditability.  IT supports strategic sourcing and seamless exchange of data in addition to evolving to meet changing requirements.  The improved capabilities will meet emerging data standards Procurement Data Standards\/Procurement Request Data Standards (PDS\/PRDS), in addition to complying with OSD Clause Logic Service.  Program Executive Office Enterprise Information Systems (PEO EIS) is the Mileston Decision Authority (MDA).  EPS meets the intent of the National Defense Authorization Act of 2013 by providing an electronic means to award contracts."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Modernization"
                                    },
                                    "Description": {
                                        "val": "Prototype Phase completed.  The initial development of \"Threat Planner\" (original Modernization portfolio) as well as subsequent spirals of K-Net capabilities, to include centralized database checks on individuals; and MTAC-related production and synthesis capabilities in support of Maritime Domain Awareness."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.110"
                                            },
                                            "Articles": {
                                                "val": "1"
                                            },
                                            "Text": {
                                                "val": "Continue in FY-2012 with the developmental efforts directed at emerging technologies in Data Collection and Knowledge Management with an emphasis on integrating them into the law enforcement and counter intelligence mission area of NCIS."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "1"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Modernization - Secretariat"
                                    },
                                    "Description": {
                                        "val": "The Secretariat has numerous requirements to modernize several systems including financial management, naval records management,  and portal applications.  These systems will be updated from older technologies to include ADA programming language to Java and Oracle Client-Server to web based.  These upgrades are necessary to continue functionality of systems which ensure timely, accurate and efficient operation of the Secretariat's mission."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.855"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Upgraded and supported multiple projects with RDT&E requirements: Consoloidated Law Enforcement Operations Center (CLEOC), Naval Criminal Justice Information System (DONCJIS)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.044"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue with platform and software upgrade within the Navy Secretariat. SARMIS modernization and design"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.147"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.147"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue with moderization of approved system within the Navy Secretariat to include platform and software version updates."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Consolidated Law Enforcement Center (CLEOC)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Naval Justice Information System (NJIS)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.896"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed Materiel Solutions Analysis; conducted Request For Information, Industry Day (including Vendor interviews and COTS demonstrations). Prepared acquisition documentation.  Conducted Decision Point \"A\".  Performed risk reduction efforts that will ready the community environment, decrease the program's future risks, and decrease required funding."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.887"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Release Request for Proposal (RFP), with contract to be awarded in February 2014 for a Commercial off the Shelf (COTS) product NJIS. The design will Include the configuration of the COTS product to include case management and reporting capabilities for all five DON criminal justice community requirements; utilizing the latest technology while incorporating user defined requirements, functionality, and a product that meets the needs of the end user. This will provide end-to-end visibility on all DON incidents and increase efficiency by automating all of the criminal justice communities business processes. In addition, it will ensure all eight Defense Incident Based Reporting System (DIBRS) segments are reported, as required by statute, including the Uniform Crime Reporting Act of 1988, the Victim's Rights and Restitution Act of 1990, the Brady Handgun Act of 1993, and the establishment of a central database on domestic violence mandated by Chapter 47 and Section 1562 of Title 10 U.S.C."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "DON TRACKER"
                                    },
                                    "Description": {
                                        "val": "The Department of the Navy Tasking, Records and Consolidated Knowledge Enterprise Repository (DON TRACKER) will streamline DON's electronic records and task management processes under a consolidated enterprise solution and will enable the DON to capture unstructured and structured electronic records, seamlessly manage tasking across and within all commands, ensure uniform metadata of content, provide workflow-enabled reporting, and aid in compliance with all applicable laws, policies, and regulations.  In addition, this will eliminate duplicative capabilities and result in cost-saving opportunities and efficiencies.  The DON TRACKER solution will be extended to all authorized, shore-based users across the DON enterprise, including the Continental United States (CONUS) and Outside the Continental United States (OCONUS)communities.\n\nPreliminary program plannning conducted.  Anticipate SBIR contract award for inital phases of the program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "A contract will be awarded in April 2014 for a fully developed prototype capability for a Commercial off the Shelf (COTS) product of DON TRACKER.  The design will include a single DON enterprise-wide technology solution to implement the reengineered business processes.  This will support the DON consolidation of multiple RM (Records Management) and TM (Task Management) processes throughout the Department into a single, auditable process implemented uniformly across all DON directorate and commands."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Electronic Procurement System (EPS)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.096"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A --- FY13 RDT&E funding was not certified until November 19, 2013"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.062"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete Analysis of Alternatives (completed on 21 November 2013).  \nConduct ITR\/ASR SETR\nCritical Actions for the EPS Program will include:\n1)  Establish Governance\n2)  Staffing of Program Office\n3)  Milestone A Documentation\n4)  Financial Exchange \/ Interfaces \/ Data Migration preparations, plans, prototype\n5)  Set up infrastructure (development\/testing\/source selection)"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Planned actions for EPS in FY15 include:\n- Milestone B\n- System Engineering Testing Requirements and Events  (SETR) Events\n- Award Commercial Off the Shelf Software (COTS) Solution Contract, vendor provided contract writing system\n- Navy Enterprise Service Bus (NESB) is the interface required between existing financial systems (i.e., Navy ERP) to EPS.  For example, NESB will replace the existing interface between Navy ERP and SPS.  \n- Continue development of NESB interfaces\n- Award COTS Solution Contract"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "MODERNIZATION - Contract will be awarded under a competitive, all source, RFP.  NO ACAT\n\nThe selected contractor must have knowledge of the existing information systems pertinent to the task.  They must also have the corporate experience and a staff of knowledgeable personnel to provide the required services.  The task will be monitored by the Contracting Officer Representative (COR), who reviews technical data submissions, system deliverables, and invoices to ensure acceptable contractor performance and scheduled deliveries.\nNJIS - Contract will be awarded under a small business set aside RFP. NJIS has a requirement for a contractor to provide full life-cycle software configuration services (requirements analysis, project management and planning, design, configuration, testing, documentation, training, implementation, and post-implementation support). The selected contractor must have knowledge of the existing DoD Law Enforcement information systems pertinent to the task. They must also have the corporate experience and a staff of knowledgeable personnel to provide the required services. The task will be monitored by the Contracting Officer Representative (COR), who reviews technical data submissions, system deliverables, and invoices to ensure acceptable contractor performance and scheduled deliveries.\n\nDON TRACKER- Increment II contract will be awarded under an extended SBIR contract, sole source RFP.  DON TRACKER has a requirement to complete the prototype design capability.  The contractor must have knowledge of the current design, its requirements, and conduct capability demonstrations.  The contractor may also be required to provide life-cycle software configuration services (design, configuration, testing, documentation, and training).\n\nEPS - Commercial Off-The-Shelf (COTS) contract (full and open competition), close the capability \/ requirements gap and implement Navy Enterprise Service business for financial interfaces to EPS."
                        },
                        "PerformanceMetrics": {
                            "val": "\"Program cost, schedule and performance are measured using a systematic approach with approved programs and methods.  The results of these measurements are presented to DON\/AA management through a governance review board process on a regular basis to determine program effectiveness and to provide new direction as needed to ensure the efficient use of\nresources.  To monitor and manage the execution of projects in addition to other IT investments, management and governance boards review metrics and key performance indicators that are outlined in various plans.  Some of the plans that expound on the data captured to attribute to performance measures include: Project Management Plan, Risk Mitigation Plan, Communication Plan, Procurement Plan, and a Certification & Accreditation Plan. \nOther specific performance measurements include:\n1. Actual versus planned project scope\n2. Actual versus planned time schedule\n3. Actual versus planned costs\n4. Actual versus planned risks and the mitigation of those risks\nNJIS:  Program cost, schedule and performance will be measured using a systematic approach with approved programs and methods.  The results of these measurements are presented to PEO EIS \/ SPAWAR management through a governance review board process on a regular basis to determine program effectiveness and to provide new direction as needed to ensure the efficient use of resources.  To monitor and manage the execution of projects in addition to other IT investments, management and governance boards review metrics and key performance indicators that are outlined in various plans.  Some of the plans that expound on the data captured to attribute to performance measures include: Project Management Plan, Risk Mitigation Plan, Communication Plan, Procurement Plan, and a Certification & Accreditation Plan.  Other specific performance measurements include:\n1. Actual versus planned project scope\n2. Actual versus planned time schedule\n3. Actual versus planned costs\n4. Actual versus planned risks\n\nDON TRACKER: Funds will provide development of a SBIR proof of concept into a fully realized unified tasking and records management solution across the DON.  Interface testing is required to validate and verify existing and developed interface design specifications and ensure compliance with applicable laws, regulations and policies.  Organizational change management will feature heavily, including the rationalization of multiple (20+) disparate systems and\/or redundant capabilities, and the disposition of multiple records pools.\n\nEPS:  Program cost, schedule and performance metrics will be determined prior to Milestone A and will be a systemic approach following the Defense Business System (DBS) process.  The metrics will be presented and approved by all stakeholders.  Key to success will be the scope of the requirements and how to leverage existing SPS data and processes.  Key measures will include:\n1. Actual versus planned project scope\n2. Actual versus planned time schedule\n3. Actual versus planned costs\n4. Actual versus planned risks\n5. Requirements met by IOC\n6. Legacy system retirement cost avoidance"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2903"
                    },
                    "ProjectTitle": {
                        "val": "NAVAIR IT"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.712"
                        },
                        "PriorYear": {
                            "val": "0.643"
                        },
                        "CurrentYear": {
                            "val": "0.523"
                        },
                        "BudgetYearOne": {
                            "val": "0.699"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.699"
                        },
                        "BudgetYearTwo": {
                            "val": "0.704"
                        },
                        "BudgetYearThree": {
                            "val": "0.624"
                        },
                        "BudgetYearFour": {
                            "val": "0.627"
                        },
                        "BudgetYearFive": {
                            "val": "0.604"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Configuration Management Information System (CMIS) Program is DoD's standard software system for complete and integrated Configuration Management (CM) of weapon systems from acquisition to disposal.  CMIS efficiently manages all product structure data, including complex interrelationship between assemblies and subassemblies, technical documentation and the parts that comprise the item.  CMIS is designed to manage and control configuration data to support the DoD business processes.  Accurate, complete and accessible configuration data is critical to the successful operations of DoD weapon systems or tracked assets.  Mission readiness and operational capabilities are enhanced by CMIS, as instant consistent integrated configuration data is readily available to operators, maintainers and logistics personnel.  This system is a CM tool available DoD wide to support all potential customers.  CMIS provides users with a common database infrastructure to ensure compatibility, quality, and consistency of CM processes and provides configuration managers and analysts the validated CM information necessary for accurate maintenance, spare procurements, reliability and safety analysis, and mission readiness.  Funding is budgeted to support the services of rehosting and testing of Commercial off-the-shelf (COTS) upgrades to ensure objective performance of CMIS is achieved."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "CMIS Annual Software Release"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.643"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Re-baseline CMIS Software to upgrade to latest version of Oracle, incorporate development efforts associated with COTS obsolescence and evolve an open standard interface to other systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.523"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Re-baseline CMIS Software to upgrade to latest version of Oracle, incorporate development efforts associated with COTS obsolescence and evolve an open standard interface to other systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.699"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.699"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Re-baseline CMIS Software to upgrade to latest version of Oracle, incorporate development efforts associated with COTS obsolescence and evolve an open standard interface to other systems."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Configuration Management Information System (CMIS) Program used Joint Logistics Systems Center (JLSC) funds to evolve CMIS to Software Release 5.0.  In June 1998 CMIS was transferred to the Navy as executive agent and NAVAIR as program manager.  Program Budget Decision 401 transferred joint funding from JLSC to NAVAIR to continue evolving CMIS.  The CMIS Program Manager continues to evolve the program to keep pace with cost, Military Standards, and evolving commercial standards.  Various contractors using competitively awarded contracts have supported the program.  Currently, Intergraph Corporation is the CMIS integration contractor selected through a GSA contract."
                        },
                        "PerformanceMetrics": {
                            "val": "CMIS - Milestone C Spiral Development:  \n1.  During the life of the contract verify conformance with agency specific information processing standards and functional requirements. Prior to delivery of enhanced software, demonstrate the operational capability of the system software. Functionality of the software must meet required systems architecture and processing capabilities. All requirements mandated by law or regulation must be 100% compliant.  Independent Verification and Validation will be used for testing new releases of software to determine that previous functionality is maintained. Customer satisfaction will be measured through limited validated customer complaints, feedback, and surveys."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0605013N_2903_FILE1.PNG"
                                }
                            }
                        ]
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2904"
                    },
                    "ProjectTitle": {
                        "val": "NAVSEA IT"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "84.464"
                        },
                        "PriorYear": {
                            "val": "16.016"
                        },
                        "CurrentYear": {
                            "val": "11.711"
                        },
                        "BudgetYearOne": {
                            "val": "23.173"
                        },
                        "BudgetYearOneBase": {
                            "val": "23.173"
                        },
                        "BudgetYearTwo": {
                            "val": "31.383"
                        },
                        "BudgetYearThree": {
                            "val": "16.647"
                        },
                        "BudgetYearFour": {
                            "val": "16.967"
                        },
                        "BudgetYearFive": {
                            "val": "17.361"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This program includes the funding for Information Technology (IT) support at NAVSEA, managed by the NAVSEA 04 Program Management Office (PMO-IT) for the support and sustainment of maritime shore maintenance and includes multiple modernization efforts to insure effectiveness of Fleet maintenance systems as part of the current Navy Maritime Maintenance Enterprise Solution (NMMES).  These efforts include retirement and\/or replacement of costly legacy systems, transition planning and systems engineering for integration with national and enterprise interim and future solutions.  These efforts align with direction to insure that proposed interim solutions support a planned, single maintenance solution end state, as well as direction to align with data center consolidation plans proposed across the FYDP.  It includes the modernization of Naval Shipyard and Regional Maintenance Centers' Maintenance, Repair and Overhaul (MRO) production tools.  This includes modifications\/enhancements to Shipyard IT systems, such as Advanced Industrial Management (AIM); Project Scheduling and Sequencing (PSS); Workload and Performance Systems; the COST and MAT systems, and other solutions such as the Electronic Technical Working Document (eTWD) Initiative.  This program also includes funding for the advanced planning and execution of the technical refreshes of the current solution which is at end of life.  Advanced planning includes capabilities studies to examine COTS applications to replace current GOTS technology. The goal of PMO-IT is to provide modernization, migration and consolidation of obsolete legacy systems to the next generation of centrally hosted tools supporting Fleet Maintenance and national systems for the Navy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "NAVSEA IT"
                                    },
                                    "Description": {
                                        "val": "This program includes the funding for Ship Maintenance Information Technology modernization at NAVSEA, managed by the NAVSEA 04 Program Management Office (PMO-IT) for the support of maritime shore maintenance and includes multiple modernization efforts to insure effectiveness of Fleet maintenance systems.  It includes the modernization of Naval Shipyard and Regional Maintenance Center (RMC) maintenance, repair and overhaul (MRO) production tools.  This effort will allow Navy to realign functionality, consolidate systems and applications, and re-platform operations to facilitate a centrally hosted, net-centric maintenance solution suite."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.016"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Released the solicitation for the Electronic Technical Working Document (eTWD) contract and began advanced planning for the Naval Shipyards."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.711"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Award eTWD contract and perform acceptance testing and continue deployment planning."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "23.173"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "23.173"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Project completed and rolled out to all Navy shipyards.  Establish program office and continue advanced planning for MSMS technical refresh."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Navy information technology (IT) products have been supported by a variety of activities over time and have been developed, deployed and maintained using numerous toolsets and techniques.  This non-centralized approach to development has made integration difficult and as a result, has reduced the functional benefits and cost savings that could be realized from common system standards; common processes; shared resources and infrastructure.  Furthermore, the lack of standard development methodology and toolsets has increased the corporate sustainment support costs of these automated solutions.  Consolidation of the management of these resources under the leadership of NAVSEA 04 PMO-IT at a corporate level has hastened IT system consolidation and supports efforts to further reduce information technology costs.  Two key efficiencies from consolidation will be improved system performance at less cost, and consistent, standardized processes across the maritime shore maintenance community.  NAVSEA 04 has established the Program Management Office for Information Technology (PMO-IT) to oversee IT development and sustainment efforts, and to acquire and manage IT resources to gain further efficiencies in the systems supporting the ship maintenance processes."
                        },
                        "PerformanceMetrics": {
                            "val": "FY13 - Continue development of electronic Technical Working Document (eTWD) project.  Reduction in data centers in support of the Data Center Consolidation (DCC) initiative.\nFY14 - Plan the deployment of the eTWD solution.\nFY15 - Deployment of eTWD completed at Naval Shipyards."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0605013N_2904_FILE1.PNG"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0605013N_2904_FILE2.PNG"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0605013N_2904_FILE3.PNG"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0605013N_2904_FILE4.PNG"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0605013N_2904_FILE5.PNG"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0605013N_2904_FILE6.PNG"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0605013N_2904_FILE7.PNG"
                                }
                            }
                        ]
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2905."
                    },
                    "ProjectTitle": {
                        "val": "BUPERS IT"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "12.215"
                        },
                        "PriorYear": {
                            "val": "28.111"
                        },
                        "CurrentYear": {
                            "val": "16.285"
                        },
                        "BudgetYearOne": {
                            "val": "14.690"
                        },
                        "BudgetYearOneBase": {
                            "val": "14.690"
                        },
                        "BudgetYearTwo": {
                            "val": "20.667"
                        },
                        "BudgetYearThree": {
                            "val": "9.244"
                        },
                        "BudgetYearFour": {
                            "val": "11.618"
                        },
                        "BudgetYearFive": {
                            "val": "9.224"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "BILLET BASE DISTRIBUTION (BBD): Mission Description: Due to the changing needs of the Navy, transformation of the requisition generation and assignment processes is necessary. Current requisition generation and distribution processes utilize an inventory-based system that does not fully reflect the actual needs of Navy commands or accurately identify the Sailor's currently assigned position. This methodology hinders the ability to accurately measure or ensure personnel readiness, leaving gaps in skills-to-position requirements. Commands, Immediate Superior in Chain, Type Commanders, Major Manpower Claimant, United States Fleet Forces, Manning Control Authorities, and Distribution and Placement personnel currently lack the capabilities necessary to align and sustain sailors in discrete positions. Furthermore, a command's manning cannot be analyzed and the actual knowledge, skills and capabilities critical to a command's mission execution cannot be determined. The objective of BBD is to replace the current inventory-based requisition generation process with automated functionality, which is requirements driven, inventory-balanced, and position-based. This methodology will increase personnel readiness, improve fit, and provide clear visibility to the impact on mission readiness at the billet level. BBD will facilitate maximizing the contributions of every member of the Navy workforce by delivering competency-based career paths. FY15 efforts will complete functional testing and deployment of Phase IB which includes continuous alignment of people to position functionality deployed with Phase IA in FY13, creation of a position based requisition, Inventory Projection, Requisition Priority, Alignment Sustainment Functions, and Global Force Management Data Initiative (GFM DI) spaces to faces requirement. FY16 efforts will include performing systems engineering reviews, software design and development of BBD Phase IC which will provide Command user\nInteractive capability with regard to alignment and sustainment of people to position.\n\nINTEGRATED PERSONNEL AND PAY SYSTEMS - NAVY (IPPS-N): In accordance with DCMO ADM Dated 22 October 2013 the IPPS-N line RDT&E funding is moved to the NSIPS line in order to better align funding with the system being modernized. Since IPPS-N is a strategy and not a system to be fielded, the IPPS-N will cease to be a separately tracked activity. The integrated personnel and pay strategy is to develop economical and efficient solutions allowing the Navy to respond rapidly to warfighter personnel and pay information needs. \n\nLEARNING MANAGEMENT SYSTEM - DISTANCE LEARNING (LMS-DL):  The effort to modernize LMS-DL was initiated by the Enterprise Training Management Delivery\nSystem (ETMDS):  Phase II of this effort begins in FY14. Phase II (delivery order three) will provide for the following: 1) interface with the Navy's Authoring Instructional Materials (AIM) system and Learning Assessment System (LAS) to provide a more collaborative learning environment, 2) develop enhanced administrator and user features in accordance with sponsor priorities to improve the efficiency of the application, 3) upgrade the application to eliminate dependence on software components that are nearing end of life and improve security features and, 4) provide the ability to deliver content to the learner by creating, de-confliction, prioritizing and scheduling learning event plans, supported by a learning management system and governed by learning event rules.\n\nMY NAVY PORTAL (MNP) Phase 2B:  MNP is a web site providing access to and interaction with relevant information assets (content, applications, business processes), knowledge assets and human assets, to targeted audiences, delivered in a highly personalized manner. MNP seeks to consolidate and eliminate multiple portals and will absorb the need for sailors to use various applications which cross multiple lines of business. It will provide a set of technological services commonly used by sailor facing applications and will eliminate redundancy in the implementation of those services across the enterprise. The MNP investment is designed to reduce the overall DON IT footprint, reduce the number of Navy portals, reduce the investment in technology services by business applications, and improve the quality of service provided to sailors and marines. MNP will be executed in multiple phases.  Beginning with FY14 requirements will be defined and preliminary design work will begin.  FY14 funds most of the development, critical design, testing, and deployment of MNP.  In FY15 the My Navy Portal effort will focus on migrating NKO functionality into the newly designed (Sailor\/HSI friendly )My Navy Portal user interface and restructuring how Customer Relationship Management is undertaken.  Additionally in FY15, applications presently within the BUPERS On Line environment will begin to be integrated into My Navy Portal (selection of those applications will be dependent on Fleet\/User feedback as well as technical considerations).   Following integration with NKO and the start of BoL application integration, planning for future MPTE application integration will commence.  In FY15 the MNP development plan will include beginning a Strategic Communication\/Enterprise Change Management effort to educate the Navy's Total Force about My Navy Portal and begin developing training tools to teach users how to use the new tool.  \n\nTOTAL FORCE MANPOWER MANAGEMENT SYSTEM (TFMMS):  TFMMS is the Navy's authoritative source for manpower management. The current capability to generate the authoritative, enterprise-wide, naval manpower information products, including Activity Manpower Documents (AMD), total force positions, manpower resource controls, and organizational structure is based on an outdated, non-standard, force structure definition with limited access to a mainframe classified environment. TFMMS modernization will establish a modernized web based system that can be accessed via a classified and unclassified environment providing increased access, modernized manpower processes, and improved cyber defense. This implementation will be done in two iterations. Iteration 1 contains Billet Change Request (BCR), and Activity Maintenance functionality. The requirements phase will be completed in FY14, and the design phase will begin. Development, testing, and deployment will be done in FY15. Iteration 2 contains the remaining functionality including End Strength Management, Position Authorizations, Extended Workflow, Level of Aggregation (LOA) Management, Reports, and Interfaces. Iteration 2 will be designed and developed  in FY15. Testing and deployment will occur in FY16.\n\nPERSONALIZED RECRUITING FOR IMMEDIATE AND DELAYED ENLISTMENT MODERNIZATION II (PRIDE Mod II):  PRIDE Mod II will consolidate the officer and enlisted active and reserve processes into one solution allowing NRC to streamline its recruiting force and create multifunction field recruiters who can coordinate officer as well as enlisted Kit processing.  This project is for a post-delivery product improvement effort to incorporate biometric signature capability, to further reduce paper-based processing of kits, and to implement deferred requirements.\n\n\nNAVY STANDARD INTEGRATED PERSONNEL SYSTEM (NSIPS):  NSIPS is the Navy's business solution to Human Resources Management for approximately 400,000 Sailors worldwide.  NSIPS provides the Navy with a web-based, field-entry, electronic pay and personnel support system and analytical repository for all active duty and reserve Sailors.  Available worldwide, both ashore and shipboard, the system collects, validates, processes, and transfers data necessary to ensure accurate and timely pay and maintenance of personnel records.  NSIPS is pivotal in the processes of mobilization and demobilization.  \nThe NSIPS and integration of legacy system capability into NSIPS, including Reserve Headquarters System (RHS), Navy Enlisted System (NES), (Officer Personnel Information System (OPINS), Inactive Manpower Management Information System (IMAPMIS), Navy Personnel Database (NPDB), and Defense Manpower Data Center (DMDC).\nIn addition to this transactional portion, there is a NSIPS Analytics Environment (AE) to facilitate data queries of NSIPS data by users and other systems.  The NSIPS AE supports functionality to query data on an ad hoc basis.  The NSIPS AE contains numerous interfaces to personnel data sources including Change Data Capture (CDC) from a transactional database.  Reporting from NSIPS AE is done through various methods including flat file transfers and web services.  Within the NSIPS Analytics Environment there is a single database that contains multiple schemas that are logically and physically separated from the operating functions of the transactional environment.  These schemas support an Ad-Hoc inquiry capability for NSIPS transactional data, and web services.\nNSIPS major systems currently include: \n\tNSIPS Transactional - Navy field level Personnel transaction system\n\tNSIPS Reporting\/Business Intelligence - reporting and ad hoc query tool\n\tWeb Afloat - shipboard NSIPS component\n\tWeb Adhoc - business intelligence analysis\n\tCareer Information Management System (CIMS) - used for career counseling\n\tNavy Retention Monitoring (NRMS) - reports retention statistics\n\tPermanent Change of Station Obligation and Expenditure Management System (POEMS) - used to manage costs associated with Permanent Change of Station (PCS)\n\tAlternate Final Multiple Score (AFMS) - used to determine eligibility to E-7 selection board for SO and SB ratings\n\tHealth Professionals Incentive Program (HPIP) - manages the development of medical personnel\n- Deliver capability to the field (PERSMOD R&S)\n-NSIPS Modernization Activities;\n-- Initiate Reserve Headquarters System (RHS) legacy migration to NSIPS; modernize RHS capabilities in accordance with\nFunctional Requirements Document (FRD)\n-- Finalize analysis (interfaces, data, and reports) between Officer Personnel Information System (OPINS) and NSIPS.\nThis effort will analyze the data structures and functionality of OPINS and the DoD OSD driven Data mapping effort and\nenterprise alignment. The goal of this effort is better reports management and increased interoperability between corporate Navy Human Resources systems and OSD systems within the lab environment.\nInitiate Reserve Headquarters System (RHS) legacy migration to NSIPS; modernize RHS capabilities in accordance with\nFunctional requirements document (FRD)\nRHS - Will be modernized by migrating RHS legacy functionality into NSIPS. The funding for the RHS migration and modernization will be reflected in the NSIPS line.\n\n\nANALYSIS OF ALTERNATIVE\/ECONOMIC ANALYSIS (AOA):  ANALYSIS OF ALTERNATIVE\/ECONOMIC ANALYSIS (AOA): As part of the IPPS-N strategy, the Navy plans to conduct multiple AoAs to analyze viable alternatives in order to determine the most efficient and effective solution to address the modernization of elements of the Navy's Manpower, Personnel, Training and Education (MPTE) IT portfolio.\nFY14 funds the commencement of Pay processes across all pay and personnel systems.\nFY15 funds the commencement of personnel accountability processes across all pay and personnel systems.\n\nRISK MANAGEMENT INITIATIVE (RMI):  The Risk Management Initiative (RMI) program is a consolidation of DON risk management requirements into a single Program of Record (POR).  Instead of modifying multiple legacy safety systems, a COTS product is being procured; process improvements leveraged from the Navy's investment in current risk management and safety systems will be implemented in RMI with a modular approach based on BPR of defined requirements.  RMI capability consists of four distinct safety capabilities:  Streamlined Incident Reporting (SIR), Single Point of Entry (SPOE), Safety Program Management (SPM), and Analysis & Dissemination (A&D).  Each of these capabilities will be acquired as individual Abbreviated Acquisition Programs.\nThe goal of this effort is to use an evolutionary, incremental approach to implement reengineered business processes, and consolidate five legacy stovepipe systems [Web-Enabled Safety System (WESS), Enterprise Safety Application Management Systems (ESAMS), Portsmouth Occupational Accident and Illness Reporting System (POAIRS), Medical Mishap and Compensation (MMAC)] into a complementary and supportable RMI capability.  RMI will provide modern Safety capabilities for the military (both active and reserve) component of the Navy Total Force, enabling agile responses to business rule changes, automation of routine actions, improve data integrity, and facilitate self-service for organizations and individuals.  RMI development and modernization is a key part of the Navy's plan to address outdated Safety systems, capability gaps and Logistic Information Technology (IT) portfolio rationalization.  To achieve this vision, RMI will be procured as a \"commercial item\" under FAR Part 12.  SIR configuration\/customization will be accomplished under individual task orders under a 5 year (in duration) IDIQ umbrella.  \nThe first two capabilities to be acquired in FY14 are SIR and SPOE.  Critical Design Review and Application Test Readiness Review will be performed in FY15 for SIR and Single POE.  FY15 also funds the SPM and A&D system requirements and preliminary design reviews.\nFunding associated with Personnel TEMPO (PERSTEMPO) is being aligned to PE 060513N 2905 beginning in FY15.  This aligns the funds with the organization required to execute PERSTEMPO strategy as directed by the CNO to the CNP.  Two components are rolled together, modifying the ITEMPO system and further developing the Navy Deployment Health Location process.  This strategy consists of Business Process Re-engineering (BPR) defined requirements (artifact is a Functional Requirements Document-FRD), modernization\/risk reduction of existing system (ITEMPO) and a process that uses our corporate systems at DMDC Mechanicsburg.  The existing systems do not fully comply with statutory and regulatory directives.  Some specific problem areas are:\n- Ineffective tracking of PERSTEMPO.\n- Inefficient and inaccurate data to legacy pay systems (important when the DOD-wide waiver is lifted).\n- Rigid and non-responsive systems that lack the ability to statutory and regulatory changes to entitlements.\n- Lack of capabilities that allow operational commanders to track and make informed decisions about personnel entering,\n  within, or departing their area of operations.\n- Lack of financial audit capability.\n\nThe desired affects of PERSTEMPO strategy are:\n- Generate efficiencies throughout the Fleet to meet statutory requirements and improve Fleet readiness.\n- Provide improved service to Sailors (improving retention).\n- Facilitate informed management decision making.\n\nAssociated sub-projects:\n\nIndividual TEMPO (ITEMPO): PERSTEMPO was implemented to comply with Sections 586 and 923 of the FY00 NDAA, now within 10 USCS 991.  This is a non-acquisition category program.  Each military service is to track and manage the number of deployed days and number of temporary duty days away from homeport for active and reserve personnel.  Information is reported to DoD\/DMDC, which is used to report to the Secretary of Defense.  ITEMPO is the system used to comply with these directives.  PERSTEMPO supports Navy management of stress on the force as requested by the CNO; Commander, U.S. Fleet Forces Command (N1); and the Commander, U.S. Pacific Fleet (N1).  Enhancements will be performed on the primitive ITEMPO functional tools\/metrics to make it actionable, current in technology, user friendly, and integrated into a variety of personnel and pay systems.  Preparations are already underway to complete the FRD and perform a gap analysis within existing resources.  This will support pay auditability\/certainty when payment is authorized.  \n\nDEPLOYMENT HEALTH LOCATION:  Deployment Health Location is being implemented per DoD Instruction 6490.03, \"Deployment Health,\" (DoD Instruction) August 11, 2006.  This requires the Military Departments to plan, program, and implement a system to ensure daily location recording for all deployed personnel assigned, attached on temporary duty, or temporary additional duty to deployed units.  The Services are required to report the daily location information electronically to DMDC at least weekly.  Also, this will correct the finding by DoD Inspector General Report NO. DODIG 2012-112 of Jul 18, 2012.  The Army, Air Force, and Marine Corps reported the daily location of deployed Service members; however, the Navy did not report the required deployment information.\n\nCapability change for ITEMPO:  The system has had no significant software change in more than 8 years.  The report mechanisms are extremely antiquated.  User real-time reports are non-existent.  ITEMPO is not only a Legislative requirement, but is the right thing to do for our Sailors.  It is impossible for OPNAV or BUPERS ITEMPO managers to know the ITEMPO deployment schedule of every unit or individual in the Navy; the responsibility and requirement to report ITEMPO for Sailors must appropriately rest with the Commanding Officer.  It is vital that every CO be personally involved to ensure that ITEMPO information is submitted in an accurate and timely manner.\n\nCapability change Deployment Health Location:  Deployed Service members are potentially subject to occupational and environmental hazards that can include exposure to harmful levels of environmental contaminants, such as industrial toxic chemicals, chemical and biological warfare agents, or radiological and nuclear contaminants.  These hazards may include contamination from the past use of a site, battle damage, stored stockpiles, military use of hazardous materials, or from other sources.  Harmful levels include high-level exposures that result in immediate health effects and low-level exposures that could result in delayed or long-term health effects.  Collecting deployment information will allow the Military Health System to identify populations at risk for occupational and environmental exposures that may need medical follow-up.  Improving timeliness of treatment will have a positive effect on readiness and long-term wounded warrior care."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Billet Based Distribution (BBD)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.600"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Perform system engineering reviews and complete software development of BBD Phase IB."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.583"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.583"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete detailed requirements analysis on BBD Phase 1C. Complete functional testing and deploy BBD Phase IB."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Integrated  Personnel and Pay Systems - Navy  (IPPS-N)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "23.611"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "IPPS-N: PERSMOD ID\/IQ contract vehicle created supporting the initiation of PERSMOD R&S task order to modernize retirements and separations capabilities within NSIPS.  Continued detailed analysis of interfaces, data structure mapping, and reports between Reserve Headquarters System (RHS) and Navy Standard Integrated personnel System (NSIPS). This effort was the second phase of analysis of the legacy systems functionality to the proposed OSD driven data structure mapping efforts and enterprise alignment.\n- Initiated phase one analysis (interfaces, data, and reports) between Officer Personnel Information System (OPINS) and NSIPS. This effort analyzed the data structures and functionality of OPINS and the DoD OSD driven Data mapping effort and enterprise alignment. The goal of this effort is better reports management and increased interoperability between corporate Navy Human Resources systems and OSD systems within the lab environment.\n- Conducted software testing activities on the lab activities in support of developing test scripts and plans with the expectation of providing this information to the Navy Systems Engineering Technical Review (SETR) process. Testing teams will be composed of support contractors and Government subject matter experts (SME) from multiple commands.\n- Initiated modeling and simulation efforts to effectively forecast software requirements and technical specification in the Statement of Work development effort.\n- Initiated development of Navy required SETR documentation, such as Alternative Software Review artifacts, Preliminary Design Review artifacts, Initial Technical Review artifacts, Technical Readiness Review artifacts, and Critical Design Review artifacts.\n-  PERSMOD proposals received.  Completed source selection 1st review.  RHS legacy decomposition initiated.  PAY capability rquirements first draft functional requirements document."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-In accordance with DCMO ADM Dated 22 October 2013 the IPPS-N line RDT&E POM funding is moved to the NSIPS line in order to better align funding with the system being modernized. Since IPPS-N is a strategy and not a system to fielded the IPPS-N will cease to be a separately tracked activity."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Learning Management System - Distance Learning (LMS-DL)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "LMS-DL Phase II will perform a Systems Requirement Review and three incremental software releases. LMS-DL Phase II will provide a Critical Design Review, an incremental software release and a final Production release."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "My Navy Portal (MNP)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.500"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed the RFP development and continued the validation of the functional requirements of the portal."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.100"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Plans are to further refine the integration roadmap and migration patterns associated with applications identified in Phase 2A effort as well as refining requirements and starting the design review."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.100"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.100"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Begin Phase 2B development, complete Design Review, and acceptance testing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Total  Force Manpower Management System (TFMMS)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.300"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop System Subsystem Specification (SSS), System Requirements Specification (SRS) and supporting architecture documentation.  Additionally, application design will begin and development phase will begin."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.977"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.977"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Application design will be completed, development of iteration 1 will be deployed, development of iteration 2 will begin.  Iteration 2 will be deployed in early 2016."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Personalized Recruiting for Immediate and Delayed Enlistment Modernization II (PRIDE Mod II)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.370"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.370"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Critical Design Review complete.  Development complete and testing underway.  Deliver PRIDE Mod II baseline delivery and begin product improvement effort.  Complete Systems Requirement Review (SRR), System Functional Review (SFR), and Production Deployment Review (PDR) by end of FY15."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Analysis of Alternative Economic Analysis (AOA EA)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct studies and Analysis of Alternative (AoA) of material solutions for emerging business IT requirements. Initiate the AoA for Pay capability processes."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.538"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.538"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct studies and Analysis of Alternative (AoA) of material solutions for emerging business IT requirements.  Initiate the AoA for personnel accountability processes."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Navy Standard Integrated Personnel System (NSIPS)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.501"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-  Award PERMOD Retirement and Separation (R&S) contract, initiate NSIPS R&S capability development\n-  Support PAY capability requirements development process\n-  Support RHS requirements development process\n-  Initiate Reserve Headquarters System (RHS) legacy migration to NSIPS"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.400"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.400"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- NSIPS - Finalize analysis (interfaces, data, and reports) between Officer Personnel Information System (OPINS) and NSIPS. This effort will analyze the data structures and functionality of OPINS and the DoD OSD driven Data mapping effort and enterprise alignment. The goal of this effort is better reports management and increased interoperability between corporate Navy Human Resources systems and OSD systems within the lab environment.\n Initiate Reserve Headquarters System (RHS) legacy migration to NSIPS, modernize RHS capabilities in accordance with Functional requirements document (FRD)"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Risk Management Initiative (RMI)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.284"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Award contract.  Perform Streamline Incident Reporting (SIR) and and Single Point of Entry (SPOE) system requirements review and preliminary design review."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.790"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.790"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Perform Safety Program Management (SPM) and Analysis & Dissemination (A&D) system requirements and preliminary design review.  Perform Streamline Incident Reporting (SIR) and Single Point of Entry (POE) Critical Design Review and application test readiness review."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Personnel TEMPO (PERSTEMPO)"
                                    },
                                    "Description": {
                                        "val": "The PERSTEMPO program consists of two components: Modifying the ITEMPO system and further developing the Navy Deployment Health Location process.  This strategy consists of Business Process Re-engineering (BPR) defined requirements, modernization\/risk reduction of existing system (ITEMPO) and a process that uses our corporate systems at DMDC Mechanicsburg.\n\nITEMPO: PERSTEMPO was implemented to comply with Sections 586 and 923 of the FY00 NDAA, now within 10 USCS 991.  This is a non-acquisition category program.  Each military service is to track and manage the number of deployed days and number of temporary duty days away from homeport for active and reserve personnel.  This information is reported to DoD\/DMDC, which is used to report to the Secretary of Defense.  ITEMPO is the system used to comply with these directives.  PERSTEMPO supports Navy management of stress on the force as requested by the CNO; Commander, U.S. Fleet Forces Command (N1); and the Commander, U.S. Pacific Fleet (N1).  Enhancements will be performed on the primitive ITEMPO functional tools\/metrics to make it actionable, current in technology, user friendly, and integrated into a variety of personnel and pay systems.  Preparations are already underway to complete the FRD and perform a gap analysis within existing resources.  This will support pay auditability\/certainty when payment is authorized.\n\nDEPLOYMENT HEALTH LOCATION: Deployment Health Location is being implemented per DoD Instruction 6490.03, \"Deployment Health,\" (DoD Instruction) August 11, 2006.  This requires the Military Departments to plan, program, and implement a system to ensure daily location recording for all deployed personnel assigned, attached, on temporary duty, or temporary additional duty to deployed units.  The Services are required to report the daily location information electronically to DMDC at least on a weekly basis.  Also, this will correct the finding by DoD Inspector General Report NO. DODIG 2012-112 of Jul 18, 2012.  The Army, Air Force, and Marine Corps reported the daily location of deployed Service members, however, the Navy did not report the required deployment information."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.932"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.932"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Start PERSTEMPO design. \n- Complete PERSTEMPO design reviews. \n- Start building the modifications on the ITEMPO and Deployment Health Location development sub-projects, based on\n  approved FRDs.  \n- Complete advanced updates and enhancements (likely) to ITEMPO, allowing to transition the system to make it \n  actionable, current in technology, user friendly, and integrated into a variety of personnel and pay systems."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "BBD Phase I:  Acquisition will be through contract technical services.  The required services will be procured through a performance-based service acquisition using Cost Plus Fixed Fee (CPFF) 8a contract. Acquisition will be primarily through SPAWAR HQ. An incremental development approach will be used.\n\nIPPS-N\/NSIPS:  The current strategy consists of an incremental migration of Human Resources functionality aligned with the capability areas mapped to the DoD Hire to Retire End to End Lifecycle to the Navy Standard Integrated Personnel System (NSIPS). The first capability for NSIPS will be retirements and separations personnel functions. This strategy will also support the development of an Authoritative Data warehouse providing governance, validation and continuity of the data transfer between NSIPS and the data environment.  \n\nLMS-DL:  Acquisition will be through an IDIQ contract for technical services.  New delivery order is expected to fulfill these requirements.  Of the three contract delivery orders required, the first one is completed, the second acquisition phase or delivery order was issued in FY12 and the third and final delivery order will be issued in FY14.\n\nMNP: The second phase (2B) and all subsequent phases of MNP execution will be accomplished via a cost plus fixed fee contractual approach using RDTE funds. Individual contract orders will be issued for the engineering and systems design and development associated with each MNP phase. FY15 RDTE funds will be specifically used for executing  the third phase (2C) of MNP design and development.\n\nTFMMS: Task orders will be awarded using the Aliant MAC contract.\n\nPRIDE MOD:  Task order will be awarded using existing SPAWAR contract and will be competitively awarded.\n\nRMI:  Award a single vendor Indefinite Delivery \/ Indefinite Quantity (IDIQ) The approach for RMI is an incremental COTS configuration model that provides usable increments of capability within 24 month cycles after funds certification for each.  The RDTE beginning in FY14 will be used for development of the Streamlined Incident Reporting and Single Point of Entry capability increments through separate task orders.  Safety Program Management and Analysis & Dissemination will be initiated with FY15 RDTE.\n(U) PERSTEMPO:  Expect to use existing systems and build applications in those environments.  Specifically for ITEMPO related costing, system resources are already existing within other system budget lines, and the OMN structure has been increased from FY2016 through the FYDP to sustain these changes.  For Deployment Health Location, best system will be  determined to host these attributes once the FRD is completed.  For software development, the existing contract vehicles will be used, managing the work through separate sub contract line items (SLINs).  Existing test resources will be used for testing software modifications."
                        },
                        "PerformanceMetrics": {
                            "val": "BBD:  Meet program system engineering and technical review milestones for development of BBD Phase IB and IC with no outstanding severity 1-3 defects for production release.\n\nIPPS-N\/NSIPS:\n1.  Demonstrate the feasibility of at least one technical architecture approach for IPPS-N.\n2.  A 20% reduction in the number of redundant transactional systems for personnel and pay.\n3.  A 15% reduction in system interfaces.\n4.  Documented plan and preliminary design for the consolidation of legacy personnel systems.\n\nLMS-DL:  Meet program, systems engineering, and technical review milestones for ETMDS for delivery orders two and three. Provide a capability that will allow Naval Education and Training Command to virtually present at least 10% of the scheduled training that is now presented in person.\n\nMNP:  Meet major systems engineering and technical review milestones. Begin integrating\/connecting NKO and BOL systems and functions into MNP as the presentation layer.\n\nTFMMS:  Performance objectives and thresholds will be established during the requirements phase.\n\nPRIDE MOD:  Performance objectives and thresholds will be established during the requirements phase.\n\nRMI:  Meet major systems engineering and technical review milestones.\n(U) 2905 PERSTEMPO:  Meet program system engineering and technical review milestones for development with no outstanding severity 1-3 defects for production release."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0605013N_2905_DOT_S22_FILE1.PNG"
                                }
                            }
                        ]
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3167"
                    },
                    "ProjectTitle": {
                        "val": "Joint Technical Data Integration (JTDI)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "11.955"
                        },
                        "PriorYear": {
                            "val": "7.424"
                        },
                        "CurrentYear": {
                            "val": "1.964"
                        },
                        "BudgetYearOne": {
                            "val": "2.848"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.848"
                        },
                        "BudgetYearTwo": {
                            "val": "6.602"
                        },
                        "BudgetYearThree": {
                            "val": "5.366"
                        },
                        "BudgetYearFour": {
                            "val": "4.312"
                        },
                        "BudgetYearFive": {
                            "val": "4.004"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "JTDI Program  -  Funding supports the evaluation, testing and integration to develop a JTDI Commercial Off-The-Shelf (COTS) solution for installation on Carrier and Amphibious Assault class ships and up to 104 Navy\/Marine Corp aviation activities.  JTDI is a digital technical data access, delivery and local Organizational & Intermediate level library management toolset and telemaintenance collaboration process enabler.  It improves accuracy and timeliness of technical manual and other technical data delivery and minimizes the Fleet's library management burden.  JTDI reduces maintenance work hours with a savings Return on Investment of 2.5:1.  It facilitates the transition of the Joint Distance Support and Response Advanced Concept Technology Demonstration for telemaintenance and provides for process efficiencies to support ongoing Aviation Fleet Technical Representative reductions.\n\nMarine Aviation Logistics Support Program II (MALSP II) Expeditionary Pack up Kit (EPUK):  Funding supports the evaluation, development, testing and integration of software and hardware solutions across all US Marine Corps Aviation activities to be used in the planning and execution of geographically distributed, expeditionary Aviation Logistics (AVLOG) chains in support of deployed USMC Air Combat Element operations.  The Marine Aviation Logistics Enterprise Information Technology (MAL-EIT) Program is one of four programs contained within the Marine Aviation Logistics Support Program (MALSP) modernization program known as MALSP II.  Legacy MALSP is nearly 25 years old and grossly inadequate in IT capability to meet the informational, planning, and C2 needs of a dynamic, geographically distributed nodal AVLOG system.  MAL-EIT is an Abbreviated Acquisition Program that will develop and deliver the required IT capability necessary to eliminate the IT related gaps existing in the legacy MALSP.  MAL-EIT is a family of IT solutions to be developed and delivered in three increments.  These increments are depicted below:\n\nIncrement 1. EPUK: Provides Expeditionary Supply Operations to include business administration, inventory, and customer service operations.\n\nIncrement 2. Next Generation Buffer Management System: Provides buffer management in a time domain, and buffer sizing analysis.\n\nIncrement 3. Logistics Planning Tool and Optimizer Tool: Provides capability to develop tailored Remote Expeditionary Support Packages, consumption forecasts, and Nodal Logistics Lay down designs."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "JTDI"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.897"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct development efforts associated with a major release of fully deployed COTS intensive JTDI system.  Conduct COTS requirements definition, evaluation, integration, and testing of annual baseline releases.  Conduct technology insertion of the JTDI system.  The increase in JTDI FY 13 core RDTE is required to replace critical web based services for Naval Aviation Weapon System Websites and critical technology replacement to maintain equipment readiness across multiple services."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.640"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct development efforts associated with a major release of fully deployed COTS intensive JTDI system.  Conduct COTS requirements definition, evaluation, integration, and testing of annual baseline releases.  Conduct technology insertion of the JTDI system."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.694"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.694"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct development efforts associated with a major release of fully deployed COTS intensive JTDI system.  Conduct COTS requirements definition, evaluation, integration, and testing of annual baseline releases.  Conduct technology insertion of the JTDI system."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MALSP II EPUK"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.527"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Procure, deliver and begin deployment of EPUK suites to USMC forces within the PACOM AOR.  Conduct test and evaluation of hardware requirements and network connectivity via satellite communication prior to deployment to the fleet based on a yearly release\/maintenance cycle. Conduct analysis of alternatives for MAL-EIT Increments 2 and 3 to determine possible COTS, GOTS and\/or developmental solutions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.324"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue procurement, delivery and deployment of EPUK suites to USMC forces.  Complete analysis of alternatives for MAL-EIT Increments 2 and 3 to determine possible COTS, GOTS and\/or developmental solutions. Award contract for increments 2 and 3 COTS\/GOTS and\/or developmental solutions.  Begin software development of Next Generation Buffer Management System.  Hire and fund labor resources for MAL-EIT program management billet vacancies and IPT SME support.  Conduct test and evaluation of hardware requirements and network connectivity via satellite communication prior to deployment to the fleet based on a yearly release\/maintenance cycle."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.154"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.154"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete procurement, delivery and deployment of EPUK suites to USMC forces.  Conduct evaluation, integration, and testing of planned software capabilities for increments 2 and 3.  Begin delivery and deployment of  NGBMS to USMC forces.  Conduct test and evaluation of hardware requirements and network connectivity via satellite communication prior to deployment to the fleet based on a yearly release\/maintenance cycle."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPN\/4265\/JTDI"
                                    },
                                    "Title": {
                                        "val": "JTDI Other Aviation Support Equipment"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "2.793"
                                        },
                                        "CurrentYear": {
                                            "val": "0.566"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "88.624"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "OPN\/4265\/MALSP II"
                                    },
                                    "Title": {
                                        "val": "Marine Aviation Logistics Support Program (MALSP II) Other Aviation Support Equipment"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.354"
                                        },
                                        "CurrentYear": {
                                            "val": "0.069"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "0.776"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "OPN\/4268\/JTDI"
                                    },
                                    "Title": {
                                        "val": "JTDI Aviation Support Equipment"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "1.193"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1.193"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.868"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.859"
                                        },
                                        "BudgetYearFour": {
                                            "val": "2.425"
                                        },
                                        "BudgetYearFive": {
                                            "val": "2.473"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "OPN\/4268\/MALSP II"
                                    },
                                    "Title": {
                                        "val": "Marine Aviation Logistics Support Program (MALSP II) Aviation Support"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.374"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.374"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.215"
                                        },
                                        "BudgetYearThree": {
                                            "val": "2.113"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.228"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.234"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "JTDI Program  -  The management approach includes the Program Management Office residing in NAVAIR with Milestone Decision Authority (MDA) delegated to the NAVAIR Command Information Officer (CIO).  The evolutionary development approach will be used to execute requirements.  Contracting for the prime integrator will be via competitively awarded Indefinite Delivery - Indefinite Quantity (IDIQ) contracts.\n\nMALSP II Expeditionary Pack up Kit (EPUK) Program - The management approach includes the Program Management Office residing in the NAVAIR with MDA delegated to the NAVAIR CIO.  The evolutionary development approach will be used to execute requirements.  Contracting for the prime integrator will be via competitively awarded IDIQ contracts."
                        },
                        "PerformanceMetrics": {
                            "val": "JTDI and MALSP II EPUK Program - Successfully achieve government testing of annual software release."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0605013N_3167_FILE1.PNG"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0605013N_3167_FILE2.PNG"
                                }
                            }
                        ]
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3185"
                    },
                    "ProjectTitle": {
                        "val": "Joint Airlift Information System (JALIS)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.409"
                        },
                        "PriorYear": {
                            "val": "0.364"
                        },
                        "CurrentYear": {
                            "val": "0.282"
                        },
                        "BudgetYearOne": {
                            "val": "0.337"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.337"
                        },
                        "BudgetYearTwo": {
                            "val": "0.343"
                        },
                        "BudgetYearThree": {
                            "val": "0.345"
                        },
                        "BudgetYearFour": {
                            "val": "0.355"
                        },
                        "BudgetYearFive": {
                            "val": "0.363"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Joint Air Logistic Information System (JALIS) is a critical element of the DoD CONUS and OCONUS Air Logistics assets. JALIS is an operational scheduling, aircraft management, and data analysis system that allows DoD Service Personnel to submit airlift requirements for DOD Personnel and cargo; air logistics flying units to communicate their aircraft availability in a real time graphic display; and designated scheduling organizations to compare airlift requirements to available aircraft and create mission assignments. Using a combination of system displays and email updates, JALIS informs applicable users of mission details and modifications. Geographically distributed, JALIS has a user base in excess of 4000 members, and moves thousands of DOD Personnel and tons of cargo annually in support of Navy Unique Fleet Essential Airlift, Army's Operational Support Airlift Agency (OSAA), United States Transportation Command (USTRANSCOM), and United States Marine Corps (USMC).\nCJCS Instruction4520.02D mandates JALIS as the official DOD Airlift scheduling system for Operational Support Airlift (OSA); JALIS meets the requirement for multi-service coordinated Air Logistics scheduling as directed by Chairman, Joint Chiefs of Staff. The Navy is designated as lead agency for sponsoring and funding the JALIS program."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Air Logistic Information System (JALIS)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.364"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed electronic log, designed & developed opportune lift & possible solutions display, graphical maps, and aircraft position map."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.282"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Capture fully burdened costs for each airlift request; implement CJCS requirement for commercial cost comparisons; modify JALIS to accept standardized airport data from the National Geospatial-Intelligence Agency; provide more robust data reporting."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.337"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.337"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Incrementally design and develop new JALIS capabilities from prioritized requirements within the Common Movement Management System (CMMS) approved Functional Requirements Document dtd May 2010, and generate new capabilities approved by the JALIS Configuration Control Board."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Contract activities will focus on developing the following capabilities:\n1. Provide executive management more complete and accurate comparisons of commercial versus military costs.\n2. Provide stakeholders with more flexible and robust data querying tools.\n3. Provide scheduling and squadron users more accurate and up-to-date airport data."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics for JALIS include:\n1. Increase the accuracy and completeness of fully-burdened commercial costs by 60%\n2. Reduce time to create and run new reports by 30%\n3. Reduce data administrator time required to update airport data by 80%\n4. Decrease training requirements for Schedulers by 15%"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "9406"
                    },
                    "ProjectTitle": {
                        "val": "Maintenance Data Warehouse"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "4.985"
                        },
                        "PriorYear": {
                            "val": "2.223"
                        },
                        "CurrentYear": {
                            "val": "7.049"
                        },
                        "BudgetYearOne": {
                            "val": "13.423"
                        },
                        "BudgetYearOneBase": {
                            "val": "13.423"
                        },
                        "BudgetYearTwo": {
                            "val": "14.878"
                        },
                        "BudgetYearThree": {
                            "val": "8.979"
                        },
                        "BudgetYearFour": {
                            "val": "7.178"
                        },
                        "BudgetYearFive": {
                            "val": "6.918"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Maintenance Data Warehouse\/NAVAIR Decision Knowledge Programming for Logistics Analysis and Technical Evaluation (DECKPLATE)  -  The development of the DECKPLATE program is the next generation data warehouse for aircraft maintenance, flight, and usage data.  It provides a web-based interface to a single source of information currently being stored in multiple Naval Aviation Logistics Data Analysis systems.  Through the use of analysis, query, and reporting tools the user has the capabilities to effectively obtain readiness data in a near real-time environment, as well as historical data for trend analysis and records reconstruction.  DECKPLATE supports the mission of the warfighter who requires a single source of near real-time aviation data in which to base critical readiness decisions.  This requires collecting data from authoritative sources into a data warehouse.  Because the warfighter only needs to access one database, the time consuming task of collecting various pieces of data from various sources will be reduced and ultimately eliminated.  This improves data quality because it reduces the possibility of two systems providing identical data elements, but slightly different data.  Data availability is improved through continuous near real-time feeds from the data sources,  giving the warfighter the most current information to base decisions.  In addition, this also accomplishes a reduction in legacy systems mandated by Office of the Chief of Naval Operations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Maintenance Data Warehouse\/NAVAIR DECKPLATE"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.223"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue transition of Aircraft Inventory and Readiness Reporting System and Logistics Management Decision Support System functionality into DECKPLATE and begin transition of Auto Log Set (ALS) functionality into DECKPLATE."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.049"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue transition of ALS functionality into DECKPLATE and begin transition of original equipment manufacturer (OEM)\/DEPOT functionality. Increase in funding in FY14 is due to POM 14 issues which increased funding for transition of Condition Based Maintenance (CBM) functionality\/Naval Aviation Logistics Command Management Information System into DECKPLATE. Increase in FY14 funding to facilitate the transition of CBM into DECKPLATE was a POM14 issue.  CBM is a much more complex application and none of the functionality currently exists in DECKPLATE."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.423"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.423"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue transition of ALS functionality into DECKPLATE and continue transition of OEM\/DEPOT functionality. Additionally, an increase in funding in FY15 and FY16 is due to a POM 15 issue which increased funding for support of Integrated Logistics Support Management System which will develop a web-based business intelligence tool (ILSMS v 3.0) to allow all users to access and utilize the same data on a nearly real-time basis thus allowing queries across multiple type\/model\/series to identify systemic issues.  Increase in funding in FY15 and FY16 is also due to a POM 15 issue for Auto Log Set which is an Automated Logistics Environment Deckplate component that provides a central repository for aircraft maintenance information into DECKPLATE."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPN, 4265"
                                    },
                                    "Title": {
                                        "val": "Other Aviation Support Equipment"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.786"
                                        },
                                        "CurrentYear": {
                                            "val": "0.439"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "6.665"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "OPN, 4268"
                                    },
                                    "Title": {
                                        "val": "Aviation Support Equipment"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "2.890"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "2.890"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "3.380"
                                        },
                                        "BudgetYearThree": {
                                            "val": "1.966"
                                        },
                                        "BudgetYearFour": {
                                            "val": "2.130"
                                        },
                                        "BudgetYearFive": {
                                            "val": "2.404"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Maintenance Data Warehouse\/NAVAIR Decision Knowledge Programming for Logistics Analysis and Technical Evaluation (DECKPLATE) - Development services will be awarded using a competitively awarded contract under the Seaport Contract System containing a matrix of tasks and required levels of performance.  Follow on Contract will utilize the same competitive system.  The Services provided under the contract support acquisition will not encompass tasks inherently Governmental in nature.  The Statement of Work will include a matrix that establishes the minimum acceptable performance standards."
                        },
                        "PerformanceMetrics": {
                            "val": "Maintenance Data Warehouse\/NAVAIR DECKPLATE \n1. Metric - During the life of the contract verify conformance with agency specific information processing standards and functional requirements. Prior to delivery of enhanced software, demonstrate the operational capability of the system software. Standard - Functionality of the software to meet required systems architecture and processing capabilities. Max Deviation Allowed - All requirements mandated by law or regulation must be 100% compliant.  Quality Assurance -  Independent Verification and Validation (IV&V) for testing new releases of software to determine that previous functionality is maintained. Customer satisfaction as measured through limited validated customer complaints, feedback, and surveys.  \n2. Metric - Interfaces must maintain compatibility among system components in the operational environment. Standard - Service Levels for software: Throughput in terms of processing response time, number of transactions processed per second; volume of data processed over time. Compatibility with particular hardware and software within the existing processing environment. Functionality of software to meet required systems architecture and processing capabilities.  Max Deviation Allowed - None. Quality Assurance - Customer satisfaction as measured through limited validated customer complaints, feedback and surveys. Operational monitoring by use of system statistics and logs. IV&V for testing new software, including verifying results to determine that requirements and specifications are met. \n3. Metric - Documentation for deliverables must match the agency specific system processing and operational procedures.  Standard - Documentation meets agency specific formats for accuracy and completeness.  Max Deviation Allowed - None.  Quality Assurance - IV&V for determining that documentation delivered by the contractor matches the system processing and operational procedures. \n4. Metric - Meet delivery dates\/milestones. Period of Performance will be 12 months from the date of award.  Standard - Delivery dates are met, or exceeded. Max Deviation Allowed - None. Quality Assurance - 100% inspection.\n5. Metric - Security.  Standard - Meet all Government and agency specific requirements. Max Deviation Allowed - None.  Quality Assurance - 100% inspection to ensure that all Government and Agency specific requirements have been met.  Independent verification of security procedures defined by agency (could be performed by a third party, or another agency according to current security regulations and measures). \n6. Metric - Enhancement to software shall not adversely affect system performance.  Standard - Standards affecting system performance include but are not limited to: response time for resolving problems; central processing unit busy; response time; memory utilization; storage utilization.  Max Deviation Allowed - Base line functionality is met at 100%. Non critical functionality is met at 95%. Quality Assurance - Operational monitoring by use of system statistics and logs. \n7. Metric - New releases of software must maintain previously provided functionality, while providing enhanced capabilities, or systems corrections. Standard - Software adds value and improves existing functionality without negatively impacting the existing operational environment. Max Deviation Allowed - Base line functionality is met at 100%. Non critical functionality is met at 95%.  Quality Assurance - Independent Verification and Validation for testing new releases of software to determine that previous functionality is improved. Customer satisfaction is measured through validated customer complaints and surveys."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0605013N_9406_FILE1.PNG"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0605013N_9406_FILE2.PNG"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0605013N_9406_FILE3.PNG"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0605013N_9406_FILE4.PNG"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0605013N_9406_FILE5.PNG"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0605013N_9406_FILE6.PNG"
                                }
                            }
                        ]
                    }
                }
            ]
        }
    }
}