{
    "id": "5f852e59d6f16ce2c2ebb85d2994de1799b32960",
    "meta": {
        "filename": "dod-2015_RDTE_2015_SOCOM_RDTE_JustificationBook_United_States_Special_Operations_Command_PB_2015.zzz_unzipped_RDTE_JustificationBook_United_States_Special_Operations_Command_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "United States Special Operations Command",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0305208BB"
        },
        "ProgramElementTitle": {
            "val": "Distributed Common Ground\/Surface Systems"
        },
        "R1LineNumber": {
            "val": "221"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "United States Special Operations Command"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "13.969"
            },
            "PriorYear": {
                "val": "7.083"
            },
            "CurrentYear": {
                "val": "5.195"
            },
            "BudgetYearOne": {
                "val": "5.286"
            },
            "BudgetYearOneBase": {
                "val": "5.286"
            },
            "BudgetYearTwo": {
                "val": "5.340"
            },
            "BudgetYearThree": {
                "val": "5.449"
            },
            "BudgetYearFour": {
                "val": "5.564"
            },
            "BudgetYearFive": {
                "val": "6.413"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element is part of the Military Intelligence Program (MIP) that provides for the identification, development, and testing of the Distributed Common Ground\/Surface System Special Operations Forces (DCGS-SOF).  The mission tailored infrastructure interconnects the warfighter and sensor data to find and fix enemy combatants and\/or terrorists.  The DCGS-SOF program is a network-enabled, interoperable construct allowing continual, unimpeded sharing of intelligence data, information and services within SOF and between the Services, other national intelligence agencies, combatant commands and Multi-National partners in support of a Joint Task Force.  It connects the SOF warfighter with essential intelligence information and provides situational awareness information to SOF leadership at all echelons.  The primary functions of DCGS-SOF are to conduct processing, exploitation and dissemination (PED) for all SOF Intelligence Surveillance and Reconnaissance (ISR) sensors, permit the collection of SOF data from collection sensors and intelligence databases, share across the DCGS Integration Backbone and provide timely, tailored, all-source, fused intelligence reporting to the SOF warfighter.  This program will employ non-development commercial and government off-the-shelf hardware and software and will leverage from existing technology to the greatest degree possible."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "7.114"
                },
                "CurrentYear": {
                    "val": "5.195"
                },
                "BudgetYearOne": {
                    "val": "5.286"
                },
                "BudgetYearOneBase": {
                    "val": "5.286"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "7.083"
                },
                "CurrentYear": {
                    "val": "5.195"
                },
                "BudgetYearOne": {
                    "val": "5.286"
                },
                "BudgetYearOneBase": {
                    "val": "5.286"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.031"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.621"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "-0.010"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.600"
                    }
                }
            },
            "SummaryExplanation": {
                "val": "Funding: \n\nFY 2013:  Net decrease of $0.031 million is due to sequestration reductions (-$0.621 million), congressional rescissions (-$0.010 million), and congressional add ($0.600 million).\n\nSequestration Impacts: Delayed integration and test of DCGS-SOF new tools, data sources\/stores and services for backend Command, Control, Communications, and Computers, Intelligence, Surveillance and Reconnaissance (C4ISR) PED framework used to support 38.8 Intelligence, Surveillance, and Reconnaissance (ISR) orbits provided by SOF and Services and 24 PED lines provided by SOF.  Specifically, delayed analyst access to and exploitation of 22 SOF enterprise data stores by 6 months.   \n\nFY 2014:  None.\n\nFY 2015: None.\n\nSchedule:  None.\n \nTechnical:  None."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "S400A"
                    },
                    "ProjectTitle": {
                        "val": "Distributed Common Ground\/Surface Systems"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "13.969"
                        },
                        "PriorYear": {
                            "val": "7.083"
                        },
                        "CurrentYear": {
                            "val": "5.195"
                        },
                        "BudgetYearOne": {
                            "val": "5.286"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.286"
                        },
                        "BudgetYearTwo": {
                            "val": "5.340"
                        },
                        "BudgetYearThree": {
                            "val": "5.449"
                        },
                        "BudgetYearFour": {
                            "val": "5.564"
                        },
                        "BudgetYearFive": {
                            "val": "6.413"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This program element is part of the Military intelligence Program (MIP) that provides for the identification, development, and testing of the Distributed Common Ground\/Surface System Special Operations Forces (DCGS-SOF).  The mission tailored infrastructure interconnects the warfighter and sensor data to find and fix enemy combatants and\/or terrorists.  The DCGS-SOF program is a network-enabled, interoperable construct allowing continual, unimpeded sharing of intelligence data, information and services within SOF and between the Services, other national intelligence agencies, combatant commands and Multi-National partners in support of a Joint Task Force.  It connects the SOF warfighter with essential intelligence information and provides situational awareness information to SOF leadership at all echelons.  The primary functions of DCGS-SOF are to conduct processing, exploitation and dissemination (PED) for all SOF Intelligence Surveillance and Reconnaissance (ISR) sensors, permit the collection of SOF data from collection sensors and intelligence databases, share across the DCGS Integration Backbone and provide timely, tailored, all-source, fused intelligence reporting to the SOF warfighter.  This program will employ non-development commercial and government off-the-shelf hardware and software and will leverage from existing technology to the greatest degree possible."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "DCGS-SOF High Definition-Full Motion Video Quality of Service (HD-FMV QoS)"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.600"
                                        },
                                        "Text": {
                                            "val": "Initiated HD-FMV QoS testing and design improvement recommendation efforts for an enterprise-level HD-FMV distribution, storage, and analysis architecture for DCGS-SOF.  Findings will be shared with OUSD(I), National Geo-spatial Intelligence Agency (NGA) and counterpart Service Program Management offices."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "DCGS"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.483"
                                            },
                                            "Text": {
                                                "val": "Integrated emerging technologies and capabilities for all source information fusion and initial development and integration of technology to enable disconnected operations into the DCGS-SOF baseline, commenced test and evaluation of these technologies into this baseline, and conducted DCGS-SOF limited objective events and Enterprise Challenge demonstrations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.195"
                                            },
                                            "Text": {
                                                "val": "Continue to integrate emerging technologies and capabilities for all source information fusion and initial integration of technology to enable disconnected operations into the DCGS-SOF baseline, continue test and evaluation of these technologies into this baseline, and conduct DCGS-SOF limited objective events and Enterprise Challenge demonstrations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.286"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.286"
                                            },
                                            "Text": {
                                                "val": "Continues to integrate emerging technologies and capabilities for all source information fusion and continues integration of technology to enable disconnected operations into the DCGS-SOF baseline, continues test and evaluation of these technologies into this baseline, and conducts DCGS-SOF limited objective events and Enterprise Challenge demonstrations."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "PROC1"
                                    },
                                    "Title": {
                                        "val": "Distributed Common Ground\/Surface System"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "14.704"
                                        },
                                        "CurrentYear": {
                                            "val": "14.906"
                                        },
                                        "BudgetYearOne": {
                                            "val": "17.323"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "17.323"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "11.611"
                                        },
                                        "BudgetYearThree": {
                                            "val": "13.735"
                                        },
                                        "BudgetYearFour": {
                                            "val": "10.781"
                                        },
                                        "BudgetYearFive": {
                                            "val": "10.097"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "•  DCGS-SOF will partner within DoD and with other government agencies to integrate mature technologies into the SOF information enterprise and enable more agile access to and sharing of data and services to meet SOF-peculiar documented requirements.  The technology will allow for seamless integration with DoD, interagency, and coalition ISR tactical PED systems.  The DCGS-SOF program office employs an agile development process with capability insertions into the development baseline for assessment and future deployment into the operational baseline.  All development requirements are prioritized through the DCGS Requirements Working Group (DRWG) chaired by J2.  Once approved the requirements are evaluated and scheduled by engineering.  Using this methodology allows capabilities to be inserted in a fast and agile manner based on user requirements and priorities.  All evolutionary technology insertions (ETIs) in the R-4 schedule are based on current program office projections.  If requirement priorities change based on the DRWG, the ETI and version capabilities identified may change."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Distributed Common Ground\/Surface Systems (DGCS) Integration and Technology Insertions"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "DCGS-SOF Developmental Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SOF PED Enterprise Enhancements"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "DCGS v2.X Operational Test (OT) (User Interface, SOF Data Layer, Data Engine, Brokered Search, Combined Search Widget, Data Soure Integration)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "DCGS v3.X OT (Brokered Search into IC Community, Scheduled Combined Search Widget, Data Source Integration)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "DCGS v4.X OT (Redesigned User Interface, DIB 4.X, Distributed Data Framework, Enterprise Messaging, SIGINT Data Integration, Combat Assessment Disconnect\/Mobile Capability)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "DCGS v5.X OT (Extend enterprise capability to the SSEP, Production Build For Disconnect\/Mobile, Additional Data Sources, Services, Analytical Tools)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "DCGS High Definition-Full Motion Video Quality of Service Testing (Congressional Add)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "DCGS Limited Objective Event & Enterprise Challenge - FY 2013"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "DCGS Limited Objective Event & Enterprise Challenge - FY 2014"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "DCGS Limited Objective Event & Enterprise Challenge - FY 2015"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "DCGS Limited Objective Event & Enterprise Challenge - FY 2016"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "DCGS Limited Objective Events& Enterprise Challenge - FY 2017"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "DCGS Limited Objective Events & Enterprise Challenge - FY 2018"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "DCGS Limited Objective Events & Enterprise Challenge - FY 2019"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}