{
    "id": "5fa0de81fb1c5932870947a8624af09e13e1ad02",
    "meta": {
        "filename": "dod-2015_RDTE_2015_ARMY_BA5A_RDTE_JustificationBook_Army_PB_2015.zzz_unzipped_RDTE_JustificationBook_Army_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604822A"
        },
        "ProgramElementTitle": {
            "val": "General Fund Enterprise Business System (GFEBS)"
        },
        "R1LineNumber": {
            "val": "110"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "24.742"
            },
            "CurrentYear": {
                "val": "0.226"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "24.968"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The General Fund Business Enterprise System (GFEBS) is a Major Automated Information System program and is currently in the sustainment phase. It followed the DoD Business Enterprise Architecture which is aligned to the mandated Federal Enterprise Architecture. GFEBS was implemented to fulfill the needs and comply with the Federal Financial Management Improvement Act, The Chief Financial Officers Act of 1990, the Government Performance and Results Act of 1993, the Government Management Reform Act of 1994, and the Clinger-Cohen Act of 1996 and to fulfill the stated mission of the Assistant Secretary of the Army for Financial Management and Comptroller. GFEBS replaced, in full or in part, financial systems operating in excess of 40 years including the Standard Finance Systems and other costly feeder systems which do not allow the Department of Defense or the U.S. government to achieve an unqualified audit opinion on its financial statements. GFEBS is used to administering the Army's General Fund. GFEBS was developed using a commercial off-the-shelf Enterprise Resource Planning system that is certified by the Chief, Financial Officer Council and provides six core financial functions. GFEBS allows tactical commanders to make informed decisions on a virtually real time system.\n\nOn 1 October 2008, GFEBS deployed to Wave 1 end users at Fort Jackson Garrison, Defense Finance Accounting Service (DFAS) Indianapolis, Indiana and several other organizations. On 1 April 2009, GFEBS deployed to Wave 2 users at Fort Benning, Fort Stewart, DFAS Rome and several other organizations. Wave 3 deployed in October FY10, Wave 4 in January of FY11, Wave 5 in April 2011, Wave 6 in July 2011, Wave 7 in October 2011, Wave 8A in April 2012 and the final Wave 8B in July 2012. GFEBS is fielded to 53,000 trained end users. Each fielded release subsumes the previous release keeping all deployed sites executing under the same GFEBS release. The Full Deployment Decision was received by the Milestone Decision Authority on 24 June 2011 and Full Deployment was Full Deployment was achieved on 1 July 2012.\n\nGFEBS-Sensitive Activities (SA) instance of the General Fund Enterprise Business System (GFEBS). GFEBS is a commercial off-the-shelf Enterprise Resource Planning System certified by the Chief Financial Officers Council. GFEBS has trained and supports over 53,000 end users at 227 installations worldwide and is the Army's solution to the current capability gap in accounting and financial management. Army still has classified and sensitive financial activity remaining in legacy systems that cannot be processed in our new, fully-fielded GFEBS. To protect sensitive information and enable auditability, Army needs a separate instance of GFEBS operated on a secure network for processing sensitive and classified financial transactions. GFEBS-SA will be implemented in two functional releases to 3,000 users across 100 locations worldwide. GFEBS-SA will integrate seamlessly with GFEBS to provide secure, web-based financial execution and reporting capabilities to the Army's classified and sensitive activities. SA is envisioned as a fully functional GFEBS application operated on a secure network, including additional performance requirements designed to enhance security. SA is essential to comply with the Chief Financial Officers Act and the Federal Financial Management Improvement Act; includes the additional security controls; shall be delivered NLT 3QFY16 with all capability and required cross domain interfaces. SA will be accessible on SIPRnet domain, contain Secret Collateral level information, and below. SA will utilize a cross-domain solution to exchange summary level financial transaction data to GFEBS and other required systems, enabling total general ledger accountability in one system. In accordance with 2010 NDAA, GFEBS-SA willl support the legal requirements to achieve full audit readiness of all DOD finanical statement by 2017. Without the SA increment, GFEBS will be unable to achieve an unqualified audit opinion or achieve audit readiness. GFEBS and GFEBS-SA will provide Army's decision makers with relevant, reliable, and timely information for decision making. RDTE funds are required to execute the System Integrator contract to develop and test the SA solution.Sensitive Activities provides a classified version of the GFEBS program.  \n\nSensitive Activities allows processing of data in a secure environment to protect and manage classified data without causing risk to our national security."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "9.963"
                },
                "CurrentYear": {
                    "val": "17.342"
                },
                "BudgetYearOne": {
                    "val": "0.072"
                },
                "BudgetYearOneBase": {
                    "val": "0.072"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "24.742"
                },
                "CurrentYear": {
                    "val": "0.226"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "14.779"
                },
                "CurrentYear": {
                    "val": "-17.116"
                },
                "BudgetYearOne": {
                    "val": "-0.072"
                },
                "BudgetYearOneBase": {
                    "val": "-0.072"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments 1"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "14.779"
                                },
                                "CurrentYear": {
                                    "val": "-17.116"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.072"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.072"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "DV6"
                    },
                    "ProjectTitle": {
                        "val": "General Fund Enterprise Business System"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "24.742"
                        },
                        "CurrentYear": {
                            "val": "0.226"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "24.968"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Project DV6 is General Fund Enterprise Business System - Sensitive Activities."
                        },
                        "ProjectMissionDescription": {
                            "val": "Plan, develop, and manage GFEBS-SA as a separate instance from GFEBS base program to support evolutionary delivery of capabilities. SA is envisioned as a fully functional GFEBS application operated on a secure network (SIPRNET), including additional performance requirements designed to enhance security. SA is essential to comply with the Chief Financial Officers (CFO) Act and the Federal Financial Management Improvement Act (FFMIA). Fully integrated (across domains) secure GFEBS-SA capability with all required cross domain interfaces shall be delivered no later than 1QFY16."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Product Development"
                                    },
                                    "Description": {
                                        "val": "Funding is for the following activities:"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "24.742"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Award of a System Integrator contractor to develop and test functional, technical and configuration designs for a secure solution of GFEBS."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.226"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Execution of systems Integrator contractor to develop and test functional, technical and configuration designs for secure solution of GFEBS."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPA"
                                    },
                                    "Title": {
                                        "val": "GFEBS Sensative Activites (OPA SSN B55511)"
                                    },
                                    "Funding": {
                                        "BudgetYearOne": {
                                            "val": "13.728"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "13.728"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Plan, develop, and manage GFEBS-SA as a separate instance from GFEBS base program to support evolutionary delivery of capabilities.  SA is envisioned as a fully functional GFEBS application operated on a secure network (SIPRNET), including additional performance requirements designed to enhance security.  SA is essential to comply with the Chief Financial Officers (CFO) Act and the Federal Financial Management Improvement Act (FFMIA). Fully integrated (across domains) secure GFEBS-SA capability with all required cross domain interfaces."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "System Integrator Contract"
                                                },
                                                "FundingVehicle": {
                                                    "val": "PO"
                                                },
                                                "PerformingActivity": {
                                                    "val": "EDC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Alexandria, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "17.056"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-04"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.226"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "17.282"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Support Costs"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PdM GFEBS SA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Alexandria, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.726"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.726"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Testing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "IA"
                                                },
                                                "PerformingActivity": {
                                                    "val": "JITC\/ATEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Alexandria, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "4.960"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "4.960"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}