{
    "id": "6063b1a2985bc26e66a646b19d239c95e820b878",
    "meta": {
        "filename": "dod-2015_RDTE_2015_NAVY_BA1_3_RDTE_JustificationBook_Navy_PB_2015.zzz_unzipped_RDTE_JustificationBook_Navy_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602651M"
        },
        "ProgramElementTitle": {
            "val": "JT Non-Lethal Wpns Applied Res"
        },
        "R1LineNumber": {
            "val": "11"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "5.234"
            },
            "CurrentYear": {
                "val": "6.059"
            },
            "BudgetYearOne": {
                "val": "5.887"
            },
            "BudgetYearOneBase": {
                "val": "5.887"
            },
            "BudgetYearTwo": {
                "val": "6.119"
            },
            "BudgetYearThree": {
                "val": "6.327"
            },
            "BudgetYearFour": {
                "val": "6.425"
            },
            "BudgetYearFive": {
                "val": "6.425"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The DOD's Joint Non-Lethal Weapons Program (JNLWP) was established by the Secretary of Defense, who assigned centralized responsibility for DoD joint research and development of non-lethal technology to the Commandant of the Marine Corps as the Executive Agent.  The Under Secretary of Defense for Acquisition, Technology and Logistics provides direct oversight of the JNLWP.\n\nThe efforts described in this Program Element (PE) reflect science and technology (S&T) investment decisions provided by the Joint Non-Lethal Weapons (NLW) Integrated Product Team, a multi-service flag level corporate board that executes the JNLWP for the Commandant of the Marine Corps.  This direction is based on the needs and capabilities of the Services, the Special Operations Command, and the Coast Guard, as identified in the DoD's Non-Lethal Weapons Joint Capabilities Based Assessment Document.  This coordinated joint S&T development approach addresses mutual capability gaps and assures the best non-lethal technologies and equipment are provided to the operating forces while eliminating duplicative service S&T investment.\n\nThis program funds the applied research, study, assessment, and demonstration of technologies that could provide a non-lethal capability or target effect.  Investment areas include applied research related to: non-lethal directed energy weapons (lasers, millimeter wave and high power microwave) for counter-personnel and counter-materiel missions; non-lethal acoustic and optical technologies; advanced non-lethal materiels (including materiels for vehicle\/vessel stopping and counter-facility applications); associated human effects and effectiveness for new non-lethal stimuli; injury potential and effectiveness of directed energy, electric stun, ocular, and acoustic based non-lethal technologies; and developing models of crowd behavior and dynamics.  This program transitioned from PE 0602114N, Power Projection Applied Research by order of the Under Secretary of Defense for Acquisition, Technology, and Logistics, USD(AT&L), to a separate PE for Joint Non-Lethal Weapons Applied Research and established the Commandant of the Marine Corps as the Executive Agent for DoD Joint Non-Lethal Weapons RDT&E.\n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "5.973"
                },
                "CurrentYear": {
                    "val": "6.060"
                },
                "BudgetYearOne": {
                    "val": "6.194"
                },
                "BudgetYearOneBase": {
                    "val": "6.194"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "5.234"
                },
                "CurrentYear": {
                    "val": "6.059"
                },
                "BudgetYearOne": {
                    "val": "5.887"
                },
                "BudgetYearOneBase": {
                    "val": "5.887"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.739"
                },
                "CurrentYear": {
                    "val": "-0.001"
                },
                "BudgetYearOne": {
                    "val": "-0.307"
                },
                "BudgetYearOneBase": {
                    "val": "-0.307"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.001"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.229"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.001"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.307"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.307"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.511"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Not applicable.\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0000"
                    },
                    "ProjectTitle": {
                        "val": "JT Non-Lethal Wpns Applied Res"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "5.234"
                        },
                        "CurrentYear": {
                            "val": "6.059"
                        },
                        "BudgetYearOne": {
                            "val": "5.887"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.887"
                        },
                        "BudgetYearTwo": {
                            "val": "6.119"
                        },
                        "BudgetYearThree": {
                            "val": "6.327"
                        },
                        "BudgetYearFour": {
                            "val": "6.425"
                        },
                        "BudgetYearFive": {
                            "val": "6.425"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project funds the applied research, study, assessment, and demonstration of technologies that could provide a non-lethal capability or target effect. Investment areas include applied research related to: non-lethal directed energy weapons (lasers, millimeter wave and high power microwave) for counter-personnel and counter-materiel missions; non-lethal acoustic and optical technologies; advanced non-lethal materials (including materials for vehicle\/vessel stopping and counter-facility applications); associated human effects and effectiveness for new non-lethal stimuli; injury potential and effectiveness of directed energy, electric stun, ocular, and acoustic based non-lethal technologies; and developing models of crowd behavior and dynamics."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "(U) JOINT NON-LETHAL WEAPONS"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.234"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Completed investigation of the characteristics, optimization, and control of Laser Induced Plasma (LIP) phenomena for their nonlethal applications to both counter-personnel and counter-materiel missions.  LIP phenomena to be revisited as technology matures.\n- Continued refinement of directed energy weapon models through research into non-lethal phenomena and assessment of human effects and weapon effectiveness. \n- Continued academic research into technology areas with relevance to non-lethal weapon capabilities. \n- Continued investigations of alternative technologies with potential to address emerging capability gaps. \n- Continued characterization efforts of alternative directed energy technologies by building upon the Advanced Total Body Model (ATBM), as part of the Human Effects Modeling Analysis Program (HEMAP), to incorporate suitable sensors capable of measuring directed energy effects (millimeter - wave, high powered microwave, etc). \n- Continued human effects investigation of alternative physical phenomena to non-lethally suppress humans beyond small arms range. \n- Continued investigations of advanced materials and emergent technologies suitable for extended range non-lethal weapon payload applications. \n- Continued transition of foundational effects associated with advanced electro-muscular disruption technologies to higher levels of technology development and demonstration. \n- Continued applied research for potential emergent technologies with applicability to the clear-a-space counter-personnel mission. \n- Completed transition of foundational effects associated with underwater acoustics bioeffects applied research to higher levels of technology development. \n- Completed investigation of the characteristics, optimization and control of Laser Induced Plasma (LIP) phenomena as they pertain to the counter-material\/counter-aircraft mission application. \n- Initiated investigation of collateral, non-lethal effects to personnel associated with anticipated employment of maturing counter-material nonlethal weapons technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.059"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts from FY 2013, except those noted as completed.\n- Initiate technologic revisit of using laser induced plasmas to deliver novel NL effects. \n- Initiate feasibility assessment and evaluation of candidate technologies with potential to mitigate technology challenges impeding NLE capability gap resolution."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.887"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.887"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts from FY 2014.\n- Continue incorporation of suitable sensors capable of measuring NL stimuli into surrogate test models as part of the Human Effects Modeling Analysis Program (HEMAP) under PE 0603651M.\n- Initiate Laser Induced Plasma (LIP) capability to deliver novel NL effects.\n- Initiate feasibility study of most promising LIP concepts and applications\n- Initiate evaluation of the feasibility and practicality study of advanced vehicle stopping design concepts. \n- Initiate investigation of component High Power Microwave (HPM) technologies and transition results to higher levels of technology development and demonstration."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "The primary objective of this Program Element is the development of technologies that lead to the next-generation of Non-Lethal Weapons. The program consists of a collection of projects that range from studies and analyses to the development and evaluation of feasibility demonstration models. Individual project metrics reflect the technical goals of each specific project. Typical metrics include both the effectiveness of the technology, human effects and effectiveness, and potential for compliance with policy and legislation. Overarching considerations include the advancement of related Technology Readiness Levels and Human Effects Readiness Levels, the degree to which project investments are leveraged with other performers, reduction in life cycle cost upon application of the technology, and the identification of opportunities to transition technology to higher categories of development."
                        }
                    }
                }
            ]
        }
    }
}