{
    "id": "60aa507011a5f84458094ba3ae14d09c00f578a4",
    "meta": {
        "filename": "dod-2015_RDTE_2015_TJS_RDTE_JustificationBook_The_Joint_Staff_PB_2015.zzz_unzipped_RDTE_JustificationBook_The_Joint_Staff_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "The Joint Staff",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0603828J"
        },
        "ProgramElementTitle": {
            "val": "Joint Experimentation"
        },
        "R1LineNumber": {
            "val": "67"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "The Joint Staff"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "15.841"
            },
            "CurrentYear": {
                "val": "12.667"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Joint Experimentation (JE) Program Element provides funding for the Department’s Joint Concept Development & Experimentation (JCD&E) effort, carried out by the JCD&E Community.  The JCD&E Community is comprised of the Combatant Commands (CCMDs), Services, Office of the Secretary of Defense (OSD), Joint Staff, National Guard Bureau (NGB), United States Coast Guard (USCG) and several Defense agencies.  Intra-government agencies and coalition partners often participate in JCD&E processes and projects.  The Director for Joint Force Development (DJ-7) leads the joint force development efforts on behalf of the Chairman.  The J-7 staff coordinates all efforts with respect to the JCD&E Community.\n\nTo ensure the program focuses on needs of the warfighters, JCD&E initiatives originate from an annual call for nominations from CCMD's and Services, and from assessment of CCMDs identified critical warfighting capability gaps articulated in the Comprehensive Joint Assessment (CJA).  JCD&E project submissions undergo preliminary analysis by the JCD&E Community to confirm suitability for experimentation and, where feasible, to associate closely related subjects for economy of effort.  Preliminary analysis also confirms alignment to the Chairman’s priorities for developing Joint Force 2020 and Defense Planning Guidance (DPG) strategic priority areas.  The resulting annual list of project submissions includes concepts for development and experimentation efforts eligible for design and execution.  These efforts are prioritized and approved by the CCMDs and Service members of the Synchronization Board and forwarded to the Joint Capabilities Board (JCB)\/Joint Requirements Oversight Council (JROC) for approval.\n\nJCD&E activities examine potential solutions for CCMD operational needs emphasizing non-materiel solutions through targeted Doctrine, Organizational, Training, Leadership and Education, Personnel, Facilities, and Policy (DOT-LPF-P) improvements.  JCD&E tackles joint concept and capability issues demanding sophisticated analysis, innovative design and complex execution.  JCD&E projects address topics that would prove difficult for individual combatant commands and Services to capture in the context of their immediate operational and force generation responsibilities.  In partnership with the CCMDs and Services, JCD&E mitigates operational risk by establishing procedural models to conduct emergent concepts that are not yet instantiated in conventional force generation.  The results are briefed to Functional Capability Boards (FCB) who integrate solutions into their functional investment plans.\n\nBased on leadership guidance, JS J7 shed themselves of the experimentation functions originally outlined in the Joint Experimentation R2.  While JS J7 divested this piece, the other portions such as concept development and wargaming were retained. The shift in focus aligns more closely with those functions under BA6 RDT&E Management Support.  As a result, this line was zeroed and the remaining requirement was realigned to PE 0204571J, Joint Staff Analytical Support."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "21.230"
                },
                "CurrentYear": {
                    "val": "12.667"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "15.841"
                },
                "CurrentYear": {
                    "val": "12.667"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-5.389"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.028"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "-1.701"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-3.660"
                    }
                }
            },
            "SummaryExplanation": {
                "val": "FY 2013 was the first year PE 0603828J, Joint Experimentation, was in the Joint Staff's account.  Prior to FY 2013, OUSD (Research & Evaluation) owned the funding and reported the information on their budget exhibits.\n\nThe Chairman, Joint Chiefs of Staff directed the J7 to transform the Joint Experimentation program.  The reduction in BA3 funding between FY 2013 and FY 2014 is part of the transformation from Joint Experimentation to a Joint Assessment Program.\n\nBased on leadership guidance, JS J7 shed themselves of the experimentation functions originally outlined in the Joint Experimentation R2.  While JS J7 divested this piece, the other portions such as concept development and wargaming were retained. The shift in focus aligns more closely with those functions under BA6 RDT&E Management Support.  As a result, this line was zeroed and the remaining requirement was realigned to PE 0204571J, Joint Staff Analytical Support."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P01"
                    },
                    "ProjectTitle": {
                        "val": "Joint Experimentation"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "15.841"
                        },
                        "CurrentYear": {
                            "val": "12.667"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Experimentation (JE) Program Element provides funding for the Department’s Joint Concept Development & Experimentation (JCD&E) effort, carried out by the JCD&E Community.\n\nThe JCD&E Community is comprised of the Combatant Commands (CCMDs), Services, the Office of the Secretary of Defense (OSD), the Joint Staff, the National Guard Bureau (NGB), the United States Coast Guard (USCG), and several Defense agencies.  Intra-government agencies and coalition partners often participate in JCD&E processes and projects.  The Director for Joint Force Development (DJ-7) leads the joint force development efforts on behalf of the Chairman.  The J-7 staff coordinates all efforts with respect to the JCD&E Community.\n\nTo ensure the program focuses on needs of the warfighters, JCD&E initiatives originate from an annual call for nominations from CCMD's and Services, and from assessment of combatant command identified critical warfighting capability gaps articulated in the Comprehensive Joint Assessment (CJA).  JCD&E project submissions undergo preliminary analysis by the JCD&E Community to confirm suitability for experimentation and, where feasible, to associate closely related subjects for economy of effort.  Preliminary analysis also confirms alignment to the Chairman’s priorities for developing Joint Force 2020 and Defense Planning Guidance (DPG) strategic priority areas.  The resultant annual list of project submissions includes concepts for development and experimentation efforts eligible for design and execution. These efforts are prioritized and approved by the combatant command and Service members of the Synchronization Board and forwarded to the Joint Capabilities Board (JCB) and the Joint Requirements Oversight Council (JROC) for approval.\n\nJCD&E activities examine potential solutions for CCMD operational needs emphasizing non-materiel solutions through targeted Doctrine, Organizational, Training, Leadership and Education, Personnel, Facilities, and Policy (DOT-LPF-P) improvements.  JCD&E tackles joint concept and capability issues demanding sophisticated analysis, innovative design, and complex execution.  JCD&E projects address topics that would prove difficult for individual combatant commands and Services to capture in the context of their immediate operational and force generation responsibilities.  In partnership with the combatant commands and Services, JCD&E mitigates operational risk by establishing procedural models to conduct emergent concepts that are not yet instantiated in conventional force generation.  The results are provided to Functional Capability Boards who integrate solutions into their functional investment plans.\n\nBased on leadership guidance, JS J7 shed themselves of the experimentation functions originally outlined in the Joint Experimentation R2.  While JS J7 divested this piece, the other portions such as concept development and wargaming were retained. The shift in focus aligns more closely with those functions under BA6 RDT&E Management Support.  As a result, this line was zeroed and the remaining requirement was realigned to PE 0204571J, Joint Staff Analytical Support."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Experimentation"
                                    },
                                    "Description": {
                                        "val": "The Joint Experimentation (JE) Program Element provides funding for the Department’s Joint Concept Development & Experimentation (JCD&E) effort, carried out by the JCD&E Community.\n\nThe JCD&E Community is comprised of the Combatant Commands, Services, the Office of the Secretary of Defense (OSD), the Joint Staff, the National Guard Bureau (NGB), the United States Coast Guard (USCG), and several Defense agencies.  Intra-government agencies and coalition partners often participate in JCD&E processes and projects. The Director for Joint Force Development (DJ-7) leads the joint force development efforts on behalf of the Chairman. The J-7 staff coordinates all efforts with respect to the JCD&E Community."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.841"
                                            },
                                            "Text": {
                                                "val": "The FY 2013 Program of Work included projects supporting the President’s “Sustaining U.S. Global Leadership Priorities for the 21st Century Defense”.  Specific projects focused on capabilities critical to the success of the future joint force, including intelligence, surveillance, and reconnaissance; counterterrorism; countering weapons of mass destruction; operating in anti-access environments, and prevailing in all domains, including cyber."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.667"
                                            },
                                            "Text": {
                                                "val": "(1) The Chairman, Joint Chiefs of Staff directed the J7 to transform the Joint Experimentation program.  The reduction in BA3 funding between FY 2013 and FY 2014 is part of the transformation from Joint Experimentation to a Joint Assessment program in BA6.\n\n(2) FY 2014 efforts will focus on supporting the President’s “Sustaining U.S. Global Leadership Priorities for the 21st Century Defense” with emphasis on implementing the Joint Operational Access Concept, and building Joint Force 2020 as described in the Chairman, Joint Chiefs of Staff Capstone Concept for Joint Operations.  Specific work will focus on concepts, and gap analysis and the resultant recommended non-materiel solutions that will improve current and future joint force capability including operating in anti-access and area denial environments, joint command & control, intercontinental missile defense, counterterrorism, operations in space, and defeating threats in all domains, including cyber."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "JCD&E efforts result in development of and integration or transition of concepts and capabilities to improve current and future joint force capability, and are measured by the following:\n(1) Concepts accounted for lessons learned reports, Joint and Coalition Operational Analysis studies, training exercises, past wargames, previous operations, and other historically captured events.\n(2) Collaborated with a broad, cross-cutting representation from Services, Academia, CCMDs, Defense Agencies, and Industry.\n(3) Introduced innovative operating methods leading to Doctrine, Organization, Training, Materiel, Leadership, Personnel & Facilities (DOTmLPF) changes.\n(4) Vetted through a deliberate, rigorous process resulting in Chairman of the Joint Chiefs of Staff (CJCS) endorsement and approval.\n(5) Capabilities identified in concepts are described in a way to facilitate transition to gap analysis. \n(6) Assessments have considered concepts, lessons learned, operational studies, and planned\/projected force capabilities.\n(7) Assessments are coordinated with relevant community of practice, current subject matter experts, industry, academia, and appropriate multinational partners.\n(8) Assessments are completed in a responsive and timely manner, and staffed in accordance with established Department of Defense policy and guidelines.\n(9) Provided sound, supportable recommendations derived from assessments that succinctly addressed identified gaps with practical and actionable options that directly or indirectly improved capabilities.\n(10) Recommendations were appropriately transitioned to designated action offices of responsibility."
                        }
                    }
                }
            ]
        }
    }
}