{
    "id": "60e5a3505364ddfb9d0b9b7edca786bfa52124b4",
    "meta": {
        "filename": "dod-2015_RDTE_2015_ARMY_BA1_RDTE_JustificationBook_Army_PB_2015.zzz_unzipped_RDTE_JustificationBook_Army_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0601104A"
        },
        "ProgramElementTitle": {
            "val": "University and Industry Research Centers"
        },
        "R1LineNumber": {
            "val": "4"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Basic Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "95.867"
            },
            "CurrentYear": {
                "val": "113.601"
            },
            "BudgetYearOne": {
                "val": "102.737"
            },
            "BudgetYearOneBase": {
                "val": "102.737"
            },
            "BudgetYearTwo": {
                "val": "101.024"
            },
            "BudgetYearThree": {
                "val": "102.535"
            },
            "BudgetYearFour": {
                "val": "104.302"
            },
            "BudgetYearFive": {
                "val": "109.696"
            }
        },
        "ProgramElementNote": {
            "val": "FY 13 funding was reduced due to Congressionally directed reprogramming of $15.549 million for Historically Black Colleges and Universities and Minority Institutions (HBCU\/MI) to RDT&E, Defense-wide appropriation, $8.465 million for sequestration reductions, and $2.971 million for SBIR\/STTR transfers\nFY15 funding reduced to support higher Army priorities."
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) fosters university and industry based research to provide a scientific foundation for enabling technologies for future force capabilities.  Broadly, the work in this project falls into three categories: Collaborative Technology Alliances \/ Collaborative Research Alliances (CTAs\/CRAs), University Centers of Excellence (COE), and University Affiliated Research Centers (UARCs).  The Army formed CTAs to leverage large investments by the commercial sector in basic research areas that are of great interest to the Army.  CTAs are industry-led partnerships between industry, academia, and the Army Research Laboratory (ARL) to incorporate the practicality of industry, the expansion of the boundaries of knowledge from universities, and Army scientists to shape, mature, and transition technology relevant to the Army mission.  CTAs have been competitively established in the areas of Micro Autonomous Systems Technology (MAST), Network Sciences, Robotics, Cognition and Neuroergonomics, and Multi-Scale Materials Modeling.  COEs focus on expanding the frontiers of knowledge in research areas where the Army has enduring needs, and couples state-of-the-art research programs at academic institutions with broad-based graduate education programs to increase the supply of scientists and engineers in automotive and rotary wing technology.  Also included are Army Educational Outreach Program (AEOP) and activities to stimulate interest in science, math, and technology among middle and high school students.  This PE includes support for basic research at three Army UARCs, which have been created to exploit opportunities to advance new capabilities through a sustained long-term multidisciplinary effort.  The Institute for Soldier Nanotechnologies focuses on Soldier protection by emphasizing revolutionary materials research for advanced Soldier protection and survivability.  The Institute for Collaborative Biotechnologies focuses on enabling network centric-technologies, and broadening the Army's use of biotechnology for the development of bio-inspired materials, sensors, and information processing.  The Institute for Creative Technologies is a partnership with academia and the entertainment and gaming industries to leverage innovative research and concepts for training and simulation.  Examples of specific research of mutual interest to the entertainment industry and the Army are technologies for realistic immersion in synthetic environments, networked simulation, standards for interoperability, and tools for creating simulated environments.  This PE also includes the Historically Black Colleges and Universities and Minority Institution (HBCU\/MI) Centers of Excellence that address critical research areas for Army Transformation. \n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering science and technology focus areas and the Army Modernization Strategy.  \n \nWork in this PE is performed by the U. S. Army Research Lab (ARL) in Adelphi, MD; the U.S. Army Tank Automotive Research, Development, and Engineering Center (TARDEC) in Warren, MI; U.S. Army Aviation and Missile Research, Development and Engineering Center (AMRDEC), in Huntsville, AL, and U.S. Army Research, Development and Engineering Command (RDECOM), in Aberdeen, MD."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "123.045"
                },
                "CurrentYear": {
                    "val": "113.662"
                },
                "BudgetYearOne": {
                    "val": "118.502"
                },
                "BudgetYearOneBase": {
                    "val": "118.502"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "95.867"
                },
                "CurrentYear": {
                    "val": "113.601"
                },
                "BudgetYearOne": {
                    "val": "102.737"
                },
                "BudgetYearOneBase": {
                    "val": "102.737"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-27.178"
                },
                "CurrentYear": {
                    "val": "-0.061"
                },
                "BudgetYearOne": {
                    "val": "-15.765"
                },
                "BudgetYearOneBase": {
                    "val": "-15.765"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.183"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "-15.559"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.971"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-15.765"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-15.765"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments 1"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-8.465"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments 2"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "-0.061"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "EA6"
                    },
                    "ProjectTitle": {
                        "val": "Cyber Collaborative Research Alliance"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "3.008"
                        },
                        "BudgetYearOne": {
                            "val": "4.200"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.200"
                        },
                        "BudgetYearTwo": {
                            "val": "3.257"
                        },
                        "BudgetYearThree": {
                            "val": "3.306"
                        },
                        "BudgetYearFour": {
                            "val": "3.363"
                        },
                        "BudgetYearFive": {
                            "val": "4.923"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Cyber Security Collaborative Research Alliance (CRA), a competitively selected consortium, is formed to advance the theoretical foundations of cyber science in the context of Army networks.  This CRA consists of academia, industry and government researchers working jointly with the objective of developing a fundamental understanding of cyber phenomena so that fundamental laws, theories, and theoretically grounded and empirically validated models can be applied to a broad range of Army domains, applications, and environments.  This research will focus on three interrelated aspects of cyber security and will be conducted using a trans-disciplinary approach that takes into account the human element of the network.  The three aspects of cyber that are addressed are: 1) vulnerabilities and risks of cyber networks to malicious activities, 2) anticipating, detecting, and analyzing malicious activities, and 3) agile cyber maneuver to thwart and defeat malicious activities.  Overarching goals of cyber security are to significantly decrease the adversary's return on investment when considering cyber attack on Army networks, and minimizing the impact on (Army) network performance related to implementing cyber security.  The CRA research creates a framework that effectively integrates the knowledge of cyber assets and potential adversary capabilities and approaches, and provides defense mechanisms that dynamically adjust to changes related to mission, assets, vulnerability state, and defense mechanisms.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the U.S. Army Research Laboratory (ARL) in Adelphi and Aberdeen Proving Grounds, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Cyber Security Collaborative Research Alliance"
                                    },
                                    "Description": {
                                        "val": "The Cyber Security Collaborative Research Alliance (CRA) supports basic research to enable capabilities for rapid development and adaptation of cyber tools for dynamically assessing cyber risks, detecting hostile activities on friendly networks, and supporting agile maneuver in cyber space in spite of the continous evolution and emergence of novel threats."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.008"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Competitively select a consortium consisting of academia, industry and government researchers to advance the theoretical foundations of cyber science in the context of Army networks; investigate new holistic conceptualizations and definitions of risk, resiliency and robustness under an adversarial setting; study and create theory and techniques for effective non-signature based detection of advanced persistent threats; develop mathematical theories and models leading to algorithms to affect a desired maneuver end-state in dynamic environments and deliberate obfuscation attempts by the adversary; and explore theoretical models of the cyber defender leading to improved defender effectiveness."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.200"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.200"
                                            },
                                            "Text": {
                                                "val": "Will develop theories and models relating fundamental properties and features of dynamic risk assessment algorithms to the fundamental properties of dynamic cyber threats, Army's networks, and defensive mechanisms taking into account the context of the mission; develop theories and models relating properties and capabilities of cyber threat detection and recognition processes\/mechanisms to properties of malicious activity and of Army networks; develop theories and models to support planning and control of cyber maneuver (i.e., \"maneuver\" in the space of network characteristics and topologies) that would describe how control and the end-state of the maneuver are influenced by fundamental properties of threats - such as might be rapidly inferred from limited observations of a new, recently observed threat; and develop a theoretical understanding of the socio-cognitive factors that impact the decision making of the user\/Soldier, defender\/analyst, and adversary."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "F17"
                    },
                    "ProjectTitle": {
                        "val": "Neuroergonomics Collaborative Technology Alliance"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.680"
                        },
                        "CurrentYear": {
                            "val": "5.378"
                        },
                        "BudgetYearOne": {
                            "val": "3.991"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.991"
                        },
                        "BudgetYearTwo": {
                            "val": "5.293"
                        },
                        "BudgetYearThree": {
                            "val": "5.372"
                        },
                        "BudgetYearFour": {
                            "val": "5.465"
                        },
                        "BudgetYearFive": {
                            "val": "5.562"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project fosters research through the Cognition and Neuroergonomics Collaborative Technology Alliance (CTA), a competitively selected industry and university consortium, to leverage world-class research in support of future force and Army transformation needs.  Escalating levels of complexity and uncertainty on the current and future battlefield present conditions which have never existed before now.  Solution strategies and approaches must be developed or tailored.  The emerging field of neuroergonomics, which seeks to understand the brain at work and to leverage that understanding to optimize system design, offers tremendous potential for providing the solutions needed to meet the needs of Army forces in the future.  This CTA addresses the solution strategies and approaches needed to design systems to fully exploit investments in revolutionary technological advances in areas such as robotics, microelectronics, and computer and network information systems.  These technologies present significant opportunities to enhance Army mission capabilities, but impose significant burdens on the human brain, which will ultimately limit Soldier-system effectiveness, sustainability, and survivability.  The technical barriers associated with this project include: immature knowledge base to guide the neuroergonomic approach to human-system integration; inadequate capabilities to sense and extract information about brain activity in dynamic, operational environments; lack of valid measures to robustly and uniquely characterize operationally-relevant cognitive performance; lack of techniques for integrating advanced understandings of brain activity into systems designs, including real-time use of measures of cognitive behavior as system inputs and the capability to account for individual differences in maximizing Soldier-system performance.  This CTA conducts an intensive and accelerated program to formulate, validate, and transition basic research findings through multi-dimensional approaches focused in three areas: understanding fundamental principles underlying Soldier neurocognitive performance in operational environments, advancing computational approaches for the analysis and interpretation of neural functioning, and fundamental advancement in neurotechnologies that enhance Soldier-system interactions and performance. \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the U.S. Army Research Laboratory (ARL) in Adelphi, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Neurocognitive performance in operational environments"
                                    },
                                    "Description": {
                                        "val": "This effort is intended to understand fundamental principles underlying Soldier neurocognitive performance in operational environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.695"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed execution of large scale simulation evaluations to generate data for addressing issues of individual differences in neurocognitive performance; and transitioned lessons learned from evaluation of formal models in simulation assessments to inform the development of a second phase of evaluation with increased military relevance\/realism"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.047"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop and transition lessons learned on individual differences in neurocognitive performance from large scale simulation evaluations to second phase of evaluation with increased military relevance\/realism; and develop simulation evaluations with increased military relevance\/realism to evaluate formal models of neurocognitive performance issues of individuals in neurocognitive performance"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.517"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.517"
                                            },
                                            "Text": {
                                                "val": "Will evaluate neurocognitive performance using novel scenarios of increasing military relevance to determine feasibility of military applications; and identify methods of mathematical processing and evaluate utility for interpreting brain activity recordings under conditions that demand complex neural functioning of operationally relevant tasks."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Computational neural analysis"
                                    },
                                    "Description": {
                                        "val": "This effort advances computational approaches for the analysis and interpretation of neural functioning."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.485"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed the analysis of large-scale simulations including further elaboration of models and computational methods for assessing neurocognitive performance and identifying predictive features of inter- and intra-subject variability; and designed extensions of databases to enable further analysis and modeling of individual differences in neurocognitive function."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.606"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct data mining explorations of large-scale simulation evaluations using novel computational methods for identification and clustering of predictive features of inter- and intra-subject variability; and implement extensible database designs for enabling data exploration and modeling of individual differences in neurocognitive function."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.197"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.197"
                                            },
                                            "Text": {
                                                "val": "Will use information obtained from data mining explorations of large-scale simulation for development of improved algorithms for brain computer interaction technologies that better account for variability among individuals."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Neurotechnologies"
                                    },
                                    "Description": {
                                        "val": "This effort provides a fundamental advancement in neurotechnologies that enhance Soldier-system interactions and performance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.500"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Matured and assessed online signal processing methods for analysis of EEG data; validated methods and sensor performance for remote monitoring of Soldier fatigue; and implemented and evaluated algorithms for a neuro-computer vision system for automated environmental appraisal; implemented and assessed user feedback \/ alerting system relating to saliency and attention modeling, object detection, object tracking for automation and Soldier training technology design."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.725"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Refine methods, sensor performance, and system designs for on-line monitoring and assessment of Soldier fatigue and neurocognitive state; validate performance of algorithms for a neuro-computer vision for automated environment appraisal; and evaluate and validate methods for Soldier monitoring and assessment in human-computer interaction technologies for Soldier intentional and target detection performance and adaptive automation systems"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.277"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.277"
                                            },
                                            "Text": {
                                                "val": "Will pursue adaptation of neuroimaging technologies to enhance functionality in complex environments; and develop technical capabilities for identification of brain activity in realistic environments, including hardware and software algorithms robust to environmental and user-induced artifacts."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H04"
                    },
                    "ProjectTitle": {
                        "val": "HBCU\/MI Programs"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.494"
                        },
                        "CurrentYear": {
                            "val": "2.959"
                        },
                        "BudgetYearOne": {
                            "val": "2.105"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.105"
                        },
                        "BudgetYearTwo": {
                            "val": "1.901"
                        },
                        "BudgetYearThree": {
                            "val": "1.944"
                        },
                        "BudgetYearFour": {
                            "val": "1.995"
                        },
                        "BudgetYearFive": {
                            "val": "2.049"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "FY 14 OSD funding for Historically Black Colleges and Universities and Minority Institutions was realigned from the RDT&E, Army appropriation to RDT&E, Defense-wide appropriation.  Army specific efforts continue to be funded in this project."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project supports basic research through the Partnership in Research Transition (PIRT) program, the Army's research initiative focused on partnerships with Historically Black Colleges and Universities and Minority Institutions (HBCU\/MI), and provides support to Department of Defense (DoD) Historically Black Colleges and Universities and Minority Institutions (HBCU\/MI) program providing support for research and collaboration with DoD facilities and personnel for research and collaboration with DoD facilities and personnel.  The focus of this effort is to enhance programs and capabilities of a select number of high-interest scientific and engineering disciplines through innovative research at Centers of Excellence (CoE) established at Historically Black Colleges and Universities.  These COEs work with Army, industrial, and other academic partners to accelerate the transition from the research phase to technology demonstration.  In addition, these CoEs recruit, educate, and train outstanding students and post-doctoral researchers in science and technology areas relevant to the Army.\n\nWork in this project if fully coordinated with the Office of Secretary of Defense program manager for HBCU\/MI programs.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n    \nWork on this project is performed by the U.S. Army Research Laboratory (ARL) in Adelphi, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Centers of Excellence for Battlefield Capability Enhancements (BCE)"
                                    },
                                    "Description": {
                                        "val": "Five new Partnership in Research Transition (PIRT) Centers of Excellence were established in 2011 at: Hampton Univ. (Lower Atmospheric Research Using Lidar Remote Sensing); NCA&T State Univ. (Nano to Continuum Multi-Scale Modeling Techniques and Analysis for Cementitious Materials Under Dynamic Loading); Delaware State Univ. (Center for Advanced Algorithms); Howard Univ.(2) (Bayesian Imaging and Advanced Signal Processing for Landmine and IED Detection Using GPR, and Extracting Social Meaning From Linguistic Structures in African Languages).  These Centers were selected to: enhance programs and capabilities through Army-relevant, topic-focused, near-transition-ready innovative research; strengthen the capacity of the Historically Black Colleges and Universities (HBCUs) to provide excellence in education; and to conduct research critical to the national security functions of the DoD."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.494"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued research efforts at the PIRT Centers of Excellence; and conducted major program-wide review of all center research progress."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.959"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue research efforts at PIRT Centers of Excellence that began in FY11 and continued in FY12 and FY13, for centers showing sufficient progress toward research goals and transition."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.105"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.105"
                                            },
                                            "Text": {
                                                "val": "Will continue to support research at PIRT Centers of Excellence and collaboration with Army Labs and other institutions of higher learning to transition science and innovation to enhance warfighting capabilities of U.S. Soldiers."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H05"
                    },
                    "ProjectTitle": {
                        "val": "Institute For Collaborative Biotechnologies"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "10.834"
                        },
                        "CurrentYear": {
                            "val": "12.451"
                        },
                        "BudgetYearOne": {
                            "val": "8.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "8.000"
                        },
                        "BudgetYearTwo": {
                            "val": "6.532"
                        },
                        "BudgetYearThree": {
                            "val": "6.645"
                        },
                        "BudgetYearFour": {
                            "val": "6.777"
                        },
                        "BudgetYearFive": {
                            "val": "6.921"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project supports research at the Army's Institute for Collaborative Biotechnologies (ICB), led by the University of California-Santa Barbara, and two major supporting partners, the California Institute of Technology and the Massachusetts Institute of Technology.  The ICB was established as a University Affiliated Research Center (UARC) to support leveraging biotechnology for: advanced sensors; new electronic, magnetic, and optical materials; and information processing and bioinspired network analysis. The objective is to perform sustained multidisciplinary basic research supporting technology to provide the Army with biomolecular sensor platforms with unprecedented sensitivity, reliability, and durability; higher-order arrays of functional electronic and optoelectronic components capable of self-assembly and with multi-functions; and new biological means to process, integrate, and network information.  These sensor platforms will incorporate proteomics (large scale study of proteins) technology, DNA sequence identification and detection tools, and the capability for recognition of viral pathogens.  A second ICB objective is to educate and train outstanding students and post doctoral researchers in revolutionary areas of science to support Army Transformation.  The ICB has many industrial partners, such as IBM and SAIC, and has strong collaborations with Argonne, Lawrence Berkley, Lawrence Livermore, Los Alamos, Oak Ridge, and Sandia National Laboratories, the Army's Institute for Soldier Nanotechnologies, the Institute for Creative Technologies, and U.S. Army Medical Research and Materiel Command (MRMC) laboratories.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n \nWork in this project is performed extramurally by the U.S. Army Research Laboratory (ARL) in Adelphi, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Institute for Collaborative Biotechnologies"
                                    },
                                    "Description": {
                                        "val": "Perform sustained multidisciplinary basic research supporting technology to provide the Army with bio-inspired materials and biomolecular sensor platforms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.595"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigated engineering glucosidases (enzyme class responsible for catalyzing breakdown of plant and other biomaterials into nutrients) and assessed bio- mixtures with thermally-stable cellulases for potential future applications in biofuel production; and researched concepts and designs for bio-inspired energy-dispersive composites."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.007"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigate methods for designing and characterizing bio-inspired materials such as exploring new architectures for mechanical strength which can form the basis for new protective materials for the Soldier; expand computational tools that allow for improved selection of engineered enzymes as candidates for potential use in biofuel production; design biomolecular circuitry and control systems within cells to enable rapid detection and response to environmental effects; and examine the effects of oligoelectrolyte insertion within the membranes of a variety of bacterial species to better determine the effects of membrane modification on the potential for generating power from wastewater remediation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.200"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.200"
                                            },
                                            "Text": {
                                                "val": "Will show independent tuning of the temperature coefficient of resistance and noise to improve signal to noise ratio of room temperature infrared detectors; show electrically injected, high-speed 1.55 µm nanoscale lasers on a silicon (Si) platform for potential gains in energy efficiency of computational and sensor systems;  show that plasmonic antennas can mitigate efficiency degradation for efficient data communications and energy harvesting; and create and investigate a novel sensor based on optical dark modes in nanorods for use in biomolecule, chemical sensing, and near-field imaging."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Neuroscience"
                                    },
                                    "Description": {
                                        "val": "Perform multidisciplinary basic research in the area of neuroscience."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.239"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Studied genetic, anatomic, and strategic differences of cognitive performance using EEG and functional magnetic resonance imaging (fMRI) methods to characterize individual differences of brain activity; and began design and validation of new methods to characterize brain anatomic networks and dynamical patterns relevant to neuroimaging studies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.444"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Assess the relationship between brain structural and functional connections with behavior to gain a better understanding of the relationship between a Soldier's hardwired brain structure and cognitive ability; assess whether neural measurements (e.g.,  functional magnetic resonance imaging or electroencephalography) can predict the performance of an individual to correctly perceive and detect targets placed at unusual locations within natural environments; and identify neural and physiological biomarkers associated with adaptive cognitive capacity under stress and fatigue"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.800"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.800"
                                            },
                                            "Text": {
                                                "val": "Will utilize psychophysics, mathematical modeling and cutting-edge neuroscientific measurements to explore the neural components underlying perceptual decision making, indecisiveness, learning capabilities and attentional states while performing complex visual tasks, which may ultimately lead to new methods, tools, and models to enhance warfighter performance; and explore the organizational principles governing the structure and topology of brain networks and analyze brain imaging data that, in the long term, may enable the design of improved training protocols to reduce unwanted maladaptive behaviors."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H09"
                    },
                    "ProjectTitle": {
                        "val": "Robotics CTA"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.955"
                        },
                        "CurrentYear": {
                            "val": "6.646"
                        },
                        "BudgetYearOne": {
                            "val": "5.844"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.844"
                        },
                        "BudgetYearTwo": {
                            "val": "5.598"
                        },
                        "BudgetYearThree": {
                            "val": "5.682"
                        },
                        "BudgetYearFour": {
                            "val": "5.780"
                        },
                        "BudgetYearFive": {
                            "val": "5.884"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project supports a collaborative effort between the competitively selected industry and university consortium, the Robotics Collaborative Technology Alliance (CTA), and the U.S. Army Research Laboratory (ARL) for the purpose of leveraging world-class research in support of the future force and Army transformation needs.  This project conducts basic research in areas that will expand the capabilities of intelligent mobile robotic systems for military applications with a focus on enhanced, innate intelligence, ultimately approaching that of a dog or other intelligent animal, to permit unmanned systems to function as productive members of a military team.  Research is conducted in machine perception, including the exploration of sensor phenomenology, and the investigation of basic machine vision algorithms enabling future unmanned systems to better understand their local environment for enhanced mobility and tactical performance; intelligent control, including the advancement of artificial intelligence techniques for robot behaviors permitting future systems to autonomously adapt, and alter their behavior to dynamic tactical situations; understanding the interaction of humans with machines focusing upon intuitive control by Soldiers to minimize cognitive burden; dexterous manipulation of the environment by unmanned systems; and unique modes of mobility to enable unmanned systems to seamlessly navigate complex or highly constrained three dimensional environments.  The program will conduct both analytic and validation studies.  \n\nWork in this projects builds fundamental knowledge for and complements the companion applied technology program, PE 0602120A, project TS2 (Robotics).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n \nWork in this project is performed by the U.S. Army Research Laboratory (ARL) at the Aberdeen Proving Ground, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Autonomous Systems"
                                    },
                                    "Description": {
                                        "val": "Explore opportunities enabling revolutionary, autonomous, and highly mobile systems for the future force.  Research focuses on unmanned systems operating as a team with human supervisors and displaying a high degree of adaptability to dynamic environmental and tactical situations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.955"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigated incorporation of learning into recognition of relationships between both static and dynamic elements of the environment; explored mechanisms for common understanding between humans and machines to enable effective teaming; and examined fundamental principles and mechanics of grasping, manipulation, and ambulation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.646"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Expand investigation of learning and recognition of relationships to include more complex dynamic environments and adversarial intent; continue investigation of cognitive approaches to machine perception and the creation of a shared mental model to reduce reliance upon communication between humans and robots; continue exploration of whole body (dynamic) manipulation of objects in the environment; and continue exploration of novel ground locomotion techniques to enable rapid mobility in three-dimensional and confined environments"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.844"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.844"
                                            },
                                            "Text": {
                                                "val": "Will expand upon utilization of learning to conduct semantic labeling of objects and behaviors; expand upon the concept of a hybrid cognitive-metric architecture, including perceptual and reasoning skills, to enable teaming of humans and unmanned systems; and explore novel modes of mobility, including legs and snake-like motion, to enable efficient, effective mobility in complex three-dimensional environments."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H50"
                    },
                    "ProjectTitle": {
                        "val": "Network Sciences Cta"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "11.573"
                        },
                        "CurrentYear": {
                            "val": "14.193"
                        },
                        "BudgetYearOne": {
                            "val": "11.500"
                        },
                        "BudgetYearOneBase": {
                            "val": "11.500"
                        },
                        "BudgetYearTwo": {
                            "val": "11.196"
                        },
                        "BudgetYearThree": {
                            "val": "11.364"
                        },
                        "BudgetYearFour": {
                            "val": "11.560"
                        },
                        "BudgetYearFive": {
                            "val": "11.771"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project supports a competitively selected university and industry consortium, the Network Sciences Collaborative Technology Alliance (NS CTA), formed to leverage commercial research investments to provide solutions to Army's requirements for robust, survivable, and highly mobile wireless communications networks, while meeting the Army's needs for a state-of-the-art wireless mobile communications networks for command-on-the-move.  The NS CTA performs foundational, cross-cutting network science research leading to: a fundamental understanding of the interplay and common underlying science among social\/cognitive, information, and communications networks; determination of how processes and parameters in one network affect and are affected by those in other networks; and prediction and control of the individual and composite behavior of these complex interacting networks.  This research will lead to optimized human performance in network-enabled warfare and greatly enhanced speed and precision for complex military operations.  The CTA facilitates the exchange of people among the collaborating organizations to provide cross-organizational perspectives on basic research challenges, as well as the use of state-of-the-art facilities and equipment at the participating organizations.  \nBeginning in FY12, all funds from PE 61104\/project J22 were realigned to this project.\n\nWork in this project builds fundamental knowledge for and accelerates the transition of communications and networks technology to PE 0602783A (Computer and Software Technology).  \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the U.S. Army Research Laboratory (ARL) in Adelphi, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Network Sciences Collaborative Technology Alliance (NS CTA)"
                                    },
                                    "Description": {
                                        "val": "The Network Sciences CTA focuses on four major research areas: Information Networks, Communication Networks, Social\/Cognitive Networks, and Interdisciplinary Research to develop a fundamental understanding of the ways that information, social\/cognitive, and communications networks can be designed, composed, and controlled to dramatically increase mission effectiveness and ultimately enable humans to effectively exploit information for timely decision-making.  Information Networks research develops the fundamental understanding of autonomous network activities and its linkage to the physical and human domains as related to human decision making within the networked command and control (C2) structure.  Social\/Cognitive Networks research is developing the fundamental understanding of the interplay of the various aspects of the social and cognitive networks with information and communications.  Communications Networks research is developing the foundational techniques to model, analyze, predict, and control the behavior of secure tactical communication networks as an enabler for information and C2 networks.  Integration is focused on achieving an integrated Information Networks, Social\/Cognitive Networks, Communications Networks research program that significantly enhances the fundamental understanding of the underlying science of networks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.573"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Using human-in-the-loop and simulation-emulation experiments, along with collections of empirical data, extended, calibrated and validated theories and models of complex interactions between social, cognitive, information and communication networks, particularly in the evolution and propagation of information, trust and beliefs in insurgent-civilian populations, as well as in battle command decision-making under dynamic conditions and adversarial attacks."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.193"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Explore mathematical representations of dynamic communications, information, and social networks that enable the analysis of their joint behavior; develop techniques for discovering node roles and hierarchical structures in noisy, uncertain social networks, and techniques to maximize information (not bits) delivered based on quality of information needs and the context of decisions (semantics); and develop techniques for social and information-aware caching to improve performance and robustness of composite networks.  These efforts will result in analytical techniques for the design of better Army tactical networks that are more resilient in disruptive environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.500"
                                            },
                                            "Text": {
                                                "val": "Will develop an understanding and associated metrics representative of the relationship between security and network performance in the context of tactical and coalition networks by developing models of socio-cognitive trust and quantification of trust relationships and risk management; develop theories of quality of information, employing human-in-the-loop analysis, to model the tradeoffs between quality of information and efficiency of analysis on affecting the accuracy of analysis and data interpretation; and develop mathematical representations for the quality of information of static and dynamic data and its effectiveness for situational awareness.  These efforts will result in the identification of data for more accurate situational awareness."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mobile Network Modeling Institute"
                                    },
                                    "Description": {
                                        "val": "This research focuses on novel computational models, data structures, computational architectures and techniques that enable predictions of performance and stability of large, complex communications networks.  It takes into account the impact of Soldiers' information needs and modalities of access and use of communication networks in complex adversarial environments, high mobility, and adversarial effects such as jamming or cyber attacks.  Also considered are computational modeling approaches that capture dynamics of information that flows through the network and\/or is stored within the network, and undergoes continual changes as new information arrives and other information ages or is refuted\/superseded by newly arrived information; and the impact of clouds and local tactical cloudlets on network behaviors."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Will investigate approaches to computational modeling of large-scale networks that incorporate alternative routing techniques, such as trust-based or quality-based routing schemes; use computational experiments to inform study of pathological phenomena that might be induced in large-scale network behaviors by such novel schemes with unknown ramifications; explore impact of such models on existing computational architectures and their performance; and identify constraints on potential uses of alternative routing schemes on applicability of available computational modeling techniques."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H53"
                    },
                    "ProjectTitle": {
                        "val": "Army High Performance Computing Research Center"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.054"
                        },
                        "CurrentYear": {
                            "val": "4.899"
                        },
                        "BudgetYearOne": {
                            "val": "5.392"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.392"
                        },
                        "BudgetYearTwo": {
                            "val": "5.700"
                        },
                        "BudgetYearThree": {
                            "val": "5.785"
                        },
                        "BudgetYearFour": {
                            "val": "5.885"
                        },
                        "BudgetYearFive": {
                            "val": "5.993"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project supports critical research at the Army High Performance Computing Research Center (AHPCRC).  Research at the AHPCRC is focused on the Lightweight Combat Systems Survivability, computational nano- and bio-sciences, computational battlefield network and information sciences including evaluating materials suitable for armor\/anti-armor and sensor applications, defense from chemical and biological agents, and associated enabling technologies requiring computationally intensive algorithms in the areas of combat systems survivability, battlefield network sciences, chemical and biological defense, nanoscience and nanomechanics, and computational information sciences, scientific visualization enabling technologies that support the future force transition path.  This project also supports the Robotics Collaborative Technology Alliance (0601104\/project H09) which explores new opportunities to enable revolutionary autonomous mobility of unmanned systems for the future force.  This research is an integral part of the larger Army Robotics Program and feeds technology into Robotics Technology (0602120A\/project TS2).  The project also addresses research focusing on unmanned systems operating as a team with human supervisors and displaying a high degree of adaptability to dynamic environmental and tactical situations.  \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the U.S. Army Research Laboratory (ARL) in Adelphi, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "AHPCRC"
                                    },
                                    "Description": {
                                        "val": "The AHPCRC research mission is to advance computational science and its application to critical Army technologies through an Army-university-industry collaborative research program in such areas as combat systems survivability, and chemical and biological defense."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.054"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued to develop reduced order modeling (ROM) concepts for underbody blast problems by developing and solving high-fidelity fully-coupled blast-structure interaction applications and then developing appropriate complex mathematical formulations for accurate reduced models; developed scalable approaches for drug delivery through non-fluidic methods for Army medical applications; validated preliminary simulations for all electron battery; validated ion of back projection applications for battle command applications on new hybrid computing architecture; and investigated scalable algorithms for large-scale graphene modeling software and associated validation approaches with U.S. Army Research Laboratory experiments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.899"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Implement ROM approach for underbody blast application including occupant, improvised explosive device (IED) blast, and vehicle structural response; support verification and validation of ROM approach (with U.S. Army Research Development and Engineering Centers); implement nano-fluidic based multi-scale\/multi-physics approaches on scalable computers and support validation of this work for blood flow and drug delivery (with U.S. Army Medical Reseach and Materiel Command (MRMC)); develop domain specific language (DSL) for finite element-based approaches; explore emerging hybrid and memory hierarchy computer systems; and support education and outreach activities formerly funded in 0605803\/project 731."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.392"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.392"
                                            },
                                            "Text": {
                                                "val": "The goal of the ROM for underbody blast project is to develop predictive capability for practical underbody blast applications.  Earlier work demonstrated feasibility by adopting DoD engineering software Conventional Weapons Effects (ConWep).  This phase will develop highly non-linear mathematical formulations and implement fully coupled, high-fidelity blast-structure interaction problem-solving.  A number of new energy conserving algorithms in the context of ROM will be developed and implemented for this multi-physics transient application.  Will validate, verify and transition research software working with Army partners; continue exascale algorithms development under LISZTFE (domain specific finite element code) environment;  investigate a new class of direct solvers, called fast direct solvers (FDS), which use low-rank-matrix approximations to reduce the computational complexity; and transition software developed for blood transfusion and continue new scalable algorithmic development research for simulating inhalation of toxic agents for realistic patient-specific geometric features."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H54"
                    },
                    "ProjectTitle": {
                        "val": "Micro-Autonomous Systems Technology (MAST) CTA"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7.078"
                        },
                        "CurrentYear": {
                            "val": "8.092"
                        },
                        "BudgetYearOne": {
                            "val": "7.303"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.303"
                        },
                        "BudgetYearTwo": {
                            "val": "7.735"
                        },
                        "BudgetYearThree": {
                            "val": "7.851"
                        },
                        "BudgetYearFour": {
                            "val": "7.987"
                        },
                        "BudgetYearFive": {
                            "val": "8.131"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project fosters basic research through the Micro Autonomous Systems and Technology (MAST) Collaborative Technology Alliance (CTA), a competitively selected industry-university consortium which leverages world-class research necessary to address future force and Army Transformation needs. The CTA links a broad range of government technology agencies, as well as industrial and academic partners with the U.S. Army Research Laboratory (ARL).  The MAST CTA focuses on innovative research in four main technical areas related to the coherent and collaborative operation of multiple micro autonomous platforms: microsystem mechanics, processing for autonomous operation, microelectronics, and platform integration.  Payoff to the warfighter will be advanced technologies to support future force requirements in situational awareness.  The CTA facilitates the exchange of people among the collaborating organizations to provide cross-organizational perspectives on basic research challenges, and to make available to the Alliance state-of-the-art facilities and equipment at the participating organizations.   \n\nWork in this project complements and is fully coordinated with the U.S. Army Tank and Automotive Research, Development, and Engineering Center  (TARDEC); the U.S. Army Natick Soldier Research, Development, and Engineering Center (NSRDEC); and the U.S. Special Operations Command (SOCOM).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the U.S. Army Research Laboratory (ARL) in Adelphi, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Micro Autonomous Systems Technology CTA"
                                    },
                                    "Description": {
                                        "val": "Enhance tactical situational awareness in urban and complex terrain by enabling the autonomous operation of a collaborative ensemble of multifunctional mobile microsystems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.078"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Experimentally validated the ability of small air platforms to navigate autonomously in disturbed air and develop technology to allow micro ground platforms to move over rough terrain; and conducted experiments on the ability of small air and ground platforms to work collaboratively to enter and explore an urban structure."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.092"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Study and develop bio-inspired robotic platform mobility and control methods for Micro Autonomous Systems (MAS) in real world environments, sensors for on-board state estimation and perception, architectures and algorithms for heterogenous teaming; study trades between increased risk and uncertainty and increased operational tempo; and conduct joint experiments on emerging technology to assess the ability of small air and ground platforms to work collaboratively to enter and explore urban and complex three dimenstional (3-D) environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.303"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.303"
                                            },
                                            "Text": {
                                                "val": "Will investigate bio-inspired air and ground robotic platform mobility and control methods (for MAS in real world environments), sensors (for on-board state estimation and perception for size, weight, power, and processing constrained MAS), and architectures and algorithms (for heterogenous teaming, communications, and navigation); study trades between increased risk, uncertainty and increased operational tempo; and  conduct joint experiments on emerging MAS technology to assess the ability to support rapid and mobile Intelligence, Surveillance, and Reconnaissance for the Soldier in complex 3-D environments."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H59"
                    },
                    "ProjectTitle": {
                        "val": "International Tech Centers"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.615"
                        },
                        "CurrentYear": {
                            "val": "7.605"
                        },
                        "BudgetYearOne": {
                            "val": "6.097"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.097"
                        },
                        "BudgetYearTwo": {
                            "val": "7.027"
                        },
                        "BudgetYearThree": {
                            "val": "7.129"
                        },
                        "BudgetYearFour": {
                            "val": "7.251"
                        },
                        "BudgetYearFive": {
                            "val": "7.384"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project funds the International Technology Centers (ITCs), the Foreign Technology (and Science) Assessment Support (FTAS) program, and the Basic Research Center for Network Science located at the United States Military Academy (USMA).  \n\nThe nine ITCs located in Australia, the United Kingdom, Canada, France, Germany, Japan, Chile, Argentina, and Singapore support the Army's goals of providing the best technology in the World to our Warfighters by leveraging the Science and Technology (S&T) investments of our international partners.  The ITCs perform identification and evaluation of international technology programs to assess their potential impact on the Army's S&T investment strategy.  ITC 'technology finds' are submitted as technology information papers (TIPs) to various Army S&T organizations for evaluation and consideration for further research and development.  The ITC TIPs also serve as input into the international section of the Army S&T Master Plan.  The FTAS program builds upon the TIPs submitted by the ITCs.  In some cases the TIP is truly unique and may well meet an Army requirement or potentially support ongoing Army S&T investments.  In such cases, the FTAS program can provide initial resources (seed money) to fund basic research in these technology areas identified by the TIPs as having potential relevance to the Army's S&T plan.  The research will provide information useful in making early assessments of the technology's potential contributions to the Army's S&T strategy.  \n\nWork in this project related to the USMA Basic Research Center for Network Science is fully coordinated with and complementary to PE 0601104\/Project H50 (Network Science CTA). \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n       \nWork in this project is performed by Headquarters, U.S. Army Research, Development and Engineering Command (RDECOM), the U.S. Army Research Laboratory (ARL) in Adelphi, MD, and the United States Military Academy, NY."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "International Technology Centers (ITC)"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.743"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued to solicit projects and build on the success of the Foreign Technology (and Science) Assessment Support (FTAS) Program; and continued to enhance and refine technology search capabilities using customer feedback (U.S. Army Research Development and Engineering Centers (RDECs), Program Managers (PMs) and labs) to focus on near and long term capabilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.598"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to solicit projects and build on the success of the FTAS Program; and continue to enhance and refine technology search capabilities using customer feedback (RDECs, PMs and labs) to focus on near and long term capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.703"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.703"
                                            },
                                            "Text": {
                                                "val": "Will continue to solicit projects and build on the success of the FTAS Program; continue to enhance and refine technology search capabilities using customer feedback (RDECs, PMs and labs) to focus on near and long term capabilities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Basic Research Center in Network Science at the United States Military Academy (USMA)"
                                    },
                                    "Description": {
                                        "val": "Network science research at USMA in coordination with the Network Science CTA (0601104\/project H50)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.872"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigated cooperation networks and how those theoretical frameworks can improve systems and organizations; continued to research biological networks and implement those insights towards improvement in communication and organizational networks; and studied economic cascading events in order to better understand obstacles to the economic development of a country."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.007"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop an algorithm based on the convergence of \"vertex probabilities\" that will improve the ability to \"influence\" a social network; refine initial findings concerning cooperation networks and how these theoretical frameworks can improve systems and organizations; study network topologies and features linked to network vulnerabilities and efficient network-level power management; and study development of a new network classification model that assists policy makers with economic development strategy."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.394"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.394"
                                            },
                                            "Text": {
                                                "val": "Will continue to refine algorithms based on the convergence of \"vertex probabilities\" to improve the ability to \"influence\" networks; and continue to refine advances in cooperation networks to include how these theoretical frameworks can improve systems and organizations."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H64"
                    },
                    "ProjectTitle": {
                        "val": "MATERIALS CENTER"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.738"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project concentrates scientific resources on materials research for lightweight vehicle protection and is executed through Cooperative Research Agreements (CRAs).  The effort funds collaborative research in three Materials Science and Engineering Research Areas (MSERAs): Composite Materials Research; Advanced Metals and Ceramics Research; and Polymer Materials Research.  Each MSERA pursues thematic research thrusts that address topics pertinent to lightweight vehicle protection and that are aligned with the Army's strategic materials research vision enabling long term synergistic collaboration between the U.S. Army Research Laboratory (ARL) scientists and university researchers.  The Materials Cooperative Research Agreements provide for mutual exchange of personnel and sharing of research facilities with the University of Delaware, Johns Hopkins University, Rutgers University, Drexel University, and Virginia Polytechnic Institute and State University.  Lightweight, multi-functional composites, advanced armor ceramics, dynamic response of metals, protective polymer, and hybrid systems are emphasized.  \n\nWork in this project built fundamental knowledge supporting ARL in-house materials research projects (PE 0601102A\/ project H42) and accelerated the transition of technology to PE 0602105A (Materials Technology).  In FY12, work in this effort concluded.  In FY13, the advanced materials emphasis for the Army focuses on multi-disciplinary, multi-scale materials behavior in extreme environments conducted in PE 0601104A\/project VS2 (Multi-Scale Materials Modeling Centers). \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n \nWork in this project is performed by the U.S. Army Research Laboratory (ARL) in Aberdeen Proving Ground, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Materials Research for Vehicle Protection"
                                    },
                                    "Description": {
                                        "val": "Materials research for vehicle protection performs research and exploits promising breakthroughs in multi-functional composites, advanced armor ceramics, dynamic response of metals, protective polymers, and hybrid systems to enable revolutionary vehicle protection."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.738"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Finalized mechanism-based multi-scale approach to microstructure design for dynamic applications; and developed understanding of size effects in magnesium vis-a -vis etching and orientation for quantifying demonstrated enhanced mechanical properties.  Completed effort in FY13."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H73"
                    },
                    "ProjectTitle": {
                        "val": "Automotive Research Center (ARC)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.649"
                        },
                        "CurrentYear": {
                            "val": "4.193"
                        },
                        "BudgetYearOne": {
                            "val": "3.157"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.157"
                        },
                        "BudgetYearTwo": {
                            "val": "3.156"
                        },
                        "BudgetYearThree": {
                            "val": "3.203"
                        },
                        "BudgetYearFour": {
                            "val": "3.258"
                        },
                        "BudgetYearFive": {
                            "val": "3.318"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project fosters basic research in novel, high payoff technologies that can be integrated into Army ground platforms.  The Center of Excellence for Automotive Research is part of the basic research component of the National Automotive Center (NAC), a business group within the US Army Tank-Automotive Research, Development, and Engineering Center (TARDEC).  The Center of Excellence for Automotive Research is an innovative university\/industry\/government consortium leveraging commercial technology for potential application in Army vehicle systems through ongoing and new programs in automotive research, resulting in significant cost savings and performance enhancing technological opportunities.  The research performed in this project contributes to formulating and establishing the basic scientific and engineering principles for these technologies.  \n\nWork in this project complements and is fully coordinated with work under PE 0602601A (Combat Vehicle and Automotive Technology).  Selected university partners include:  University of Michigan, Virginia Tech, Wayne State University, University of Iowa, Oakland University, and Clemson University.  Key industry partners include all major US automotive manufacturers and suppliers.  The Automotive Research Center (ARC) formulates and evaluates advanced automotive technologies and advances state-of-the-art modeling and simulation for the Army's future ground vehicle platforms. \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by TARDEC, Warren, MI."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Automotive Research Center (ARC)"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.649"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conducted research in areas that included: non-traditional off-road vehicle dynamics and controls, soldier\/vehicle interaction modeling, high-performance\/lightweight structures and materials, advanced alternative propulsion systems including hybrids, strategic and innovative thermal management schemes, and vehicle system optimization and design for reliability with robustness.  Researched targeting key areas such as fuel economy, safety, system compactness, soldier\/vehicle performance, cost savings, vehicle control (including autonomous vehicles), and system optimality\/reliability."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.193"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Synthesize and test new hybrid propulsion concepts with novel energy conversion and storage devices; perform engine experiments with combustion modeling to characterize JP-8 performance; design lightweight and safe structures to address impact protection and reliability; integrate physical and cognitive human models to represent driving behavior; classify driver distraction, fatigue and stress; characterize Soft Soil Terra-mechanics and effects on mobility, safety and fuel economy; perform vehicle system integration through verification, validation and certification of vehicle tests, and multi-level vehicle design."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.157"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.157"
                                            },
                                            "Text": {
                                                "val": "Will develop valid predictive simulations tools that integrate design strategies that include reliability, product life management and human\/machine interactions. Will improve characterization and representation of human attributes, capabilities, responses, tolerance, and behaviors and employ this knowledge. Will pursue occupant centric vehicle structures that provide safety from explosive threats."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "J08"
                    },
                    "ProjectTitle": {
                        "val": "Institute For Creative Technologies (ICT)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7.134"
                        },
                        "CurrentYear": {
                            "val": "8.099"
                        },
                        "BudgetYearOne": {
                            "val": "7.500"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.500"
                        },
                        "BudgetYearTwo": {
                            "val": "6.125"
                        },
                        "BudgetYearThree": {
                            "val": "6.232"
                        },
                        "BudgetYearFour": {
                            "val": "6.356"
                        },
                        "BudgetYearFive": {
                            "val": "6.490"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project supports simulation and training technology research at the Army's Institute for Creative Technologies (ICT) at the University of Southern California.  The ICT was established as a University Affiliated Research Center (UARC) to support Army training and readiness through research into simulation and training technology for applications such as mission rehearsal, leadership development, health and medical, and distance learning.  The ICT actively performs research and engages industry to exploit dual-use technology and serves as a means for the military to learn about, benefit from, and facilitate the transfer of applicable technologies into military systems.  In addition the ICT works with creative talent from the entertainment industry to leverage techniques and capabilities and adapt concepts of story and character to increase the degree of participant immersion in synthetic environments in order to improve the realism and usefulness of these experiences.  In developing a true synthesis of the creativity, research, technology, and capability of industry and the research and development community, the ICT is revolutionizing capabilities for the Army by  making it more effective in terms of cost, time, range of experiences and the quality of the result.  Resulting research, techniques, and technologies and techniques are transitioned for maturation to PE 0602308A\/project D02.  \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n \nWork in this project is performed by the U.S. Army Research Laboratory (ARL) in Adelphi, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Immersive Environments"
                                    },
                                    "Description": {
                                        "val": "Conduct basic research in immersive environments, to include virtual humans, three dimensional (3-D) sound and visual media, to achieve more efficient and affordable training, modeling, simulation and application solutions and tools. Research includes investigation of techniques and methods to address the rapid development of synthetic environments and the study of perception and cognition to help direct the development of new technologies and techniques that evoke more realistic responses from users."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.773"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Implemented psychophysiology measures to improve the simulation fidelity of virtual immersive environments; and continued evaluation of techniques and methods to address the rapid development of synthetic environments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.111"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigate integrated augmented reality environments that add virtual elements (people, objects, and events) onto real world visualization for training and learning purposes; and examine techniques for the creation of virtual training content from sources such as mobile devices, mobile sensors, public databases, and sensor networks to make training and distance learning more accessible."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.888"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.888"
                                            },
                                            "Text": {
                                                "val": "Will investigate techniques for creating immersive environments and interactions with virtual humans on computing platforms with limited computational resources such as tablet computers and mobile devices; and assess effectiveness of techniques across a variety of contexts (e.g., training, mission rehearsal)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Graphics and Animations"
                                    },
                                    "Description": {
                                        "val": "Research will improve computational techniques in graphics for achieving real-time photo-realistic rendering of physical and synthetic environments for training and simulations.  Research into auditory aspects of immersion  provides the sound stimulus for increasing the realism for military training and simulation devices."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.588"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Researched the creation of photo-real characters and environments and demonstrate these capabilities; developed comprehensive facial performance capture techniques; developed software for rendering multiple faces; and completed the research investigation of high-fidelity eye models for virtual characters."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.878"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop facial animation techniques that accurately mimic human facial expressions; and develop a pipeline which combines automated rigging based on high-fidelity facial scans."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.725"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.725"
                                            },
                                            "Text": {
                                                "val": "Will research and develop new methods and algorithms in multi-view optical flow triangulation to align laser-scanned geometry with photographs to reconstruct missed data from previous data capture pipelines."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Techniques and Human-Virtual Human Interaction"
                                    },
                                    "Description": {
                                        "val": "Conduct basic research to investigate methods and techniques for improving the perception, communication, understanding, and responsiveness of virtual humans when interacting with live humans."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.773"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Integrated virtual human system with life-like graphics, facial and body animations and developed multiple forms of learning algorithms as a part of Virtual Humans; and developed group behavior prediction models and algorithms to include social cognition, social perception and social reactivity models and algorithms for virtual humans."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.110"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct evaluations of the social impact of virtual humans on human users and develop social cues that predict cooperative\/competitive orientation in a bargaining task to expand understanding of effectiveness of virtual characters as role players in training exercises; and implement graphical cognitive architecture into Virtual Humans that will lead to less complex but more human-like systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.887"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.887"
                                            },
                                            "Text": {
                                                "val": "Will conduct evaluations and develop theoretical design frameworks to identify the most cost-effective balance between virtual human fidelity and training effectiveness and investigate an individual's response to the human-like behaviors (e.g., persuasion, cultural biases, etc) of virtual role-players; extend virtual human cognitive architecture research to recognize various human behaviors and learn from the agent's past experiences; and investigate the use of linguistics and machine learning for automated knowledge acquisition allowing for the creation of more intelligent and communicative artificial agents."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "J12"
                    },
                    "ProjectTitle": {
                        "val": "Institute For Soldier Nanotechnology (ISN)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "9.287"
                        },
                        "CurrentYear": {
                            "val": "10.553"
                        },
                        "BudgetYearOne": {
                            "val": "6.713"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.713"
                        },
                        "BudgetYearTwo": {
                            "val": "6.125"
                        },
                        "BudgetYearThree": {
                            "val": "6.232"
                        },
                        "BudgetYearFour": {
                            "val": "6.356"
                        },
                        "BudgetYearFive": {
                            "val": "6.492"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project supports sustained multidisciplinary research at the Army's Institute for Soldier Nanotechnologies (ISN) at the Massachusetts Institute of Technology.  The ISN was established as a University Affiliated Research Center (UARC) to support research to devise nanotechnology-based solutions for the Soldier.  The ISN emphasizes revolutionary materials research for advanced Soldier protection and survivability.  The ISN works in close collaboration with the U.S. Army Research Laboratory (ARL), the U.S. Army Natick Soldier Research, Development and Engineering Center (NSRDEC), and other U.S. Army Research Development and Engineering Command (RDECOM) elements, as well as several major industrial partners, including Raytheon and DuPont, in pursuit of its goals.  This project emphasizes revolutionary materials research toward an advanced uniform concept.  The future uniform will integrate a wide range of functionality, including ballistic protection, responsive passive cooling and insulating, screening of chemical and biological agents, biomedical monitoring, performance enhancement, and extremities protection.  The objective is to lighten the Soldier's load through system integration and multifunctional devices while increasing survivability.  The new technologies will be compatible with other Soldier requirements, including Soldier performance, limited power generation, integrated sensors, communication and display technologies, weapons systems, and expected extremes of temperature, humidity, storage lifetimes, damage, and spoilage. \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n    \nWork in this project is performed by the U.S. Army Research Lab (ARL) in Adelphi, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Nanomaterials"
                                    },
                                    "Description": {
                                        "val": "Nanomaterials research efforts focus on light-weight, multifunctional nanostructured fibers and materials."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.322"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Examined carbon nanotube\/conducting polymer composite films assembled onto electrospun nanofibers to determine sensing properties; studied properties conferred by various functional group additions\/modifications to polymers for potential sensing applications; investigated the range of electrical robustness of conductive electrospun fibers for future signal communications; and investigated mechanical properties of electrospun materials."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.639"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Characterize a variety of quantum dot and graphene-based structures as detection elements for night vision applications; perform preliminary characterization of thermal properties at ceramic\/polymer interfaces that may provide materials for improved cooling and power generation from waste heat; model hybrid structure architectures of semiconductor materials within pre-drawn fibers to optimize the semiconductor performance within a fiber; and investigate methods for imaging light and sound within arrays of fibers designed for optical and acoustic detection."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.679"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.679"
                                            },
                                            "Text": {
                                                "val": "Will model, synthesize, and study nanoscale objects with tailored composition, size, and geometry that may lead to future applications in obscurant and optical broadband communications; design releasable layer-by-layer, assemblies of stabilized lipid nanocapsules on microneedles that may ultimately enable dynamic monitoring of disease states and enhanced vaccine delivery; model and synthesize nanotube-adsorbed polymer complexes that may provide completely synthetic analogues of antibodies and aptamers capable of detecting and recognizing neurotransmitters and other biologically relevant molecules; and model, synthesize, and characterize scalable and flexible nanoscale patterned metamaterial objects and photonic topological insulators that are able to dynamically respond to electromagnetic fields ranging from optical to microwave wavelengths, potentially providing future materials for integrated sensing or communication elements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Blast Effects on Soldier"
                                    },
                                    "Description": {
                                        "val": "Blast Effects on Soldier research involves the areas of Battle Suit Medicine and Blast and Ballistic Protection."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.643"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigated natural armor systems to determine related mechanical behavior and penetration resistance; explored how new biological-design concepts can be scaled to resist forces proportional to blast or ballistic impact; assessed new membranes for peptide immobilization and potential as a high-throughput assay of peptide activity; and synthesized and characterized continuous shape memory alloy fibers."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.276"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Synthesize a library of brain-lipid nanoparticles as a potential encapsulating agent for potential use in targeted therapies to treat traumatic brain injury; measure structure and properties of two-layer aluminum-alloy nanostructures for future design of improved lightweight materials with optimized strength, hardness and toughness; synthesize new protein-based hydrogels as tissue stimulants and test the effects of these hydrogels against blast and ballistic impact; and design and test atomistic level models for ceramic and polymer systems toward an ultimate multi-scalar model that provides more accurate predictive tools for material failure under blast and ballistic loading conditions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.356"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.356"
                                            },
                                            "Text": {
                                                "val": "Will evaluate and validate advanced large-scale modeling capabilities that may enable high-fidelity, full-scale simulations of the effect of blast and ballistic impact loading on soldier protection systems; computationally probe the physical mechanisms leading to the failure of bone tissue under dynamic compressive loading which may provide predictive models of blast injuries and improve the development of protective foot gear; and objectively define and model the neural correlates of mild traumatic brain injury (mTBI) produced by blast waves which may provide new methods to detect cognitive disorders resulting from mTBI."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier Protection"
                                    },
                                    "Description": {
                                        "val": "Soldier Protection research efforts focused on Soldier Survivability and Protection and Nanosystems Integration."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.322"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigated nanotube-based assemblies for detection of DNA and determining whether structures can be adapted to detect other chemicals and biological warfare agents; synthesized and characterized high-quality nanoscale virucidal and bactericidal coatings of sensory polymers using photochemical grafting and other fabrication methods; developed and characterized new fiber designs to determine structures that improve fiber sensing functionality; and functionalized surface of graphene sensing devices to confer different electrochemistries and determine changes in selectivity."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.638"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigate modification of a graphene surface toward the design, fabrication and testing of a first-generation graphene sensor optimized for the detection of food pathogens; determine various polymeric structures bound to carbon nanotubes and to screen these complexes against a panel of explosive compounds to potentially enable the future design of a highly-sensitive chemical detection platform; and investigate methods for fabrication and testing of artificial protein polymer hydrogels for potential use as a biodegradable hemostat that can stop blood flow from a wound."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.678"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.678"
                                            },
                                            "Text": {
                                                "val": "Will model and synthesize nanocomposite, metamaterial architectures and examine if and how these materials can guide and dissipate energy, potentially providing a method to dissipate blast energy for soldier protection; model, synthesize, and characterize nanostructured protein hydrogels under physiologically relevant conditions which may ultimately lead to a rapid field treatment option for hemorrhagic shock or other trauma; and explore and model the rate-dependent response of biological and synthetic gels to intense loadings over a broad range of length and time scales, which will guide the future design of compliant, protective materials."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "J14"
                    },
                    "ProjectTitle": {
                        "val": "Army Educational Outreach Program"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "8.691"
                        },
                        "CurrentYear": {
                            "val": "9.733"
                        },
                        "BudgetYearOne": {
                            "val": "9.550"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.550"
                        },
                        "BudgetYearTwo": {
                            "val": "9.466"
                        },
                        "BudgetYearThree": {
                            "val": "9.608"
                        },
                        "BudgetYearFour": {
                            "val": "9.773"
                        },
                        "BudgetYearFive": {
                            "val": "9.949"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Consolidated funds from PE 0605803\/project 729 and PE 06061104\/project J14 to align educational outreach program elements into a central funding line of accounting."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project supports science activities that encourage elementary\/middle\/high school and college youths to develop an interest in and pursue higher education and employment in the science, mathematics, and engineering (STEM) fields. These activities are consolidated within the Army Educational Outreach Program (AEOP) that links and networks appropriate components to derive the best synergies to present the Army to a larger pool of technical talent and to provide students with Army-unique practical experiences at Army laboratories, centers, and institutes to fill future Army Science and Technology workforce needs. AEOP increases interest and involvement of students and teachers across the nation in science, mathematics, and engineering at all proficiency levels and backgrounds to include under-represented and economically disadvantaged groups through exposure to Army sponsored research, education, competitions, internships, and practical experiences. This project enhances the national pool of science and engineering personnel that in turn supports defense industry and Army laboratory and research, development, and engineering center needs.\n\nIn FY13, activities and funds for educational outreach were consolidated from PE 0605803\/project 729 into PE 0601104\/project J14.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus area, the Army Modernization Strategy, the Department of Defense STEM Educational Outreach Strategic Plan and the President's \"Educate to Innovate\" campaign for STEM education.\n\nWork in this project is performed by the U.S. Army Research, Development, and Engineering Command (RDECOM), the U.S. Army Research Institute (ARI) for the Behavioral and Social Sciences, the U.S. Army Corps of Engineers' Engineer Research and Development Center (ERDC), the U.S. Army Medical Research and Materiel Command (MRMC), the U.S. Army Space and Missile Defense Command (SMDC), and the United States Military Academy (USMA)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "eCYBERMISSION"
                                    },
                                    "Description": {
                                        "val": "This program supports a nation-wide, web-based, science, technology, engineering and mathematics (STEM) competition for students in grades 6 through 9, designed to stimulate interest and encourage continued education in these areas among middle and high school students nationwide."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.053"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued to increase participation from existing levels with a concentrated effort in underserved populations; increased geographic diversity; sustained eCYBERMISSION; and implemented program enhancements based on lessons learned from previous years."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.887"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Increase participation from existing levels with a concentrated effort in underserved populations; increase geographic diversity; sustain eCYBERMISSION; and implement program enhancements based on lessons learned from previous years."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.775"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.775"
                                            },
                                            "Text": {
                                                "val": "Will continue STEM activities with a concentrated effort in underserved populations; increase geographic diversity; sustain eCYBERMISSION; and implement program enhancements based on lessons learned from previous years."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Educational Outreach and Workforce Development"
                                    },
                                    "Description": {
                                        "val": "In FY13, funds for this effort transferred from PE 0605803\/project 729 to align educational outreach program elements within a single Project."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.416"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued AEOP support to reach under-represented and economically disadvantaged areas to enhance STEM education through student experiences in Army labs and academic partner institutions; and mentored students to broaden their interest in and development of STEM education."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.430"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue AEOP support to reach under-represented and economically disadvantaged areas to enhance STEM education through student experiences in Army labs and academic partner institutions; and mentor students to broaden their interest in and their development of STEM education."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.400"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.400"
                                            },
                                            "Text": {
                                                "val": "Will continue AEOP support to reach under-represented and economically disadvantaged areas to enhance STEM education through student experiences in Army labs and academic partner institutions; and mentor students to broaden their interest in and their development of STEM education."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Army Educational Outreach Program Cooperative Agreement"
                                    },
                                    "Description": {
                                        "val": "The youth science cooperative outreach agreement (COA) encompasses a variety of outreach activities under AEOP.  This activity supports a strong partnership with government, academia and industry to address the shortfall of clearable STEM skilled talent preparing for the workforce.  These activities include Army-sponsored research, education, competitions, internships and practical experiences designed to engage and guide students and teachers in Army sponsored STEM programs.  The funding for this line item was consolidated from PE 0605803\/project 729."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.813"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued to increase Army lab and research center sponsorship of students and STEM education opportunities; provided competition incentives in STEM competitions that include scholarships, experiences, and mentorships as well as exposing students to DoD career opportunities; and streamlined processes, leveraged funding and built educational partnerships."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.073"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue Army lab and research center sponsorship of students and STEM education opportunities; provide competition incentives in STEM competitions that include scholarships, experiences and mentorships as well as expose students to DoD career opportunities; streamline processes, leverage funding and build educational partnerships; and perform annual comprehensive review and educational assessments to suppport future decisions and best practices."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.050"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.050"
                                            },
                                            "Text": {
                                                "val": "Will continue Army lab and research center sponsorship of students and STEM education opportunities; provide competition incentives in STEM competitions that include scholarships, experiences and mentorships as well as expose students to DoD career opportunities; streamline processes, leverage funding and build educational partnerships; and perform annual comprehensive review and educational assessments to support future decisions and best practices."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "West Point Cadet Research"
                                    },
                                    "Description": {
                                        "val": "In FY13, funds for this effort transferred from PE 0605803\/project 729 to align educational outreach program elements within a single Project."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.409"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conducted West Point cadet research internship programs to enhance cadet training through field experience within Army research labs and centers."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.343"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct West Point cadet research internship program to enhance cadet training through field experience within Army research labs and centers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.325"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.325"
                                            },
                                            "Text": {
                                                "val": "Will conduct West Point cadet research internship program to enhance cadet training through field experience within Army research labs and centers."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "J15"
                    },
                    "ProjectTitle": {
                        "val": "Network Sciences ITA"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.912"
                        },
                        "CurrentYear": {
                            "val": "4.122"
                        },
                        "BudgetYearOne": {
                            "val": "3.861"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.861"
                        },
                        "BudgetYearTwo": {
                            "val": "4.275"
                        },
                        "BudgetYearThree": {
                            "val": "4.339"
                        },
                        "BudgetYearFour": {
                            "val": "4.414"
                        },
                        "BudgetYearFive": {
                            "val": "4.493"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project supports research at a competitively selected United States (U.S.)\/United Kingdom (U.K.) government, university, and industry consortium established to perform fundamental network and information science investigations in the areas of network theory, system-of-systems security, sensor processing and delivery, and distributed coalition planning and decision making.  The focus is on enhancing distributed, secure, and flexible decision-making to improve coalition operations, and developing the scientific foundations for complex and dynamic networked systems-of-systems to support the complex human, social, and technical interactions anticipated in future coalition operations with the emphasis on integration of multiple technical disciplines in an international arena.  The U.S. Army Research Laboratory (ARL) and the U.K. Ministry of Defense (MOD) established the jointly funded and managed U.S. and U.K. consortium, known as the International Technology Alliance (ITA) on Network and Information Sciences, in FY06. \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.  \n \nWork in this project is performed by the U.S. Army Research Laboratory (ARL) at Adelphi, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Network and Information Science Basic Research for U.S.\/U.K. Coalition Operations Information"
                                    },
                                    "Description": {
                                        "val": "This research will address the fundamental science underpinning the complex information network issues that are vital to future U.S.\/U.K. coalition military operations and to fully exploit the joint development of emerging technologies necessary to enable coalition operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.912"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed scaling laws for hybrid networks with less restrictive assumptions regarding network homogeneity (relax the assumptions to account for variable bandwidth, network management information, etc.); and developed techniques for the management and control of hybrid coalition networks and techniques for the security of distributed services. These efforts contribute to the creation of novel capabilities to assist coalition Warfighters' capability to manage secure distribution of information in coalition networks, with efficiency and agility."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.122"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop controlled natural language that enables information extraction from structured and unstructured data sources to improve interactions between analyst and machine processing; develop techniques to enable dynamic group coalition information exchange in hybrid mobile ad hoc and cellular networks; and develop efficient and secure access to distributed data as a service among coalition partners without disclosure of security policies.  These efforts enhance network security and information sharing in coalition operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.861"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.861"
                                            },
                                            "Text": {
                                                "val": "Will develop integrated analysis algorithms of data derived from hybrid networks to aid analysts in performing projective analysis; develop techniques to provide risk averse and security conscious analysis capabilities to distributed mobile devices among coalition partners; and develop secure energy-aware and resource-aware access to distributed computing resources.  These efforts will enhance network and security analysis while improving the effective use of coalition resources available to the Warfighter."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "J17"
                    },
                    "ProjectTitle": {
                        "val": "Vertical Lift Research Center Of Excellence"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.473"
                        },
                        "CurrentYear": {
                            "val": "3.061"
                        },
                        "BudgetYearOne": {
                            "val": "2.885"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.885"
                        },
                        "BudgetYearTwo": {
                            "val": "3.053"
                        },
                        "BudgetYearThree": {
                            "val": "3.099"
                        },
                        "BudgetYearFour": {
                            "val": "3.153"
                        },
                        "BudgetYearFive": {
                            "val": "3.210"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project fosters research to provide vertical lift capability and engineering expertise for the Army. The focus of the Vertical Lift Research Center of Excellence is to couple state-of-the-art research programs with broad-based graduate education programs at academic institutions with the goal of increasing the supply of scientists and engineers who can contribute to Army Transformation.  Work will provide research into technologies that can improve tactical mobility, reduce the logistics footprint, and increase survivability for rotary wing vehicles.  \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.    \n  \nWork in this project is performed extramurally by the Aeroflightdynamics Directorate of the Aviation and Missile Research, Development, and Engineering Center (AMRDEC) (located at the NASA Ames Research Center, Moffett Field, CA)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Vertical Lift Research Center of Excellence"
                                    },
                                    "Description": {
                                        "val": "Began year two of new VLRCOE agreements with Penn State University, University of Maryland, and Georgia Institute of Technology; secured Navy and NASA funding to supplement a robust experimental and analytic basic research program in rotorcraft technologies including: Aeromechanics, Structures, Flight Dynamics and Control, Rotorcraft Design and Concepts, Vibration and Noise Control, Propulsion, Affordability, Safety and Survivability, and Naval Operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.473"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Implement year two of new VLRCOE agreements with Penn State University, University of Maryland, and Georgia Institute of Technology; secure Navy and NASA funding to supplement a robust experimental and analytic basic research program in rotorcraft technologies including: Aeromechanics, Structures, Flight Dynamics and Control, Rotorcraft Design and Concepts, Vibration and Noise Control, Propulsion, Affordability, Safety and Survivability, and Naval Operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.061"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Implement year three of VLRCOE agreements with Penn State University, University of Maryland, and Georgia Institute of Technology to conduct a robust experimental and analytic basic research program in rotorcraft technologies including: Aeromechanics, Structures, Flight Dynamics and Control, Rotorcraft Design and Concepts, Vibration and Noise Control, Propulsion, Affordability, Safety and Survivability, and Naval Operations"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.885"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.885"
                                            },
                                            "Text": {
                                                "val": "Will implement year four of VLRCOE agreements with Penn State University, University of Maryland, and Georgia Institute of Technology to conduct a robust experimental and analytic basic research program in rotorcraft technologies including: Aeromechanics, Structures, Flight Dynamics and Control, Rotorcraft Design and Concepts, Vibration and Noise Control, Propulsion, Affordability, Safety and Survivability, and Naval Operations."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "VS2"
                    },
                    "ProjectTitle": {
                        "val": "Multi-Scale Materials Modeling Centers"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7.700"
                        },
                        "CurrentYear": {
                            "val": "8.609"
                        },
                        "BudgetYearOne": {
                            "val": "9.639"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.639"
                        },
                        "BudgetYearTwo": {
                            "val": "9.364"
                        },
                        "BudgetYearThree": {
                            "val": "9.504"
                        },
                        "BudgetYearFour": {
                            "val": "9.668"
                        },
                        "BudgetYearFive": {
                            "val": "9.842"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project supports two competitively awarded Collaborative Research Alliances (CRAs) to provide the Army with next generation multi-functional materials for ballistic and electronic applications and to address the extreme challenges associated with understanding and modeling materials subject to Army operational environments. The Materials in Extreme Dynamic Environments consortium, led by Johns Hopkins University partnered with CalTech, Rutgers University, and University of Delaware, focuses on understanding materials under high strain-rates.  The Multiscale\/Multidisciplinary Modeling of Electronic Materials consortium, led by University of Utah partnered with Boston University, and Rensselaer Polytechnic Institute, focuses on microscale properties to design macroscale behavior for electronics.  Research at both CRAs will address the modeling and experimental challenges associated with developing multidisciplinary physics simulations across multiple length scales for materials to include: a limited ability to relate materials chemistry, structure, and defects to materials response and failure under extreme conditions; an inadequate ability to predict the roles of materials structure, processing, and properties on performance in relevant extreme environments and designs; and the lack of experimental capabilities to quantify multiscale response and failure of materials under extreme conditions.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the U.S. Army Research Laboratory (ARL) in Aberdeen Proving Ground, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Collaborative Research Alliances in Materials in Extreme Dynamic Environments and Multiscale Multidisciplinary Modeling of Electronic Materials."
                                    },
                                    "Description": {
                                        "val": "Research will focus on the following areas: two-way multiscale modeling for predicting performance and designing materials, investigating analytical and theoretical analyses to effectively define the interface physics across length scales; advancing experimental capabilities for verification and validation of multiscale physics; and modeling and strategies for the synthesis of high loading rate tolerant materials so that all of the latter lead to the development of a comprehensive set of metrics that define high loading rate tolerant material systems.  The multi-scale modeling capability will be applied across multiple disciplines to facilitate revolutionary advances in materials for coupled environments (electromagnetic, high rate, high pressure and other extreme environments)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.700"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Demonstrated real-time microstructural interrogation of materials during high-rate experiments; identified key microstructural phenomena related to high-rate deformation, fracture, and failure at critical length and time scales; and accurately predicted bulk dynamic properties based upon models built up from smaller size scales in each of the four selected material systems (metallic, polymeric, ceramic, and composite)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.609"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Model and characterize metallic, polymeric, ceramic and composite material systems response to extreme dynamic environments to enhance the fidelity of simulation codes that optimize hybrid multi-material protection for soldier and vehicle systems; implement physics-based modeling of electronic materials by developing a set of multiscale algorithms\/theories that enable better understanding of material, electronic, optical and opto-electronic properties; and develop multiscale models and algorithms that predict the bulk and interfacial properties of fuel cells and electrochemical energy sources.  Resulting models and algorithms enable the advancement of the next generation sensors and power and energy devices on the battlefield."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.639"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.639"
                                            },
                                            "Text": {
                                                "val": "Will conduct research to achieve a comprehensive \"materials-by-design\" capability to include designing materials and predicting key properties for materials in extreme dynamic environments through the integration of novel experimental methodologies and multiscale computational approaches; validate material characteristics and properties at length scales that govern high rate deformation, fracture and failure phenomena in metallic, polymeric, ceramic and composite material systems through both computational and experimental techniques; research fabrication technology for optimized polymeric, metallic, ceramic and composite systems; and investigate interface physics (with regards to strain, polarization, piezoelectric, electromagnetic phenomena and solid\/liquid boundaries).  Results will advance the state-of-the art in multiscale modeling for electronic materials to create a capability for \"materials optimization\" and \"materials by design\" supporting increased efficiency, source and detector lifetimes, increased power density (in electrochemical energy storage devices), and advancing the understanding of electronic materials to include interactions of electrons, photons, phonons, defects and impurities."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "VS3"
                    },
                    "ProjectTitle": {
                        "val": "Center For Quantum Science Research"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "5.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.000"
                        },
                        "BudgetYearTwo": {
                            "val": "5.221"
                        },
                        "BudgetYearThree": {
                            "val": "5.240"
                        },
                        "BudgetYearFour": {
                            "val": "5.261"
                        },
                        "BudgetYearFive": {
                            "val": "7.284"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "no funding for this program in FY14"
                        },
                        "ProjectMissionDescription": {
                            "val": "No funding for this program in FY14\n\nThis project supports two extramural research consortiums, each of which will bring together a critical mass of preeminent university researchers to explore and develop critical emerging concepts in Quantum Information Science (QIS).  Focus will be on two areas of QIS that are expected to provide disruptive impacts on Army warfighter capabilities, and to perform collaborative research with Army in-house scientists and engineers to help accelerate the transition of the research. One focus area will be on quantum simulations to provide previously unattainable capabilities to model and design high-performance materials crucial for the individual soldier and Army equipment. The other focus area is in precision measurement using quantum sensing and imaging to provide leap-ahead imaging capabilities that would have been considered impossible using classical physics and current state of the art engineering.  In addition to providing the required focused level of effort, the consortiums will also provide the broad unified multidisciplinary effort the field of QIS needs to accelerate progress, ranging from pure mathematics to engineering.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology focus areas, and the Army Modernization Strategy.\n\nWork in this project is performed by the U.S. Army Research Laboratory (ARL) in Adelphi, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Center for the Exploitation of Quantum Effects"
                                    },
                                    "Description": {
                                        "val": "This program supports critical quantum science basic research at the Army Research Laboratory exploiting quantum effects to greatly enhance computing, communication, imaging, sensing and security ensuring Army dominance on the future battlefield."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "Will research mapping between model quantum systems and the system whose properties need to be understood and controlled using atoms in optical lattices, ions in radio frequency (RF) traps, atoms in cavities with and without mechanical resonators, and other approaches; and conduct research to elucidate the role and creation of quantum resources such as superposition, entanglement, and entanglement swapping (including long-range and long-time as needed for quantum repeaters), in overcoming the limitations of classical systems."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}