{
    "id": "60f5917407a867ecd37b506919e06e2d04fc8ff6",
    "meta": {
        "filename": "dod-2015_RDTE_2015_NAVY_BA4_RDTE_JustificationBook_Navy_PB_2015.zzz_unzipped_RDTE_JustificationBook_Navy_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603609N"
        },
        "ProgramElementTitle": {
            "val": "Conventional Munitions"
        },
        "R1LineNumber": {
            "val": "52"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "200.037"
            },
            "PriorYear": {
                "val": "6.717"
            },
            "CurrentYear": {
                "val": "8.404"
            },
            "BudgetYearOne": {
                "val": "7.603"
            },
            "BudgetYearOneBase": {
                "val": "7.603"
            },
            "BudgetYearTwo": {
                "val": "9.210"
            },
            "BudgetYearThree": {
                "val": "8.446"
            },
            "BudgetYearFour": {
                "val": "8.530"
            },
            "BudgetYearFive": {
                "val": "8.704"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Most Navy munitions react violently when exposed to unplanned stimuli such as fire, shock and bullet or fragment impact, thus presenting a great hazard to ships, aircraft and personnel. The Insensitive Munitions Advanced Development (IMAD) program will provide, validate, and transition technology to all new weapon developments and priority weapon systems and enable production of munitions insensitive to these stimuli with no reduction in combat performance. Insensitive Munitions (IM) is the Navy's focused effort on propellants, propulsion units, explosives, warheads, fuses and pyrotechnics to reduce the severity of cook-off and bullet\/fragment impact reactions, minimizing the probability for sympathetic detonation, both in normal storage and in use, increasing ship and platform survivability and satisfying performance and readiness requirements."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "7.342"
                },
                "CurrentYear": {
                    "val": "8.404"
                },
                "BudgetYearOne": {
                    "val": "8.548"
                },
                "BudgetYearOneBase": {
                    "val": "8.548"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "6.717"
                },
                "CurrentYear": {
                    "val": "8.404"
                },
                "BudgetYearOne": {
                    "val": "7.603"
                },
                "BudgetYearOneBase": {
                    "val": "7.603"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.625"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.945"
                },
                "BudgetYearOneBase": {
                    "val": "-0.945"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.014"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.945"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.945"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.611"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical: FY15 $0.945 in other rate adjustments."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0363"
                    },
                    "ProjectTitle": {
                        "val": "Insensitive Munitions Adv. Development"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "200.037"
                        },
                        "PriorYear": {
                            "val": "6.717"
                        },
                        "CurrentYear": {
                            "val": "8.404"
                        },
                        "BudgetYearOne": {
                            "val": "7.603"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.603"
                        },
                        "BudgetYearTwo": {
                            "val": "9.210"
                        },
                        "BudgetYearThree": {
                            "val": "8.446"
                        },
                        "BudgetYearFour": {
                            "val": "8.530"
                        },
                        "BudgetYearFive": {
                            "val": "8.704"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Each technology area is divided into subtasks addressing specific munition\/munition class IM deficiencies. Energetic materials producibility is demonstrated to assure national capability to produce and load munitions systems. The program leverages are being closely coordinated with other military departments, North Atlantic Treaty organization (NATO) and allied countries to eliminate redundant efforts and maximize efficiency. A joint service IM requirement has been developed and through the IM strategic planning process, all Program Executive Offices (PEO) are implementing IM in their priority munitions. IM are identified as a Department of Defense (DoD) critical technology requirement and considered as part of a weapon design. The IMAD program matures the technology developed by a variety of Science and Technology (S&T) sources for program management integration into weapons systems to meet the IM technical deficiencies documented in the PEO IM Strategic Plans. IMAD provides the link between S&T programs and the program managers (PM) by optimizing IM technologies to meet Navy requirements. IMAD offers risk mitigation for the PMs in terms of IM technical knowledge, expertise and manpower with the state of the art expertise across IM products. Each technology area is divided into subtasks addressing specific munition and munition class IM deficiencies."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Insensitive Munitions Adv. Development"
                                    },
                                    "Description": {
                                        "val": "Validate and assess weapon systems plan of action and milestones for IM compliance. Review Insensitive Munitions Strategic Plan (IMSP) for Navy compile and analyze weapon system, energetic material and generic technology IM test data. Perform Threat Hazard Assessments (THAs). Perform analysis of energetic material properties logistic process. Review IM certification and waivers. Support Insensitive Munitions Council (IMC), Insensitive Munitions Coordination Group (IMCG), and IMC Working Group. Support and develop Insensitive Munitions Technology Tool (IMT2). Support North Atlantic Treaty Organization Standardization Agreement (NATO STANAG) and Advanced Operations (AOP) development. Support IMAD program briefs. Support all Navy Joint Services Insensitive Munitions Technical Panel (JSIMTP) meetings. Support Explosive Safety Working Group (ESWG) meetings. Provide task management support for financial management, review of programmatic deliverables and overall task coordination."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.717"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Evaluated and demonstrated IM propellants and propulsion systems which provide improved or comparable performance to in-service systems and better IM characteristics. Combined candidate IM propellants and case concepts to demonstrate compliance with IM and performance requirements. Demonstrated an insensitive multi-mission, high performance rocket motor. Evaluated options for minimum smoke propellants for shoulder launched applications. Evaluated and demonstrated IM boost propellant formulation for future Tomahawk systems providing improved and comparable performance to in-service systems and better IM characteristics. Assessed combined candidate IM propellants and case concepts to demonstrate compliance with IM and performance requirements. Designed a composite booster case for Tomahawk which will improve IM performance for cook-off and impact scenarios. Demonstrated new formulations that will self extinguish while maintaining performance for Advanced Medium Range Air-to-Air Missile (AMRAAM), Sidewinder and other air launched systems. Looked at new ways to develop rocket propellant formulations that meet performance requirements and solve IM deficiencies. Resolved IM problems using top down approach. Evaluated ordnance and container concepts.  Modeled applications that could reduce and enhance IM warhead container design. Assessed the operations utility of current and projected IM improvements to determine current state of IM and prioritize future funding for IM technology. Assessed shielding evaluation of Tomahawk Vertical Launch System (VLS) storage canister. Reviewed modeling to solve impact and cook-off with All Up Round (AUR) pallet in support of a cooperative effort with Advanced Gun System Long Range Land Attack Projectile (AGS LRLAP). The technical focus is on new weapons and product improvement programs (PIP).  IMAD works collaboratively with the Joint IM Technology Program (JIMTP) to transition JIMTP's S&T products to address PEO IM requirements.  The PEOs IMSPs provide a comprehensive IM technology requirements list that helps to focus IM technology thrusts throughout DoD.\n\nAdditionally, in FY 2013 the program evaluated and demonstrated MK54 Vertical Launched Anti-Submarine Rocket (ASROC) (VLA) solid propellant rocket IM capabilities that meet performance.  Demonstrated and qualified Tomahawk weapon systems to include improved booster explosives and insensitive metalized propellants that are IM compliant.  Conducted an evaluation of all issues and concerns related to heated RDX discoloration. Performed a demonstration and qualification test of AMRAAM and Sidewinder for joint insensitive munitions to improve response to combat and hazards.  Evaluated and provided a modular ballistic shield for protection of navy munitions.  Assessed characterization of Micro-Electro-Mechanical System (MEMS) in support of IM Navy qualifications.  Demonstrated and qualified insensitive primer for large caliber gun propellant charges."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.404"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Evaluate and demonstrate IM propellants and propulsion systems which provide improved or comparable performance to in-service systems and better IM characteristics. Combine candidate IM propellants and case concepts to demonstrate compliance with IM and performance requirements. Demonstrate an insensitive multi-mission, high performance rocket motor. Evaluate options for minimum smoke propellants for shoulder launched applications. Evaluate and demonstrate IM boost propellant formulation for future Tomahawk systems providing improved and comparable performance to in-service systems and better IM characteristics. Assess combined candidate IM propellants and case concepts to demonstrate compliance with IM and performance requirements. Design a composite booster case for Tomahawk which will improve IM performance for cook-off and impact scenarios.  Look at new ways to develop rocket propellant formulations that meet performance requirements and solve IM deficiencies. Resolve IM problems using top down approach. Evaluate ordnance and container concepts.  Assess the operations utility of current and projected IM improvements to determine current state of IM and prioritize future funding for IM technology. Assess shielding evaluation of Tomahawk VLS storage canister. Review modeling to solve impact and cook-off with AUR pallet in support of a cooperative effort with AGS LRLAP. The technical focus is on new weapons and PIP.  Evaluate and demonstrate MK54 ASROC VLA solid propellant rocket IM capabilities that meet performance.  Demonstrate and qualify improved booster explosives and insensitive metalized propellants that are IM compliant for Tomahawk weapon systems.  Evaluation of all issues and concerns related to heated RDX discoloration. Perform demonstration and qualification testing of AMRAAM and Sidewinder for joint insensitive munitions to improve response to combat and hazards.  Evaluate and provide a modular ballistic shield for protection of Navy munitions.  Assess characterization of MEMS in support of IM Navy qualifications.  Demonstrate and qualify insensitive primer for large caliber gun propellant charges.  IMAD works collaboratively with the JIMTP to transition JIMTP's S&T products to address PEO IM requirements.  The PEOs IMSPs provide a comprehensive IM technology requirements list that helps to focus IM technology thrusts throughout DoD.\n\nAdditional resources are necessary in FY 2014 to support additional efforts such as: the demonstration and qualification of IM improved booster explosive for General Purpose (GP) Bombs; the demonstration and qualification of insensitive metalized propellants in IM compliant rocket motors for high performance systems such as Standard Missile and Tomahawk; and to perform process development of cook-off resistant Thermoplastic Plastomer Explosives (TPE) a potential replacement for all explosives."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.603"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.603"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Evaluate and demonstrate IM propellants and propulsion systems which provide improved or comparable performance to in-service systems and better IM characteristics. Combine candidate IM propellants and case concepts to demonstrate compliance with IM and performance requirements. Demonstrate an insensitive multi-mission, high performance rocket motor. Evaluate options for minimum smoke propellants for shoulder launched applications. Evaluate and demonstrate IM boost propellant formulation for future Tomahawk systems providing improved and comparable performance to in-service systems and better IM characteristics. Assess combined candidate IM propellants and case concepts to demonstrate compliance with IM and performance requirements. Design a composite booster case for Tomahawk which will improve IM performance for cook-off and impact scenarios.  Look at new ways to develop rocket propellant formulations that meet performance requirements and solve IM deficiencies. Resolve IM problems using top down approach. Evaluate ordnance and container concepts.  Assess the operations utility of current and projected IM improvements to determine current state of IM and prioritize future funding for IM technology. Assess shielding evaluation of Tomahawk VLS storage canister. Review modeling to solve impact and cook-off with AUR pallet in support of a cooperative effort with AGS LRLAP. The technical focus is on new weapons and PIP.  Evaluate and demonstrate MK54 ASROC VLA solid propellant rocket IM capabilities that meet performance.  Demonstrate and qualify improved booster explosives and insensitive metalized propellants that are IM compliant for Tomahawk weapon systems.  Evaluation of all issues and concerns related to heated RDX discoloration. Perform demonstration and qualification testing of AMRAAM and Sidewinder for joint insensitive munitions to improve response to combat and hazards.  Evaluate and provide a modular ballistic shield for protection of Navy munitions.  Assess characterization of MEMS in support of IM Navy qualifications.  Demonstrate and qualify Insensitive Primer for large caliber gun propellant charges.  IMAD works collaboratively with the JIMTP to transition JIMTP's S&T products to address PEO IM requirements.  The PEOs IMSPs provide a comprehensive IM technology requirements list that helps to focus IM technology thrusts throughout DoD.\n\nFY 2015 will also support additional efforts such as: the demonstration and qualification of IM improved booster explosive for GP Bombs; the demonstration and qualification of insensitive metalized propellants in IM compliant rocket motors for high performance systems such as Standard Missile and Tomahawk; and to perform process development of cook-off resistant Thermoplastic Plastomer Explosives (TPE) a potential replacement for all explosives."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "IMAD is assigned as a non-ACAT program and therefore does not have program milestones like the ACAT I to IV programs. IMAD develops and evaluates IM technologies for use in Navy weapon systems and is not part of a particular weapon acquisition program."
                        },
                        "PerformanceMetrics": {
                            "val": "Quarterly program reviews"
                        }
                    }
                }
            ]
        }
    }
}