{
    "id": "6174ef0eb5e2d77a7944bb0d171f9d03ca8ded73",
    "meta": {
        "filename": "dod-2015_RDTE_2015_OSD_RDTE_JustificationBook_Office_of_Secretary_Of_Defense_PB_2015.zzz_unzipped_RDTE_JustificationBook_Office_of_Secretary_Of_Defense_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602663D8Z"
        },
        "ProgramElementTitle": {
            "val": "Data to Decisions Applied Research"
        },
        "R1LineNumber": {
            "val": "17"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "8.605"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "Change from FY 2013 to FY 2014 reflects a realignment of the program from the Data to Decisions Applied Research program element (PE) 0602663D8Z to higher Department of Defense (DoD) priorities.\n\nThe goals of this program will be shifted to the DoD Components under the direction of the Research and Engineering (R&E) Executive Committee and will conform with the DoD Data to Decision Priority Steering Council roadmaps.  Historically, the Joint Data Management program was restructured to evolve into the revised Data to Decisions Applied Research program, a FY 2012 new start, in support of the 2010 Quadrennial Defense Review mission:  Succeed in counterinsurgency, stability, and counterterrorism operations.  In addition, this program addresses a signed Secretary of Defense S&T priority, Data to Decisions, which reduces the cycle time and manpower requirements for analysis and use of large data sets."
        },
        "ProgramElementMissionDescription": {
            "val": "The DoD response to a changing threat environment includes an expansion of the types of sensors deployed, new types of information collected, and different features used to classify these new threats.  As the DoD increases the capability and capacity to generate increasing amounts of data from numerous sensors in the battlespace, the issue of handling very large data sets has become more challenging.  From a technical perspective, data creation speeds have outpaced the speed and ability to transport, store, and process the data created.  S&T investigation into new and novel ways to manage and exploit this data is required to more efficiently use sensor assets and effectively use information in a timely fashion.\n\nThe Office of the Secretary of Defense (OSD) Data to Decisions program (PEs 0602663D8Z and 0603663D8Z) uniquely addresses three specific gap areas not addressed by Component S&T:  minimal dedicated Data to Decisions research to support Joint and emerging mission areas; DoD needs a mechanism to increase responsiveness of Component Data to Decisions research and lower the time-to-solution across a broad DoD-wide user base; and limited investment in multi-disciplinary research investigations of Data to Decisions issues and solutions.  The OSD Data to Decisions program pulls together research efforts to address shortfalls within the context of Joint and emerging missions to ensure that the distinctive needs of these joint analysts and decision makers are addressed by DoD science and technology.  As an example, irregular warfare, non-state terrorism movements, and uncertain environmental patterns that trigger major weather disasters are producing a reality for military and government leaders where traditional physics-based sensors alone are insufficient to plan current and future actions in a region of interest or need.  Component Data to Decisions efforts focus on developing technology to overcome a particular challenge within a mission or to advance a particular priority area of that Component.  As a result, the R&E Database has over 388 references to Decision Support programs; all of which are designed to address a specific need over the course of several years.  However, there exists no other program in the DoD that focuses on technology development efforts to speed the delivery of the Component solutions and lessons learned to a DoD-wide user base.  The OSD Data to Decisions program provides the common platform (access to datasets, infrastructure, and metrics) to integrate and evaluate the technology development and research methods to support various missions driven by the challenge problems.  This ability to rapidly evaluate technology development and research methods will allow technology transfer for mission analysis not previously foreseen and lower the time-to solution across DoD by rigorously analyzing technical performance for more immediate use.  Traditional approaches within research seek to advance machine systems for a specific mission effect resulting in large complex data sets.  While necessary for sensor system improvements, potential Data to Decisions solutions require a coupling of automated data analysis with human analysts, operators, and decision makers in order to reduce time and limit the number of people required.  Many research studies, workshops, and analysis have stated that solutions to data issues are multi-disciplinary.  The OSD Data to Decisions program is in the unique position to reach across Components and research disciplines to blend promising research in new ways in response to cross-service Challenge Problem statements.  For Challenge Problems, contextual understanding will result from research combining human sciences with computer processing techniques to take advantage of a person’s cognitive ability to fuse and assimilate multiple sources and types of information for new insights."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "13.753"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "8.605"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-5.148"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-5.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "-0.696"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "-0.012"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.752"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.189"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.003"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P266"
                    },
                    "ProjectTitle": {
                        "val": "Data to Decisions Applied Research"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "8.605"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Change from FY 2013 to FY 2014 reflects a realignment of the program from the Data to Decisions Applied Research program element (PE) 0602663D8Z to  higher Department of Defense (DoD) priorities."
                        },
                        "ProjectMissionDescription": {
                            "val": "The OSD Data to Decisions (D2D) program (PEs 0602663D8Z and 0603663D8Z) uniquely addresses three specific gap areas not addressed by Component Science and Technology (S&T):  (1) minimal dedicated D2D research to support Joint and emerging mission areas; (2) DoD needs a mechanism to increase responsiveness of Component D2D research and lower the time-to-solution across a broad DoD-wide user base; and (3) limited investment in multi-disciplinary research investigations of D2D issues and solutions.\n\nThe D2D program establishes the demonstration and experimentation environment to conduct independent evaluations of research efforts that have the most potential of minimizing the impact of the increasing amount of information available and required to support military operational decision-making.  The intent is to leverage existing research investments within defense S&T and provide proper evaluations and assessments to facilitate technology transition.  The Applied Research program concentrates on the development portion of this collaborative effort, focusing on the development of improved algorithms, relative to FY 2012 state of the art, to be demonstrated and validated in the 6.3 D2D program test bed.  The D2D Advanced Development (6.3) program uses a spiral development model with four-steps.  Each year Operational teams will choose a series of cross-service challenge problems dominated by a specific sensing modality.  Representative data for each of those problems will then be collected for testing against that problem.  A Development team will design algorithms and data management architectures using high-level languages and self-test on controlled data sets to address those challenge problems.  Independent assessment will occur with sequestered data sets, but each development tool will also be tested against new sensors not included in the self-testing to determine fragility and applicability.  A Transition team will host the developed algorithms as services in a spiraling prototype system that will support rapid prototyping and transition."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Moving Intelligence (MOVINT) Analytics"
                                    },
                                    "Description": {
                                        "val": "MOVINT analytics is concerned with developing algorithms to exploit full motion video, Ground Moving Target Indication (GMTI), Communications Intelligence (COMINT), and other forms of MOVINT.  These algorithms will be implemented in software modules that can be cast as services on a Service-Oriented Architecture.  Representative modules include trackers, activity based analytics, behavior detection, start-stop detectors, and others."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.302"
                                            },
                                            "Text": {
                                                "val": "- Conducted bottom-up analysis of a single workflow to identify functions controlling performance.\n- Initiated efforts to provide management of uncertainty by simultaneously controlling sensing and processing.\n- Evaluated technology implementation of common functions that occur in the wide area motion imagery problem space.\n- Reviewed projects to determine if they should continue as DoD Component programs, can be completed at the end of FY 2013, or cancelled as soon as practical."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Text Analytics"
                                    },
                                    "Description": {
                                        "val": "Text Analytics, a term used to identify a set of linguistic, statistical, and machine learning techniques that model and structure the information content of textual sources for exploratory data analysis, research, and investigation¸ play a vital role in achieving open-source intelligence (OSINT) and human intelligence (HUMINT) capabilities that inform timely and accurate situational awareness in time-constrained, uncertain, and complex environments.  With the recent advances in online social media and the proliferation of mobile communication devices, text information is available in unprecedented amounts and formats and thus represents an opportunity to engage in research for information retrieval, lexical analysis to study word frequency, and data mining techniques including link and association analysis, visualization, and predictive analytics."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.303"
                                            },
                                            "Text": {
                                                "val": "- Researched information representation methods to enable faster and more efficient detection of social networks in complex, incomplete, imprecise, and potentially contradictory large data sets.\n- Researched methods to enable analysts to operate more efficiently, leverage non-traditional data sources, and more effectively identify objects of interest\n- Reviewed projects to determine if they should continue as DoD Component programs, can be completed at the end of FY 2013, or cancelled as soon as practical."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "BA 3, PE# 0603663D8Z, P366"
                                    },
                                    "Title": {
                                        "val": "Data to Decisions Advanced Development"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "9.217"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "Change from FY 2013 to FY 2014 reflects a realignment of the program from the Data to Decisions Advanced Development PE 0603663D8Z to higher Department of Defense (DoD) priorities.  The goals of the program will be shifted to the DoD Components under the direction of the Research and Engineering Executive Committee and will conform with the DoD Data to Decision Priority Steering Council roadmaps."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}