{
    "id": "665e5fc05aafaadff62672a1df6a1d50c9a96766",
    "meta": {
        "filename": "dod-2015_RDTE_2015_ARMY_BA2_RDTE_JustificationBook_Army_PB_2015.zzz_unzipped_RDTE_JustificationBook_Army_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602787A"
        },
        "ProgramElementTitle": {
            "val": "MEDICAL TECHNOLOGY"
        },
        "R1LineNumber": {
            "val": "28"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "98.023"
            },
            "CurrentYear": {
                "val": "93.290"
            },
            "BudgetYearOne": {
                "val": "76.068"
            },
            "BudgetYearOneBase": {
                "val": "76.068"
            },
            "BudgetYearTwo": {
                "val": "77.330"
            },
            "BudgetYearThree": {
                "val": "77.544"
            },
            "BudgetYearFour": {
                "val": "82.783"
            },
            "BudgetYearFive": {
                "val": "83.412"
            }
        },
        "ProgramElementNote": {
            "val": "FY13 adjustments attributed to Congressional General Reductions (-212 thousand); SBIR\/STTR transfers (-1.579 million); Sequestration reductions (-8.912 million) and internal Army reprogrammings (835 thousand)\nFY15 reduction attributed to realignment to other higher priority Army programs."
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) supports application of knowledge gained through basic research to refine drugs, vaccines, medical devices, diagnostics, medical practices\/procedures, and other preventive measures essential to the protection and sustainment of Warfighter health. Research is conducted in five principal areas: Combat Casualty Care; Military Operational Medicine; Military Relevant Infectious Diseases Clinical and Rehabilitative Medicine; and Systems Biology\/Network Sciences. Research is funded in six projects.  \n\nProject 869 refines knowledge and technologies on screening tools and preventive measures for post-traumatic stress disorder and mild traumatic brain injuries, physiological monitors, and interventions to protect Soldiers from injuries resulting from operational stress, and exposure to hazardous environments and materials. Also conducts research on medically valid testing devices and predictive models used for the refinement of Soldier protective equipment. This project is being coordinated with the Defense Health Program.  \n\nProject 870 designs and refines medical diagnostic devices, drugs, and vaccines for protection and treatment against naturally occurring diseases and wound infections of military importance, as identified by worldwide medical surveillance and military threat analysis. This project is being coordinated with the Defense Health Program.  \n\nProject 873 conducts research on HIV, which causes acquired immunodeficiency syndrome (AIDS). Work in this area includes refining improved identification methods to determine genetic diversity of the virus, preclinical work in laboratory animals including non-human primates to identify candidates for future vaccine refinement, and evaluating and preparing overseas sites for future vaccine trials. This project is being coordinated with the Defense Health Program, (DHP). This effort and associated funding was transferred to DHP starting FY14.\n\nProject 874 identifies and evaluates drugs, biologics (products derived from living organisms), medical devices, and diagnostics for resuscitation, life support, and post-evacuation restorative and rehabilitative care, as well as trauma care systems for use by field medics and surgeons. Research focus is on identifying more effective critical care technologies and protocols to treat severe bleeding, traumatic brain injury and other blast related injuries, and treatments for ocular injury and visual system dysfunction, as well as laboratory and animal studies of regenerating skin, muscle, nerves, and bone tissue for the care and treatment of battle-injured casualties. This project is being coordinated with the Defense Health Program. \n\nProject FH2 conducts applied research directed toward the sustainment of a healthy force of Warfighters through the entire deployment life cycle.  \n\nProject VB4 conducts applied research in systems biology to provide a highly effective mechanism to integrate iterative biological tests, computer simulations, and animal studies.  Such refinement efforts using systems biology could ultimately reduce the time and effort invested in medical product refinement. This project is being coordinated with the Defense Health Program.\n\nProject VJ4 examines the mental and behavioral health of Soldiers to counter suicidal behavior. This work focuses on advancing the understanding of the multiple determinants of suicidal behavior, psychopathology (study of the causes and nature of abnormal behavior), psychological resilience, and role functioning. Work on this project is being performed by the National Institute of Mental Health through extramural cooperative research grants in collaboration with the Department of the Army. This project is being coordinated with the Defense Health Program.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology, focus areas and the Army Modernization Strategy.\n\nAll medical applied research is conducted in compliance with U.S. Food and Drug Administration (FDA) or Environmental Protection Agency (EPA) regulations. The FDA requires thorough testing in animals (referred to as preclinical testing) to ensure safety and, where possible, effectiveness prior to evaluation in controlled human clinical trials (upon transition to 6.3 Advanced Technology Development). This PE focuses on research and refinement of technologies such as product formulation and purification and assay refinement with the aim of identifying candidate solutions. This work often involves preclinical testing in animals. The EPA also requires thorough testing of products, such as sterilants, disinfectants, repellents, and insecticides to ensure the environment is adequately protected before these products are licensed for use.\n\nProgram refinement and execution is externally peer-reviewed and fully coordinated with all Services as well as other agencies through the Joint Technology Coordinating Groups of the Armed Services Biomedical Research Evaluation and Management (ASBREM) Committee. The ASBREM Committee serves to facilitate coordination and prevent unnecessary duplication of effort within the Department of Defenses (DoD) biomedical research and refinement community, as well as their associated enabling research areas.\n\nWork funded in this project PE is fully coordinated with efforts undertaken in PE 0603002A and the Defense Health Program.\n\nWork in this PE is performed by the Walter Reed Army Institute of Research (WRAIR), Silver Spring, MD and its overseas laboratories; U.S. Army Medical Research Institute of Infectious Diseases (USAMRIID) and the Armed Forces Institute of Regenerative Medicine (AFIRM), Fort Detrick, MD; U.S. Army Research Institute of Environmental Medicine (USARIEM), Natick, MA; the U.S. Army Dental Trauma Research Detachment and the U.S. Army Institute of Surgical Research (USAISR), Fort Sam Houston, TX; U.S. Army Aeromedical Research Laboratory (USAARL), Fort Rucker, AL; and the Naval Medical Research Center (NMRC), Silver Spring, MD."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "107.891"
                },
                "CurrentYear": {
                    "val": "93.340"
                },
                "BudgetYearOne": {
                    "val": "83.115"
                },
                "BudgetYearOneBase": {
                    "val": "83.115"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "98.023"
                },
                "CurrentYear": {
                    "val": "93.290"
                },
                "BudgetYearOne": {
                    "val": "76.068"
                },
                "BudgetYearOneBase": {
                    "val": "76.068"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-9.868"
                },
                "CurrentYear": {
                    "val": "-0.050"
                },
                "BudgetYearOne": {
                    "val": "-7.047"
                },
                "BudgetYearOneBase": {
                    "val": "-7.047"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.212"
                    },
                    "CurrentYear": {
                        "val": "-0.050"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.835"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.579"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-7.047"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-7.047"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Sequestration"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-8.912"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "869"
                    },
                    "ProjectTitle": {
                        "val": "Warfighter Health Prot & Perf Stnds"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "34.378"
                        },
                        "CurrentYear": {
                            "val": "34.709"
                        },
                        "BudgetYearOne": {
                            "val": "31.603"
                        },
                        "BudgetYearOneBase": {
                            "val": "31.603"
                        },
                        "BudgetYearTwo": {
                            "val": "30.668"
                        },
                        "BudgetYearThree": {
                            "val": "27.638"
                        },
                        "BudgetYearFour": {
                            "val": "30.376"
                        },
                        "BudgetYearFive": {
                            "val": "30.634"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project conducts research to prevent and protect Soldiers from training and operational injuries, refine mechanisms for detection of physiological and psychological health problems, evaluate hazards to head, neck, spine, eyes, and ears, set the standards for rapid return-to-duty, and determine new methods to sustain and enhance performance across the operational spectrum. This research provides medical information important to the design and operational use of military systems, and this work forms the basis for behavioral, training, pharmacological (drug actions), and nutritional interventions. \n\nThe four main areas of study are: \n(1) Environmental Health and Protection \n(2) Physiological Health\n(3) Injury Prevention and Reduction\n(4) Psychological Health and Resilience\n\nAdditionally the Soldier Systems Engineering Architecture task advances medical S&T in the areas of injury prevention and performance sustainment in the context of human interaction with new Soldier systems and provide greater insight into informing new research in development of Soldier systems and the interactions between Soldiers and the systems they employ.  \n\nPromising efforts identified in this project are further matured under PE 0603002A, project MM3.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology, focus areas and the Army Modernization Strategy.   \n\nWork in this project is performed by the Walter Reed Army Institute of Research (WRAIR), Silver Spring, MD; the U.S. Army Research Institute of Environmental Medicine (USARIEM), Natick, MA; U.S. Institute of Surgical Research (USAISR), Fort Sam Houston, TX; and the U.S. Army Aeromedical Research Laboratory (USAARL), Fort Rucker, AL. \n\nEfforts in this project support the Soldier Portfolio and the principal areas of Combat Casualty Care and Military Operational Medicine."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Environmental Health and Protection - Physiological Awareness Tools and Warrior Sustainment in Extreme Environments"
                                    },
                                    "Description": {
                                        "val": "This effort evaluates remote monitoring of Soldier physiological (human physical and biochemical functions) status and mitigating\/eliminating the effects of heat, cold, altitude, and other environmental stressors on Soldier performance. This effort supports Technology-Enabled Capability Demonstration 1.b, Force Protection--Soldier and Small Unit in FY2013-2014, and also supports capability demonstrations in the area of decreasing physical burden for Soldiers in FY 2013-2014."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.643"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conducted laboratory studies to determine effects of hypoxia (oxygen depletion) on peripheral blood flow during cold exposure.  These results lead to the refinement of preventive measures for Warfighters deployed in high-altitude environments and may be included as components in the altitude and work performance models."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.930"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct studies to determine whether physiological fatigue in cold environments increases susceptibility to non-freezing cold injury, such as trenchfoot and hypothermia and develop screening procedures to determine those Warriors most at risk for non-freezing cold injury. Continue studies to determine the impact of hypoxia (oxygen depletion) on peripheral blood flow responses and susceptibility to non-freezing cold injury."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.337"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.337"
                                            },
                                            "Text": {
                                                "val": "Will identify physiological (human physical and biochemical functions) reflexes that improve hand and finger dexterity during cold exposure and will refine localized heating strategies to improve dexterity (coordination of small muscle movements which occur in body parts such as the fingers, usually in coordination with the eyes) in cold weather operations. Will develop decision aids for trade-off analyses of the impact of body armor protection and load on aerobic performance capabilities in temperate and hot environments. Will also determine if thermoregulatory (ability of an organism to keep its body temperature within certain boundaries) fatigue and altitude exposure increase susceptibility for non-freezing cold injury symptoms including numbness. Will identify biomarkers predictive of individual risk for developing acute mountain sickness at high altitude operations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Physiological Health - Nutritional Sustainment and Fatigue Interventions"
                                    },
                                    "Description": {
                                        "val": "This effort evaluates methods for managing and controlling the effects of nutrition and fatigue on Soldier operational performance. This effort supports Technology Enabled Capability Demonstration 7.d, Brain In Combat in FY 2013-2014."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.779"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Determined the capacity of nutrients from plants to alter oxidative stress (condition where potentially damaging substances exist in cells in excess of the cell's ability to detoxify them), reduced oxygen supply, or chemical-induced toxicity. These results lead to interventions designed to protect Warfighters from environmental hazards; defined the effects of metabolic energy availability on cognitive performance; determined whether nutritional interventions can facilitate bone remodeling in response to military training; incorporated a mathematical model of caffeine effects during chronic sleep restriction into the sleep performance model; and refined a cognitive (mental processing) model to predict differential rates of recovery following various chronic sleep restriction operational scenarios. These results increased predictive capability against the effects of fatigue; determined the effects of physiological (human mechanical, physical and biochemical functions) factors, such as genetic makeup, sleep history, and personality on individual differences in physiological resiliency."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.103"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Establish the nutritional requirements for optimizing Soldier re-fueling; establish Military Dining Facility serving practices that promote healthy food choices; establish the nutritional requirements for optimizing bone health; and develop dietary support interventions that accelerate cognitive recovery after operational stress.   These interventions optimize Soldier recovery from demanding missions through nutrition; develop mathematical models and algorithms for prediction of cognitive resilience based on physiological factors determined from laboratory studies, which allow resilience training to be personally optimized; compare the effectiveness and post-awakening performance profile of novel sleep-inducers against that of currently available pharmaceuticals, which will determine the most efficient intervention for sleep induction; develop a mathematical method for estimating thermal-work strain from non-invasive measures such as heart rate, skin temperature, heat flux, without the use of thermometer pills, which will allow for the optimization of Soldier load distribution and energy expenditure."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.611"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.611"
                                            },
                                            "Text": {
                                                "val": "Will establish nutrition approaches that promote resistance to physical, cognitive and environmental stressors and promote muscle and bone recovery. Will develop next generation predictive algorithms that non-invasively estimate overheating for incorporation into wearable sensor systems. Will establish sensors and biomathematical models capable of predicting cognitive status and likelihood of risk for musculoskeletal injury. Will determine patterns of physiological (human mechanical, physical, and biochemical functions), behavioral, and cognitive-affective responses in individuals during exposure to multiple stressors and will develop a working operational definition of physiological resilience and algorithms to predict individualized resilience."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Injury Prevention and Reduction - Neurosensory Injury Prevention"
                                    },
                                    "Description": {
                                        "val": "The Warrior Injury Assessment Manikin analyzes and models the effects of mechanical and operational stressors on Soldier performance, to include acoustic and impact trauma, vision, vibration, and jolt to model the effects of these stressors on the brain, spine, eyes, and hearing. This effort supports Technology-Enabled Capability Demonstration 1.c, Force Protection- Occupant Centric Platform in FY2013-2014."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.744"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Refined standard methodology for the evaluation of vision and ocular sensitivity during rapid transitions between light and dark operational conditions; refined methodology to evaluate blunt facial protection strategies; refined a model to assess the effectiveness of existing and newly developed hearing protection\/enhancement strategies during continuous and impulse noise combat operations to predict the effects of hearing loss in an operational environment; determined additive effects of laser pulses to enable the safe use of military laser systems and provide biomedical data to assess eye protection devices; assessed military ocular (eye) trauma from blast or lasers and outcomes to lead to the prevention and effective mitigation of battlefield eye injuries."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.165"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop improved eye protection standards and ophthalmic (pertaining to the eye) guidelines for protective eyewear that serves the various Warrior occupations and develop hearing protection strategies for optimized active noise-reduction protection. Develop novel assessment methods to detect impulse noise exposures. Develop a computational fluid dynamic model of the eye to evaluate the effects of blast exposures to ocular tissue."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.490"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.490"
                                            },
                                            "Text": {
                                                "val": "Will develop spinal injury criteria and protection assessment methodologies for military vehicle occupants. Will develop methods for assessing the effectiveness of prevention strategies against hearing and vestibular (sensory system supporting movement and sense of balance, located in the inner ear) injuries. Will develop assessment criteria for prediction of eye injury resulting from blunt, ballistic, and blast-wave forces, and will determine injury prevention criteria for eye injury induced by repetitive blast exposures."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Injury Prevention and Reduction - Musculoskeletal Injury Prevention"
                                    },
                                    "Description": {
                                        "val": "This effort evaluates and assesses the effects of repetitive motion during military operations and training on the human body; allows for the prediction of injuries as a result of continuous operations and muscle fatigue; evaluates current standards for return-to-duty; and establishes improved medical assessment methods with the goal of rapid return to duty of Soldiers following injury. This effort supports Technology-Enabled Capability Demonstration 1.b, Force Protection--Soldier and Small Unit in FY2013-2014."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.884"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Refined a mounted Soldier injury performance assessment battery and assessed the physical performance requirements and determine minimal acceptable standards for muscle\/skeletal injury for the dismounted Soldier. These results provided data for an improved musculoskeletal injury risk analysis capability for the Soldier."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.159"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop a quantitative computational model that can predict physical performance and risk of injury of individual Soldiers and develop training strategies and\/or dietary interventions to improve recovery following intense physical exercise."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.076"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.076"
                                            },
                                            "Text": {
                                                "val": "Will model functional neuromuscular adaptation following muscle injury and will determine the effect of inflammatory processes on muscle repair and regeneration, risk of re-injury, and incomplete healing. Will determine the modifiable and non-modifiable risk hazards for musculoskeletal injuries."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Injury Prevention and Reduction - Injury Return-to-Duty Standards:"
                                    },
                                    "Description": {
                                        "val": "This effort evaluates current standards for rapid return-to-duty and establishes improved medical standards and assessment methods with the goal of more rapid return-to-duty of Soldiers following injury."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.058"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Evaluated impulse noise measurement techniques to assess the potential for acoustic (hearing) injury to Soldiers.  These results provided an increased predictive capability for acoustic trauma.  Determined the effect of a low-level repeated-blast exposure environment on vestibular function (balance and movement).  These results lead to the refinement of medical guidelines that prevent impaired Soldiers from being prematurely returned to duty."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.676"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Compare treatment modalities for impact on return to duty and develop a toolkit for assessment that includes testing vision, hearing, and vestibular (sensory system supporting movement and sense of balance) function; develop models that predict and prevent auditory (process of hearing) injury; and develop criteria to improve hearing conservation and guide development of hearing protection equipment for Warriors."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.016"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.016"
                                            },
                                            "Text": {
                                                "val": "Will characterize current Warfighter injury trends contributing to lost duty days, reduced mission effectiveness, and occupational disability. Will determine the effects of physical, auditory, and visual system injury on military occupational performance and will define minimal standards for Soldier performance prior to returning to duty. Will evaluate the consequences of injury to the auditory or visual systems of Warfighters diagnosed with brain injury."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Psychological Health - Psychological Resilience"
                                    },
                                    "Description": {
                                        "val": "This effort refines, validates, and disseminates early interventions to prevent and reduce combat-related behavioral health problems, including symptoms of post-traumatic stress disorder (PTSD), depression, anger problems, anxiety, substance abuse, post-concussive symptoms, and other health risk behaviors and also assesses and refines interventions to enhance and sustain resilience throughout the Warfighter's career. This effort supports Technology Enabled Capability Demonstration 7.d. Brain In Combat in FY2013-2014."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.566"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Finalized assessment of post-deployment reintegration strategies; conducted studies to show the effectiveness of behavioral health and resiliency skills for leaders; and conducted studies to evaluate the effectiveness of behavioral health and resiliency skills for leaders.  These results are used to refine preventive and treatment interventions to enhance the psychological resilience of the Warfighter."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.436"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Evaluate and determine optimal interventions for preventing and treating deployment-related PTSD and comorbidities (more than one illness) to include medications, best psychotherapy and medication combinations, and alternative therapy protocols, including internet- based cognitive (mental processes) therapy. These intervention strategies will be used to optimize treatment outcomes and to implement more effective, efficient, and economical treatment regimens; benchmark emerging behavioral health trends through rapid fielding assessment teams to inform resilience training modifications. This effort ensures rapid response to Warfighter needs and determines evidence-based recommendations for Soldier reintegration strategies into their units and society; develop and refine evidence-based resilience training strategies for the deployment cycle; develop best practice recommendations based on research findings to facilitate Warfighters receiving the best possible training and provider care; and assess factors that contribute to return-to-duty decisions and conduct research to develop criteria and tools to inform return-to-duty decisions following psychological injury. This effort works toward facilitating confidence in the Warfighter and provider that the Warfighter is psychologically fit to return to duty."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.497"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.497"
                                            },
                                            "Text": {
                                                "val": "Will develop and disseminate validated strategies and early interventions to enhance and sustain mental health and well-being throughout service member's careers and will determine evidence-based recommendations for reintegration strategies. Will benchmark behavioral health problems, risk, and resilience physiological biomarkers (blood, urine, saliva, genetic, protein, etc.) in Soldiers and their Families. Will conduct analyses of neurocognitive (cognitive ability) test scores associated with a wide variety of psychological return-to-duty outcomes. Will conduct studies that explore the utility of sleep monitors and neurocognitive tools for psychological return-to-duty decision making. Will assess various mechanisms and interventions for reducing deployment-related anxiety. Will develop and validate unit-based, post-deployment resilience training for Soldiers. Will conduct trials with active duty Warriors assessing optimal intervention methods for PTSD, including medications. Will determine the correlation between PTSD interventions, such as prolonged exposure adjunct therapy and virtual reality to recreate the context of the original traumatic exposure, and changes in individual biomarker levels."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Psychological Health & Resilience - Suicide Prevention and Treatment of PTSD"
                                    },
                                    "Description": {
                                        "val": "This effort supports investigation of methods to treat PTSD in a military population and identifies causative and preventive factors in military suicides."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.270"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Refined specific interventions for the most effective means of treating deployment-related PTSD, including medications, psychotherapy, and complementary alternative medicine approaches and refined valid screening and assessment measures for the Soldier at risk of suicide.  These early intervention strategies are used to reduce suicide rates among Service members, determined effectiveness of suicide prevention training for increasing suicide awareness and decreasing suicide-related behaviors and intent.  These results helped increase psychological resilience and mitigated the potential for suicide. Additionally, these results complement work in 6.3 Project MM3 and related DHP programs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.014"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Test the effectiveness of a brief, telephone-based intervention to increase behavioral health treatment-seeking among Service members at high risk of suicide; learn about the type and range of decisions made by behavioral healthcare providers, chaplains, and leaders to address suicide-related events that occur during deployment, the process for making these decisions, and the lessons learned; assess how suicide-related events were managed and what could be improved; and develop guidelines and decision aids for use in deployed settings when suicide-related events occur."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Will determine risk and protective factors associated with suicide behavior and intent. Will determine effective risk assessment and management methods for suicide prevention. Will deliver interventions to unit leaders and unit members following suicide events in a combat environment including interventions to manage grief and bereavement, and suicide prevention strategies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Psychological Health & Resilience - Concussion\/Mild Traumatic Brain Injury (mTBI) Interventions"
                                    },
                                    "Description": {
                                        "val": "This effort refines and evaluates methods to detect and treat concussion as well as identify and evaluate the effects of cognitive deficits in Soldiers during operations. This effort supports Technology-Enabled Capability Demonstration 7.d, Brain In Combat in FY2013-2014."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.434"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Refined an evidence (data)-based comparative analysis of the foremost neurocognitive (functions of the brain) tests for assessment of mTBI in Soldiers; conducted an assessment to determine which post-concussion syndrome symptoms are caused by sleep disturbance; and refine guidance on drug interventions to improve psychological and neurophysiological functioning post-concussion. These results lead to the refinement of more effective interventions following concussive injury."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.226"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct research to evaluate the utility of magnetoencephalography (MEG), (technique for mapping brain activity by recording magnetic fields produced by electrical currents occurring naturally in the brain, using very sensitive magnetometers), a cutting-edge imaging technique for the brain, as a tool for differentiating PTSD from the brain injury following a post-concussion event; compare two imaging techniques (MEG and functional magnetic resonance imaging) for effectively assessing brain injury following a post-concussion event. These efforts lead to more effective assessment of Warriors brain injury post-concussion and facilitate appropriate care."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.076"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.076"
                                            },
                                            "Text": {
                                                "val": "Will characterize sleep duration, timing, and continuity on post-concussive symptoms using objective sleep measures. Will determine the relative utility of existing neurocognitive tools for assessment of post-concussive symptoms. Will develop algorithms to predict concussion likelihood based on post-exposure symptoms and brain injury"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier Systems Engineering Architecture"
                                    },
                                    "Description": {
                                        "val": "This effort will advance medical S&T in the areas of injury prevention and performance sustainment."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.500"
                                            },
                                            "Text": {
                                                "val": "Will advance medical S&T in the areas of injury prevention and performance sustainment in the context of human interaction with new Soldier systems and provide greater insight into informing new research across the S&T community (medical and non-medical) in development of Soldier systems and the interactions between Soldiers and the systems they employ.  This effort will leverage the work being done in Physiological Health, Injury Prevention & Reduction, both musculoskeletal and neurosensory, Psychological Health and Resilience and Environmental Health to inform the Soldier Systems Engineering Architecture initiative."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "870"
                    },
                    "ProjectTitle": {
                        "val": "Dod Med Def Ag Inf Dis"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "17.993"
                        },
                        "CurrentYear": {
                            "val": "19.062"
                        },
                        "BudgetYearOne": {
                            "val": "17.745"
                        },
                        "BudgetYearOneBase": {
                            "val": "17.745"
                        },
                        "BudgetYearTwo": {
                            "val": "19.350"
                        },
                        "BudgetYearThree": {
                            "val": "20.743"
                        },
                        "BudgetYearFour": {
                            "val": "22.418"
                        },
                        "BudgetYearFive": {
                            "val": "22.912"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project conducts applied research for medical countermeasures to naturally occurring infectious diseases that pose a significant threat to the operational effectiveness of forces deployed outside the United States. Effective preventive countermeasures (protective\/therapeutic drugs and vaccines and insect repellents and traps) protect the Force from disease and sustain operations by avoiding the need for evacuations from the theater of operations. Diseases of military importance are malaria, bacterial diarrhea, and viral diseases (e.g., dengue fever and hantavirus). In addition to countermeasures, this project funds refinement of improved diagnostic tools to facilitate early identification of infectious disease threats in an operational environment, informing Commanders of the need to institute preventive actions and improve medical care. Major goals are to integrate genomics (DNA-based) and proteomics (protein-based) as well as other new biotechnologies into the refinement of new concepts for new vaccine, drug, and diagnostics candidates.\n\nResearch conducted in this project focuses on the following five areas:\n\n(1) Drugs to Prevent\/Treat Parasitic (organisms living in or on another organisms) Diseases\n(2) Vaccines for Prevention of Malaria\n(3) Diagnostics and Disease Transmission Control\n(4) Bacterial Disease Threats (diseases caused by bacteria)\n(5) Viral Disease Threats (diseases caused by viruses)\n\nFor the refinement of drugs and biological products, studies in the laboratory and in animal models provide a proof-of-concept for these candidate products, including safety, toxicity (degree to which a substance can damage an organism), and effectiveness, and are necessary to provide evidence to the U.S. Food and Drug Administration (FDA) to justify approval for a product to enter into future human subject testing. Additional non-clinical studies are often needed in applied research even after candidate products enter into human testing during advanced technology development, usually at the direction of the FDA, to assess potential safety issues. Drug and vaccine refinement bears high technical risk. Of those candidates identified as promising in initial screens, the vast majority are eliminated after additional safety, toxicity, and\/or effectiveness testing. Similarly, vaccine candidates have a high failure rate, because animal testing may not be a good predictor of human response, and therefore candidate technologies\/products are often eliminated after going into human trials. Because of this high failure rate, a continuing effort to identify other potential candidates to sustain a working pipeline of countermeasures is critical for replacing those products that fail in testing.  \n\nWork is managed by the U.S. Army Medical Research and Materiel Command (USAMRMC) in coordination with the Naval Medical Research Center (NMRC). The Army is responsible for programming and funding all Department of Defense (DoD) naturally occurring infectious disease research requirements, thereby precluding duplication of effort within the Military Departments.   \n\nPromising medical countermeasures identified in this project are further matured under PE 0603002A, project 810.\n \nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology, focus areas and the Army Modernization Strategy.   \n \nWork in this project is performed by the Walter Reed Army Institute of Research (WRAIR), Silver Spring, MD, and its overseas laboratories; the U.S. Army Medical Research Institute of Infectious Disease (USAMRIID), Fort Detrick, MD; and the Naval Medical Research Center (NMRC), Silver Spring, MD, and its overseas laboratories."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Drugs to Prevent\/Treat Parasitic Diseases (harmful effects on host by an infecting organism)"
                                    },
                                    "Description": {
                                        "val": "This effort conducts assessments and improves candidate drugs coming from the DoD discovery program and from other collaborations for prevention and treatment of malaria to counter the continuing spread of drug resistance to current drugs; conducts assessments in animal models of currently available drugs for use against cutaneous leishmaniasis (a skin-based disease transmitted by sand flies); and selects the most effective and safe candidates for continued refinement and possible clinical testing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.052"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Evaluated selected compounds for anti-parasitic effectiveness in animal models to further down-select compounds specifically targeted for P. falciparum and P. vivax malaria for human trials and validated animal models for predicting drug effectiveness and toxicity for future drug testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.463"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Test new refined candidate drug treatment in animal models for drug safety and effectiveness to evaluate anti-malaria and anti-leishmania activities of these compounds."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.360"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.360"
                                            },
                                            "Text": {
                                                "val": "Will continue to optimize new candidate drugs and drug combinations to stay ahead of emerging drug resistance in malaria parasite."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Vaccines for Prevention of Malaria"
                                    },
                                    "Description": {
                                        "val": "This effort conducts studies to investigate new candidate vaccines for preventing malaria and selects the best candidate(s) for continued refinement.  A highly effective vaccine would reduce or eliminate the use of anti-malarial drugs and would minimize the progression and impact of drug resistance to current\/future drugs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.035"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Optimized formulations of candidate antigens (substance that when introduced into the body stimulates the production of an antibody) in animal models for further evaluation in human clinical trials."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.199"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Assess immune responses of candidate antigens (substance that when introduced into the body stimulates the production of an antibody) and adjuvant (agent that enhances the effect of vaccines) formulations to optimize immunogenicity (ability of a particular substance to provoke an immune response) and effectiveness in animal challenge models."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.830"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.830"
                                            },
                                            "Text": {
                                                "val": "Will complete the development of a human challenge model for malaria. Under this model, volunteers vaccinated with a malaria vaccine candidate are deliberately \"challenged\" with malaria through the bite of malaria-infected mosquitoes to assess whether or not the candidate vaccine can prevent or delay malaria infection. Will test novel Plasmodium falciparum (severe form of malaria) antigens (substance that when introduced into the body stimulates the production of an antibody) and antigen combination in small animals."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Diagnostics and Disease Transmission Control:"
                                    },
                                    "Description": {
                                        "val": "This effort designs and prototypes new medical diagnostic and surveillance tools for the field, focusing on bedside and field-deployable diagnostic systems and refines interventions that protect Warfighters from biting insects such as sand flies, responsible for transmitting leishmaniasis, and mosquitoes, which transmit a variety of diseases including dengue fever, Japanese encephalitis, and malaria."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.882"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Refined diagnostic tools that provide on-the-spot identification of biting insects\/tick\/mites and their human\/animal pathogen (infectious agent) infection status; evaluated new non-pesticidal technologies for insect population control; refined data package to obtain FDA clearance on the dengue assay designed for Joint Biological Agent Identification and Diagnaotic System (JBAIDS); and evaluated next-generation diagnostic system platforms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.040"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Incorporate the vector (organisms that transmit infections) diagnostics and human diagnostic assays into the next-generation diagnostic system managed by Program Executive Office, Chemical Biologics and complete the dengue assay for use on testing mosquitoes to see if they carry the pathogen (infectious agent) of interest to Warfighters."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.679"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.679"
                                            },
                                            "Text": {
                                                "val": "Will research and develop pathogen (infectious agent) specific reagents (substance used in chemical reaction) and assays for selected diseases of military importance to address the capability gaps of fielded and commercially available Rapid Human Diagnostic Devices (RHDDs). Will refine pathogen detection assays and field test surveillance devices developed to detect pathogens in medically important arthropods and insects (e.g., ticks, mosquitoes and sandflies). Will test new compounds\/formulations for application to personal protection methodologies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Viral Threats Research"
                                    },
                                    "Description": {
                                        "val": "This effort designs and laboratory tests new vaccine candidates against  dengue and other hemorrhagic fever viruses such as hantaviruses (cause of Korean hemorrhagic fever) and other lethal viruses such as Lassa fever (viral disease contracted by ingestion or inhalation of rodents' urine and feces) and Crimean-Congo hemorrhagic fever (severe tick-borne viral disease with a 30% mortality rate in infected humans), and assesses other non-vaccine technologies to protect against such lethal viral diseases. Efforts also include establishing and maintaining of clinical trial sites worldwide."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.571"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Refined vaccines for viruses of military importance; conducted effectiveness studies to refine and\/or maintain vaccine test site infrastructure; refined and validated assays in animal studies for future testing of dengue fever vaccine trials; established partnerships with industry for pre-clinical and clinical evaluation of medical countermeasures; investigated the feasibility of combining vaccines against different agents into single-label, multi-agent vaccines; identified and characterized new populations who are at high risk of being infected with HIV for clinical evaluation of potential vaccine candidates at overseas sites; and produced vaccines for various HIV subtypes and complete evaluation in animals."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.771"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Identify and develop reagents, assays, and animal models to test the immunogenicity (ability of a particular substance to provoke an immune response) and protective effectiveness of candidate vaccines and other medical countermeasures against dengue, hantavirus, and other lethal viruses of military interest."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.745"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.745"
                                            },
                                            "Text": {
                                                "val": "Will identify and maintain vaccine test site infrastructure for evaluation of dengue vaccine candidates in human clinical trials. Will assess safety and immunogenicity (ability of a particular substance to provoke an immune response) data. Will apply this data as down selection criteria to identify superior performing vaccine candidates or administration strategies for advancement to testing of hantavirus and dengue vaccine candidates in human volunteers. Will test research strategies to develop novel assays to rapidly measure hantavirus neutralizing antibodies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Bacterial Threats"
                                    },
                                    "Description": {
                                        "val": "This effort conducts studies to refine antibacterial countermeasures, including vaccine candidates, to prevent diarrhea (a common disease in deployed troops caused by three diarrheal pathogens (infectious agents), E. coli, Campylobacter, and Shigella, wound infection, and scrub typhus (a debilitating mite-borne disease that is developing resistance to currently available antibiotics)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.453"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Scaled-up vaccine formulation process and conducted toxicity testing on additional E. coli vaccine candidates to ensure adequate safety and vaccine protection coverage; conducted preclinical animal studies to determine safety and immune response to live-attenuated Shigella bivalent (two types) vaccine; and performed animal wound infection studies on candidate products to prevent wound infection and biofilm (an aggregate of microorganisms in which cells adhere to each other on a surface) formation"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.589"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to evaluate new vaccine candidates against three diarrheal pathogens (infectious agents), Shigella, Campylobacter, and E. coli in animal models and evaluate safety and toxicity of selected antigens (substance that when introduced into the body stimulates the production of an antibody) in small animals to further down-select best candidates for future human testing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.131"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.131"
                                            },
                                            "Text": {
                                                "val": "Will refine and evaluate two diarrheal pathogens (infectious agents), Shigella, and enterotoxigenic E. coli (leading bacterial cause of diarrhea), and vaccine candidates. Will study clinical grade prototype diarrheal disease vaccine candidates for animal testing. Will identify and prepare field sites for evaluation of candidate vaccines. Will maintain a scrub typhus chigger colony that is used as the challenge model to evaluate current Scrub typhus vaccine candidates. Will identify and characterize mechanisms of antibiotic resistance to scrub typhus infection."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "873"
                    },
                    "ProjectTitle": {
                        "val": "HIV Exploratory Rsch"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7.800"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project conducts research on Human Immunodeficiency Virus (HIV), which causes Acquired Immunodeficiency Syndrome (AIDS). Work in this area includes refining improved identification methods to determine genetic diversity of the virus and evaluating and preparing overseas sites for future vaccine trials. Additional activities include refining candidate vaccines for preventing HIV and undertaking preclinical studies (studies required before testing in humans) to assess vaccine for potential to protect and\/or manage the disease in infected individuals. This funding transferred to the Defense Health Program in FY14.This program is jointly managed through an Interagency Agreement between the U.S. Army Medical Research and Materiel Command (USAMRMC) and the National Institute of Allergy and Infectious Diseases (NIAID) of the National Institutes of Health (NIH). This project contains no duplication of effort within the Military Departments or other government organizations.  \n\nWork is related to and fully coordinated with work funded in PE 0603105A, project H29. \n \nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology, focus areas and the Army Modernization Strategy.   \n \nWork in this project is performed by the Walter Reed Army Institute of Research (WRAIR) and the Naval Medical Research Center (NMRC), Silver Spring, MD, and their overseas laboratories. The Henry M. Jackson Foundation (HMJF), located in Rockville, MD provides support for the U.S Food and Drug Administration (FDA) testing and other research under a cooperative agreement.\n\nEfforts in this project support the Soldier Portfolio and the principal area of Military Relevant Infectious Diseases to include HIV."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "HIV Research Program"
                                    },
                                    "Description": {
                                        "val": "This effort assesses new HIV vaccine candidates and worldwide vaccine test sites, tracks HIV disease outbreaks, and analyzes the genetic attributes of HIV threat."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.800"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Identified, refined, and maintained new clinical trial sites in Africa and Asia; manufactured vaccine candidates based on HIV subtypes present in Africa and Asia to perform pre-clinical testing in laboratory animals; and tested selected vaccine candidates in non-human, primate models to test safety and effectiveness of vaccine candidates to down-select best candidates for further testing in humans."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "874"
                    },
                    "ProjectTitle": {
                        "val": "Cbt Casualty Care Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "17.642"
                        },
                        "CurrentYear": {
                            "val": "18.261"
                        },
                        "BudgetYearOne": {
                            "val": "15.861"
                        },
                        "BudgetYearOneBase": {
                            "val": "15.861"
                        },
                        "BudgetYearTwo": {
                            "val": "17.120"
                        },
                        "BudgetYearThree": {
                            "val": "17.531"
                        },
                        "BudgetYearFour": {
                            "val": "19.214"
                        },
                        "BudgetYearFive": {
                            "val": "19.056"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project refines and assesses concepts, techniques, and materiel that improve survivability and ensure better medical treatment outcomes for Warfighters wounded in combat and other military operations. Combat casualty care research addresses control of severe bleeding, revival and stabilization, prognostics and diagnostics for life support systems (predictive indicators and decision aids), treatment of burns, and traumatic brain injury (TBI). Clinical and rehabilitative medicine research addresses tissue repair including transplant technologies, orthopedic injuries, eye injuries, and face trauma.\n\nResearch involves extensive collaboration with multiple academic institutions to refine treatments for combat wounds through AFIRM. This project is coordinated with the Military Departments and other government organizations to avoid duplication.\n\nResearch conducted in this project focuses on the following five areas:\n(1) Damage Control Resuscitation\n(2) Combat Trauma Therapies\n(3) Combat Critical Care Engineering\n(4) Clinical and Rehabilitative Medicine\n(5) Traumatic Brain Injury\n\nAll drugs, biological products, and medical devices are refined in accordance with FDA regulations, which govern testing in animals to assess safety, toxicity, and effectiveness and subsequent human subject clinical trials.  \n\nPromising efforts identified in this project are further matured under PE 0603002A, project 840.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology, focus areas and the Army Modernization Strategy.\n\nWork on this project is performed by U.S. Army Institute of Surgical Research (USAISR), the U.S. Army Dental Trauma Research Detachment (USADTRD), Fort Sam Houston, TX; the Walter Reed Army Institute of Research (WRAIR), Silver Spring, MD; and the Armed Forces Institute of Regenerative Medicine (AFIRM), Fort Detrick, MD. \n\nEfforts in this project support the Soldier Portfolio and the principal areas of Combat Casualty Care and Clinical and Rehabilitative Medicine."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Damage Control Resuscitation"
                                    },
                                    "Description": {
                                        "val": "This effort develops and refines knowledge products (such as clinical practice guidelines, manuals, protocols, studies, and media), materials, and systems for control of internal bleeding; minimizing the effects of traumatic blood loss; preserving, storing, and transporting blood and blood products; and resuscitation following trauma."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.931"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conducted coagulation (blood clotting) factor and inflammation studies; validated a portable, rapid, point-of-care device to measure clotting ability to guide providers administering resuscitation; transition diagnostic for coagulopathy of trauma (uncontrollable bleeding resulting from injury) to 6.3 and Advanced Development when sufficiently validated; and then seek FDA approval for its use."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.187"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue validation studies of portable, rapid, point-of-care devices that provide care givers information on clotting ability to guide resuscitation and perform studies of blood product storage technologies suitable for use under battlefield conditions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.676"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.676"
                                            },
                                            "Text": {
                                                "val": "Will conduct studies to determine effective means to control bleeding when clotting ability has been impaired due to trauma. Will conduct studies of plasma (fluid component of blood) in combination with other blood products and various drugs in traumatic hemorrhage (bleeding) animal models."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Combat Trauma Therapies"
                                    },
                                    "Description": {
                                        "val": "This effort conducts research to enhance the ability to diagnose, stabilize, and accelerate wound healing and repair of damaged tissue for casualties with survivable wounds to the face and head, extremities, and brain."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.877"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conducted studies on how biofilms (an aggregate of microorganisms in which cells adhere to each other on a surface) reduce wound healing rate and impair wound closure in traumatic craniomaxillofacial wounds and characterize biofilm diagnostics, dispersal agents, and therapies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.609"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Formulate an anti-biofilm wound gel to combat wound infections, prevent chronic infections, and hasten wound healing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.245"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.245"
                                            },
                                            "Text": {
                                                "val": "Will continue development of anti-biofilm gel. Will perform studies to determine means to alleviate persistent wound inflammation to prevent subsequent tissue destruction and excessive scarring."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Combat Critical Care Engineering"
                                    },
                                    "Description": {
                                        "val": "This effort refines diagnostic and therapeutic medical devices as well as associated algorithms, software, and data-processing systems for resuscitation, stabilization, life support, and surgical support that can be applied across the pre-hospital, operational field setting, and initial definitive care facilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.453"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Refined algorithms to track blood loss under conditions of heat, cold, dehydration, varying rates of blood loss, etc., to determine possible causal relationships."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.829"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Work to optimize algorithms to improve fluid resuscitation and prevent hemorrhagic shock and to develop decision support algorithms to guide provision of critical care to casualties at the point of injury, during transport, and in field hospital."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.370"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.370"
                                            },
                                            "Text": {
                                                "val": "Will conduct studies to identify the physiological (characteristic of or appropriate to an organism's healthy or normal functioning) effects of optimizing the flow of blood returning to the heart as a fluidless resuscitation strategy. Will continue research to optimize algorithms to improve fluid resuscitation, prevent hemorrhagic shock, and to develop decision support algorithms to guide provision of critical care to casualties at point of injury, during transport, and in field hospitals."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Clinical and Rehabilitative Medicine"
                                    },
                                    "Description": {
                                        "val": "This effort conducts laboratory and animal studies on regenerating skin, muscle, nerve, bone tissue, and soft tissue (including the genitalia and abdomen) as well as studies regarding ocular and visual system traumatic injury for the care and treatment of battle-injured casualties."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.907"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Refined novel drug delivery, diagnostic, and tissue repair strategies including stem cell therapies utilizing knowledge deliverables from FY2012; further refined animal models to assess soft and hard tissue regeneration technologies; continued studies of burn, scar-less wound, soft tissue, and bone repair strategies; expanded refinement and testing of stem cell therapies and scaffolds (tissue-engineered grafts) in animal models; and built on promising approaches by continuing the evaluation of candidate strategies for craniomaxillofacial (head, neck, face and jaw) reconstruction, including wound-healing control and tissue engineering\/regeneration techniques to restore facial features."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.624"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Down-select novel drug delivery, diagnostic, tissue repair, and treatment strategies including pharmacologic (drugs) and stem cell therapies for eye trauma injury; incrementally build on past successes to refine and develop novel drug delivery, diagnostic, reconstructive, and regenerative strategies; utilize and refine cell-based therapies (including stem cells) and tissue scaffolds (tissue-engineered grafts) in animal models to assess soft and hard tissue repair and regeneration; and build on promising approaches from FY2013 by evaluating candidate strategies for burn and wound- healing bone and soft tissue repair and strategies to repair extremities (arms and legs), craniomaxillofacial (head, neck, face and jaw), genital, and abdominal regions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.555"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.555"
                                            },
                                            "Text": {
                                                "val": "Will down-select and direct applied research efforts to further develop drug delivery, diagnostic, tissue repair, and treatment strategies including pharmacologic (drugs) and stem cell therapies for eye trauma; build upon promising cell- and tissue-based regenerative and reconstructive approaches from FY2014 by evaluating candidate strategies for burn and wound-healing bone and soft tissue repair and strategies to repair extremities (arms and legs), craniomaxillofacial (head, neck, face and jaw), genital, and abdominal regions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Traumatic Brain Injury"
                                    },
                                    "Description": {
                                        "val": "This effort supports refinement of drugs and therapeutic strategies to manage brain injury resulting from battlefield trauma, including mature drug technologies, novel stem cell strategies, and selective brain cooling. This effort supports Technology-Enabled Capability Demonstration 7.d, Brain in Combat in FY2013 and FY2014."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.474"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigated selective brain cooling and non-embryonic stem cells derived from human amniotic fluid as non-traditional therapies for TBI."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.012"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop selective brain cooling and neural (nervous system) stem cell transplantation as non-traditional therapies for traumatic brain injury and combat-relevant animal model of repeated mild TBI (Traumatic Brain Injury)\/concussion."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.015"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.015"
                                            },
                                            "Text": {
                                                "val": "Will continue to screen and evaluate drugs and other treatment strategies, including brain cooling, stem cell constructs, sleep enhancement, and nutraceuticals (products derived from food sources that provide extra health benefits) for treatment of Traumatic Brain Injury (TBI)."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "FH2"
                    },
                    "ProjectTitle": {
                        "val": "Force Health Protection - Applied Research"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.565"
                        },
                        "CurrentYear": {
                            "val": "6.313"
                        },
                        "BudgetYearOne": {
                            "val": "6.061"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.061"
                        },
                        "BudgetYearTwo": {
                            "val": "5.314"
                        },
                        "BudgetYearThree": {
                            "val": "6.673"
                        },
                        "BudgetYearFour": {
                            "val": "5.727"
                        },
                        "BudgetYearFive": {
                            "val": "5.727"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project conducts research to support applied research directed toward the sustainment of a healthy force of Warfighters from accession through retirement.  This research focuses on enhanced protection of Soldiers against health threats in military operations and training. Stressors that adversely affect individual Soldier health readiness are identified and studied to refine interventions that will protect Soldiers and improve their health and performance in stressful environments. This is follow-on research that extends and applies findings from over a decade of research on Gulf War Illnesses and other chronic multi-symptom illnesses that have suspected nerve and behavioral alterations caused by environmental contaminants and deployment stressors. Key databases include the Millennium Cohort Study and the Total Army Injury and Health Outcomes Database. These databases allow us to evaluate interactions of psychological stress and other deployment and occupational stressors that affect Warfighter health behaviors.\n\nForce Health Protection applied research is conducted in close coordination with the Department of Veterans Affairs. This project contains no duplication with any effort within the Military Departments and includes direct participation by other Services working on Army projects.\n\nResearch conducted in this project focuses on the following three areas:\n(1) Millennium Cohort Research\n(2) Biomarkers of Exposure and Environmental Biomonitoring\n(3) Physiological Response and Blast and Blunt Trauma Models of Thoracic (Chest) and Pulmonary (Lung) Injuries\n \nPromising efforts identified in this project are further matured under PE 0603002A, project FH4.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology, focus areas and the Army Modernization Strategy.    \n \nWork in this project is performed by the U.S. Army Center for Environmental Health Research (USACEHR), Fort Detrick, MD; the Naval Health Research Center (NHRC), San Diego, CA; and the U.S. Army Research Institute of Environmental Medicine (USARIEM), Natick, MA. \n\nEfforts in this project support the Soldier Portfolio and the principal area of Combat Casualty Care."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Millennium Cohort Research"
                                    },
                                    "Description": {
                                        "val": "This effort supports a long-term study of Soldiers that includes psychological, physical, and spiritual impacts of military service throughout their lifetime.  The Millennium Cohort and Deployment Health Task area employs a prospective epidemiological (study of health-event patterns in a society) surveillance research designed to address mental health and comorbid (multiple) disorders, including neurological and other chronic degenerative disorders, fitness and readiness performance outcomes, and longer-term physical and mental health illnesses and disease over the life cycle of military Servicemen and women."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.661"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Planned and conducted analyses to further identify gender risk differences for PTSD and depression associated with deployment; examined return-to-duty parameters related to multiple health and injury illnesses; and disseminated strategic findings from studies that support policy formation and guide further research to promote the longer term physical and mental health of the force. These results lead to the formulation of strategies designed to mitigate the adverse psychological effects of military deployments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.517"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Determine the long-term and ongoing functional, physical, and mental health issues of Service members (including injury and respiratory\/environmental exposures) after military experiences including deployments, training, and other exposures of concern and characterize emerging or high-profile health threats among Service members through longitudinal assessment.  These results will inform preventive and intervention strategies to ensure a healthy and fit force and possibly aid providers and leadership in mitigating adverse health outcomes associated with military experiences."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.587"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.587"
                                            },
                                            "Text": {
                                                "val": "Will evaluate the impact of child health on Family functioning and Service Member health outcome and investigate the impact of the Family's response to deployment on the mental health of the deployed Service Member."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Biomarkers of Exposure and Environmental Biomonitoring (measurement of the body’s response to toxic chemical compounds, elements, or their metabolites, in biological substances)"
                                    },
                                    "Description": {
                                        "val": "This effort supports refinement and evaluation of methods to detect environmental contamination and toxic exposure during military operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.701"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conducted assessment of high-priority Army research needs in nanomaterial characterization, exposure assessment, toxicity studies, or risk assessment. This research provided Soldiers with exposure risk health assessment to the potential health hazards associated with nanomaterials (materials smaller than a one tenth of a micrometer in at least one dimension) in the environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.719"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Apply a risk ranking system to provide a screening-level assessment for hazardous exposures to the identified Army nanomaterials (materials smaller than a one tenth of a micrometer in at least one dimension). These studies will identify Army materiel nanomaterials associated with having the highest initial risk rankings of potential exposures to Warriors"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Physiological Response and Blast and Blunt Trauma Models of Thoracic (Chest) and Pulmonary (Lung) Injury"
                                    },
                                    "Description": {
                                        "val": "This effort supports modeling and assessment of the combined effects of blast, impact, and ballistic trauma on the chest and lung system. This effort supports Technology-Enabled Capability Demonstration 7.d, Brain In Combat in FY2013-2014."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.203"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Refined software that integrates blast, toxic gas, and blunt trauma injury prediction models into a combined application for integrated blast injury and performance assessment. This research provides Commanders with a single assessment tool for myriad health hazards and with an enhanced capability to assess injury-related risk for the Warfighter."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.077"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop musculoskeletal models for predicting individualized physical performance outcomes of military-relevant tasks following blast or blunt impacts. This research will show the physical decrement associated with blast or blunt impact exposure."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.474"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.474"
                                            },
                                            "Text": {
                                                "val": "Will develop models to assess endurance for military relevant tasks including algorithm development to predict musculoskeletal adaptations to fatigue. Will expand biomechanical performance modeling to incorporate relevant tasks, such as lifting and marksmanship that use the upper body and core."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "VB4"
                    },
                    "ProjectTitle": {
                        "val": "System  Biology And Network Science Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.645"
                        },
                        "CurrentYear": {
                            "val": "4.836"
                        },
                        "BudgetYearOne": {
                            "val": "4.798"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.798"
                        },
                        "BudgetYearTwo": {
                            "val": "4.878"
                        },
                        "BudgetYearThree": {
                            "val": "4.959"
                        },
                        "BudgetYearFour": {
                            "val": "5.048"
                        },
                        "BudgetYearFive": {
                            "val": "5.083"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project encompasses two efforts to support applied research and impact medical research relevant to the Soldier. (A) The core capability for multidisciplinary applied research in systems biology enables integration and analysis of complex data from human and animal studies, development of in silico (via computer simulation) network models, allowing us to differentiate molecular signatures of disease, and supports transition of research to clinical applications. This core capability applies integrative and systemic biological approaches to trace progression of illnesses and diseases of military relevance and has already shown that the approach significantly reduces time, funds and effort invested in medical product development and refinement. (B) Applied research is to identify toxicity-altered pathways (scientists can infer human harm from chemicals on the basis of how they change the activity of biochemical steps in cells and animals) enabling us to understand the mechanisms of toxic environmental chemicals and to develop molecular markers of toxicity for a next generation diagnostic system to support early exposure medical decisions. \n\nThese examples of more complex, yet integrated approaches to projects studying biological systems (PTSD project) has been shown to reduce both the time and expense of medical product development for the Army\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology, focus areas and the Army Modernization Strategy.   \n \nWork in this project is performed by the US Army Medical Research and Materiel Command (USAMRMC), Fort Detrick, MD. \n\nEfforts in this project support the Soldier Portfolio and the principal area of Systems Biology\/Network Sciences."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Systems Biology"
                                    },
                                    "Description": {
                                        "val": "This project encompasses two efforts to support applied research and impact medical research relevant to the Soldier. (A) The core capability for multidisciplinary applied research in systems biology enables integration and analysis of complex data from human and animal studies and development of in silico (via computer simulation) network models, allowing us to differentiate between molecular signatures of psychological illness, diseases, and other medical conditions for the Soldier, such as heat injury. This core capability has supported transition of research to clinical applications faster, cheaper and better than standard approaches because many forms of data from numerous studies are integrated into a consolidated personalized clinical environment used to treat Soldiers more effectively. (B) Applied research is to identify toxicity-altered pathways (scientists can infer human harm from chemicals on the basis of how they change the activity of biochemical steps in cells and animals) enabling us to identify toxic environmental chemicals and materials as well as understand the injury mechanisms of toxic environmental chemicals and to develop molecular and physiological markers of toxicity for a next generation diagnostic system to support early exposure medical decisions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.645"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Performed experiments and high-content screening for host responses to environmental hazards and disease states (initially PTSD and trauma coagulopathy [a condition affecting the blood's ability to clot]); refined and begin validating a computational platform and mathematical models for biological responses to toxicity, disease, and injury; and identify candidate biomarkers for adverse host responses."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.836"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to adapt novel state-of-the-art approaches to enable use of clinical samples from illness or diseases of military relevance, including the technology of the SysDataCube database, (data management and analytic system) to further the aims of clinical data integration with the massive datasets from multiomic (interrelated \"omic\" fields such as proteomics, genomics, and others) approaches and other physiologic findings. Evaluate high-content data sets from environmental exposures using computational platform to identify activated-toxicity pathways (understanding the physiology of toxicity) and screen and down-select candidate PTSD and coagulopathy (abnormal blood clotting) biomarkers for further analysis and validation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.798"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.798"
                                            },
                                            "Text": {
                                                "val": "Will design and utilize new tools to solve problems that arise in the course of extracting signatures (distinctive and unique characteristics of a condition or event) related to suicide, coagulopathy (abnormal blood clotting and hemorrhage), and chronic pain experienced by soldiers. Will evaluate and integrate iterative computer modeling with high-content global molecular data sets from PTSD (gathered in human clinical trials) and utilize animal model simulating aspects of PTSD to further basic studies related to therapeutics; following the successful pattern of combining clinical trials with animal models to study coagulopathy and mechanisms of chronic pain. Will develop and enhance capabilities to support transition of research to advanced development by incorporating newly emerging digital FDA-approved approaches.  \nWill evaluate high-content data sets from environmental exposures using computational platforms to identify toxicity-altered pathways (understanding the physiology of toxicity) and develop a panel of molecular markers for assessing adverse reactions from exposure to environmental health hazards with a focus on systemic toxicities (toxicity for specific organ systems). Will verify candidate pathways of toxicity and validate molecular markers in the rodent model."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "VJ4"
                    },
                    "ProjectTitle": {
                        "val": "Suicide Prevention\/Mitigation"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "10.000"
                        },
                        "CurrentYear": {
                            "val": "10.109"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Army and the National Institute of Mental Health (NIMH) have jointly initiated the Army Study to Assess Risk and Resilience in Servicemembers (Army STARRS) to examine how psychosocial (related to both the psychological and social aspects), biological (related to living organisms), and genetic factors affect risk\/resilience for suicide, as well as related conditions. This study funds research to examine the mental and behavioral health of Soldiers and related suicidal behavior. Army STARRS component studies (Historical Data Study, New Soldier Study, All Army Study, Soldier Health Outcomes Study, and Pre\/Post Deployment Study) examine historical and administrative data collected by the Army from Soldiers in all phases of Army service. As of July 2013, more than 100,000 Soldiers volunteered to participate in Army STARRS. \n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology, focus areas and the Army Modernization Strategy.   \n \nWork on this project is performed by The National Institute of Mental Health (NIMH) with the Department of the Army providing program oversight. \n\nEfforts in this project support the Soldier Portfolio and the principal area of Military Operational Medicine."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Suicide Prevention\/Mitigation"
                                    },
                                    "Description": {
                                        "val": "This effort conducts research to better understand the apparent increase in suicide deaths and nonfatal attempts among active duty Soldiers, as well as identify improved prevention\/intervention methods for individuals at risk for suicide based on data-driven recommendations. The efforts will be used to decrease suicide rates in both military populations as well as in the general public."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued epidemiological (population-based) studies to further identify determinants of suicidal behavior and potential modifiable risk factors; collected data for suicide-death case control study; and conduct research efforts to assist in improved identification of individuals at greatest risk for suicide, validated screening measures, and enhanced prevention\/intervention methods"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.109"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop data-driven methods for mitigating or preventing suicide behaviors in active duty service members from a longitudinal study; determine modifiable risk and protective factors associated with suicide, mental health and psychological resilience; refine at risk factors for identification of individuals who are at a greater risk for suicide; refine improved suicide prevention interventions."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}