{
    "id": "68e32a60996c98faeff6fe525ff6090f6d683074",
    "meta": {
        "filename": "dod-2015_RDTE_2015_AIRFORCE_V1_RDTE_JustificationBook_Air_Force_PB_2015.zzz_unzipped_RDTE_JustificationBook_Air_Force_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602201F"
        },
        "ProgramElementTitle": {
            "val": "Aerospace Vehicle Technologies"
        },
        "R1LineNumber": {
            "val": "5"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "108.536"
            },
            "CurrentYear": {
                "val": "119.624"
            },
            "BudgetYearOne": {
                "val": "105.747"
            },
            "BudgetYearOneBase": {
                "val": "105.747"
            },
            "BudgetYearTwo": {
                "val": "121.690"
            },
            "BudgetYearThree": {
                "val": "125.883"
            },
            "BudgetYearFour": {
                "val": "127.449"
            },
            "BudgetYearFive": {
                "val": "134.605"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program investigates, develops, and analyzes aerospace vehicle technologies in the three primary areas of structures, controls, and aerodynamics for legacy and future aerospace vehicles. Advanced structures concepts are explored and developed to exploit new materials, fabrication processes, and design techniques. Flight control technologies are developed and simulated for aerospace vehicles. Advanced aerodynamic vehicle configurations are developed and analyzed through simulations, experiments, and multi-disciplinary analyses. Resulting technologies improve performance of existing and future manned and remotely piloted air vehicles, sustained high speed, and space access vehicles. Improvements include, but are not limited to, reduced energy use by efficient air platform designs, use of lightweight composite structures and improved sustainment methods based on the condition of the platform and sub-systems. Efforts in this program have been coordinated through the Department of Defense (DoD) Science and Technology (S&T) Executive Committee process to harmonize efforts and eliminate duplication. This program is in Budget Activity 2, Applied Research, since it develops and determines the technical feasibility and military utility of evolutionary and revolutionary aerospace vehicle technologies."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "120.719"
                },
                "CurrentYear": {
                    "val": "119.672"
                },
                "BudgetYearOne": {
                    "val": "121.849"
                },
                "BudgetYearOneBase": {
                    "val": "121.849"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "108.536"
                },
                "CurrentYear": {
                    "val": "119.624"
                },
                "BudgetYearOne": {
                    "val": "105.747"
                },
                "BudgetYearOneBase": {
                    "val": "105.747"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-12.183"
                },
                "CurrentYear": {
                    "val": "-0.048"
                },
                "BudgetYearOne": {
                    "val": "-16.102"
                },
                "BudgetYearOneBase": {
                    "val": "-16.102"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.215"
                    },
                    "CurrentYear": {
                        "val": "-0.048"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.030"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-9.938"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-16.102"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-16.102"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY13 decrease due to Sequestration.\nFY15 decrease due to higher DoD priorities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "622401"
                    },
                    "ProjectTitle": {
                        "val": "Structures"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "37.783"
                        },
                        "CurrentYear": {
                            "val": "44.046"
                        },
                        "BudgetYearOne": {
                            "val": "32.779"
                        },
                        "BudgetYearOneBase": {
                            "val": "32.779"
                        },
                        "BudgetYearTwo": {
                            "val": "52.947"
                        },
                        "BudgetYearThree": {
                            "val": "51.429"
                        },
                        "BudgetYearFour": {
                            "val": "51.890"
                        },
                        "BudgetYearFive": {
                            "val": "56.166"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops advanced structures concepts to exploit new materials and fabrication processes and investigates new concepts and design techniques.  New structural concepts include incorporating subsystem hardware items and adaptive mechanisms into the aerospace structures and\/or skin of the platform."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Aircraft Service Life Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop an economic service life analysis capability comprised of analysis tools, methodologies, and structural health monitoring technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "22.031"
                                            },
                                            "Text": {
                                                "val": "Continued development of engineered residual stress concepts, analysis, and applications. Continued the development concepts for risk informed decision-making. Continued efforts for condition-based maintenance of structural integrity. Continued the development of failure criteria tools for advanced aircraft components and concepts. Initiated efforts in certification of advanced composite for aircraft structures. Completed the development of integrated sensors for determination of system health."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "28.427"
                                            },
                                            "Text": {
                                                "val": "Complete development of engineered residual stress concepts, analysis, and applications. Continue the technology development concepts for risk informed decision-making. Continue technology efforts for condition-based maintenance of structural integrity. Continue the technology development of failure criteria tools for advanced aircraft composite and metallic components.  Continue efforts in certification of advanced composite for aircraft structures.  Develop an integrated system of data, models, and analysis tools that enable better decisions regarding fleet lifecycle management and sustainment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "24.828"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "24.828"
                                            },
                                            "Text": {
                                                "val": "Complete the technology development concepts for risk informed decision-making. Complete technology efforts for condition-based maintenance of structural integrity. Continue the technology development of failure criteria tools for advanced aircraft composite and metallic components. Continue efforts in certification of advanced composite for aircraft structures. Continue development of an integrated system of data, models, and analysis tools that enable better decisions regarding fleet lifecycle management and sustainment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Vehicle Design Technologies"
                                    },
                                    "Description": {
                                        "val": "Title changed from: Airworthiness Certification Technologies to Vehicle Design Technologies.\nDevelop methodologies to reduce the cost and time involved from design to full-scale testing of structural concepts and aircraft systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.765"
                                            },
                                            "Text": {
                                                "val": "Continued development of multi-disciplinary methodologies that will allow for lower cost analytical certification of advanced composite structures. Completed experimental validation of integrated system health management technologies for aircraft subsystems. Continued the development of advanced aircraft flutter analysis tools."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.600"
                                            },
                                            "Text": {
                                                "val": "Continue development of multi-disciplinary methodologies that will allow for lower cost advanced structures. Continue the development of advanced high fidelity aircraft design analysis tools.  Develop high fidelity multidisciplinary design methods to enable efficient supersonic air vehicle technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.785"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.785"
                                            },
                                            "Text": {
                                                "val": "Complete development of multi-disciplinary methodologies that will allow for lower cost advanced structures. Continue the development of advanced high fidelity aircraft design analysis tools.  Continue development high fidelity multidisciplinary design methods to enable efficient supersonic air vehicle technologies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Structural Concepts"
                                    },
                                    "Description": {
                                        "val": "Thrust title changed from Survivability and Performance Technologies Develop to Structural Concepts.  \nDevelop design methods, processes, and lightweight, adaptive, and multifunctional structural concepts to capitalize on new materials, multi-role considerations, and technology integration into aircraft systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.127"
                                            },
                                            "Text": {
                                                "val": "Continued the development of low-cost technologies to increase the survivability and performance of future aircraft systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.779"
                                            },
                                            "Text": {
                                                "val": "Continue the development of low-cost technologies to increase the survivability and performance of future systems. Develop efforts on energy efficient integration of conformal load bearing antenna technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.166"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.166"
                                            },
                                            "Text": {
                                                "val": "Continue efforts on energy efficient integration of conformal load bearing antenna structural concepts.  Develop lightweight, adaptive, and efficient structural concepts for future mobility and future air dominance."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Extreme Flight Environment Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop technologies that will permit the structural development of platforms that can operate at an extreme altitude, while at sustained speeds greater than Mach 2."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.860"
                                            },
                                            "Text": {
                                                "val": "Further developed technologies that incorporate advanced materials and design concepts for the creation of an integrated air vehicle structure that can withstand extreme flight environments. Continued to develop structural concepts and analysis methods for design and evaluation of hot primary structures. Completed the refinement of affordable space access concepts and applied these technologies for lower cost, reduced weight expendable vehicle airframes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.240"
                                            },
                                            "Text": {
                                                "val": "Continue to develop structural design concepts that incorporate promising materials and components for the creation of an integrated vehicle structure that can withstand extreme flight environments.  Validate extreme environment prediction methods to develop key hot structure design data.  Further development of analytical methods for predicting structural response needed for design and evaluation of hot primary structure for hypersonic vehicles."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "This work moves to Program 0602201, Project 622405 - High Speed Systems Technology."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "622403"
                    },
                    "ProjectTitle": {
                        "val": "Flight Controls and Pilot-Vehicle Interface"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "32.540"
                        },
                        "CurrentYear": {
                            "val": "35.222"
                        },
                        "BudgetYearOne": {
                            "val": "29.499"
                        },
                        "BudgetYearOneBase": {
                            "val": "29.499"
                        },
                        "BudgetYearTwo": {
                            "val": "28.281"
                        },
                        "BudgetYearThree": {
                            "val": "29.173"
                        },
                        "BudgetYearFour": {
                            "val": "30.404"
                        },
                        "BudgetYearFive": {
                            "val": "30.982"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops technologies that enable maximum affordable capability from manned and remotely piloted aerospace vehicles.  Advanced flight control technologies are developed for maximum vehicle performance throughout the flight envelope and simulated in virtual environments.  Resulting technologies contribute significantly towards the development of reliable autonomous remotely piloted air vehicles, space access systems with aircraft-like operations, and extended-life legacy aircraft."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Flight Controls Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop technologies for advanced control-enabled capabilities, including flight controls, components, and integrated vehicle monitoring systems for both manned and remotely piloted aircraft."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.660"
                                            },
                                            "Text": {
                                                "val": "Continued the development, assessment, and certification capability of advanced flight control mechanization technologies for highly reliable operations under adverse environments. Continued development of control configurations for small remotely piloted aerospace systems. Continued development of control systems hardening and health assessment technologies for enhanced survivability."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.886"
                                            },
                                            "Text": {
                                                "val": "Continue the development, demonstration, and assessment of advanced flight control mechanization technologies for trusted and certifiable operations under adverse and contested environments. Continue development of control configurations for small remotely piloted aerospace systems. Continue development of survivable and health-adaptive control system architectures. Complete the assessment of adaptive guidance and control technologies for fault\/damage tolerance in unmanned space access systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.846"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.846"
                                            },
                                            "Text": {
                                                "val": "Continue the development, demonstration, and assessment of advanced flight control mechanization technologies for trusted and certifiable operations under adverse and contested environments. Continue the development of survivable and health-adaptive control system architecture; developing new methods and expanding to include more aircraft systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Manned and Unmanned Teaming Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop technology for flight control systems that will permit safe interoperability between manned and remotely piloted aircraft."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.064"
                                            },
                                            "Text": {
                                                "val": "Continued the development and assessment of advanced control automation techniques. Continued the development of mixed initiative control techniques for multiple remotely piloted aircraft teams, as well as for the integration of unmanned systems into controlled airspace and airbase operations. Continued the development and assessment of adaptive guidance and control technologies for fault\/damage tolerance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.015"
                                            },
                                            "Text": {
                                                "val": "Continue development, demonstration, and assessment of advanced control automation techniques. Continue the development of mixed initiative control techniques for multiple remotely piloted aircraft teams in dynamic mission environments, as well as for the integration of unmanned systems into controlled airspace and airbase operations. Develop and assess manned-unmanned aircraft teams in tactical environments"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.297"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.297"
                                            },
                                            "Text": {
                                                "val": "Continue development, demonstration, and assessment of advanced control automation techniques. Continue the development of mixed initiative control techniques for teams of remotely piloted aircraft and\/or manned-unmanned teams in dynamic mission environments, as well as for the integration of unmanned systems into controlled airspace and airbase operations.  Complete study of airbase infrastructure options and implications, and initiate systems prototype development."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Flight Controls Technologies Modeling and Simulation"
                                    },
                                    "Description": {
                                        "val": "Develop tools and methods for capitalizing on simulation-based research and development of future aerospace vehicles."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.816"
                                            },
                                            "Text": {
                                                "val": "Continued to conduct modeling and simulation efforts to evaluate emerging flight control technologies and concepts, as well as assess mission-level performance of integrated air systems. Continued technology analyses of unmanned air systems in manned\/unmanned airspace and airbase operations. Refined trade studies of vehicle concepts for strike, mobility and reconnaissance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.321"
                                            },
                                            "Text": {
                                                "val": "Continue modeling and simulation efforts to evaluate emerging autonomous and robust flight control technologies and concepts, as well as assess mission-level performance of integrated aerospace systems. Continue analyses of automated unmanned air systems in controlled airspace and airbase operations, as well as in adversarial mission environments. Continue trade studies of vehicle concepts for strike, mobility and reconnaissance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.356"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.356"
                                            },
                                            "Text": {
                                                "val": "Continue modeling and simulation efforts to evaluate emerging autonomous and robust flight control technologies and concepts, as well as assess mission-level performance of integrated aerospace systems. Continue analyses of automated unmanned air systems and manned-unmanned teams in controlled airspace and airbase operations, as well as in adversarial mission environments.  Continue trade studies of vehicle concepts for strike, mobility and reconnaissance."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "622404"
                    },
                    "ProjectTitle": {
                        "val": "Aeromechanics and Integration"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "38.213"
                        },
                        "CurrentYear": {
                            "val": "40.356"
                        },
                        "BudgetYearOne": {
                            "val": "27.306"
                        },
                        "BudgetYearOneBase": {
                            "val": "27.306"
                        },
                        "BudgetYearTwo": {
                            "val": "25.263"
                        },
                        "BudgetYearThree": {
                            "val": "29.140"
                        },
                        "BudgetYearFour": {
                            "val": "28.507"
                        },
                        "BudgetYearFive": {
                            "val": "29.104"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops aerodynamic configurations of a broad range of revolutionary, affordable aerospace vehicles.  It matures and applies modeling and numerical simulation methods for fast and affordable aerodynamics prediction and integrates and demonstrates multi-disciplinary advances in airframe, propulsion, weapon and air vehicle control integration."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Aerodynamic Systems Technologies"
                                    },
                                    "Description": {
                                        "val": "Name change from Aeronautical Technologies for Unmanned Aircraft to Aerodynamic Systems Technologies. Develop aerodynamic assessment prediction methods centered on expanding the design capabilities of future air vehicles."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.484"
                                            },
                                            "Text": {
                                                "val": "Continued to develop and assess aeronautical technologies that enable broad use of unmanned aircraft.  Continued work to develop and demonstrate flow control to enable unsteady load suppression, fluidic thrust\nvectoring, area control, and thermal management for a remotely piloted aircraft. Continued development of innovative aerodynamic control methods for remotely piloted aircraft."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.643"
                                            },
                                            "Text": {
                                                "val": "Continue to develop and assess aeronautical technologies that enable broad use of unmanned aircraft.  Complete demonstration of flow control techniques to enable unsteady load suppression for unmanned ISR platforms and future fleet mobility aircraft to increase aerodynamic efficiency.  Continue development of innovative aerodynamic control methods for integrating high bypass propulsion for unmanned ISR platforms and future mobility aircraft."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.245"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.245"
                                            },
                                            "Text": {
                                                "val": "Continue to develop and assess aerodynamic  technologies that enable future revolutionary manned and unmanned air vehicles.  Continue to develop and assess advanced aircraft configurations for Mobility and Air Dominance.  Complete technology assessments on next generation Air Dominance vehicle concepts.  Initiate technology assessments on next generation tanker and transport systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Concepts, Designs, and Analysis of High Speed Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop new and improved concepts, designs, and analysis of technologies to enable revolutionary capabilities for sustained high-speed re-useable high altitude vehicle efforts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.811"
                                            },
                                            "Text": {
                                                "val": "Continued to develop technologies to enable high-speed flight. Continued development of analysis\/design techniques and tools to enable shock\/boundary layer interaction flow control and enhanced stability for\nhigh-speed propulsion concepts. Continue efforts to characterize high-speed phenomena and develop and validate fundamental high-speed component technologies through experimental flight techniques in a relevant environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.583"
                                            },
                                            "Text": {
                                                "val": "Continue to develop technologies to enable high-speed flight. Continue development of analysis\/design techniques and tools to enable shock\/boundary layer interaction flow control and enhanced stability for high-speed propulsion concepts. Continue efforts to characterize high-speed phenomena and develop and validate fundamental high-speed component technologies through experimental testing in a relevant environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "This work will move to Project 622405 - High Speed Systems Technology."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Next Generation Aerodynamic Technologies"
                                    },
                                    "Description": {
                                        "val": "Thrust title changed from Next Generation Multi-Role Large Aircraft Technologies to Next Generation Aerodynamic Technologies for clarity. Effort and focused remained the same, to develop and assess technologies for the next generation of multi-role large aircraft."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "21.918"
                                            },
                                            "Text": {
                                                "val": "Continued to develop aerodynamic and propulsion integration technologies that enable multiple roles and missions for delivery and support aircraft. Conducted analyses and experiments to investigate flow control\nfor suppression of unsteady flow and enhanced drag reduction, and to enhance platform performance with integrated propulsion."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "23.130"
                                            },
                                            "Text": {
                                                "val": "Continue high fidelity aerodynamic analysis and method development.  Continue development of practical laminar flow technologies to highly swept wings and higher Reynolds numbers.  Begin studies and analysis to investigating more extensive legacy fleet fuel savings opportunities for drag reduction and formation flight."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.929"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.929"
                                            },
                                            "Text": {
                                                "val": "Continue high fidelity aerodynamic analysis and method development.  Continue development of practical laminar flow technologies to highly swept wings and higher Reynolds numbers. Continue studies and analysis to investigating more extensive legacy fleet fuel savings opportunities for drag reduction and formation flight"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aircraft Integration Technologies"
                                    },
                                    "Description": {
                                        "val": "This is a new major thrust.  Develop enabling technologies to allow efficient and effective integration of propulsion, weapons, and subsystems into current and future air vehicles."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.132"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.132"
                                            },
                                            "Text": {
                                                "val": "Develop aerodynamic and propulsion integration technologies that enable future mobility and fighter aircraft.  Develop analyses and experiments to investigate propulsion integration flow control to enhance vehicle performance.  Development of innovative aerodynamic control methods for integrating high bypass propulsion for future mobility aircraft.  Development of propulsion integration system for a next generation high bypass ration engine.  Development of advanced weapons integration concepts for next generation Air Dominance."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "622405"
                    },
                    "ProjectTitle": {
                        "val": "High Speed Systems Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "16.163"
                        },
                        "BudgetYearOneBase": {
                            "val": "16.163"
                        },
                        "BudgetYearTwo": {
                            "val": "15.199"
                        },
                        "BudgetYearThree": {
                            "val": "16.141"
                        },
                        "BudgetYearFour": {
                            "val": "16.648"
                        },
                        "BudgetYearFive": {
                            "val": "18.353"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "This is a new Project, starting in FY15."
                        },
                        "ProjectMissionDescription": {
                            "val": "This program investigates, analyzes and develops high speed\/hypersonic aerospace vehicle technologies. Advanced high temperature structures concepts are explored and developed to exploit new materials, fabrication processes, and design techniques. Advanced aerodynamic vehicle configurations are developed and analyzed through simulations, experiments, and multi-disciplinary analyses. Advanced flight control technologies are developed and simulated for hypersonic vehicles. These technologies will enable future high speed weapons; intelligence, surveillance and reconnaissance systems; and space access vehicles"
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "High Speed Systems Technology"
                                    },
                                    "Description": {
                                        "val": "Develop high temperature structural analysis methods and technologies for extreme operating conditions in current and future air vehicles."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.231"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.231"
                                            },
                                            "Text": {
                                                "val": "Initiate development of innovative structural concepts for high speed\/hypersonic air vehicles.  Initiate development of analytical methods for predicting structural response needed for design and evaluation of hot primary structure for hypersonic vehicles.   Initiate the impact of path dependent structural behavior on the service life prediction for hot structures encountering extreme environments. Initiate the development and integrate model uncertainty methods into multi-disciplinary simulations and quantify its impact on the structural margin. Initiate development of structural analysis methods and technology for hot structure concepts under extreme environment loading conditions. Initiate the assessment of the aerospace community to quantify the structural margins for extreme environment hot structure through experimental validation of ground test articles."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Speed Vehicle Aeromechanics and Integration"
                                    },
                                    "Description": {
                                        "val": "Develop new and improved components, concepts, and designs for sustained flight of high-speed\/hypersonic expendable and re-useable vehicles. Conduct analyses of high speed\/hypersonic vehicles to enable revolutionary capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.932"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.932"
                                            },
                                            "Text": {
                                                "val": "Mature critical technologies for high speed\/hypersonic flight.  Begin development of design\/analysis techniques\/tools and experimental approaches to enable enhanced high-speed air induction system starting, operability, and performance for propulsion integration concepts over a wide range of flight conditions.  Begin development of high speed system concepts that provide revolutionary capabilities.  Investigate aeromechanic technologies to reduced drag and enable robust stability & control at low dynamic pressure flight conditions.  Initiate efforts to characterize high-speed phenomena and develop and validate fundamental high-speed technologies through experimental testing. As part of international collaborative effort, conduct flight tests of Mach 6 adaptive guidance and control flight experiment and Mach 8 ethylene powered sustained cruise flight experiment. Develop design of multi-functional terminal sensor integrated flight experiment. Complete refined, mission-level modeling and simulation of preferred high speed weapon alternatives.  Assess mission-level effectiveness and refine definition of preferred high speed weapon alternatives. Develop campaign-level modeling and simulation of high speed weapon alternatives. Assess campaign-level benefits of preferred high speed weapon alternatives"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}