{
    "id": "6a33eaaf16b0146ec9a8aa411ce19defb2cd8232",
    "meta": {
        "filename": "dod-2015_RDTE_2015_NAVY_BA4_RDTE_JustificationBook_Navy_PB_2015.zzz_unzipped_RDTE_JustificationBook_Navy_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603563N"
        },
        "ProgramElementTitle": {
            "val": "Ship Concept Advanced Design"
        },
        "R1LineNumber": {
            "val": "42"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "122.527"
            },
            "PriorYear": {
                "val": "22.193"
            },
            "CurrentYear": {
                "val": "17.501"
            },
            "BudgetYearOne": {
                "val": "17.864"
            },
            "BudgetYearOneBase": {
                "val": "17.864"
            },
            "BudgetYearTwo": {
                "val": "19.365"
            },
            "BudgetYearThree": {
                "val": "11.529"
            },
            "BudgetYearFour": {
                "val": "11.870"
            },
            "BudgetYearFive": {
                "val": "12.162"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Explore alternative surface ship force structures, advanced surface ship and unmanned surface vehicles concepts, and the potential technologies for these force structures and advanced concepts in support of pre-acquisition mission needs analysis, mission area analysis, and planning. The objective is a more affordable, mission capable surface ship force including increased ship production capability; ships with reduce manning, reduced operating and support costs, and greater utilization of the latest technology. The program directly supports the Navy Shipbuilding Plan with state-of-the-art design tools and methods for surface ship force structure alternative studies, ship & unmanned vehicle concept studies, and the actual conduct of surface ship force structure alternative studies and advanced design concept studies for the ships that may become part of the shipbuilding plan.\n\nProject 2196 - This project funds concept development engineering, mission effectiveness analysis, and other analyses for formulation of future surface ship force structure along with development of the tools to accomplish these efforts. Efforts include advanced ship concept studies, ship and ship systems technology assessments, and the development and upgrade of ship concept design and engineering tools, methods, and criteria.\n\nProject 3161 - This project funds a prioritized portfolio of time-sensitive initiatives through integrated efforts in Cross Platform Systems Development (CPSD), furthering Sea Enterprise through the development of support elements meeting relevant needs of the warfare community.  The areas of exploration for CPSD include surface ship concept advanced development, next generation unmanned surface vehicle, high speed ships, tool integration and technical data exchange, embedded interoperability engineering, and mission capability systems engineering.  The research products developed by this project directly support and influence both immediate fleet requirements and future acquisition programs by providing a range of technically acceptable alternatives and evaluation of emerging technologies. \n\nIn particular, tasks within this project continue to directly support interoperability testing and certification for Littoral Combat Ship (LCS) and other platforms in deploying battle groups, development and certification of Safe Operating Envelope (SOE) tools for surface combatants (CG 47, DDG 51, DDG 1000), Total Ownership Cost (TOC) pilot programs, future flexible and modular warship analyses, and development of specifications and processes to reduce production costs of platforms.  \n\nTasks within this project continue to directly support the Test and Evaluation Master Plan (TEMP) execution for multiple ship classes including, LCS, JHSV, and DDG 1000 reducing Live Fire Test and Evaluation (LFT&E) costs, furthered validation of hydrodynamic simulation tool supporting DDG 1000 Hull Form Plan (HFP), have increased technology readiness level for aluminum combatants, developed tools to execute the CG 47 Cracking Task Force recommendations, increased situational awareness for deploying strike groups.  This project supports NAVSEA's core mission and allows for improved performance and reduced cost of current and future naval platforms.\n\nProject 3376 - Strategic Sealift Research and Development - Develops new concepts and technologies which can be applied to or will enable future strategic sealift, and Seabasing systems. The technologies include ship configuration concepts, equipment to increase cargo handling and cargo loading\/unloading rates (including commercial and merchant ship systems), improved man\/machine interfaces, improved structural configurations and materials, and Logistics-Over-the-Shore (LOTS) equipment and system improvements. This project is a continuation of efforts accomplished under NDSF BA 04 Project 3116 Strategic Sealift Research and Development and is not a new start. \n\nNote:  NDSF BA 04 Project 3116 Strategic Sealift Research and Development amounts:  FY 2013: $6.169M; FY 2014: $6.288M"
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "24.609"
                },
                "CurrentYear": {
                    "val": "20.501"
                },
                "BudgetYearOne": {
                    "val": "16.049"
                },
                "BudgetYearOneBase": {
                    "val": "16.049"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "22.193"
                },
                "CurrentYear": {
                    "val": "17.501"
                },
                "BudgetYearOne": {
                    "val": "17.864"
                },
                "BudgetYearOneBase": {
                    "val": "17.864"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.416"
                },
                "CurrentYear": {
                    "val": "-3.000"
                },
                "BudgetYearOne": {
                    "val": "1.815"
                },
                "BudgetYearOneBase": {
                    "val": "1.815"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-3.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.363"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "2.304"
                                },
                                "BudgetYearOneBase": {
                                    "val": "2.304"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.001"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.489"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.489"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-2.054"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funding:\n\nFunding:\n\nProjects 2196\/3161:  FY 2013 reductions reflect Congressionally mandated sequestration and general reductions.\n\nProjects 2196\/3161\/3376:  FY 2015 reductions reflect the Department's decision to reduce contracted services. \n\nProject 3161:  The FY 2015 program was adjusted to properly phase program requirements with expenditures.\n\nProject 3376: Prior to FY 2015, Project 3376 was funded in the National Defense Sealift Fund (NDSF) Appropriation, BA 04, Project 3116 Strategic Sealift Research & Development."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "2196"
                    },
                    "ProjectTitle": {
                        "val": "Design, Tools, Plans and Concepts"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.518"
                        },
                        "PriorYear": {
                            "val": "0.503"
                        },
                        "CurrentYear": {
                            "val": "0.465"
                        },
                        "BudgetYearOne": {
                            "val": "0.433"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.433"
                        },
                        "BudgetYearTwo": {
                            "val": "0.446"
                        },
                        "BudgetYearThree": {
                            "val": "0.452"
                        },
                        "BudgetYearFour": {
                            "val": "0.458"
                        },
                        "BudgetYearFive": {
                            "val": "0.468"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project provides the foundation for an affordable and mission capable surface ship force. It also supports the next step in the development of a transformed naval force by accomplishing the pre-milestone A (especially pre-concept decision) efforts for all potential surface ships and craft. These efforts are the required first step in the integration of total ship systems, including combat systems, weapons systems and Hull, Mechanical and Electrical (HM&E) systems. Inadequate early planning and ship concept formulation can result in down-stream design, construction and operational problems. A more subtle and severely negative impact of neglecting this early effort is that the \"best\" concepts and technologies may never even be considered and our greatest potential ship design advances never realized. Designs and technologies must meet the threat. This project supports this requirement.\n\nThis project funds concept development engineering, mission effectiveness analysis, and other analyses for formulation of future surface ship force structure along with development of the tools to accomplish these efforts. Advanced ship concept studies, ship and ship systems technology assessments, and the development and upgrade of ship concept design and engineering tools, methods, and criteria are also funded in this project.\n\nThis project accomplishes the following: (1) Develops alternative surface ship force structure concepts including the ships and unmanned vehicles; (2) Evaluates the mission capability effectiveness and costs for these alternative surface fleet architectures; (3) Performs fleet war fighting\/mission effectiveness assessment studies; (4) Identifies future surface ship requirements and characteristics necessary to meet future threats and support mission needs; (5) Investigates new affordable ship concepts and evaluates technologies necessary to support these concepts; (6) Provides design methods and automated design tools to develop and evaluate ship concepts; and (7) Supports development of Initial Capabilities Documents (ICD) and analogous early requirements documents for future ships. These efforts are done to support mission analysis; mission needs development and technology assessment in support of future fleet concepts and potential ship acquisition programs. These efforts are fundamental to the Navy's formulation of the future fleet.\n\nSupports concept exploration and mission needs assessment for potential future ship acquisition programs, however, these are not direct efforts for specific, authorized shipbuilding programs. This project supports and maintains this country's naval ship design and engineering capabilities in the area of very early stage (Concept Design) design tools, criteria, and methods."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Ship Concepts and Mission Need Analysis"
                                    },
                                    "Description": {
                                        "val": "Develop ship concepts and perform analysis for potential ships and Force Architecture 5-10 years out in shipbuilding plan."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.434"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued concept designs for small surface combatants to develop flexible and affordable platforms.  These efforts enable the design of future affordable surface combatants with increased reliable, efficient, long range, high speed and optimized payload capabilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.391"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continuation of concept designs for small and medium surface combatants that develop agile, fuel efficient and flexible platforms capable of operating in required environments.  These efforts will enable the design of future affordable surface combatants with increased reliable, efficient, long range, high speed and optimized payload capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.433"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.433"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop concepts of integrating unmanned vehicles aboard surface ships.  Refine cost analyses of surface ship design and construction.  Further improve surface ship design tools.  Continue concept development efforts to explore flexible, modular surface combatants."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Total Ship Technology Assessment (TSTA)"
                                    },
                                    "Description": {
                                        "val": "Analyze the benefits and impacts of new ship, Hull, Mechanical & Electrical (HM&E) concepts, technologies and warfare systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.069"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed FY12 TSTA tasks as well as integration of design of an advanced total platform energy monitoring system as well as reduced manning capabilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.074"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Commence development on small scale tools to automate challenging and\/or labor intensive naval arch activities (such as weight reports, liquid loading vs. trim scenarios) and to add capability to existing software tools.  The products would be to aid in the in-house technical capability of the Navy in conducting pre-AoA studies for surface ships."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "RDTEN\/0204202N"
                                    },
                                    "Title": {
                                        "val": "DDG-1000"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "120.842"
                                        },
                                        "CurrentYear": {
                                            "val": "187.904"
                                        },
                                        "BudgetYearOne": {
                                            "val": "202.522"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "202.522"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "128.998"
                                        },
                                        "BudgetYearThree": {
                                            "val": "7.226"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTEN\/0603512N"
                                    },
                                    "Title": {
                                        "val": "Carrier Systems Development"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "97.668"
                                        },
                                        "CurrentYear": {
                                            "val": "80.899"
                                        },
                                        "BudgetYearOne": {
                                            "val": "5.959"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "5.959"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "6.368"
                                        },
                                        "BudgetYearThree": {
                                            "val": "5.570"
                                        },
                                        "BudgetYearFour": {
                                            "val": "5.566"
                                        },
                                        "BudgetYearFive": {
                                            "val": "5.702"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTEN\/0603564N"
                                    },
                                    "Title": {
                                        "val": "Ship Preliminary Design\/Feasibility"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "35.737"
                                        },
                                        "CurrentYear": {
                                            "val": "38.117"
                                        },
                                        "BudgetYearOne": {
                                            "val": "23.716"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "23.716"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "29.895"
                                        },
                                        "BudgetYearThree": {
                                            "val": "31.791"
                                        },
                                        "BudgetYearFour": {
                                            "val": "38.498"
                                        },
                                        "BudgetYearFive": {
                                            "val": "39.194"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTEN\/0604567N"
                                    },
                                    "Title": {
                                        "val": "Ship Contract Design\/Live Fire T&E"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "165.907"
                                        },
                                        "CurrentYear": {
                                            "val": "187.421"
                                        },
                                        "BudgetYearOne": {
                                            "val": "48.470"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "48.470"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "40.275"
                                        },
                                        "BudgetYearThree": {
                                            "val": "35.376"
                                        },
                                        "BudgetYearFour": {
                                            "val": "34.322"
                                        },
                                        "BudgetYearFive": {
                                            "val": "34.540"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTEN\/0603582N"
                                    },
                                    "Title": {
                                        "val": "Combat System Integration"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "45.131"
                                        },
                                        "CurrentYear": {
                                            "val": "4.396"
                                        },
                                        "BudgetYearOne": {
                                            "val": "20.881"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "20.881"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "33.195"
                                        },
                                        "BudgetYearThree": {
                                            "val": "32.355"
                                        },
                                        "BudgetYearFour": {
                                            "val": "29.196"
                                        },
                                        "BudgetYearFive": {
                                            "val": "29.814"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "This is a non acquisition program that develops, evaluates, and validates early stages of total ship concepts and technologies in support of SCN planning and potential future ship acquisition programs. This program also supports development, demonstration, evaluation, and validation of engineering tools, methods, and criteria for those concept designs and assessments."
                        },
                        "PerformanceMetrics": {
                            "val": "Quarterly Program Reviews"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3161"
                    },
                    "ProjectTitle": {
                        "val": "NAVSEA Tech Authority"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "122.009"
                        },
                        "PriorYear": {
                            "val": "21.690"
                        },
                        "CurrentYear": {
                            "val": "17.036"
                        },
                        "BudgetYearOne": {
                            "val": "11.838"
                        },
                        "BudgetYearOneBase": {
                            "val": "11.838"
                        },
                        "BudgetYearTwo": {
                            "val": "13.391"
                        },
                        "BudgetYearThree": {
                            "val": "5.524"
                        },
                        "BudgetYearFour": {
                            "val": "5.596"
                        },
                        "BudgetYearFive": {
                            "val": "5.752"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project has been established to support NAVSEA Technical Authority through coordinated, collaborative, cross-platform systems development resulting in advanced capabilities across business lines through development adaptation and extension of processes, procedures, and tools necessary to develop and explore alternative surface ship force structures; advanced surface ship and unmanned surface vehicle concepts; interoperability; and development of systems level engineering criteria and options to support these force structures and advanced concepts as part of pre-acquisition mission needs analysis, mission area analysis, SCN, and R&D planning. The objective is the coordination of ongoing early-stage concept design and development efforts for cross-platform applicability to result in a more affordable, mission-capable, and interoperable surface ship forces including ships with reduced manning, increased ability to produce, reduced operating and support costs, and greater utilization of the latest technology.\n\nNAVSEA Tech Authority efforts under Project 3161, known as the Cross Platform Systems Development (CPSD) Program enhance ongoing efforts within Project 2196 and transition directly to early-stage ship design for Ship Preliminary Design and Feasibility Studies and other Program Executive Office (PEO) ship design programs. While these efforts support concept exploration and mission needs assessment for potential future ship acquisition programs, they are not direct efforts for specific, authorized shipbuilding programs. This project is the only R&D effort (Government or commercial) that provides a coordinated, collaborative approach to the development of: cross-platform naval ship and weapon system design, as well as engineering capabilities in the areas of design tools, criteria, and methods. This project also provides innovative solutions for current Fleet issues involving Technical Authority, such as current interoperability issues with new systems or platforms.  \n\nNaval Ship System Engineering Tech Authority recapitalization and product development consolidates platform advanced concept development and design tool development in CPSD 1.0 (Platform Concept Advanced Development) and CPSD 2.0 (Platform Design and Certification Tools\/Engineering and Tech Data Exchange Development); and aligned standards and requirements development for modularity and system \/ component commonality within CPSD 3.0 (Ship Systems Engineering\/Modular Ship Systems Development). Program product areas support: platform-centric force architecture and concept development and tools (CPSD 1.0, CPSD 2.0), engineering products and system development (CPSD 3.0, CPSD 5.0), and system interoperability and mission capability for delivering ships (CPSDs 6.0, 8.0, 9.0). CPSD develops and transitions products to Technical Warrant Holder (TWH) community and develop prioritized plans and activities for future products from emerging cross platform technical requirements and associated capabilities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Platform Concept Advanced Development (CPSD 1.0)"
                                    },
                                    "Description": {
                                        "val": "This effort directly supports the Navy's ability to understand risk and associated cost of surface warfare assets; Pre-Milestone A ship, craft, and unmanned surface vehicle (USV) design and analysis."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.538"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed the NAVSEA ship concept development processes for supporting the Long Range Shipbuilding Strategy (LRSS), Capability Based Analyses (CBAs), Analyses of Alternatives (AoAs), and new technology impact assessment. Developed design space exploration methods that leverage previous Navy design tool investments by employing behavior models of higher fidelity, but more time consuming techniques. This allowed much more comprehensive trade studies in support of Capabilities Based Assessments and Analyses of Alternatives.  Continued next generation surface ship, and unmanned vehicle concept exploration. Determined ship impacts of a potential future SM-3 missile with liquid fuel."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.158"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to develop the NAVSEA ship concept development processes for supporting the LRSS, CBAs, AOAs, inform ship design policy and new technology impact assessment. It will develop design space exploration methods that leverage previous Navy design tool investments by employing behavior models of higher fidelity. This will allow much more comprehensive trade studies in support of Capabilities Based Assessments and Analyses of Alternatives.  Continue next generation surface ship, submarine and unmanned vehicle concept exploration."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.091"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.091"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Explore concepts for flexible and modular surface ships that meet Long Range Shipbuilding Strategy capability goals at reduced cost.  Develop concepts for surface ship designs that optimize the use of unmanned vehicles.  Explore ways to extend mission modularity concepts from LCS to other surface ship platforms."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Platform Design and Certification Tools\/Engineering and Tech Data Exchange (CPSD 2.0)"
                                    },
                                    "Description": {
                                        "val": "This effort supports the development of validation tools to certify the safety and mission capability of platform concepts and subsequently ships and submarines; establishes the integrated NAVSEA suite. This effort advances platform design methods, design validation tools, cost tools, manpower tools, and tools to aid in rapid total platform definition."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.359"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued tool development and upgrade to aide in early stage concept design including Advanced Ship Synthesis and Evaluation Tool (ASSET) and Leading Edge Architecture for Prototyping Systems (LEAPS). Continued the development of tools that allow for reliable, efficient, long-range, high-speed platforms with optimized payload capabilities. Continued the development of early stage ship design tools supporting total ownership cost reductions through enhancements of performance based cost models and manpower assessment tools."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.775"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to develop tools that allow for reliable, efficient, long-range, high-speed platforms with optimized payload capabilities. Continue to develop early stage ship design tools supporting total ownership cost reductions through enhancements of performance based cost models and manpower assessments tools."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.673"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.673"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Refine high-speed computer modeling tools that assist with early stage ship design.  Conduct research on the replacement of two dimensional drawings with three dimensional computer models, including their use for review and approval of ship designs.  Develop interfaces between tools used for design with those used for manufacture and repair."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ship Systems Engineering \/Modular Ship Systems Development (CPSD 3.0)"
                                    },
                                    "Description": {
                                        "val": "This effort supports Ship system development with a focus on technology transition, modularity, ship system technology integration, and design standards for new ship classes for pre-Analysis of Alternatives (AoA) studies and ongoing program of record (PoR) ship development."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.440"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Improved processes for technology upgrades during midlife overhauls that allow for affordable fleet\/force modernization.  Allowed for long term strategic use of platform and system modularity to enable an affordable future fleet."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.837"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to improve processes for technology upgrades during midlife overhauls that allow for affordable fleet\/force modernization.  Allow for long term strategic use of platform and system modularity to enable an affordable future fleet.  Continued analysis of fracture mechanics assessment for failure of aluminum structure after a cracking incident to determine inspection periodicity and temporary repair techniques for in-service CG, DDG LCS, and JHSV platforms."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.732"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.732"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Explore cross platform approaches to solving corrosion problems, techniques and applications not being developed by other programs.  Develop the use of composite materials for use in more shipboard applications.  Analyze the logistical and engineering aspects of the application of 3D printing technology for shipboard use in building spare parts.  Assess the current state of technology of robotic methods of cleaning, welding, painting, and inspecting shipboard tank and void spaces."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Speed Ships and Craft Engineering (CPSD 5.0)"
                                    },
                                    "Description": {
                                        "val": "This effort supports the development of concepts for future high speed ships and craft that promise improved mission effectiveness in mobility, survivability, and warfare mission areas."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.739"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Initiated development of improved platform stealth and survivability.  Initiated development of a R&D engineering model to support the development, design, acquisition, R&D testing and acceptance of a future modular mission ice capable surface combatant.  Continued the development of various analytical tools. Continued the planning and performance of a prescribed set of model tests and extensive analyses to support development of surface ship Safe Operating Envelope (SOE) and Heavy Weather Guidance (HWG) products. The analytical methods being developed include a simulation tool required to characterize ship motions in environments not within the Navy's ability to test. Continued to support software integration and associated training guidance for the ship's crew. This includes supporting the development of the requirements for Human System Integration (HSI), Human Computer Interface (HCI), and training."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.546"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue the development of improved platform stealth and survivability.  Continue to develop a R&D engineering model to support the development, design, acquisition, R&D testing and acceptance of a future modular mission ice capable surface combatant.  Continue the development of analytical tools, and continue a prescribed set of model tests and extensive analyses to support development of surface ship SOE and HWG products. The analytical methods being developed include a simulation tool required to characterize ship motions in environments not within the Navy's ability to test. Continue to support the integration of capability on the ship and associated training guidance for the ship's crew. This includes supporting the development of the requirements for HSI, HCI, and training."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.780"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.780"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue development of analytical tools for the generation of surface ship SOE and HWG products.  Complete and deliver surface ship HWG.  Complete Verification, Validation, and Accreditation (VV&A) of the simulation tool for characterizing ship motions in environments not within ability to test.  Continue simulation runs of ship motions in prescribed environmental conditions required to develop the surface ship SOE.  Explore innovative approaches for increased waterjet efficiency.  Review technologies developed for small craft over past years and assess applicability to ships."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Alternative Power Systems Engineering (CPSD 6.0)"
                                    },
                                    "Description": {
                                        "val": "This effort investigates concepts for ships and craft with alternative power\/propulsion systems evaluating effectiveness in mobility, survivability, and warfare mission areas."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.525"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Began development of processes and standards required to enable safe Fleet implementation and operation of lithium batteries and fuel cells.  Developed and validated surface ship operating profiles, fuel consumption models and fuel consumption calculation tools, manuals, and instructions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.148"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Evaluation of pod propulsor for future ship concept design.  Develop and evaluate energy harvesting technology for mobility and primary mission systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.081"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.081"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Refine concepts for efficiently providing pulse power aboard ship to energy weapons.   Examine energy harvesting methods for use by ship-launched unmanned vehicles.  Develop products supporting Forward Deployed Energy (FDE) techniques for refueling unmanned vehicles."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Embedded Interoperability (I\/O) Engineering (CPSD 8.0)"
                                    },
                                    "Description": {
                                        "val": "This effort establishes and executes a dedicated process for evaluating the interoperability performance of warfare systems early in the acquisition cycle, prior to certification.  Embedded I\/O ensures that fewer mission critical system failures degrade the ultimately fielded war fighting capability.  Focus on emerging Open Architecture warfare systems, including LCS 1 and 2."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.906"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Focused on development of high performance, low cost communication solutions for improved information dominance and interoperability."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.682"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue the focus on development of high performance, low cost communication solutions for improved information dominance and interoperability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.642"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.642"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Explore methods of further reducing costs of achieving certified interoperable systems.  Develop concepts making use of virtual reality and automated data assistants to lessen the information overload problem for ship combat system operators."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mission Capability Systems Engineering (CPSD 9.0)"
                                    },
                                    "Description": {
                                        "val": "This effort supports the development of force-level systems engineering criteria and guidance at the Systems of Systems (SoS) and Family of Systems (FoS) level.  This effort allows for the enhanced warfighter and system performance with reduced personnel costs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.183"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Created design engineering standards incorporating human capacities into system performance.  Incorporated the human element into design and control of autonomous and robotic systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.890"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Create a federated network architecture (combat systems, HM&E, and C4I) in future Surface Combatants with the focus on integration into both LCS classes."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.839"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.839"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete federated network architecture study."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "RDTEN\/0204202N"
                                    },
                                    "Title": {
                                        "val": "DDG-1000"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "120.842"
                                        },
                                        "CurrentYear": {
                                            "val": "187.904"
                                        },
                                        "BudgetYearOne": {
                                            "val": "202.522"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "202.522"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "128.998"
                                        },
                                        "BudgetYearThree": {
                                            "val": "7.226"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "1753.777"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTEN\/0603512N"
                                    },
                                    "Title": {
                                        "val": "Carrier Systems Development"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "97.668"
                                        },
                                        "CurrentYear": {
                                            "val": "80.899"
                                        },
                                        "BudgetYearOne": {
                                            "val": "5.959"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "5.959"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "6.368"
                                        },
                                        "BudgetYearThree": {
                                            "val": "5.570"
                                        },
                                        "BudgetYearFour": {
                                            "val": "5.586"
                                        },
                                        "BudgetYearFive": {
                                            "val": "5.702"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTEN\/0603564N"
                                    },
                                    "Title": {
                                        "val": "Ship Preliminary Design\/Feasibility Studies"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "35.737"
                                        },
                                        "CurrentYear": {
                                            "val": "38.117"
                                        },
                                        "BudgetYearOne": {
                                            "val": "23.716"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "23.716"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "29.895"
                                        },
                                        "BudgetYearThree": {
                                            "val": "31.791"
                                        },
                                        "BudgetYearFour": {
                                            "val": "38.498"
                                        },
                                        "BudgetYearFive": {
                                            "val": "39.194"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTEN\/0604567N"
                                    },
                                    "Title": {
                                        "val": "Ship Contract Design\/Live Fire T&E"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "165.907"
                                        },
                                        "CurrentYear": {
                                            "val": "187.421"
                                        },
                                        "BudgetYearOne": {
                                            "val": "48.470"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "48.470"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "40.275"
                                        },
                                        "BudgetYearThree": {
                                            "val": "35.376"
                                        },
                                        "BudgetYearFour": {
                                            "val": "34.322"
                                        },
                                        "BudgetYearFive": {
                                            "val": "34.540"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTEN\/0603582N"
                                    },
                                    "Title": {
                                        "val": "Combat System Integration"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "45.131"
                                        },
                                        "CurrentYear": {
                                            "val": "4.396"
                                        },
                                        "BudgetYearOne": {
                                            "val": "20.881"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "20.881"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "33.195"
                                        },
                                        "BudgetYearThree": {
                                            "val": "32.355"
                                        },
                                        "BudgetYearFour": {
                                            "val": "29.196"
                                        },
                                        "BudgetYearFive": {
                                            "val": "29.814"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "This is a non acquisition program that develops, evaluates, and validates early stages of total ship concepts and technologies in support of SCN planning and potential future ship acquisition programs. This program also supports development, demonstration, evaluation, and validation of engineering tools, methods, and criteria for those concept designs and assessments. This program provides validated engineering tools, methods, and criteria for ship, and weapon system concept designs and assessments while fostering collaboration and coordination of efforts resulting in more effective use of funding."
                        },
                        "PerformanceMetrics": {
                            "val": "Quarterly Program Reviews"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3376"
                    },
                    "ProjectTitle": {
                        "val": "Strategic Sealift"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "5.593"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.593"
                        },
                        "BudgetYearTwo": {
                            "val": "5.528"
                        },
                        "BudgetYearThree": {
                            "val": "5.553"
                        },
                        "BudgetYearFour": {
                            "val": "5.816"
                        },
                        "BudgetYearFive": {
                            "val": "5.942"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "Prior to FY 2015, Project 3376 was funded in PE 0408042N, National Defense Sealift Fund under Project 3116 Strategic Sealift Research & Development. This project is not a new start."
                        },
                        "ProjectMissionDescription": {
                            "val": "Project 3376 - Strategic Sealift Research and Development - Develops new concepts and technologies which can be applied to or will enable future strategic sealift, and Seabasing systems. The technologies include ship configuration concepts, equipment to increase cargo handling and cargo loading\/unloading rates (including commercial and merchant ship systems), improved man\/machine interfaces, improved structural configurations and materials, and Logistics-Over-the-Shore (LOTS) equipment and system improvements."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Shipboard Crane Systems\/Shipboard Cargo Systems"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.163"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.163"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FY15 - Continue investigation and demonstration of shipboard crane\/cargo systems improvements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Sealift Concept Development"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.430"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.430"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FY15 - Continue providing Advanced Planning, Sealift Research, and Technology development and program guidance."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Lighter\/HSV Seabase to Shore Cargo Transfer"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FY15 - Continue development and demonstration of at-sea vehicle transfer capability."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable for SEALIFT R&D efforts."
                        },
                        "PerformanceMetrics": {
                            "val": "Annual Program Review."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0603563N_3376_FILE1.PNG"
                                }
                            }
                        ]
                    }
                }
            ]
        }
    }
}