{
    "id": "6a87e7d5c4abff5311ca0aeecf116cebae769cc9",
    "meta": {
        "filename": "dod-2015_RDTE_2015_AIRFORCE_V3B_RDTE_JustificationBook_Air_Force_PB_2015.zzz_unzipped_RDTE_JustificationBook_Air_Force_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0305208F"
        },
        "ProgramElementTitle": {
            "val": "Distributed Common Ground\/Surface Systems"
        },
        "R1LineNumber": {
            "val": "214"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "43.580"
            },
            "CurrentYear": {
                "val": "6.321"
            },
            "BudgetYearOne": {
                "val": "27.265"
            },
            "BudgetYearOneBase": {
                "val": "27.265"
            },
            "BudgetYearTwo": {
                "val": "24.702"
            },
            "BudgetYearThree": {
                "val": "23.177"
            },
            "BudgetYearFour": {
                "val": "23.630"
            },
            "BudgetYearFive": {
                "val": "24.081"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "AF Distributed Common Ground Systems (DCGS) is a network-centric weapon system capable of tasking Intelligence, Surveillance and Reconnaissance (ISR) sensors and receiving, and providing the Processing, Exploitation, and Dissemination (PED) capability for data, information and intelligence from airborne, national, and commercial platforms and sensors. The weapon system consists of numerous active duty, Air National Guard, and mission partner sites interconnected by a robust communications infrastructure that allows collaborative reach-back operations.  Operators correlate collected Geospatial Intelligence (GEOINT), Signals Intelligence (SIGINT), and Measurement and Signature Intelligence (MASINT) data to provide decision-quality information to the Joint Task Force (JTF) and below, including significant support to time-critical targeting. AF DCGS is the primary PED capability for the U-2, Global Hawk, Predator, Reaper and Project Liberty.\n\nAF DCGS is modernizing through sustainment by integrating the necessary technologies and tools to provide increased capabilities and meet emerging and urgent operational needs.  These efforts will also integrate commercial and government furnished equipment upgrades to provide current technologies and achieve necessary application services.  The next series of upgrades will meet the operational need to integrate new and\/or improved sensor capabilities.  They will also enhance interoperability by migrating to a Service Oriented Architecture (SOA)and improving data sharing ability per DoD direction.\n\nThe DCGS Data Compression effort provides the warfighter a capability to efficiently compress and decompress airborne ISR sensor data and transmit near real-time to tactical users through current and future bandwidth limited commercial satellite communications (SATCOM) or military SATCOM.  The effort will develop, test and implement new sensor data compression and decompression algortihms for current and emerging airborne ISR sensors.  Additionally, the program develops compression and decompression capabilities for manned and unmanned airborne platforms, associated ground stations, and DCGS.   Outputs will meet standard certification for use within the DoD GEOINT and MASINT architectures.\n\nActivities include studies and analysis to support both current program planning and execution and future program planning.\n\nThis program is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "63.514"
                },
                "CurrentYear": {
                    "val": "7.498"
                },
                "BudgetYearOne": {
                    "val": "27.606"
                },
                "BudgetYearOneBase": {
                    "val": "27.606"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "43.580"
                },
                "CurrentYear": {
                    "val": "6.321"
                },
                "BudgetYearOne": {
                    "val": "27.265"
                },
                "BudgetYearOneBase": {
                    "val": "27.265"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-19.934"
                },
                "CurrentYear": {
                    "val": "-1.177"
                },
                "BudgetYearOne": {
                    "val": "-0.341"
                },
                "BudgetYearOneBase": {
                    "val": "-0.341"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.065"
                    },
                    "CurrentYear": {
                        "val": "-0.177"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "-15.000"
                    },
                    "CurrentYear": {
                        "val": "-1.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-4.869"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.341"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.341"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY13 $15M Congressional mark for Data Compression contract award delay.\n\nFY13 reductions in Other Adjustments was due to Sequestration.\n\nFY14 $1.000M Congressional reduction due to inadequate justification.\n\nFY15 $.341M reduction for higher Air Force needs."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "674826"
                    },
                    "ProjectTitle": {
                        "val": "Common Imagery Ground \/ Surface Systems"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "26.806"
                        },
                        "CurrentYear": {
                            "val": "6.294"
                        },
                        "BudgetYearOne": {
                            "val": "19.754"
                        },
                        "BudgetYearOneBase": {
                            "val": "19.754"
                        },
                        "BudgetYearTwo": {
                            "val": "19.867"
                        },
                        "BudgetYearThree": {
                            "val": "21.700"
                        },
                        "BudgetYearFour": {
                            "val": "22.124"
                        },
                        "BudgetYearFive": {
                            "val": "22.546"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "AF Distributed Common Ground Systems (DCGS) is a network-centric weapon system capable of tasking Intelligence, Surveillance and Reconnaissance (ISR) sensors and receiving and providing the Processing, Exploitation, and Dissemination (PED) capability for data, information and intelligence from airborne, national, and commercial platforms and sensors. The weapon system consists of numerous active duty, Air National Guard, and mission partner sites interconnected by a robust communications infrastructure that allows collaborative reach-back operations.  Operators correlate collected Geospatial Intelligence (GEOINT), Signals Intelligence (SIGINT), and Measurement and Signature Intelligence (MASINT) data to provide decision-quality information to the Joint Task Force (JTF) and below, including significant support to time-critical targeting. AF DCGS is the primary PED capability for the U-2, Global Hawk, Predator, Reaper and Project Liberty.\n\nAF DCGS is modernizing through sustainment by integrating the necessary technologies and tools to provide increased capabilities and meet emerging and urgent operational needs.  These efforts will also integrate commercial and government furnished equipment upgrades to provide current technologies and achieve necessary application services.  The next series of upgrades will meet the operational need to integrate new and\/or improved sensor capabilities.  They will also enhance interoperability by migrating to a Service Oriented Architecture (SOA) and improving data sharing ability per DoD direction.\n\nProgram actions are categorized by four distinct efforts. The GEOINT effort provides the capability for Planning, Collecting, Processing, Analysis and Dissemination (PCPAD) of imagery intelligence.  The Systems Release effort provides this capability for SIGINT. The Data Links effort provides Line-of-Site (LOS) and Satellite Communications (SATCOM) capabilities that allow AF DCGS to send and receive information between airborne Intelligence, Surveillance, and Reconnaissance (ISR) assets and the AF DCGS weapon system. The Network Communications effort involves modernizing AF DCGS infrastructure to improve data ingest, transfer, and storage capabilities while migrating the network toward a cloud architecture.\n \nAF DCGS also participates in the development, testing, and implementation of international standards (to include NATO standardization agreements) to ensure joint, allied, and coalition interoperability."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Geospatial Intelligence (GEOINT)"
                                    },
                                    "Description": {
                                        "val": "Integrate new and improved sensors for exploitation and analysis of imagery and geospatial information."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.362"
                                            },
                                            "Text": {
                                                "val": "Continued efforts to meet operational need to integrate new and improved sensors, increase capacity and imagery and geospatial data availability, and comply with DoD direction to improve interoperability through migration to a Service Oriented Architecture (SOA) construct."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.264"
                                            },
                                            "Text": {
                                                "val": "Continuing efforts to meet operational need to integrate new and improved sensors, increase capacity and imagery and geospatial data availability, and comply with DoD direction to improve interoperability through migration to a Service Oriented Architecture (SOA) construct."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.137"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.137"
                                            },
                                            "Text": {
                                                "val": "Will continue efforts to meet operational need to integrate new and improved sensors, increase capacity and imagery and geospatial data availability, virtualize sensor processing and comply with DoD direction to improve interoperability through migration to a Service Oriented Architecture (SOA) construct.  This includes integrating upgraded versions of electro-optical and synthetic aperture radar sensors."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Systems Release (SR)"
                                    },
                                    "Description": {
                                        "val": "Continue efforts to meet operational need to integrate new and improved sensors, increase capacity and signals intelligence  data availability, and comply with DoD direction to improve interoperability through migration to a Service Oriented Architecture (SOA) construct."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.924"
                                            },
                                            "Text": {
                                                "val": "Continued efforts to meet operational need to integrate new and improved sensors, increase capacity and signals intelligence  data availability, and comply with DoD direction to improve interoperability through migration to a Service Oriented Architecture (SOA) construct."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.350"
                                            },
                                            "Text": {
                                                "val": "Continuing efforts to meet operational need to integrate new and improved sensors, increase capacity and signals intelligence  data availability, and comply with DoD direction to improve interoperability through migration to a Service Oriented Architecture (SOA) construct."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.117"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.117"
                                            },
                                            "Text": {
                                                "val": "Will continue efforts to meet operational need to integrate new and improved sensors, increase capacity and signals intelligence data availability, and comply with DoD direction to improve interoperability through migration to a Service Oriented Architecture (SOA) construct. A major effort will involve beginning to virtualize the SIGINT capability throughout the weapon system."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Data Links"
                                    },
                                    "Description": {
                                        "val": "Upgrade the AF DCGS capability to transmit and receive information via data link architecture."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.700"
                                            },
                                            "Text": {
                                                "val": "Continued upgrading AF DCGS capability to transmit and receive information via data link architecture."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.350"
                                            },
                                            "Text": {
                                                "val": "Will continue upgrading AF DCGS capability to transmit and receive information via data link architecture. This will include integrating improved SATCOM terminals."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.500"
                                            },
                                            "Text": {
                                                "val": "Will continue upgrading AF DCGS capability to transmit and receive information via data link architecture. This will include integrating improved SATCOM terminals."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Network Communications (NETCOMMS)"
                                    },
                                    "Description": {
                                        "val": "Upgrade and evolve the AF DCGS communications network across the various architectures."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.850"
                                            },
                                            "Text": {
                                                "val": "Continued to upgrade and evolve the AF DCGS communications network across the various architectures."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.330"
                                            },
                                            "Text": {
                                                "val": "Continuing to upgrade and evolve the AF DCGS communications network across the various architectures."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.000"
                                            },
                                            "Text": {
                                                "val": "Will continue to upgrade and evolve the AF DCGS communications network across the various architectures establishing capabilities for remote hardware and software management. This will include initial effort to modernize the wide area network and extend the high speed data transport capability."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Geospatial Product Library (GPL)"
                                    },
                                    "Description": {
                                        "val": "Develop and integrate a greater variety of Imagery Intelligence sources and geospatial visualization capabilities in the GPL."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.970"
                                            },
                                            "Text": {
                                                "val": "Completed the development and integration of a greater variety of Imagery Intelligence sources and geospatial visualization capabilities in the GPL."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "RDT&E: BA07: PE 0305240F"
                                    },
                                    "Title": {
                                        "val": "Support to DCGS Enterprise"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "22.454"
                                        },
                                        "CurrentYear": {
                                            "val": "19.309"
                                        },
                                        "BudgetYearOne": {
                                            "val": "20.218"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "20.218"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "28.623"
                                        },
                                        "BudgetYearThree": {
                                            "val": "28.166"
                                        },
                                        "BudgetYearFour": {
                                            "val": "26.748"
                                        },
                                        "BudgetYearFive": {
                                            "val": "27.256"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "OPAF: BA07: Line Item #: 846080"
                                    },
                                    "Title": {
                                        "val": "DCGS-AF"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "90.434"
                                        },
                                        "CurrentYear": {
                                            "val": "97.149"
                                        },
                                        "BudgetYearOne": {
                                            "val": "181.556"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "181.556"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "125.106"
                                        },
                                        "BudgetYearThree": {
                                            "val": "143.353"
                                        },
                                        "BudgetYearFour": {
                                            "val": "129.351"
                                        },
                                        "BudgetYearFive": {
                                            "val": "128.076"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Air Force has changed the AF DCGS acquisition strategy from a single block upgrade to programs that will deliver the following families of capabilities to the fielded baseline while meeting emerging operational requirements and continuing to develop and integrate new\/upgraded sensors:  GEOINT, Systems Release Upgrades, Data Links, and NetComms."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0305208F_BPAC_674826_0.jpg"
                                }
                            }
                        ]
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "676025"
                    },
                    "ProjectTitle": {
                        "val": "Data Compression"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "14.669"
                        },
                        "CurrentYear": {
                            "val": "0.027"
                        },
                        "BudgetYearOne": {
                            "val": "7.511"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.511"
                        },
                        "BudgetYearTwo": {
                            "val": "4.835"
                        },
                        "BudgetYearThree": {
                            "val": "1.477"
                        },
                        "BudgetYearFour": {
                            "val": "1.506"
                        },
                        "BudgetYearFive": {
                            "val": "1.535"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This initiative will provide the warfighter a capability to efficiently compress and decompress airborne ISR sensor data and transmit near real- time to tactical users through current and future band-width limited commercial SATCOM or military SATCOM. The effort will develop, test and implement new sensor data compression and decompression algortihms for current and emerging airborne ISR sensors. Additionally, the program develops compression and decompression capabilities for manned and unmanned airborne platforms, associated ground stations, and DCGS. Outputs will meet standard certification for use within the DoD GEOINT and MASINT architectures."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Data Compression"
                                    },
                                    "Description": {
                                        "val": "The program began developing and testing compression and decompression algorithms for airborne ISR sensor data. The program will eventually build, integrate and test sensor specific hardware (with the algorithms embedded) for onboard data compression. The effort initially focused on compression and decompression of complex and detected Synthetic Aperture Radar (SAR) data followed by applications of compression technologies to other DoD IMINT\/MASINT sensor data (Spectral, Electro-Optical\/Infrared (EO\/IR), Light Detection and Ranging (LIDAR), Laser Radar (LADAR), Video) and ground architecture.  Outputs will meet DoD standard certification."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.669"
                                            },
                                            "Text": {
                                                "val": "Continued development of complex\/detected SAR, spectral, LIDAR,& Wide Area Motion Imagery (WAMI) sensor data compression capabilities. Continued to prepare technology demonstration efforts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.027"
                                            },
                                            "Text": {
                                                "val": "Continuing second phase development and evaluation of complex\/detected SAR, spectral, LIDAR, & WAMI sensor data compression capabilities at a reduced level of effort."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.511"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.511"
                                            },
                                            "Text": {
                                                "val": "Increase development and testing of complex\/detected SAR, spectral (HSI\/MSI), LIDAR, & WAMI data compression capabilities. Will begin developing and testing compression and decompression algorithms for Video Phase History (VPH) SAR.  Will also begin technology demonstration effort and cooperative platform integration."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Data Compression acquisition approach is to design and develop compression and decompression technology hardware and software components, interfaces and standards for various airborne ISR platforms, ground stations, data storage facilities, and exploitation tools utilizing existing contracts with full and open competition where appropriate.  Integration will be accomplished by the requisite program offices with data compression specific integration support provided."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0305208F_BPAC_676025_0.jpg"
                                }
                            }
                        ]
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "676028"
                    },
                    "ProjectTitle": {
                        "val": "Dynamic Time Critical Warfighting Capability"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.105"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Dynamic Time Critical Warfighting Capability (DTCWC) fuses Electronics Intelligence (ELINT) and Imagery in an upstream data fusion methodology that greatly improves target of interest identification and geolocation timeliness and accuracy. While not part of the AF DCGS weapon system, this Military Intelligence Program funded capability will initially fuse ISR feeds outside of AF DCGS while leveraging AF DCGS for access to multiple raw ISR data feeds. The primary aim of this capability is to support the targeting process, with likely outputs to the Air Operations Center (AOC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Dynamic Time Critical Warfighting Capability (DTCWC)"
                                    },
                                    "Description": {
                                        "val": "Fuse ELINT and Imagery in an up-stream data fusion methodology that greatly improves target of interest identification and geolocation timeliness and accuracy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.105"
                                            },
                                            "Text": {
                                                "val": "Continued efforts to add additional sensors and sensor modalities to DTCWC fusion engine.  Refined current algorithms to allow for target detection in added environments and terrain types.  Added new target sets to the existing DTCWC targets list."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2014 Dynamic Time Critical Warfighting Capability was terminated."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "NA"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "DTCWC used the acquisition strategy of providing spiral releases of software and capabilities.  A sole-source contract was awarded to Johns Hopkins University Applied Physics Lab due to their evolutionary approach to upstream data fusion."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0305208F_BPAC_676028_0.jpg"
                                }
                            }
                        ]
                    }
                }
            ]
        }
    }
}