{
    "id": "6cc802d598532b66de46d0b484eece99e1ef9660",
    "meta": {
        "filename": "dod-2015_RDTE_2015_ARMY_BA2_RDTE_JustificationBook_Army_PB_2015.zzz_unzipped_RDTE_JustificationBook_Army_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602785A"
        },
        "ProgramElementTitle": {
            "val": "Manpower\/Personnel\/Training Technology"
        },
        "R1LineNumber": {
            "val": "26"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "15.979"
            },
            "CurrentYear": {
                "val": "17.645"
            },
            "BudgetYearOne": {
                "val": "23.295"
            },
            "BudgetYearOneBase": {
                "val": "23.295"
            },
            "BudgetYearTwo": {
                "val": "24.889"
            },
            "BudgetYearThree": {
                "val": "26.193"
            },
            "BudgetYearFour": {
                "val": "25.043"
            },
            "BudgetYearFive": {
                "val": "25.333"
            }
        },
        "ProgramElementNote": {
            "val": "FY13 decrease attributed to Congressional General reductions (-40 thousand); SBIR\/STTR transfers (-226 thousand); and Sequestration reductions (-1.536 million)\nFY15 funding increased for human behavioral research."
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) conducts applied behavioral and social science research that provides non-materiel solutions to ensure that Soldiers can adapt and excel and improve the Army's capability to fully leverage advances in networks, systems, and technologies as they evolve. This research provides the scientific basis to recruit, select, assign, promote, educate, train, and retain Soldiers and leaders that comprise a ready and relevant Landpower capability.  The human science applied research conducted in this program element provides knowledge-products, methods, techniques, and tools that will enable the Army to: select Soldiers who are predicted to perform well in future jobs; assign Soldiers to Military Occupational Specialties (MOS) and jobs that better match their skills and abilities; retain an effective career force through improved strategies and behavioral incentives to influence Soldiers to stay in the Army for longer periods of time; accelerate the development of leader critical thinking and interpersonal skills through virtual practice so that junior leaders are more adaptable and prepared for uncertain, rapidly changing missions; develop innovative training strategies for complex battle command skills in network-enabled environments; and design training tools for dismounted squad leadership and team maneuver with ground Soldier systems technologies.  Additional research is focused on training techniques and procedures that make it easier for trainers and training developers to rapidly respond to changes in mission or operational requirements and provide a more synergistic training and education process (e.g., automated and improved diagnostics, coaching and mentoring, performance measures, and feedback methods.\n\nWork in this PE complements and is fully coordinated with PE 0603007A (Manpower\/Personnel\/Training Technology.)\n\nThe cited work is consistent with the Director, Defense Research and Engineering Strategic Plan, the Army Modernization Strategy, and the Army Science and Technology Master Plan.\n\nThis project is managed by the U.S. Army Research Institute for the Behavioral and Social Sciences (ARI), Arlington, VA."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "17.781"
                },
                "CurrentYear": {
                    "val": "17.654"
                },
                "BudgetYearOne": {
                    "val": "18.513"
                },
                "BudgetYearOneBase": {
                    "val": "18.513"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "15.979"
                },
                "CurrentYear": {
                    "val": "17.645"
                },
                "BudgetYearOne": {
                    "val": "23.295"
                },
                "BudgetYearOneBase": {
                    "val": "23.295"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.802"
                },
                "CurrentYear": {
                    "val": "-0.009"
                },
                "BudgetYearOne": {
                    "val": "4.782"
                },
                "BudgetYearOneBase": {
                    "val": "4.782"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.040"
                    },
                    "CurrentYear": {
                        "val": "-0.009"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.226"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "4.782"
                                },
                                "BudgetYearOneBase": {
                                    "val": "4.782"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Sequestration"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-1.536"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "790"
                    },
                    "ProjectTitle": {
                        "val": "Personnel Performance & Training Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "15.979"
                        },
                        "CurrentYear": {
                            "val": "17.645"
                        },
                        "BudgetYearOne": {
                            "val": "23.295"
                        },
                        "BudgetYearOneBase": {
                            "val": "23.295"
                        },
                        "BudgetYearTwo": {
                            "val": "24.889"
                        },
                        "BudgetYearThree": {
                            "val": "26.193"
                        },
                        "BudgetYearFour": {
                            "val": "25.043"
                        },
                        "BudgetYearFive": {
                            "val": "25.333"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "This program element (PE) conducts applied behavioral and social science research to enhance the Soldier Lifecycle (e.g., selection, assignment, training, leader development) and human relations (e.g., culture of dignity, respect, and inclusion). These technologies provide advanced personnel measures that more fully assess potential and predict performance, behavior, attitudes, and resilience. These technologies also provide innovative and effective training and mentoring methods to ensure Soldiers, leaders, and units have the knowledge, skills, and abilities to sustain positive unit climates and meet mission requirements in uncertain and complex environments. This PE evaluates new selection measures, refines performance metrics, assesses innovative training methods, and conducts scientific assessments to inform Human Capital policy and programs.  Research in this PE will result in effective non-materiel solutions to help the Army adjust to changes in force size and structure, a variety of mission demands and contexts, challenges in human relations, and budgetary constraints.\n\nEfforts in this program element support the Army Science and Technology Soldier portfolio.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Human Capital Strategy.\n\nWork in this PE is performed by the US Army Research Institute (ARI) for the Behavioral and Social Sciences in Ft. Belvoir, VA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Personnel"
                                    },
                                    "Description": {
                                        "val": "Conduct applied research that provides the Army with improved predictability of potential performance, behaviors, attitudes, and resilience of Soldiers, as well as an improved ability to recruit and sustain an effective career force."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.424"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed longitudinal research that validates the predictive quality of non-cognitive measures that can be used to improve selection efficiency; identified and validated predictors of junior officer performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.119"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Initiating research on the use of non-cognitive measures to improve the officer classification process; completing multi-year validation of selection efficiency research; determining higher-order skill sets required for enlisted performance assessment across multiple clusters of job types to improve classification process and personnel\/job matching. Initiating research on new measures to improve the selection of cyber personnel."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.501"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.501"
                                            },
                                            "Text": {
                                                "val": "Will conduct longitudinal validation of non-cognitive measures for awarding ROTC scholarships to high-potential officer candidates. Will initiate validation of the Information\/Communications Technology Literacy Test (ICTL) as a measure to predict performance in cyber-related domains."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Personnel Readiness and Performance"
                                    },
                                    "Description": {
                                        "val": "This effort, previously titled \"Training,\" will investigate and develop effective training and leader development methods to assess, enhance, and sustain individual and unit readiness, resilience, and effectiveness."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.219"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Created training that adapts to the needs of the trainee and tools that effectively deliver and assess training within technology enabled learning environments; developed training approaches and tools (e.g., diagnostic tools, collective training groups, pedagogical interventions) that improve units' ability to develop and manage training."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.524"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developing automated assessment tool for trainee performance to enable the Army Learning Model (i.e., accelerating learning and increasing adaptation to changing operational requirements); developing innovative training framework and methods for collective training of units that must perform exceptionally well in complex operational environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.328"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.328"
                                            },
                                            "Text": {
                                                "val": "Will develop training methods that expedite training across a range of tasks and training environments. Will initiate training research to improve Non-commissioned Officers' (NCOs) ability to develop junior Soldiers. Will initiate the development of strategies (e.g., training) for small unit leaders to create ready and resilient units."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Leader Development and Culture"
                                    },
                                    "Description": {
                                        "val": "This effort, previously titled \"Leader Development,\" will investigate and develop efficient and empirically valid measures and methods to assess command climate and associated outcomes. Will develop methods to enable leaders and units to ensure climates of dignity, respect, and inclusion."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.336"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Created methods and strategies to develop leader skills (e.g., cross-cultural competency, strategic thinking for mission command) needed in complex environments and designed assessment and training tools for leader development skills."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.002"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigating strategic decision-making of leaders to inform a comprehensive design guide for commanders and staff; investigating knowledge\/skill\/ability requirements for an operational environment to design a training framework and integrate multiple cross-cultural skills to improve leader performance in cross-cultural situations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.466"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.466"
                                            },
                                            "Text": {
                                                "val": "Will develop innovative methods and techniques to develop leader skills (e.g., techniques for mentorship, coaching, and subordinate development). Will initiate research to develop innovative training methods for Sexual Harassment\/Assault Response and Prevention (SHARP)."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}