{
    "id": "6e1ffd433e0b2f06ff227cfe888694ea70098a7d",
    "meta": {
        "filename": "dod-2015_RDTE_2015_AIRFORCE_V1_RDTE_JustificationBook_Air_Force_PB_2015.zzz_unzipped_RDTE_JustificationBook_Air_Force_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602202F"
        },
        "ProgramElementTitle": {
            "val": "Human Effectiveness Applied Research"
        },
        "R1LineNumber": {
            "val": "6"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "80.616"
            },
            "CurrentYear": {
                "val": "104.427"
            },
            "BudgetYearOne": {
                "val": "81.957"
            },
            "BudgetYearOneBase": {
                "val": "81.957"
            },
            "BudgetYearTwo": {
                "val": "97.212"
            },
            "BudgetYearThree": {
                "val": "108.693"
            },
            "BudgetYearFour": {
                "val": "110.599"
            },
            "BudgetYearFive": {
                "val": "113.343"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program conducts applied research in the area of airmen training, airmen system interfaces, bioeffects, and understanding and shaping adversarial behavior.  The Learning and Operational Readiness project conducts research to measure, accelerate, and expand the cognitive skills necessary to improve airmen training and mission performance.  The Human Dynamics Evaluation project conducts research to advance information operations and intelligence operator-aiding technologies by developing and applying human-focused research to create and influence behavior signatures of existing and emerging adversaries.  The Sensory Evaluation and Decision Science project conducts research to revolutionize the manner in which the human optimizes the capabilities of Air Force systems, including remotely piloted aircraft (RPA) and adaptive teams of humans and machines.  The Bioeffects project conducts research on the effects of human exposure to electromagnetic energy (radio frequency to optical), scalable directed energy weapons, and non-lethal weapons.  Efforts in this program have been coordinated through the Department of Defense (DoD) Science and Technology (S&T) Executive Committee process to harmonize efforts and eliminate duplication. This program is in Budget Activity 2, Applied Research, since it develops and determines the technical feasibility and military utility of evolutionary and revolutionary technologies."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "89.319"
                },
                "CurrentYear": {
                    "val": "89.483"
                },
                "BudgetYearOne": {
                    "val": "94.584"
                },
                "BudgetYearOneBase": {
                    "val": "94.584"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "80.616"
                },
                "CurrentYear": {
                    "val": "104.427"
                },
                "BudgetYearOne": {
                    "val": "81.957"
                },
                "BudgetYearOneBase": {
                    "val": "81.957"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-8.703"
                },
                "CurrentYear": {
                    "val": "14.944"
                },
                "BudgetYearOne": {
                    "val": "-12.627"
                },
                "BudgetYearOneBase": {
                    "val": "-12.627"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.190"
                    },
                    "CurrentYear": {
                        "val": "-0.056"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "15.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.165"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-7.348"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-12.627"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-12.627"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Decrease in FY13 Other Adjustments was due to Sequestration.\nDecrease in FY 2015 is due to higher DoD priorities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "621123"
                    },
                    "ProjectTitle": {
                        "val": "Learning and Operational Readiness"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "11.385"
                        },
                        "CurrentYear": {
                            "val": "14.466"
                        },
                        "BudgetYearOne": {
                            "val": "16.613"
                        },
                        "BudgetYearOneBase": {
                            "val": "16.613"
                        },
                        "BudgetYearTwo": {
                            "val": "19.928"
                        },
                        "BudgetYearThree": {
                            "val": "23.697"
                        },
                        "BudgetYearFour": {
                            "val": "23.027"
                        },
                        "BudgetYearFive": {
                            "val": "20.907"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project conducts applied research to measure, accelerate, and expand the cognitive skills necessary to improve airmen training and mission performance.  Research is conducted in two focus areas:  continuous learning and aiding and cognitive and behavioral modeling.  The continuous learning and aiding effort creates live, virtual, and constructive (LVC) environments for use in developing revolutionary simulation technologies to increase training capabilities and enhance training effectiveness and efficiency by using learning theory to improve military training and mission performance.  Cognitive and behavioral modeling creates realistic models and simulations of human behavior to advance the understanding of how people perform complex tasks."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Continuous Learning"
                                    },
                                    "Description": {
                                        "val": "Research enhances Distributed Mission Operations (DMO) and LVC environments and identifies technology requirements for training in live and immersive environments.  Continuous learning\/aiding strategies improve mission training, command and control (C2), intelligence, surveillance, and reconnaissance (ISR), and cyber missions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.290"
                                            },
                                            "Text": {
                                                "val": "Developed methods to capture, tag, and store mission performance data across LVC contexts using tactical fast jet as an exemplar.  Evaluated technologies to assess and track the credibility of virtual and constructive players to augment live operational training and rehearsal.  Began developing common scenarios and learning events for DMO systems integration.  Created and validated initial scenarios for cyber team training in a Red Flag exercise environment.  Completed the integrated combat operations planning trainer to improve C2 and ISR teaming.  Initiated work to evaluate alternatives for common after action review and analysis tools for C2, ISR, and cyber team training.  Initiated requirements definition and metrics development to support realistic LVC training for Anti Access\/Area Denial (A2\/AD) environments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.305"
                                            },
                                            "Text": {
                                                "val": "Extend methodologies for managing learning and performance to apply across combat operations, tactical C2 and ISR teams in LVC environments.  Initiate evaluations of technologies required for a complementary family of trainers.  Evaluate rule-sets for training across multiple security levels in LVC environments.  Evaluate scenarios for integrated C2\/ISR\/cyber team training in a Red Flag exercise environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.613"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.613"
                                            },
                                            "Text": {
                                                "val": "Complete development of an analyst readiness research testbed for ISR and cyber operators.  Extend learning assessment and management tools to support undergraduate pilot training.  Evaluate different methods for secure, credible LVC training and rehearsal for fourth and fifth generation fighters.  Create and document standards for tactical LVC training and readiness.  Validate methods to quickly generate rule sets for security applications in C2 and ISR domains.  Develop methods to generate realistic representations of adversary tactics for LVC training.  Evaluate methods to rapidly reconfigure training environments for different scenarios and mission sets.  Initiate work to develop agents to manage training activities in LVC.  Begin requirements definition for LVC training applications to support enhancing warfighting in contested environments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cognitive Modeling"
                                    },
                                    "Description": {
                                        "val": "Research explores application of cognitive science for performance improvement by enhancing training in mission-relevant environments (e.g., flight simulators)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.095"
                                            },
                                            "Text": {
                                                "val": "Identified and validated mechanisms for fatigue and visual monitoring to support human performance augmentation.  Completed integration of synthetic teammate for training research in RPA simulator.  Created and verified technologies to develop models at a higher level of abstraction, enabling more accurate models of human cognition in complex, dynamic environments.  Initiated research to identify potential application of models of learning and retention to complex, time-critical Air Force knowledge and skills."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.161"
                                            },
                                            "Text": {
                                                "val": "Complete predictive performance optimization for cognitively valid readiness tracking in Air Force training.  Initiate research in mechanisms of human knowledge learning and seeking and their interaction.  Validate the ability of a first-generation synthetic teammate to perform effectively in a team environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Effort is moved to Continuous Learning thrust to be consistent with future integration into LVC contexts."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "625328"
                    },
                    "ProjectTitle": {
                        "val": "Human Dynamics Evaluation"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "22.076"
                        },
                        "CurrentYear": {
                            "val": "23.290"
                        },
                        "BudgetYearOne": {
                            "val": "17.151"
                        },
                        "BudgetYearOneBase": {
                            "val": "17.151"
                        },
                        "BudgetYearTwo": {
                            "val": "22.843"
                        },
                        "BudgetYearThree": {
                            "val": "25.059"
                        },
                        "BudgetYearFour": {
                            "val": "25.054"
                        },
                        "BudgetYearFive": {
                            "val": "25.523"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project conducts applied research to advance machine intelligence, information operations, and operator-aiding technologies for advanced intelligence, surveillance, and reconnaissance (ISR) capabilities.  It develops and applies science and technology to detect and exploit a variety of human-centered signatures, including behavioral, nano-, bio-, and molecular aspects of existing and emerging adversaries.  Research is focused in the following areas:  human analyst augmentation, human trust and interaction, and human signatures.  The human analyst augmentation area develops, integrates, and evaluates human-centric analyst technology solutions, such as adversarial modeling and cross-cultural communication, leading to more operationally effective ISR for the Air Force.  The human trust and interaction area studies relevant human threat and vulnerability patterns in the context of everyday life and seeks to understand human interaction with autonomous systems.  The human signatures area discovers, characterizes, and integrates signature information to enable rapid and accurate human Measurement and Signature Intelligence (MASINT)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Human Analyst Augmentation"
                                    },
                                    "Description": {
                                        "val": "Conduct research to enhance human components of ISR.  Develop ability to improve human analytic efficiency and effectiveness with fewer personnel and in increasingly complex mission space.  Develop the ability to improve human cognitive performance of the ISR weapon system through improved data exploitation and intelligence content synthesis."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.250"
                                            },
                                            "Text": {
                                                "val": "Developed new multi-intelligence analysis concepts and prototypes based upon analyst evaluations.  Conducted studies to evaluate new prototypes for signatures, patterns, and other exploited intelligence data to augment analysis effectiveness."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.670"
                                            },
                                            "Text": {
                                                "val": "Expand multi-intelligence analysis prototypes to include autonomous systems and human performance augmentation technologies.  Provide robust situation awareness to enhance decision-makers' understanding and knowledge by improving ISR capabilities and data processing, exploitation, and dissemination."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.751"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.751"
                                            },
                                            "Text": {
                                                "val": "Research and develop human centric approaches to enhance ISR analysts' ability to attend to relevant intelligence data when coupled with autonomous systems and agents."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human Trust and Interaction"
                                    },
                                    "Description": {
                                        "val": "Conduct research in cross-cultural communications and automated speech translation tools for Air Force missions.  Develop models\/metrics to predict\/evaluate organizational effectiveness alignment and collaboration readiness.  Conduct research to address important aspects of trust in human-machine teams including investigating how a human knows an autonomous or semi-autonomous system is safe to use and should the system, data, conclusions, and decision recommendations be trusted."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.320"
                                            },
                                            "Text": {
                                                "val": "Explored multicultural potential avenues of influence and develop adversary effects models and simulations.  Developed tools, algorithms, and techniques for rapid development of speech recognition, machine translation, and natural language processing components in new languages and domains.  Developed methods for speech recognition and translation of previously unencountered words in languages that have complex prefix and suffix structures in order to improve threat warning.  Explored methods and developed theories for quantification of trust between people and real-time metrics of human trust of automation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.300"
                                            },
                                            "Text": {
                                                "val": "Mature speech recognition and machine translation capabilities for new languages and domains.  Assess speech recognition and machine translation technologies against data sets representative of general ISR applications.  Investigate how to adapt these algorithms to evolving contexts such as changing topics.  Investigate strategies and methodologies for combing multiple algorithms simultaneously to optimize system performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.780"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.780"
                                            },
                                            "Text": {
                                                "val": "Develop guidelines for calibrated trust for symbiotic human-machine teaming.  Develop work aids that enable analysts to think more deeply and methodically about their problem space by accounting for contextual factors including culture, religion, governance, and economy."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human Signatures"
                                    },
                                    "Description": {
                                        "val": "Develop databases of human motion and features collected from air\/space platforms.  Identify human threat signatures across diverse populations for ISR and force protection applications.  Conduct surveillance and counterproliferation research to support detection, identification, and assessment of threat agents in support of Air Force operational missions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.506"
                                            },
                                            "Text": {
                                                "val": "Developed architectures for machine-intelligent biofidelic human threat models.  Developed human motion\/shape information system and online analytic tools for automatic detection and tracking of humans, discernment of gender, and detection of human shape anomalies.  Developed nano-bio technologies and sensor components to detect target molecules of interest in the operational environment.  Developed analysis tools to identify and track molecular-based threat signatures.  Characterized and exploited human signatures to perform ISR mission tagging, tracking, and locating of threats."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.320"
                                            },
                                            "Text": {
                                                "val": "Develop tools for the ISR analyst and special operations forces to detect and characterize human signatures in multiple sensing modalities from multiple platforms for human threat situational awareness.  Develop tools for ISR applications to detect and characterize molecular signatures for increased threat detection in an operational environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.620"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.620"
                                            },
                                            "Text": {
                                                "val": "Develop algorithms capable of reliably detecting and characterizing human signatures by leveraging multiple sensing modalities, from multiple platforms, for human threat situation awareness.  Develop sensors for novel molecular signatures for increased threat detection in an operational environment and human performance assessment."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "625329"
                    },
                    "ProjectTitle": {
                        "val": "Sensory Evaluation and Decision Science"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "28.104"
                        },
                        "CurrentYear": {
                            "val": "38.847"
                        },
                        "BudgetYearOne": {
                            "val": "27.912"
                        },
                        "BudgetYearOneBase": {
                            "val": "27.912"
                        },
                        "BudgetYearTwo": {
                            "val": "28.301"
                        },
                        "BudgetYearThree": {
                            "val": "30.261"
                        },
                        "BudgetYearFour": {
                            "val": "30.409"
                        },
                        "BudgetYearFive": {
                            "val": "31.501"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project conducts applied research to revolutionize the manner in which the human optimizes the capabilities of Air Force systems, including RPA and adaptive teams of humans and machines.  Research optimizes human situational awareness and cognitive performance, improves the human-machine interface, and seamlessly integrates warfighters with their weapon systems across air, space, and cyber domains.  Research is conducted in four focus areas:  applied neuroscience; human role in semiautonomous systems; battlespace visualization; and battlespace acoustics.  The applied neuroscience area develops technologies to enhance human-human and human-machine collaborations and system interactions in distributed decision-making environments.  The human role in semiautonomous systems area develops new control\/display concepts and technologies to optimize Air Force platform capabilities.  The battlespace visualization area advances the science and technology associated with collecting, optimizing, displaying, and assimilating sensory information to enhance warfighter decision-making.  The battlespace acoustics area researches human-human and human-machine communications to exploit the use of voice and acoustic data in collaborative, net-centric environments while accounting for the effects of acoustic propagation."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "10.000"
                                        },
                                        "Text": {
                                            "val": "Conduct Congressionally-directed Effort."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Applied Neuroscience"
                                    },
                                    "Description": {
                                        "val": "Develop technologies to enhance human performance, human-human and human-machine collaboration, and system interaction in distributed decision-making environments.  Conduct research to predict physiological impacts of high-stress\/extreme environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.672"
                                            },
                                            "Text": {
                                                "val": "Explored the development of trust metrics that can be used to design and enable trust automation for operators.  Developed the framework for modeling physiological and behavioral workload on the human operator.  Developed adaptive algorithms for workload management and mitigation.  Evaluated utility of workload assessment tool for teams.  Investigated potential tools for enhancing warfighter cognitive resiliency and performance through the manipulation of intrinsic biological and physiological mechanisms and processes.  Defined metrics and biomarkers of resiliency and performance that can be integrated into these tools for sensing and assessing cognitive state.  Developed physiology modeling and sensing capability to measure stress parameters and predict physiological impacts of high-stress\/extreme environments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.127"
                                            },
                                            "Text": {
                                                "val": "Begin examining new sense, assess, and augmentation technologies to provide adaptive aiding based on warfighter performance.  Validate team workload and trust measures to enhance effective human-human and human-machine system performance.  Define team synchronicity and cognitive functional state metrics that aid team performance.  Research stress-driven processes and their effects on human performance.  Explore psychological and neurophysiological mechanisms and processes for developing unique operational strategies that enhance cognitive resiliency and performance.  Continue to develop physiology models to predict the effects of high-stress\/extreme environments on the human.  Begin investigating interface technologies and exposure design criteria to protect operators and mitigate injury and performance risks.  Begin development of on-board oxygen generating technologies to mitigate hypoxia vulnerability risks."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.000"
                                            },
                                            "Text": {
                                                "val": "Investigate individual and team state sensing and assessment algorithms and methods to examine augmentation mitigation strategies leading to improved warfighter performance.  Develop team workload and trust models for autonomy, increased human performance monitoring, and performance improvement.  Identify stress-driven metrics and processes that influence human performance.  Define neurophysiological, psychological, and genetic mechanisms and processes for developing guidelines to enhance warfighter cognitive resiliency and performance.  Apply physiology computational modeling methods to predict high-stress\/extreme environmental effects on the human.  Develop augmentation techniques for improving performance in operational environments that include human-machine teaming.  Investigate interface technologies and exposure design criteria to protect operators and mitigate injury and performance risks in current and future weapon systems.  Develop contamination sensor technology for on-board oxygen generation systems for hypoxia vulnerability risk mitigation.  Investigate new technologies for aircraft next generation on-board oxygen generation system."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human Role in Semiautonomous Systems"
                                    },
                                    "Description": {
                                        "val": "Research new control\/display concepts and technologies (e.g., information portrayal, control devices, decision-aiding algorithms).  Identify best design to direct operator attention."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.035"
                                            },
                                            "Text": {
                                                "val": "Identified human operator-RPA automation interaction technologies and techniques that will provide increased situational awareness while exercising supervisory control of multiple RPAs.  Investigated and developed course-of-action tools, displays, and system software architectures that will support an operator's choice between several courses of action.  Explored the use of adaptive automation for teams of RPAs\/RPA operators to enable real-time situational awareness of human and vehicle states.  Developed an agent information architecture that responds to RPA pilot information queries by gathering, fusing, and presenting information from on- and off-board sources."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.266"
                                            },
                                            "Text": {
                                                "val": "Investigate various automation technologies for the command and control of multiple RPAs.  Examine the interplay between automation technologies and various tools to enable choices between courses of action.  Evaluate advanced visualizations concepts and interaction methods for managing information from on-board and off-board sources to support RPA operator decision-making.  Begin developing adjustable, adaptive levels of automation to support flexible control of unmanned systems depending on mission and environmental context."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.580"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.580"
                                            },
                                            "Text": {
                                                "val": "Demonstrate and quantify the use of selected automation technologies and various tools to enable choices between courses of action for the command and control of multiple RPAs.  Integrate advanced visualization concepts and interaction methods for managing information from on- and off-board sources to support RPA operator decision-making into high-fidelity simulations for test and evaluation.  Perform advanced simulation of adjustable, adaptive levels of automation to support flexible control of unmanned systems depending on mission and environmental context."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Battlespace Visualization"
                                    },
                                    "Description": {
                                        "val": "Advances science and technology associated with collecting, optimizing, displaying, and assimilating sensory information to enhance warfighter decision-making."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.522"
                                            },
                                            "Text": {
                                                "val": "Assessed human perception and performance of fused, multisource information.  Developed visualizations using visual analytics for representing information from large, disparate data sets.  Extended visualization techniques to three-dimensional (3-D) displays.  Assessed the effectiveness of interactive visualizations to augment human operator situational awareness."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.152"
                                            },
                                            "Text": {
                                                "val": "Develop a suite of image enhancement and fusion tools based on human perception and performance.  Begin the design and evaluation of visualizations based on visual analytics to represent and visualize relevant information from large, disparate data sets.  Assess application of visual analytics to various warfighting domains.  Evaluate the effectiveness of using 3-D displays to augment human decision-making and situational awareness.  Evaluate the use of various interaction devices, when interacting with visualizations, to determine their effectiveness in aiding human performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.660"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.660"
                                            },
                                            "Text": {
                                                "val": "Evaluate image enhancement and fusion techniques for improving human perception and performance.  Assess visual analytics techniques for visualizing large, disparate data sets.  Investigate cyber operations visualization techniques for transforming numerical data into actionable information.  Explore decision aids for multisource fusion methods."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Battlespace Acoustics"
                                    },
                                    "Description": {
                                        "val": "Conducts research on advanced auditory and communication technologies that mitigate effects of noise and enhance performance in operational environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.875"
                                            },
                                            "Text": {
                                                "val": "Explored the use of advanced multimodal interfaces to aid combat search and rescue teams in simulated scenarios.  Assessed the effectiveness of spatial audio display concepts combined with vibro-tactile displays and enhanced visual displays to augment individual and team performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.302"
                                            },
                                            "Text": {
                                                "val": "Develop auditory interfaces to enable the human operator to respond to cyber attacks.  Develop interface concepts for using multi-modal displays and visualizations to support combat search and rescue teams.  Examine the effectiveness of audio displays combined with multi-modal interaction techniques to support human operator decision making."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.672"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.672"
                                            },
                                            "Text": {
                                                "val": "Validate auditory interfaces that enable the human operator to respond to cyber-attacks through persistent auditory displays.  Optimize the use of multimodal displays and visualizations to communicate time critical information to distributed teams.  Validate the combined effectiveness of audio displays and multimodal interaction techniques to support human decision-making."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "627757"
                    },
                    "ProjectTitle": {
                        "val": "Bioeffects"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "19.051"
                        },
                        "CurrentYear": {
                            "val": "27.824"
                        },
                        "BudgetYearOne": {
                            "val": "20.281"
                        },
                        "BudgetYearOneBase": {
                            "val": "20.281"
                        },
                        "BudgetYearTwo": {
                            "val": "26.140"
                        },
                        "BudgetYearThree": {
                            "val": "29.676"
                        },
                        "BudgetYearFour": {
                            "val": "32.109"
                        },
                        "BudgetYearFive": {
                            "val": "35.412"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project conducts applied research on the effects of human exposure to nanomaterials, electromagnetic (EM) energy (radio frequency to optical), scalable directed energy weapons, and non-lethal weapons.  This research addresses fundamental physical principles, as well as the psychophysical interaction between directed energy and the individual or groups of individuals.  Research is divided into three core focus areas:  optical radiation bioeffects; radio frequency radiation (RFR) bioeffects; and molecular bioeffects.  Optical radiation bioeffects research enhances combat survivability and systems effectiveness through technologies that enable deployed forces to counter optical threats and exploit optical systems for offensive applications.  The RFR bioeffects research investigates basic biological mechanisms of RFR, conducts theoretical and empirical dosimetry, conducts research of bioeffects from short- and long-term exposures, develops methods to counter RFR threats, and performs research for exploitation of directed energy systems for offensive capabilities.  Molecular bioeffects research is conducted to protect airmen from the effects of toxic chemicals and materials and to monitor and enhance cognitive and physiological performance."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "5.000"
                                        },
                                        "Text": {
                                            "val": "Conduct Congressionally-directed Effort."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Optical Radiation Bioeffects"
                                    },
                                    "Description": {
                                        "val": "Conduct laboratory experiments and field research on laser bioeffects, enabling military exploitation of laser technology while providing countermeasures for optical hazards\/threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.442"
                                            },
                                            "Text": {
                                                "val": "Developed high-power probabilistic range safety tools for prediction eye and skin hazard zones from high energy laser weapon systems and concepts.  Developed models and methods for approaches using optical radiation for future weapon systems with scalable, disruptive, and ultra-precise effects.  Developed parameters for optimizing laser vision effect models for advanced laser eye protection technologies and non-lethal weapon engagement-level assessments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.417"
                                            },
                                            "Text": {
                                                "val": "Integrate operational tasks into laser vision effects models to identify impacts to human operators.  Explore daytime dazzling effects via multiple wavelength stimulation in human subjects.  Enhance dose-response models to support risk-based hazard analysis for low power probabilistic laser safety tools.  Expand models and methods for application to unique approaches for using optical radiation for future weapon systems with scalable, disruptive, and ultra-precise effects."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.997"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.997"
                                            },
                                            "Text": {
                                                "val": "Integrate components of engagement-level simulations for laser bioeffects into broader DoD modeling and simulation products for the purpose of mission-level and campaign level models.  Initiate studies to evaluate bioeffects, protection needs, and collateral effects of emerging directed energy systems concepts.  Complete data collection for currently identified optical radiation damage and transient vision effects for use in next-generation of standardized personnel vulnerability models."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Radio Frequency Bioeffects"
                                    },
                                    "Description": {
                                        "val": "Conduct laboratory experiments and field research to enable safe exploitation of directed energy technologies for communication, target identification, and weapons development."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.127"
                                            },
                                            "Text": {
                                                "val": "Integrated basic mechanisms of interactions between biology and RFR for validation of bioeffects models from ultra-short, high-peak power, RF systems.  Investigated terahertz (THz) radiation effects on cells and tissues and improve bioeffects models for exposure.  Initiated proposals for refined exposure standards for THz radiation.  Assessed combined biological effects from multiple, combined directed energy sources."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.292"
                                            },
                                            "Text": {
                                                "val": "Conduct empirical laboratory tests on the human behavioral response to combined effects of directed energy sources.  Initiate validation of high-peak power exposure models.  Incorporate THz exposure test results into THz exposure standards and whole-body exposure models."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.952"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.952"
                                            },
                                            "Text": {
                                                "val": "Conduct empirical laboratory tests on the human behavioral response to combined effects of directed energy sources.  Investigate high peak power human performance effects.  Explore whole-body biological effects of directly applied ultra-short pulses.  Determine effects of RF overexposure on neurological tissue."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Molecular Bioeffects"
                                    },
                                    "Description": {
                                        "val": "Conduct studies to assess human responses to non-lethal weapons and effects\/risks of these weapons.  Conduct bio\/nanotechnology research to advance warfighter performance.  Leverage toxicological\/biological data to improve human performance and decision-making abilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.482"
                                            },
                                            "Text": {
                                                "val": "Conducted toxicology review, completed cockpit chemicals assessment, and provided analysis to support aircraft\/pilot fit-to-fly for grounded system.  Advanced namomaterial bioexposure analysis with novel science; designed system to capture and material to bioanalyze real-time emissions of flight-line nanoparticulate exposure.  Determined toxicity of two novel biofuels and fuel component performance mixture for use in Air Force weapon systems.  Determined molecular markers associated with fatigue resistance from enhanced protein diets in high-level performers.  Advanced knowledge of protein components as important macronutrients known to impact human physiology performance and cognition."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.115"
                                            },
                                            "Text": {
                                                "val": "Evaluate the quantitative framework for relating novel-effects technologies to operationally relevant mission outcomes.  Conduct research to define toxicity issues in current and future aircraft environments.  Begin development of models incorporating toxicity data and mechanisms of action to inform sensor development and development of hazard protection.  Conduct research to elucidate novel mechanisms of fundamental interaction of nanomaterials in a biological system.  Begin development of a new prototype of non-traditional effects of nanomaterials under the influence of incidental EM fields."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.332"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.332"
                                            },
                                            "Text": {
                                                "val": "Advance toxicity and nanotoxicity research; investigate\/establish toxicity impacts to selected organ systems in the body of advanced fuels, materials, and chemicals used to support existing and future weapon systems.  Define and pursue modulation of major cell pathways affecting human performance using in vitro and in vivo models and modeling and support human studies of the same.  Conduct research to define toxicity issues in current and future aircraft environments.  Begin development of models incorporating toxicity data and mechanisms of action to inform sensor development and development of real-time sensing of pilot and hazard protection of ground crews.  Conduct research to understand novel mechanisms of fundamental interaction of nanomaterials in a biological system."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}