{
    "id": "70f8525db3cdd651516ae1c4e49f502de8d2876d",
    "meta": {
        "filename": "dod-2015_RDTE_2015_MDA_RDTE_JustificationBook_Missile_Defense_Agency_PB_2015.zzz_unzipped_RDTE_JustificationBook_Missile_Defense_Agency_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Missile Defense Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603881C"
        },
        "ProgramElementTitle": {
            "val": "Ballistic Missile Defense Terminal Defense Segment"
        },
        "R1LineNumber": {
            "val": "82"
        },
        "MdapCode": {
            "val": "362"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Missile Defense Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "689.926"
            },
            "PriorYear": {
                "val": "267.396"
            },
            "CurrentYear": {
                "val": "255.918"
            },
            "BudgetYearOne": {
                "val": "299.598"
            },
            "BudgetYearOneBase": {
                "val": "299.598"
            },
            "BudgetYearTwo": {
                "val": "221.008"
            },
            "BudgetYearThree": {
                "val": "288.405"
            },
            "BudgetYearFour": {
                "val": "286.421"
            },
            "BudgetYearFive": {
                "val": "273.365"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "N\/A"
        },
        "ProgramElementMissionDescription": {
            "val": "The Terminal Defense Program Element includes the Terminal High Altitude Area Defense (THAAD) development program, Cyber Operations, THAAD System Test, support of PATRIOT (Phased Array Tracking Radar Intercept Of Target) Advanced Capability-3 (PAC-3) participation in Missile Defense Agency (MDA) activities, and Program Wide Support (PWS). \n\nTHAAD provides the only air transportable, fast reaction capability for the warfighter to provide area coverage against Short and Medium Range Ballistic Missiles within four hours of arrival. The THAAD element includes five major components: Interceptors, Launchers, Army Navy\/Transportable Radar Surveillance - Type 2 (AN\/TPY-2) Radars, THAAD Fire Control and Communication (TFCC), and THAAD Peculiar Support Equipment. THAAD delivered Battery #1 in FY 2009 and Battery #2 in FY 2010 to the U.S. Army at Fort Bliss, Texas for initial fielding and training. THAAD has completed the development of the THAAD 1.0 configuration and is developing the THAAD Build 2.0 capability. Continued development and integration will provide for enhanced debris mitigation, improved interoperability with other Ballistic Missile Defense System (BMDS) elements, and development of training devices to support the THAAD Institutional Training Base. \n\nCyber Operations sustains Missile Defense Agency (MDA) DoD Information Assurance Certification and Accreditation Program (DIACAP) and Controls Validation Testing (CVT) activities, analysis of validation results, risk assessments and reviews of proposed Program Manager\/Information Assurance Manager (PM\/IAM) Plans of Action and Milestones (POA&Ms) for MDA Command and Control Battle Management and Communications (C2BMC) mission systems and supports THAAD certification to operate in the BMD System.\n\nTHAAD System Test conducts Ballistic Missile Defense System (BMDS) Flight Tests and Ground Tests with other BMDS elements (including BMDS Command Control \/ Battle Management and Communication, PATRIOT and Aegis) in accordance with BMDS Integrated Master Test Plan. THAAD System Test coordinates with Operational Test Agencies, conducts flight test operations, performs post-flight test reporting, and performs data distribution and data storage at Pacific Missile Range Facility and the Reagan Test Site. \n\nPATRIOT Advanced Capability (PAC-3) is a U.S. Army short range BMDS that interfaces with the BMDS. MDA funds PATRIOT participation in BMDS interoperability integration efforts. \n\nMD40 Program-Wide Support (PWS) consists of essential non-headquarters management costs in support of the MDA functions and activities across the entire Ballistic Missile Defense System (BMDS)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "316.929"
                },
                "CurrentYear": {
                    "val": "268.990"
                },
                "BudgetYearOne": {
                    "val": "309.901"
                },
                "BudgetYearOneBase": {
                    "val": "309.901"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "267.396"
                },
                "CurrentYear": {
                    "val": "255.918"
                },
                "BudgetYearOne": {
                    "val": "299.598"
                },
                "BudgetYearOneBase": {
                    "val": "299.598"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-49.533"
                },
                "CurrentYear": {
                    "val": "-13.072"
                },
                "BudgetYearOne": {
                    "val": "-10.303"
                },
                "BudgetYearOneBase": {
                    "val": "-10.303"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.399"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "-15.000"
                    },
                    "CurrentYear": {
                        "val": "-13.072"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-6.345"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-3.407"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustment"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-24.382"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-10.303"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-10.303"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The FY 2014 funding reduction was a result of general Congressional reductions.  The FY 2015 funding reduced as a result of efficiency reviews and implementation of recommendations from the Test and Target Working Group to lower costs associated with the Integrated Master Test Plan"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "MD07"
                    },
                    "ProjectTitle": {
                        "val": "THAAD"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "645.681"
                        },
                        "PriorYear": {
                            "val": "192.800"
                        },
                        "CurrentYear": {
                            "val": "215.627"
                        },
                        "BudgetYearOne": {
                            "val": "169.162"
                        },
                        "BudgetYearOneBase": {
                            "val": "169.162"
                        },
                        "BudgetYearTwo": {
                            "val": "190.530"
                        },
                        "BudgetYearThree": {
                            "val": "205.837"
                        },
                        "BudgetYearFour": {
                            "val": "199.622"
                        },
                        "BudgetYearFive": {
                            "val": "211.151"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "50"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "Funding in the All Prior Years column represents a summary of Prior Years Total Costs for active contracts, Military Interdepartmental Purchase Requests, and civilian salaries on the R-3."
                        },
                        "ProjectMissionDescription": {
                            "val": "Terminal High Altitude Area Defense (THAAD) Development activities (1.0) focused on the design, development, testing and verification of a significant, fundamental capability to engage threats both inside and outside of the atmosphere in their terminal phase of flight. This capability includes engagements against short to medium-range ballistic missiles and asymmetric threats. Development of THAAD's next incremental capability (2.0) will enhance and extend the current 1.0 capability and be delivered as part of THAAD's acquisition\/development strategy.\n\nTHAAD 1.0 (Baseline Capability Development) provided the fundamental capability against short and medium-range Ballistic Missiles and asymmetric threats inside and outside the atmosphere by FY 2012. This development completed with: 1) Ground and Flight Test of the weapon system against complex Re-entry Vehicles, background clutter, and Medium-Range Ballistic Missile (MRBM) threats; 2) Ground and Flight Test of the initial Discrimination Capability; 3) Enhanced communication capability to support Link 16 compatibility with the Ballistic Missile Defense System (BMDS) and engagement coordination with other BMDS elements; and 4) Conditional Materiel Release.\n\nTHAAD 2.0 (Advanced Capability Development) expands the capability of THAAD 1.0 system. New THAAD capabilities include: 1) Launch on Link 16 BMD System Based Track providing the ability to initiate an engagement and launch THAAD interceptors using sensor data provided by BMDS sources outside the THAAD Battery; 2) Improving THAAD Weapons System performance in the presence of a high debris environment; 3) Expanding the defended area footprints by remote operation of THAAD Launchers; 4) Peer-to-peer engagement coordination with Aegis and PATRIOT weapon systems; 5) Software upgrades to maintain capability against evolving threats; 6) Message based regional engagement command functionality to process message content from Command and Control\/Battle Management and Communications (C2BMC) to obtain direction for target engagement; 7) Weapon System Information Assurance mandatory updates; 8) Warfighter requested enhancements; and 9) Upgrades to maintain interface with other BMDS software builds.\n\nIn addition to THAAD Development, there are three planned tasks: THAAD Program Support, Program Operations, and Project Redwood.\n\nTHAAD Program Support (previously Maintenance, Training, and Transportation) provides institutional and unit training devices to support U.S. Army requirements based on the System Training Plan (STRAP) and provides maintenance and transportation to support THAAD development. \n\nProgram Operations (previously Program Management) provides strategic planning, program integration, cost estimating, contracting, financial management, internal reviews and audits, earned-value management and program assessments for the THAAD Program Office.\n\nProject Redwood- Details at a Higher Classification is reported in accordance with Title 10, United States Code, Section 119 (a)(1) in the Special Access Program Annual Report to Congress."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "THAAD Development"
                                    },
                                    "Description": {
                                        "val": "This task includes completion of THAAD 1.0 development and initiates development of THAAD 2.0. Flight and ground testing of this development is included in separate task (project); however, pre-mission engineering analysis supporting testing is included in this task. In addition, it includes funding for Program Operations accomplishments in FY 2013 which has moved to the Program Operations (previously Program Management) accomplishment in FY 2014."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "119.997"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continued THAAD Build 2.0 development of non-organic intercept debris mitigation\n-Continued pre-mission analysis for FTO-01, an operational scenario further testing THAAD`s ability to conduct coordinated engagements with Aegis and PATRIOT operating with Command & Control, Battle Management and Communications and forward-based Army Navy\/Transportable Radar Surveillance and Control. Analysis ensures mission range and public safety and generates system performance predictions for post mission comparison. \n-Designed, developed, qualification tested, released, and fielded annual release of System Software Support to ensure continued performance and operation of fielded Batteries \n-Implemented Mandatory Information Assurance Updates and performed Information Assurance Vulnerability Assessments (IAVA) to mitigate potential system vulnerabilities and to ensure continued performance and operation of fielded Batteries\n-Continued to develop and maintain models, simulations, testbeds, and associated software required to perform engineering verification and analysis utilizing system simulations and Hardware-in-the-Loop (HWIL) facilities to ensure accurate element configuration and representation \n-Continued requirements development, engineering analysis, capability integration, and performance verification for BMDS and THAAD element-level development and integration\n-Continued Leak Indicator Redesign effort to provide greater safety by increasing the distance the leak indicator can be inspected in case of a hypergolic propellant fuel leak\n-Continue Suspect Missile Round Handling effort to develop a plan for proper repair or disposal of a THAAD Interceptor in the event of unsafe humidity levels inside the canister or other indications of an unsafe missile round.  This effort provides increased safety in case of potential repair, and avoids the unnecessary disposal of an interceptor if repair is possible\n-Provided technical and business management support activities, financial management, cost and schedule performance analysis, cost estimation and analysis, and integration activities to ensure effective use of appropriated resources \n-Provided contractor program management, and subcontract management to ensure effective use of appropriated resources \n-Executed Terminal High Altitude Area Defense program in compliance with internal and external direction, policies, and regulations to ensure effective use of appropriated resources \n-Provided technical and business support in the negotiation and award of the Battery contracts \n-Conducted Integrated Baseline Reviews to ensure prime contractor`s baseline cost, schedule, and risk aligned with THAAD project office requirements"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "132.483"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue development of Phase II debris mitigation functionality and integrate into the weapon system to improve interoperability with other BMDS elements \n-Conduct Terminal High Altitude Area Defense (THAAD) 2.0 Engineering Design Review to ensure Phase II debris mitigation design accounts for the results of FTO-01 (BMDS Operational Flight Test) \n-Conduct Models and Simulations (M&S) development to support element and Ballistic Missile Defense System (BMDS) events including all Integrated Master Test Plan (IMTP) M&S related activities to include System Pre Mission Tests (SPMTs) and System Post Flight Reconstruction (SPFRs) and conduct analysis of the Critical Engagement Conditions (CEC) and Empirical Measurement Events (EME) data collected during test events to validate and accredit the M&S by the Operational Test Agency (OTA) \n-Continue requirements development, engineering analysis, capability integration, and performance verification for BMDS and THAAD element-level development and integration\n-Continue to design, develop, qualification test, and field annual release of Terminal High Altitude Area Defense (THAAD) system software to ensure continued performance and operation of fielded batteries \n-Continue to develop and maintain models, simulations, testbeds, and associated software required to perform engineering verification and analysis utilizing system simulations and Hardware-in-the-Loop (HWIL) facilities to ensure accurate element configuration and representation \n-Continue integration and implementation of THAAD and its components in the BMDS through participation in Missile Defense Agency (MDA) Ground Test Campaigns and Performance Assessments to evaluate system performance and interoperability within the integrated BMDS \n-Continue integration and implementation of THAAD and its components in the BMDS through participation in Combatant Commander (COCOM) wargames and exercises \n-Implement Mandatory Information Assurance updates and perform Information Assurance Vulnerability Assessments (IAVA) to mitigate potential system vulnerabilities and to ensure continued performance and operation of fielded batteries \n-Update THAAD software and hardware to ensure compliance with DoD Weapon System Information Assurance Programs and guidance\n-Complete Missile Round Pallet (MRP) Transport development and qualification to both speed the deployment process and to reduce logistical lifecycle costs of fielding the system\n-Provide prime contractor technical and business management support activities, financial management, cost and schedule performance analysis, cost estimation and analysis, and integration activities to ensure effective use of appropriated resources \n-Provide prime contractor program management, and subcontract management to ensure effective use of appropriated resources\n\nIncrease in cost from FY 2013 to FY 2014 primarily due to Missile Round Pallet (MRP) Transport development and increased effort in Debris Mitigation Phase II and Modeling and Simulation"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "107.459"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "107.459"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Complete development of Phase II debris mitigation functionality and integrate into the weapon system to improve interoperability with other BMDS elements  \n-Continue Models and Simulations (M&S) development to support element and Ballistic Missile Defense System (BMDS) events including all Integrated Master Test Plan (IMTP) M&S related activities to include System Pre Mission Tests (SPMTs) and System Post Flight Reconstruction (SPFRs) and conduct analysis of the Critical Engagement Conditions (CEC) and Empirical Measurement Events (EME) data collected during test events to validate and accredit the M&S by the Operational Test Agency (OTA)\n-Continue development of Launch on Link 16 BMD System Based Track capability to provide the ability to initiate launch and engagement of THAAD interceptors using sensor data provided by BMDS sources outside the THAAD Battery\n-Continue to design, develop, qualification test, and field annual release of Terminal High Altitude Area Defense (THAAD) system software to ensure continued performance and operation of fielded batteries\n-Continue to develop and maintain models, simulations, testbeds, and associated software required to perform engineering verification and analysis utilizing system simulations and Hardware-in-the-Loop (HWIL) facilities to ensure accurate element configuration and representation\n-Continue integration and implementation of THAAD and its components in the BMDS through participation in Missile Defense Agency (MDA) Ground Test Campaigns and Performance Assessments to evaluate system performance and interoperability within the integrated BMDS\n-Continue requirements development, engineering analysis, capability integration, and performance verification for BMDS and THAAD element-level development and integration\n-Implement Mandatory Information Assurance updates and perform Information Assurance Vulnerability Assessments (IAVA) to mitigate potential system vulnerabilities and to ensure continued performance and operation of fielded batteries\n-Update THAAD software and hardware to ensure compliance with DoD Weapon System Information Assurance Programs and guidance  \n-Initiate development of the THAAD Launch on Remote-Battery Initiated Launch on Link 16 capability that will allow THAAD batteries to launch on track data received from an external BMDS sensor. This capability enables the THAAD battery to increase its defended area and\/or launch area, and enables a battery-initiated engagement to provide an intercept opportunity that would not otherwise be available. Development effort encompasses component THAAD Fire Control and Communication (TFCC) and Radar hardware and software development\n-Initiate development of Regional Peer to Peer Engagement Coordination which is a real-time automated exchange of coordination messages between Ballistic Missile Defense (BMD) tactical level weapon systems that share defended assets and are capable of engaging a common threat. This allows for the development of shot de-confliction to allow THAAD and other BMD weapon systems (i.e. Aegis BMD) located in a common battle space to prioritize engagement threats. Effort also includes the modification of the TFCC Planner software to provide selectable options for schema implementation, and modifications to the Engagement Ops software to implement the advanced schema\n-Initiate development to mitigate the effects of Track ID Proliferation through the implementation of BMDS changes approved in MIL-STD-6016 Interface Change Proposals (ICPs) in coordination with Aegis BMD, Command and Control, Battle Management, and Communications (C2BMC) and MDA Engineering. These changes require implementation by all members of the Network Participation Group to be effective\n\n-Reduction in cost from FY 2014 to FY 2015 primarily due to completion of Missile Round Pallet (MRP) Transport development and reduced effort in System Software Support and Modeling and Simulation"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "THAAD Program Support"
                                    },
                                    "Description": {
                                        "val": "In FY 2013, this activity provided maintenance and transportation as well as developed and maintained THAAD training devices.  It also provided funding to support the THAAD embedded Army Hybrid Cell which is the staff and internal operating budget that performs and executes the scope of the Program Support Items activity.  The Army Hybrid cell is a separate staff from the Program Operations and is composed of combined MDA and Army personnel providing Doctrine, Training, Leadership, Organization, Materiel, Soldier (DTLOMS) support for the THAAD system. In FY 2014 the maintenance and transportation efforts as well as funding for the Army Hybrid Cell were transferred to Operations and Maintenance, Defense Wide (0100D) for sustainment.  In FY 2015, Program Support includes efforts such as communications and interoperability, safety and mission assurance and growth reliability verification."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "68.543"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-The THAAD embedded Army Hybrid Cell is composed of combined MDA and Army personnel providing Doctrine, Training, Leadership, Organization, Materiel, Soldier (DTLOMS) support for the THAAD system. The Hybrid Cell provides technical guidance, financial management, cost and schedule performance analysis, cost estimation and analysis, integration activities, and sub-contract management to ensure effective use of appropriated resources \n-Continued development for Institutional Conduct of Fire Trainer (ICOFT) for Institutional Training Base to maintain Battery operational capability after soldier rotations \n-Continued development of Radar March Order & Emplacement Trainer (RMOET) for Institutional Training Base to maintain Battery operational capability after soldier rotations \n-Continued production of Table Top Trainer (TT3) to maintain Battery operational capability after soldier rotations \n-Initiated spares production for Institutional Training Base (ITB) to maintain training devices\n-Acquired Range Safety and Instrumentation System (RSIS) kits required to be used in THAAD Interceptors on specific flight tests to meet Range Safety Board requirements\n-Completed MIL-STD 331C compliance testing as required by the Ignition System Safety Review Board (ISSRB) for certification of the THAAD system for fielding.\n-Acquired and demonstrated capability of the Missile Stockpile Test Sets (MSTS) to perform factory equivalent missile round testing and software installation on tactically configured missile rounds in both stockpile storage and deployed conditions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "32.553"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue THAAD Fire Control and Communication (TFCC)-Interoperability development and maintenance to support weapon system interoperability capabilities, joint and service certifications, and net-worthiness certification. Without these certifications, the weapon system would not be authorized to operate on joint, service, or allied communications networks\n-Complete development of Radar March Order & Emplacement Trainer (RMOET) and complete design for Radar Training Device (RTD) in order for the Institutional Training Base to maintain an enduring radar training capability for THAAD Soldiers \n-Continue development of the Terminal High Altitude Area Defense (THAAD) Portable Planner and Interface to Command and Control Battle Management and Communications (C2BMC)to provide interactive defense design capability to plan defensive course(s) of action and develop detailed defense plans\n\nReduction from FY 2013 to FY 2014 due to realigning funding to Operations and Maintenance, Defense Wide (0100D) for sustainment as well as the completion of the THAAD Table Top Trainer (TT3), MIL-STD-331C, Missile Stockpile Test Sets (MSTS), and Range Safety and Instrumentation System (RSIS) kit efforts"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.581"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.581"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue THAAD Fire Control and Communication (TFCC)-Interoperability development and maintenance to support weapon system interoperability capabilities, joint and service certifications, and net-worthiness certification. Without these certifications, the weapon system would not be authorized to operate on joint, service, or allied communications networks\n-Conduct a Reliability Demonstration Test on a fully operational THAAD Battery for the purpose of demonstrating reliability growth in support of  Materiel Release\n\nReduction from FY 2014 to FY 2015 due to the completion of the development efforts associated with training devices Institutional Conduct of Fire Trainer (ICOFT), Radar March Order & Emplacement Trainer (RMOET), and Radar Training Device (RTD)"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program Operations"
                                    },
                                    "Description": {
                                        "val": "Program Operations provides for management of the Terminal High Altitude Area Defense (THAAD) program. Included in this effort is program and business management, program administration, technical and testing oversight, verification of hardware and software development, quality \/ safety \/ mission assurance, integrated logistics support, and government manpower and infrastructure to develop, test and sustain the THAAD system and components."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FY 2013 activities are included in MD07 THAAD accomplishments\/plans: THAAD Development."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "47.869"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Provide technical and business management support activities, financial management, cost and schedule performance analysis, cost estimation and analysis, configuration management and integration activities, to provide the Program Director with critical program status and decision quality data\n-Ensure Terminal High Altitude Area Defense (THAAD) program compliance with internal and external direction, policies, and regulations to deliver critical capability within a consistent and disciplined process\n-Conduct internal Baseline Execution Reviews to measure program progress against the six Missile Defense Agency approved baselines\n-Continue a Mission Assurance and Manufacturing Engineering Program to include Quality, Configuration Management, Manufacturing, Engineering, and Safety in all phases of the system life cycle, throughout the supply chain, and at all levels of assembly emphasizing high yield rates which minimize test and rework costs\n-Provide Quality Safety and Mission Assurance (QSMA) operations to ensure compliance with Agency requirements for design, test, manufacturing, quality, safety and reliability to ensure high quality products are delivered to the Warfighter \n\nIncrease is due to realignment of this task from THAAD Development"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "49.041"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "49.041"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Provide technical and business management support activities, financial management, cost and schedule performance analysis, cost estimation and analysis, configuration management and integration activities, to provide the Program Director with critical program status and decision quality data  \n-Ensure Terminal High Altitude Area Defense (THAAD) program compliance with internal and external direction, policies, and regulations to deliver critical capability within a consistent and disciplined process\n-Conduct internal Baseline Execution Reviews to measure program progress against the six Missile Defense Agency approved baselines \n-Continue a Mission Assurance and Manufacturing Engineering Program to include Quality, Configuration Management, Manufacturing, Engineering, and Safety in all phases of the system life cycle, throughout the supply chain, and at all levels of assembly emphasizing high yield rates which minimize test and rework costs\n-Provide Quality Safety and Mission Assurance (QSMA) operations to ensure compliance with Agency requirements for design, test, manufacturing, quality, safety and reliability to ensure high quality products are delivered to the Warfighter"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Project Redwood- Details at a Higher Classification"
                                    },
                                    "Description": {
                                        "val": "See Description Below"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.260"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "This project is reported in accordance with Title 10, United States Code, Section 119 (a)(1) in the Special Access Program Annual Report to Congress."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.722"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "This project is reported in accordance with Title 10, United States Code, Section 119 (a)(1) in the Special Access Program Annual Report to Congress."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.081"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.081"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "This project is reported in accordance with Title 10, United States Code, Section 119 (a)(1) in the Special Access Program Annual Report to Congress."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0208866C"
                                    },
                                    "Title": {
                                        "val": "O&M"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "221.609"
                                        },
                                        "CurrentYear": {
                                            "val": "369.371"
                                        },
                                        "BudgetYearOne": {
                                            "val": "416.644"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "416.644"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "421.633"
                                        },
                                        "BudgetYearThree": {
                                            "val": "434.974"
                                        },
                                        "BudgetYearFour": {
                                            "val": "454.477"
                                        },
                                        "BudgetYearFive": {
                                            "val": "459.678"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "2778.3860"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MD07"
                                    },
                                    "Title": {
                                        "val": "THAAD Procurement"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "416.838"
                                        },
                                        "CurrentYear": {
                                            "val": "571.851"
                                        },
                                        "BudgetYearOne": {
                                            "val": "464.424"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "464.424"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "602.692"
                                        },
                                        "BudgetYearThree": {
                                            "val": "533.258"
                                        },
                                        "BudgetYearFour": {
                                            "val": "491.026"
                                        },
                                        "BudgetYearFive": {
                                            "val": "459.124"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The program is closing out contract line items in the basic THAAD Engineering, Manufacturing, and Development (EMD) contract that are associated with THAAD 1.0 while continuing THAAD 2.0 contract line items.  THAAD awards Indefinite Delivery Indefinite Quantity (IDIQ) Task Orders on the Advanced Capability Development (ACD) contract for the continuation of THAAD 2.0 development.  The discrete task orders allow management and tracking of Development work."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "Funding in the All Prior Years column represents a summary of Prior Years Total Costs for active contracts, Military Interdepartmental Purchase Requests, and civilian salaries on the R-3."
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "N\/A"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "THAAD Development - Advanced Capability Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "IDIQ"
                                                },
                                                "PerformingActivity": {
                                                    "val": "LMSSC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Sunnyvale, CA\/Huntsville, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "38.722"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "10.856"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "48.952"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "47.627"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "47.627"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "THAAD Development - Lockheed Martin"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "LMSSC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Sunnyvale, CA\/Huntsville, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "361.722"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "24.662"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "43.008"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "22.627"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "22.627"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "THAAD Development - MDA Program Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Missile Defense Agency (MDA)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Belvoir, VA\/Huntsville, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "17.525"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "62.269"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "4.195"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "11.044"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "11.044"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "THAAD Development - Models & Simulations"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "US Army Research, Development, Engineering Command (RDECOM)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Huntsville, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "77.003"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "22.210"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "36.328"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "26.161"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "26.161"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "Remarks": {
                                        "val": "N\/A"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "THAAD Program Support - Army Cell to Hybrid Program Office"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Integrated Material Management Center, AMCOM"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Huntsville, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "11.854"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "5.771"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "17.6250"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "THAAD Program Support - MDA Program Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Missile Defense Agency (MDA)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Huntsville, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "8.249"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "8.2490"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "THAAD Program Support - Maintenance, Training, Transportation and Operations Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "LMSSC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Sunnyvale, CA\/Huntsville, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "22.688"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "62.772"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "30.469"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "THAAD Program Support - Mission Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ATEC \/ OTC \/ MDA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "WSMR, NM \/ Huntsville, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.084"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "7.581"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "7.581"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Program Operations - Program Operations MDA Program Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Missile Defense Agency (MDA)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Belvoir, VA\/Huntsville, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "54.634"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "47.869"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "49.041"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "49.041"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Project Redwood- Details at a Higher Classification - Special Programs"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "FP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "N\/A"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "N\/A"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "53.284"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "4.260"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.722"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.081"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "5.081"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Remarks": {
                                        "val": "N\/A"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "Remarks": {
                                        "val": "N\/A"
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "0603881C_Terminal_MD07_Header Out.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Conduct FTI-01 (GMD\/Aegis\/THAAD\/PATRIOT Multiple Integration Flight Test)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Debris Mitigation Phase II Engineering Requirements Review (ERR)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Flexible Threat Package Engineering Requirements Review (ERR)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Debris Mitigation Phase II Engineering Design Review (EDR)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Complete Institutional Conduct of Fire trainer (ICOFT)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Flexible Threat Package Engineering Design Review (EDR)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Complete Institutional Training Devices"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Launch on Link 16 Engineering Requirements Review (ERR)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Regional Peer to Peer Engagement Engineering Requirements Review (ERR)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Launch on Link 16 Engineering Design Review (EDR)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Regional Peer to Peer Engagement Engineering Design Review (EDR)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MC07"
                    },
                    "ProjectTitle": {
                        "val": "Cyber Operations"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.530"
                        },
                        "BudgetYearOne": {
                            "val": "0.647"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.647"
                        },
                        "BudgetYearTwo": {
                            "val": "0.659"
                        },
                        "BudgetYearThree": {
                            "val": "0.671"
                        },
                        "BudgetYearFour": {
                            "val": "0.683"
                        },
                        "BudgetYearFive": {
                            "val": "0.695"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "N\/A"
                        },
                        "ProjectMissionDescription": {
                            "val": "Funding in this project sustains Missile Defense Agency (MDA) DoD Information Assurance Certification and Accreditation Program (DIACAP) and Controls Validation Testing (CVT) activities, analysis of validation results, risk assessments and reviews of proposed Program Manager\/Information Assurance Manager (PM\/IAM) Plans of Action and Milestones (POA&Ms) for MDA Command and Control Battle Management and Communications (C2BMC) mission systems.  It maintains the Certification and Accreditation (C&A) data repository, capturing the DIACAP documentation (artifacts, validation results, and Information Assurance Risk Assessment results, and Designated Approving Authority (DAA) accreditation decisions) and POA&M on all MDA information systems.  This project supports THAAD certification to operate in the BMD System.\n\nThis project supports the monitoring and tracking of Cybersecurity mitigations detailed in Information Technology security POA&Ms.   Activities include preparation of C&A documentation and accreditation recommendations to the MDA Senior Information Assurance Officer (SIAO)\/Certification Authority (CA) and DAA.  Independent Verification and Validation (IV&V) team actions ensure the availability, integrity, authentication, confidentiality and non-repudiation of the MDA mission, test and administrative systems.  Activities in the Project are necessary to comply with the Federal Information Security Management Act (FISMA)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Network \/ System Certification and Accreditation (C&A)"
                                    },
                                    "Description": {
                                        "val": "N\/A"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.530"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Conduct cyber security \/ information assurance engineering and architecture planning for THAAD information technology systems \n- Develop and test cyber security\/information assurance control measures for Ballistic Missile Defense System (BMDS) THAAD systems \n- Develop THAAD DIACAP certification and accreditation packages \n- Support Controls Validation Testing (CVT) of THAAD mission, test, and training systems\n- Develop Plan of Action and Milestones (POA&Ms) to resource and remediate information assurance deficiencies \n- Conduct annual information assurance reviews on the THAAD enclaves to assess compliance in implementing and maintaining IA controls"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.647"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.647"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Conduct cyber security \/ information assurance engineering and architecture planning for THAAD information technology systems \n- Develop and test cyber security\/information assurance control measures for Ballistic Missile Defense System (BMDS) THAAD systems \n- Develop THAAD DIACAP certification and accreditation packages \n- Support Controls Validation Testing (CVT) of THAAD mission, test, and training systems\n- Develop Plan of Action and Milestones (POA&Ms) to resource and remediate information assurance deficiencies \n- Conduct annual information assurance reviews on the THAAD enclaves to assess compliance in implementing and maintaining IA controls"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0603175C"
                                    },
                                    "Title": {
                                        "val": "Ballistic Missile Defense Technology"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "69.438"
                                        },
                                        "CurrentYear": {
                                            "val": "9.321"
                                        },
                                        "BudgetYearOne": {
                                            "val": "38.800"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "38.800"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "76.400"
                                        },
                                        "BudgetYearThree": {
                                            "val": "52.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "112.800"
                                        },
                                        "BudgetYearFive": {
                                            "val": "178.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "536.7590"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603896C"
                                    },
                                    "Title": {
                                        "val": "Ballistic Missile Defense Command and Control, Battle Management & Communication"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "344.431"
                                        },
                                        "CurrentYear": {
                                            "val": "405.319"
                                        },
                                        "BudgetYearOne": {
                                            "val": "443.484"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "443.484"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "456.182"
                                        },
                                        "BudgetYearThree": {
                                            "val": "462.525"
                                        },
                                        "BudgetYearFour": {
                                            "val": "452.937"
                                        },
                                        "BudgetYearFive": {
                                            "val": "465.638"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603898C"
                                    },
                                    "Title": {
                                        "val": "Ballistic Missile Defense Joint Warfighter Support"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "47.710"
                                        },
                                        "CurrentYear": {
                                            "val": "42.619"
                                        },
                                        "BudgetYearOne": {
                                            "val": "46.387"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "46.387"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "52.619"
                                        },
                                        "BudgetYearThree": {
                                            "val": "53.552"
                                        },
                                        "BudgetYearFour": {
                                            "val": "54.699"
                                        },
                                        "BudgetYearFive": {
                                            "val": "56.252"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603904C"
                                    },
                                    "Title": {
                                        "val": "Missile Defense Integration and Operations Center (MDIOC)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "61.684"
                                        },
                                        "CurrentYear": {
                                            "val": "52.095"
                                        },
                                        "BudgetYearOne": {
                                            "val": "58.530"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "58.530"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "51.738"
                                        },
                                        "BudgetYearThree": {
                                            "val": "61.594"
                                        },
                                        "BudgetYearFour": {
                                            "val": "53.885"
                                        },
                                        "BudgetYearFive": {
                                            "val": "55.414"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0901598C"
                                    },
                                    "Title": {
                                        "val": "Management HQ - MDA"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "31.674"
                                        },
                                        "CurrentYear": {
                                            "val": "34.712"
                                        },
                                        "BudgetYearOne": {
                                            "val": "36.998"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "36.998"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "36.343"
                                        },
                                        "BudgetYearThree": {
                                            "val": "35.441"
                                        },
                                        "BudgetYearFour": {
                                            "val": "34.675"
                                        },
                                        "BudgetYearFive": {
                                            "val": "33.650"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "D1300639"
                                    },
                                    "Title": {
                                        "val": "Fort Drum, New York, IDT Complex"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "23.869"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "23.8690"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "D1400634"
                                    },
                                    "Title": {
                                        "val": "Clear AFS, AK"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "17.204"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "17.2040"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "N\/A"
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "Remarks": {
                                        "val": "N\/A"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Network \/ System Certification and Accreditation (C&A) - CND\/IA Advisory and Assistance Services"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Torch Technologies"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various MDA Locations"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.530"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-07"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.647"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.647"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MT07"
                    },
                    "ProjectTitle": {
                        "val": "THAAD Test"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "61.677"
                        },
                        "CurrentYear": {
                            "val": "24.540"
                        },
                        "BudgetYearOne": {
                            "val": "111.366"
                        },
                        "BudgetYearOneBase": {
                            "val": "111.366"
                        },
                        "BudgetYearTwo": {
                            "val": "15.618"
                        },
                        "BudgetYearThree": {
                            "val": "62.579"
                        },
                        "BudgetYearFour": {
                            "val": "65.497"
                        },
                        "BudgetYearFive": {
                            "val": "40.700"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "Beginning in FY 2013, THAAD System Test plans moved into Budget Project MT07, which is part of this Program Element 0603881C (Ballistic Missile Defense Terminal Defense Segment). In FY 2014 System Test plans are further broken out into Flight Test Execution, Infrastructure, and Ground Test Execution.  In FY 2015 Infrastructure plans are broken down into Resources and Wargames & Exercises."
                        },
                        "ProjectMissionDescription": {
                            "val": "Terminal High Altitude Area Defense (THAAD) System Test conducts Ballistic Missile Defense System (BMDS) Flight Tests and Ground Tests with other BMDS elements (including BMDS Command Control \/ Battle Management and Communication, PATRIOT, and Aegis) in accordance with BMDS Integrated Master Test Plan. THAAD System Test coordinates with Operational Test Agencies, conducts flight test operations, performs post-flight test reporting, and performs data distribution and data storage at Pacific Missile Range Facility and the Reagan Test Site.\n\nTHAAD Flight Test Execution includes mission planning, pre-flight integration testing, conduct of readiness reviews, test asset transportation, flight test execution and data collection, post flight test reporting and data distribution.\n\nGround Test Execution includes mission planning, BMDS test integration, conduct of readiness reviews, ground test execution and data collection, and post test reporting and data distribution.\n\nInfrastructure in FY 2014 and Resources in FY 2015 includes sustained and maintenance of test equipment and facilities. It provides maintenance, repair, and fueling of THAAD Battery assets utilized in testing.\n\nWargames & Exercises provides support to the various Combatant Commanders with model and simulations and subject matter expertise during various exercises."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "System Test"
                                    },
                                    "Description": {
                                        "val": "THAAD System Test includes mission planning, pre-test integration, conduct of readiness reviews, test asset transportation, test execution and data collection, post test reporting, data distribution, sustainment and maintenance of test equipment and facilities, maintenance, repair, and fueling of THAAD Battery assets utilized in testing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "61.677"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continued flight test planning, range interface, coordination with Operational Test Agencies (OTAs) and execution of flight test operations at Reagan Test Site for FTO-01 (BMDS Operational Flight Test) to further demonstrate in an operational scenario THAAD`s ability to conduct coordinated engagements with Aegis and PATRIOT operating with BMDS Command Control \/ Battle Management and Communications (C2BMC) and forward-based AN\/TPY-2 \n-Conducted post-mission analysis of THAAD performance in FTI-01, an operational scenario testing THAAD`s ability to conduct coordinated engagements with Aegis and PATRIOT operating with C2BMC and forward-based AN\/TPY-2\n-Provided data management, facilities operations, and post-test reporting in support of Ballistic Missile Defense System (BMDS) System Tests to ensure data collection and readiness for mission execution\n-Provided on-site range support for Terminal High Altitude Area Defense (THAAD) maintenance, repair, and fueling to ensure readiness of the THAAD test assets\n-Sustained and maintained THAAD Launch and Test Support Equipment (L&TSE) to ensure readiness of the THAAD test equipment\n-Continued THAAD participation in Missile Defense Agency (MDA) Ground Test operational scenario events to ensure THAAD`s ability to conduct coordinated engagements with Aegis and PATRIOT operating with Command and Control, Battle Management, Communications (C2BMC) and forward-based Army Navy Transportable Radar Surveillance and Control (AN\/TPY-2) \n-Continued Performance Assessments to evaluate system performance and interoperability within the integrated Ballistic Missile Defense System (BMDS)"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Plans for this scope are included in MT07 Terminal High Altitude Area Defense (THAAD) plans: Flight Test Execution, Infrastructure, and Ground Test Execution."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Plans for this scope are included in MT07 Terminal High Altitude Area Defense (THAAD) plans: Flight Test Execution, Ground Test, Resources and Wargames & Exercises."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Flight Test Execution"
                                    },
                                    "Description": {
                                        "val": "THAAD Flight Test Execution includes mission planning, pre-flight integration testing, conduct of readiness reviews, test asset transportation, flight test execution and data collection, post flight test reporting and data distribution."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Plans for this scope are included in MT07 THAAD plans: System Test."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.128"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Complete Flight Test Operational-01 (FTO-01) post test reporting and data distribution to provide data for analysis and integration into BMDS Modeling and Simulation.\n\nReduction in flight test cost from FY 2013 to FY 2014 due to no flight test being executed in FY 2014.  In FY 2013 THAAD planned and executed FTO-01 (BMDS Operational Flight Test) while also conducting post-mission analysis work for FTI-01.  In FY 2014, THAAD is not scheduled to conduct any flight tests and plans to complete post-mission analysis work for FTO-01."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "101.313"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "101.313"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Conduct flight test planning, range interface, coordination with Operational Test Agencies (OTAs) and execution of flight test operations at Wake Island for FTO-02 (BMDS Operational Flight Test) to further demonstrate, in an operational scenario, THAAD`s ability to conduct coordinated engagements with Aegis and PATRIOT operating with BMDS Command Control \/ Battle Management and Communications (C2BMC) and forward-based AN\/TPY-2 while engaging a Short Range Ballistic Missile.\n- Conduct flight test planning, range interface, coordination with Operational Test Agencies (OTAs) and execution of flight test operations at Wake Island for Flight Test THAAD-18 (FTT-18) to demonstrate THAAD's ability to intercept an Intermediate Range Ballistic Missile (IRBM) target using the THAAD radar, launcher, fire control and communications, interceptor closed-loop operations, and engagement functions.\n\n- Increase in flight test cost from FY 2014 to FY 2015 due to execution of two of flight tests in FY 2015.  In FY 2014 THAAD is not scheduled to plan or conduct any flight tests and plans only to complete post-mission analysis work for FTO-01.  In FY 2015 THAAD is scheduled to plan and execute FTO-02 E2 (BMDS Operational Flight Test) and Flight Test THAAD-18 (FTT-18)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Infrastructure"
                                    },
                                    "Description": {
                                        "val": "Infrastructure includes sustainment and maintenance of test equipment and facilities. It provides maintenance, repair, and fueling of THAAD Battery assets utilized in testing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Plans for this scope are included in MT07 THAAD plans: System Test."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.540"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Provide data management, facilities operations, and post-test reporting in support of Ballistic Missile Defense System (BMDS) System Tests to ensure data collection and readiness for mission execution\n-Provide on-site range support for Terminal High Altitude Area Defense (THAAD) maintenance, repair, and fueling to ensure readiness of the THAAD test assets\n-Continued Performance Assessments to evaluate system performance and interoperability within the integrated Ballistic Missile Defense System (BMDS)"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Plans for this scope are included in MT07 THAAD plans: Resources and Wargames & Exercises"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ground Test Execution"
                                    },
                                    "Description": {
                                        "val": "Ground Test Execution includes mission planning, BMDS test integration, conduct of readiness reviews, ground test execution and data collection, post test reporting and data distribution."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Plans for this scope are included in MT07 THAAD plans: System Test."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.872"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue THAAD participation in Missile Defense Agency (MDA) Ground Test operational scenario events (GT-04 and GT-06 campaigns) to ensure THAAD`s ability to conduct coordinated engagements with Aegis and PATRIOT operating with Command and Control, Battle Management, Communications (C2BMC) and forward-based Army Navy Transportable Radar Surveillance and Control (AN\/TPY-2)\n-Provide pre-mission planning, pre and post mission analysis, reporting support, and execution to BMDS Ground Test campaigns \n-Continue Performance Assessments to evaluate system performance and interoperability within the integrated Ballistic Missile Defense System (BMDS)"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.917"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.917"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue THAAD participation in Missile Defense Agency (MDA) Ground Test operational scenario events (GT-04 and GT-06 campaigns) to ensure THAAD`s ability to conduct coordinated engagements with Aegis and PATRIOT operating with Command and Control, Battle Management, Communications (C2BMC) and forward-based Army Navy Transportable Radar Surveillance and Control (AN\/TPY-2)\n-Provide pre-mission planning, pre and post mission analysis, reporting support, and execution to BMDS Ground Test campaigns \n-Continue Performance Assessments to evaluate system performance and interoperability within the integrated Ballistic Missile Defense System (BMDS)\n\n-Decrease in cost from FY 2014 to FY 2015 due to completion of Fast Event ground testing in FY 2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Resources"
                                    },
                                    "Description": {
                                        "val": "Resources include sustainment and maintenance of test labs and facilities. It provides maintenance, repair, and fueling of THAAD Battery assets utilized in testing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.957"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.957"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Provide data management, facilities operations, and post-test reporting in support of Ballistic Missile Defense System (BMDS) System Tests to ensure data collection and readiness for mission execution\n-Provide on-site range support for Terminal High Altitude Area Defense (THAAD) maintenance, repair, and fueling to ensure readiness of the THAAD test assets\n-Continue Performance Assessments to evaluate system performance and interoperability within the integrated Ballistic Missile Defense System (BMDS)"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Wargames and Exercises"
                                    },
                                    "Description": {
                                        "val": "See planned accomplishments"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.179"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.179"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Provide support to the various COCOM's with model and simulations and subject matter expertise during the exercise events.  Continue to assist in the development\/refining of Tactics, Techniques, and Procedures (TTP's) as well as Pre-Planned Responses (PPR's) to incorporate in further exercises, ground, and flight test events.  Demonstrate THAAD capability and limitations to the warfighter community in the Integrated and Missile Defense (IAMD) environment."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "THAAD awards Indefinite Delivery Indefinite Quantity (IDIQ) Task Orders on the Advanced Capability Development (ACD) contract for the continuation of THAAD 2.0 development and test.  The discrete task orders allow management and tracking of Development work."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "N\/A"
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "N\/A"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "Remarks": {
                                        "val": "N\/A"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Remarks": {
                                        "val": "N\/A"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "System Test - BMDS Ground Testing and Flight Test Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "US Army AMRDEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Huntsville, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "5.309"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "5.3090"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "System Test - Flight Test Planning, Analysis, and Execution"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "LMSSC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Sunnyvale, CA\/Huntsville, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "19.544"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "19.5440"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "System Test - Flight Test Range Infrastructure\/Execution"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Reagan Test Site"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Kwajalein Atoll"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "4.560"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "4.56"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "System Test - Flight Test Support and Planning"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MDA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Belvoir, VA\/Huntsville, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "32.264"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "32.2640"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Flight Test Execution - Execution, Support and Planning"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MDA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Belvoir, VA\/Huntsville, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "38.703"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "38.703"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Flight Test Execution - Planning, Analysis, and Execution"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "LMSSC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Sunnyvale, CA\/Huntsville, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "12.128"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "62.610"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "62.610"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Infrastructure - Range Infrastructure"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MDA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Belvoir, VA\/Huntsville, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "5.540"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Infrastructure - Range Infrastructure Prime"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "LMSSC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Sunnyvale, CA\/Huntsville, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Ground Test Execution - BMDS Ground Test Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "US Army AMRDEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Huntsville, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "4.169"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "4.917"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "4.917"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Ground Test Execution - Support and Planning"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MDA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Belvoir, VA\/Huntsville, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.703"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Resources - Test and Range Infrastructure"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Huntsville, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "4.957"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "4.957"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Wargames and Exercises - Wargames and Exercises"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MDA \/ SMDC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Huntsville, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.179"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.179"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "Remarks": {
                                        "val": "N\/A"
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "0603881C_Terminal_MT07_Header Out.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "FTI-01 (FTO-01 Risk Reduction Flight Test)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FTO-01 (Aegis\/THAAD\/PATRIOT Multiple Engagement Flight Test)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Fast Phoenix (BMDS Ground Test)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "GTI-04e (Part 2 (BMDS Ground Test)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Fast Falcon (BMDS Ground Test)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Fast Osprey (BMDS Ground Test)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "GTI-06 Part 1 (BMDS Ground Test)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "GTI-06 Part 2 (BMDS Ground Test)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FTT-18 (TH Intercept Flight Test)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FTO-02 E2 (OTA Intercept Flight Test)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "GTD-06 Part 1a (BMDS Ground Test)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "GTD-06 Part 2 (BMDS Ground Test)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "GTD-06 Part 1b (BMDS Ground Test)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "GTX-07a (BMDS Ground Test)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "GTI-07a (BMDS Ground Test)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FTT-15 (TH Intercept Flight Test)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "GTD-07a Part 2 (BMDS Ground Test)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "GTD-07a Part 1 (BMDS Ground Test)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "GTX-07b (BMDS Ground Test)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "GTI-07b (BMDS Ground Test)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "GTD-07b Part 2 (BMDS Ground Test)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FTO-03 E3 (OTA Intercept Flight Test)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "GTD-07b Part 1 (BMDS Ground Test)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FTT-19 (TH Intercept Flight Test)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MD06"
                    },
                    "ProjectTitle": {
                        "val": "Patriot Advanced Capability-3 (PAC-3)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "35.876"
                        },
                        "PriorYear": {
                            "val": "0.961"
                        },
                        "CurrentYear": {
                            "val": "1.091"
                        },
                        "BudgetYearOne": {
                            "val": "1.082"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.082"
                        },
                        "BudgetYearTwo": {
                            "val": "1.217"
                        },
                        "BudgetYearThree": {
                            "val": "1.243"
                        },
                        "BudgetYearFour": {
                            "val": "1.267"
                        },
                        "BudgetYearFive": {
                            "val": "1.298"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "Funding in the All Prior Years column represents a summary of Prior Years Total Costs for active contracts, Military Interdepartmental Purchase Requests, and civilian salaries on the R-3."
                        },
                        "ProjectMissionDescription": {
                            "val": "Phased Array Tracking Radar Intercept Of Target (PATRIOT) Advanced Capability (PAC-3) is one of the most mature elements of the Ballistic Missile Defense System (BMDS) and is now operational with the U.S. Army. It is a land-based element built upon the proven PATRIOT air and missile defense infrastructure. \n\nThe Army is responsible for production and further development of Advanced Capability-3 System; the Missile Defense Agency remains responsible for the Ballistic Missile Defense System interoperability and integration efforts. Lower Tier Project Office (LTPO) will utilize Missile Defense Agency funds to further the integration of PATRIOT into the BMDS. Support includes software coding, performance testing, flight testing and integration activities and modifications to cope with evolving threats."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "General Support"
                                    },
                                    "Description": {
                                        "val": "PATRIOT Advanced Capability (PAC-3) is a U.S. Army short range BMDS that interfaces with the Ballistic Missile Defense System. Missile Defense Agency funds PATRIOT participation in BMDS interoperability integration efforts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.961"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Supported the day-to-day tasking that is leveraged upon Lower Tier Project Office (LTPO) by MDA based on the Transfer and Transition Plan Annex L."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.091"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Support the day-to-day tasking that is leveraged upon Lower Tier Project Office (LTPO) by MDA based on the Transfer and Transition Plan Annex L."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.082"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.082"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Support the day-to-day tasking that is leveraged upon Lower Tier Project Office (LTPO) by Missile Defense Agency (MDA) based on the Transfer and Transition Plan Annex L."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The planned acquisition strategy for PATRIOT (Phased Array Tracking Radar Intercept on Target) support awards Task Orders on multiple contract vehicles and memorandum of Agreements with other government agencies. The program is considering opportunities for potential competitive awards."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "Funding in the All Prior Years column represents a summary of Prior Years Total Costs for active contracts, Military Interdepartmental Purchase Requests, and civilian salaries on the R-3."
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "N\/A"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "General Support - Evolutionary Development Program (EDP) Task 2"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Multiple"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Multiple"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "32.360"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "32.36"
                                                    },
                                                    "TotalCost": {
                                                        "val": "64.72"
                                                    },
                                                    "TargetValue": {
                                                        "val": "32.36"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "Remarks": {
                                        "val": "N\/A"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "General Support - General Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Intuitive Research and Technology \/ Wyle CAS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Huntsville, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.516"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.961"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.091"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.082"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.082"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Remarks": {
                                        "val": "N\/A"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "Remarks": {
                                        "val": "N\/A"
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MD40"
                    },
                    "ProjectTitle": {
                        "val": "Program-Wide Support"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "8.369"
                        },
                        "PriorYear": {
                            "val": "11.958"
                        },
                        "CurrentYear": {
                            "val": "14.130"
                        },
                        "BudgetYearOne": {
                            "val": "17.341"
                        },
                        "BudgetYearOneBase": {
                            "val": "17.341"
                        },
                        "BudgetYearTwo": {
                            "val": "12.984"
                        },
                        "BudgetYearThree": {
                            "val": "18.075"
                        },
                        "BudgetYearFour": {
                            "val": "19.352"
                        },
                        "BudgetYearFive": {
                            "val": "19.521"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "N\/A"
                        },
                        "ProjectMissionDescription": {
                            "val": "Program-Wide Support (PWS) contains non-headquarters management costs in support of Missile Defense Agency (MDA) functions and activities across the entire Ballistic Missile Defense System (BMDS). It Includes Government Civilians, Contract Support Service, and Federally Funded Research and Development Center (FFRDC) providing integrity and oversight of the BMDS as well as, supporting MDA in enabling the development and evaluation of technologies that will respond to the changing threat. In addition, includes Global Deployment personnel and support performing deployment site preparation and activation. Other costs included provide facility capabilities for MDA Executing Agent locations, such as physical and technical security, legal services, travel and agency training, office and equipment leases, utilities, data and unified communications support, supplies and maintenance, materiel and readiness and central property management of equipment, and similar operating expenses. Also includes legal settlements. In keeping with congressional intent, Program Wide Support is allocated on a pro-rata basis and therefore, fluctuates by year based on the total MDA budget."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Program Wide Support"
                                    },
                                    "Description": {
                                        "val": "N\/A"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.958"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "See paragraph A: Mission Description and Budget Item Justification"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.130"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "See paragraph A: Mission Description and Budget Item Justification"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.341"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.341"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "See paragraph A: Mission Description and Budget Item Justification"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "N\/A"
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "Remarks": {
                                        "val": "N\/A"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Wide Support - Agency Operations Management"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Multi: AL, CA, CO, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.658"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.872"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Program Wide Support - Agency Operations User Services"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Multi: AL, CA, CO, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "6.665"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "6.665"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Program Wide Support - Agency Operations and Support International and Materiel and Readiness"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Multi: AL, VA, Aust, Japan"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.099"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Program Wide Support - Agency Operations and Support Services"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Multi: AL, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "8.369"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "7.906"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "13.258"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "10.676"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "10.676"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Program Wide Support - FFRDC\/UARC"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Multi: AL, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.295"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}