{
    "id": "71224748f7b829c8c26cbabf013df1984f5b2c6d",
    "meta": {
        "filename": "dod-2015_RDTE_2015_OSD_RDTE_JustificationBook_Office_of_Secretary_Of_Defense_PB_2015.zzz_unzipped_RDTE_JustificationBook_Office_of_Secretary_Of_Defense_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603648D8Z"
        },
        "ProgramElementTitle": {
            "val": "Joint Capability Technology Demonstration (JCTD)"
        },
        "R1LineNumber": {
            "val": "47"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "192.297"
            },
            "PriorYear": {
                "val": "138.374"
            },
            "CurrentYear": {
                "val": "165.008"
            },
            "BudgetYearOne": {
                "val": "131.960"
            },
            "BudgetYearOneBase": {
                "val": "131.960"
            },
            "BudgetYearTwo": {
                "val": "146.878"
            },
            "BudgetYearThree": {
                "val": "140.496"
            },
            "BudgetYearFour": {
                "val": "146.502"
            },
            "BudgetYearFive": {
                "val": "144.865"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "Historically, the Joint Capability Technology Demonstration (JCTD) Program has worked primarily with the Combatant Commands (COCOMs) and Services to identify DoD priorities and accelerated the development and demonstration of technical solutions.  However, with the end of current conflicts there has been a strategic shift to a more balanced approach that will continue to address COCOM needs in conjunction with initiating broader, longer-term JCTDs to address DoD’s strategic initiatives to mitigate emergent threats, address affordability and interoperability of defense systems.  The JCTD Program will begin to employ developmental and operational prototypes to address these longer-term DoD priorities.\n\nThe shift in the JCTD Program will also result in a shift in Program metrics.  JCTDs supporting the DoD’s strategic initiatives will tend to be longer and larger, with less focus on transition and partner funding.  Overall, we envision initiating fewer yet more impactful JCTD projects. \n\nIn FY 2015, Disruptive Demonstrations (Project P264) funding will be transferred from Program Element (PE) 0603648D8Z (Joint Capability Technology Demonstration (JCTD)) to PE 0603289D8Z (Advanced Innovative Analysis & Concepts)."
        },
        "ProgramElementMissionDescription": {
            "val": "The JCTD Program directly addresses DoD, multi-Service and COCOMs’ priorities through partnering and cost sharing with solution providers and resource sponsors.  The value and impact of the JCTD Program is to cost-effectively address the COCOMs’ priorities and the Department’s strategic initiatives to mitigate emergent threats, address affordability and interoperability of defense systems through developmental and operational prototyping.  JCTDs provide key partnerships with the Department, Services, and other government agencies, select allies, and industry that allow for expedited development, deployment, and evaluation of capability solutions with the potential to close validated warfighting capability gaps.  The JCTD Program typically demonstrates solutions in two - four years and has a transition rate to the warfighter greater than 80 percent.  At least 57 JCTD projects supported Operation Enduring Freedom, 74 projects supported Operation Iraqi Freedom, and over 30 percent of JCTD projects involved partner nations.  These JCTD partnerships also enable interdepartmental cooperation and joint capability development (e.g. Departments of Homeland Security, State, Transportation, National Aeronautics and Space Administration and Justice).  In FY 2013, the JCTD Program successfully demonstrated and transitioned several key warfighter capabilities that address operational warfighting needs of the Department, providing affordable and sustainable solutions.\n\nKey values demonstrated by the JCTD program are:\n• The JCTD Program has a long history of providing enduring capabilities.  See “Section D.  Acquisition Strategy” for more details on transition.\n• The JCTD Program delivers capabilities rapidly and projects execute far quicker than the traditional DoD Planning, Programming, Budgeting, and Execution (PPBE) process.  The result is that 74 JCTD projects delivered capabilities used in Operation Iraqi Freedom, and 57 projects delivered capabilities to Operation Enduring Freedom.  Most of those capabilities would not have been delivered – or would have been significantly delayed – if not for the JCTD program.  Recent examples include: \n1. A robust “detect and track” capability of \"dark\" (i.e. non-emitting) maritime targets.  This is accomplished through automated data fusion of an existing suite of sensors supporting the Maritime Domain Awareness (MDA) function.  This capability was successfully transitioned into the Sealink Advanced Analysis system at Office of Naval Intelligence and is now used by multiple agencies to provide a MDA capability.\n2. An operational, internet-based, open-access, Arctic-focused, environmental research and decision-support system that enables local, regional, and international cooperation and coordination on long-term environmental planning and near-term actions in response to climatic and environmental changes occurring in the Arctic Region.\n3. A vastly improved capability for U.S., NATO, and Coalition naval forces boarding operations, data collection, and sharing of time-critical boarding and biometrics information during an international operational assessment in April 2013.\n• The JCTD Program enables coalition cooperative development by leveraging partner nation expertise and resources; approximately one-third of JCTD projects involve some degree of coalition partner participation.  As a result of successful past collaborations, the program now enjoys routine interactions with the United Kingdom, Canada, Australia, and the Republic of Korea. \n• The JCTD Program enables development and execution of interdepartmental cooperation projects, such as projects with the Department of Homeland Security, State, Transportation, and the National Aeronautics and Space Administration.  \n• The JCTD Program enables rapid response to new DoD priorities before Service PPBE cycles can respond.  For example, the DoD has established priorities for Anti-Access\/Area-Denial, Building Partner Capacity, understanding human terrain, and nuclear forensics.  The JCTD Program quickly responded to the new priorities and is providing initial capabilities that are transitioning to the warfighter today.\n\nMEASURABLE OUTCOMES:  \n• Capabilities delivered and technologies transitioned have been key metrics:\n1. JCTDs typically transition capability within 24 - 36 months with initial spiral products and deliverables in less than 24 months. \n 2. The JCTD program has been achieving transition rates of over 80 percent, well in excess of the DoD Strategic Objective 3.5.2D, Performance Measure 3.5.1-2D, goal of 40 percent.  The JCTD Program defines transition as all, or components of the demonstrated JCTD, going to a new or existing Program(s) of Record, providing fieldable-prototypes (residual capabilities) sustained by non-JCTD funds in direct support of operations in theater, or commodity-type capabilities entered onto GSA schedule for procurement by DoD users.  In FY 2013, 12 of 12 completed JCTDs successfully transitioned."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "158.263"
                },
                "CurrentYear": {
                    "val": "174.428"
                },
                "BudgetYearOne": {
                    "val": "156.756"
                },
                "BudgetYearOneBase": {
                    "val": "156.756"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "138.374"
                },
                "CurrentYear": {
                    "val": "165.008"
                },
                "BudgetYearOne": {
                    "val": "131.960"
                },
                "BudgetYearOneBase": {
                    "val": "131.960"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-19.889"
                },
                "CurrentYear": {
                    "val": "-9.420"
                },
                "BudgetYearOne": {
                    "val": "-24.796"
                },
                "BudgetYearOneBase": {
                    "val": "-24.796"
                }
            },
            "AdjustmentDetails": {
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "-14.331"
                    },
                    "CurrentYear": {
                        "val": "-9.400"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "-0.210"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-2.067"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-3.220"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Transfer of Disruptive Demonstrations funding to PE 0603289D8Z"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-21.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-21.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Efficiency Savings"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-3.796"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-3.796"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.061"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC Adjustments"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "-0.020"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2015:   Net decrease of $21.000M due to transfer of Disruptive Demonstrations (P264) funding from PE 0603648D8Z to new PE 0603289D8Z Advanced Innovative Analysis and Concepts.  \n\nNet decrease of $3.796M is the result of promoting efficient spending to support agency operations."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P648"
                    },
                    "ProjectTitle": {
                        "val": "Joint Capability Technology Demonstration (JCTD)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "192.297"
                        },
                        "PriorYear": {
                            "val": "138.374"
                        },
                        "CurrentYear": {
                            "val": "152.408"
                        },
                        "BudgetYearOne": {
                            "val": "131.960"
                        },
                        "BudgetYearOneBase": {
                            "val": "131.960"
                        },
                        "BudgetYearTwo": {
                            "val": "146.878"
                        },
                        "BudgetYearThree": {
                            "val": "140.496"
                        },
                        "BudgetYearFour": {
                            "val": "146.502"
                        },
                        "BudgetYearFive": {
                            "val": "144.865"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Historically, the Joint Capability Technology Demonstration (JCTD) Program has worked primarily with the Combatant Commands (COCOMs) and Services to identify DoD priorities and accelerated the development and demonstration of technical solutions.  However, with the end of current conflicts there has been a strategic shift to a more balanced approach that will continue to address COCOM needs in conjunction with initiating broader, longer-term JCTDs to address DoD’s strategic initiatives to mitigate emergent threats, address affordability and interoperability of defense systems.  The JCTD Program will begin to employ developmental and operational prototypes to address these longer-term DoD priorities.\n\nThe shift in the JCTD Program will also result in a shift in Program metrics.  JCTDs supporting the DoD’s strategic initiatives will tend to be longer and larger, with less focus on transition and partner funding.  Overall, we envision initiating fewer yet more impactful JCTD projects. \n\nIn FY 2015, funds will be transferred from the JCTD Program Element (PE) to establish a new PE 0603289D8Z (Advanced Innovative Analysis & Concepts)."
                        },
                        "ProjectMissionDescription": {
                            "val": "The JCTD Program directly addresses DoD, multi-Service and COCOMs’ priorities through partnering and cost sharing with solution providers and resource sponsors.  The value and impact of the JCTD program is to cost-effectively address the COCOMs’ priorities and the Department’s strategic initiatives to mitigate emergent threats, address affordability and interoperability of defense systems through developmental and operational prototyping.  JCTDs provide key partnerships with the Department, Services, and other government agencies, select allies, and industry that allow for expedited development, deployment, and evaluation of capability solutions with the potential to close validated warfighting capability gaps.  The JCTD Program typically demonstrates solutions in two - four years and has a transition rate to the warfighter greater than 80 percent.  At least 57 JCTD projects supported Operation Enduring Freedom, 74 projects supported Operation Iraqi Freedom, and over 30 percent of JCTD projects involved partner nations.  These JCTD partnerships also enable interdepartmental cooperation and joint capability development (e.g. Departments of Homeland Security, State, Transportation, National Aeronautics and Space Administration and Justice).  In FY 2013, the JCTD Program successfully demonstrated and transitioned several key warfighter capabilities that address operational warfighting needs of the Department, providing affordable and sustainable solutions.\n\nKey values demonstrated by the JCTD program are:\n• The JCTD Program has a long history of providing enduring capabilities.  See “Section D.  Acquisition Strategy” for more details on transition.\n• The JCTD Program delivers capabilities rapidly and projects execute far quicker than the traditional DoD Planning, Programming, Budgeting, and Execution (PPBE) process.  The result is that 74 JCTD projects delivered capabilities used in Operation Iraqi Freedom, and 57 projects delivered capabilities to Operation Enduring Freedom.  Most of those capabilities would not have been delivered – or would have been significantly delayed – if not for the JCTD program.  Recent examples include: \n1. A robust “detect and track” capability of \"dark\" (i.e. non-emitting) maritime targets.  This is accomplished through automated data fusion of an existing suite of sensors supporting the Maritime Domain Awareness (MDA) function.  This capability was successfully transitioned into the Sealink Advanced Analysis system at Office of Naval Intelligence and is now used by multiple agencies to provide a MDA capability.\n2. An operational, internet-based, open-access, Arctic-focused, environmental research and decision-support system that enables local, regional, and international cooperation and coordination on long-term environmental planning and near-term actions in response to climatic and environmental changes occurring in the Arctic Region.\n3. A vastly improved capability for U.S., NATO, and Coalition naval forces boarding operations, data collection, and sharing of time-critical boarding and biometrics information during an international operational assessment in April 2013.\n• The JCTD Program enables coalition cooperative development by leveraging partner nation expertise and resources; approximately one-third of JCTD projects involve some degree of coalition partner participation.  As a result of successful past collaborations, the program now enjoys routine interactions with the United Kingdom, Canada, Australia, and the Republic of Korea. \n• The JCTD Program enables development and execution of interdepartmental cooperation projects, such as projects with the Department of Homeland Security, State, Transportation, and the National Aeronautics and Space Administration.  \n• The JCTD Program enables rapid response to new DoD priorities before Service PPBE cycles can respond.  For example, the DoD has established priorities for Anti-Access\/Area-Denial, Building Partner Capacity, understanding human terrain, and nuclear forensics.  The JCTD Program quickly responded to the new priorities and is providing initial capabilities that are transitioning to the warfighter today.\n\nMEASURABLE OUTCOMES:  \n• Capabilities delivered and technologies transitioned have been key metrics:\n1. JCTDs typically transition capability within 24 - 36 months with initial spiral products and deliverables in less than 24 months. \n2. The JCTD program has been achieving transition rates of over 80 percent, well in excess of the DoD Strategic Objective 3.5.2D, Performance Measure 3.5.1-2D, goal of 40 percent.  The JCTD Program defines transition as all, or components of the demonstrated JCTD, going to a new or existing Program(s) of Record, providing fieldable-prototypes (residual capabilities) sustained by non-JCTD funds in direct support of operations in theater, or commodity-type capabilities entered onto GSA schedule for procurement by DoD users.  In FY 2013, 12 of 12 completed JCTDs successfully transitioned."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Mission Assurance Decision Support System (MADSS)"
                                    },
                                    "Description": {
                                        "val": "MADSS provides an integrated Command, Control and Communications (C3) operational and critical infrastructure relationships understanding by correlating data from different data sources, using web-based services, and secure network and automated data transformation services.  MADSS provides improved responsiveness and predictive capability, rapid event analysis, and Warfighter analysis of alternatives development for network and critical infrastructure outages.  MADSS is in daily operational use at U.S. Strategic Command (STRATCOM)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.150"
                                            },
                                            "Text": {
                                                "val": "Provided Extended Operational Use and transitioned MADSS to Defense Information Systems Agency. Completed the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tactical Edge Data Solutions (TEDS)"
                                    },
                                    "Description": {
                                        "val": "TEDS is the implementation of Command and Control (C2) Core extensions for tactical information at the battalion level so that web-services data sharing frameworks based on Universal Core (UCore) can enable data sharing among disparate systems.  TEDS focuses on exchanging data from Army and Marine Corps C2 Authoritative Data Sources for the C2 and Battlespace Awareness domains.  The efficiencies gained will be the reduction of redundant software being developed across multiple programs and the ability to seamlessly exchange data within Military Services as well as the North Atlantic Treaty Organization (NATO) and coalition partners who adopt UCore.  Transition of the C2 Core extensions and Web services for translation and semantic mediation is planned for Programs of Record in the Army and Marine Corps.  The output of TEDS will enable C2 systems to migrate to a Service Oriented Architecture environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.955"
                                            },
                                            "Text": {
                                                "val": "Demonstrated net-enabled Coalition Data Sharing using C2 Core in Coalition Warrior Interoperability Exercise with seven coalition partners.  Transitioned these capabilities by uploading the information exchange specifications to the DoD Metadata Data Repository and the NATO Metadata Registry and Repository.  Transitioned Web services to Army and Marine Corps for use in tactical programs of record to enable mediation of data across tactical C2 systems for Position Reports, Significant Activity, and Enemy Situation reporting using U.S. message text formatting.  Provided the repeatable processes for extending C2 Core mediation to other communities of interest such as logistics, force support, and cyber.  Completed the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Command and Control Gap Filler (C2GF)"
                                    },
                                    "Description": {
                                        "val": "C2GF will provide an information systems architecture that can share all-source air surveillance data between government departments.  The C2GF solution will also provide data fusion services to users.  Additionally, the C2GF will refine the concept of operations and employment and Tactics, Techniques, and Procedures (TTP) necessary for air domain surveillance coordination."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.910"
                                            },
                                            "Text": {
                                                "val": "Completed Operational Utility Assessments at an US Northern Command exercises.  Provided expanded disparate sensor integration and integrated Air and Missile Defense sensor netting.  Provided sensor integration capability among DoD and Federal Aviation Administration (FAA) sensors in the Air Operations Center."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.690"
                                            },
                                            "Text": {
                                                "val": "Finalize JCTD Transition Documents and complete the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "National Technical Nuclear Forensics (NTNF)"
                                    },
                                    "Description": {
                                        "val": "NTNF will strengthen strategic nuclear deterrence by enhancing nuclear forensics capabilities supporting attribution after release of nuclear materials (details are classified).  NTNF will integrate advanced air and ground debris sample collection technologies in both manned and unmanned platforms, and integrate DoD capabilities into the developing joint interagency Concept of Operations for advanced air and ground sample collection with global applicability.  The project will also demonstrate enhanced integrated yield estimation methods for nuclear events.  The techniques to be employed will increase capabilities to determine initial yields and collect nuclear debris, while enhancing safety for NTNF Task Force personnel."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.083"
                                            },
                                            "Text": {
                                                "val": "Completed and produced operational assessment of integrated yield determination software tool.  Completed technical development and training with unmanned advanced ground sampling collection platform and particulate airborne collection system capabilities.  Operationally demonstrated and exercised advanced ground sampling collection platform capabilities with line-of site communications systems.  Operationally demonstrated and exercised particulate airborne collection system and particulate airborne collection system capabilities on Department of Homeland Security Customs and Boarder MQ-9 Predator unmanned aerial system\/platform.  Produced advanced ground sampling collection and particulate airborne collection system interim operational assessments.  Conducted integration and technical testing of advanced ground sampling collection with non-line-of-sight (satellite) communications.  Conducted integration, ground\/technical testing and initial flight testing of particulate airborne collection system on manned C-130 aircraft."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.600"
                                            },
                                            "Text": {
                                                "val": "Continue integration, ground\/technical testing and initial flight testing of particulate airborne collection system on manned C-130 aircraft.  Complete the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Dark Fusion (DF)"
                                    },
                                    "Description": {
                                        "val": "DF is a capability to detect and track non-emitting maritime threats by integrating data from national collection capabilities which provides the ability to detect and track difficult maritime targets and increases maritime situational awareness (details are classified)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.725"
                                            },
                                            "Text": {
                                                "val": "Conducted technical demonstration and final operational demonstration.  Transitioned spiral capabilities to the Office of Naval Intelligence (ONI) program of record.  Completed Military Utility Assessment.  JCTD Completed."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Combat Commander Direct Participation, Transition Enabling, and Special Programs"
                                    },
                                    "Description": {
                                        "val": "This effort is comprised of three programs that support the entire JCTD Program, separate from the specific JCTD projects.  The three programs are (1) Unified Combatant Commander (COCOM) Direct Support; (2) JCTD Pre-Transition; and (3) Program Integration Office for execution of select, classified projects.  (1) COCOM Direct Support:  The COCOMs are essential in specifying capability needs, project selection, validation, demonstration, assessment, and transition of JCTDs.  The JCTD Program provides direct support to COCOMs, enabling the COCOMs to provide an on-site JCTD manager, typically one to two full-time equivalents (FTEs).  (2) JCTD Pre-Transition:  In some cases, Service or Agency partner transition funding is not available for one to two years following the JCTD assessment phase due to Service or Agency commitments.  In such cases, where there is a clear transition and the need to sustain the capability for a short time prior to availability of Service or Agency transition funds the JCTD Pre-Transition fund may be used to meet that need.  (3) Program Integration Office:  A limited number of classified projects that require enhanced security measures due to need-to-know and\/or mission partner sensitivities are managed within the Program Integration Office."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.908"
                                            },
                                            "Text": {
                                                "val": "COCOM direct participation enabled COCOM staff participation in developing and executing JCTD projects, ensuring direct warfighter input, and proper focus of JCTD projects.  JCTD transition enabling funds provided transition bridge funding for several projects, sustaining the efforts for a year until committed Program of Record (POR) funds were received.  The Program Integration Office executed projects as approved and developed new projects that address the most critical COCOM and Department needs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "24.150"
                                            },
                                            "Text": {
                                                "val": "Continue to provide COCOM direct participation to enable COCOM staff participation in developing and executing JCTD projects, ensuring direct warfighter input and proper focus of JCTD projects.  Sustain selected completed JCTD efforts until POR funds are received.  Develop and execute projects as proposed by COCOMs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "33.150"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "33.150"
                                            },
                                            "Text": {
                                                "val": "Continue to provide COCOM direct participation to enable COCOM staff participation in developing and executing JCTD projects, ensuring direct warfighter input and proper focus of JCTD projects.  Sustain selected completed JCTD efforts until POR funds are received.  Develop and execute projects as proposed by COCOMs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enabling Technologies (ET)"
                                    },
                                    "Description": {
                                        "val": "The ET fund is used to rapidly assess or mature emerging capabilities requested by COCOMs prior to determining whether a JCTD project should be initiated.  Emerging Technology investments are small, short (less than one year) efforts that may lead to JCTD proposals, depending on the COCOM assessment and determination of technical maturity."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "31.511"
                                            },
                                            "Text": {
                                                "val": "Projects were selected based on the rapid assessment or maturing of emerging capabilities requested by COCOMs, inter-agency partners, and\/or DoD leadership that were intended to mitigate technical risks prior to determining whether a JCTD project should be initiated.  Selected efforts were small, focused, and executable in less than one year and required a concrete deliverable (prototype hardware and\/or software, integrated subsystem, tech assessment report, etc.).  Desired ET attributes include technology maturation, leads to risk mitigation, partner contributions, and directly responded to COCOM needs.  Additionally, in FY 2013, ETs included funding for \"Disruptive Demonstrations\" to support development\/demonstration of time-sensitive capabilities that addressed Secretary\/Department Strategic Vectors, and Chairman’s Gap Assessment of capability shortfalls."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.050"
                                            },
                                            "Text": {
                                                "val": "Projects will continue to be determined based on the rapid assessment or maturing of emerging capabilities requested by COCOMs, interagency partners, and\/or DoD leadership that are intended to mitigate technical risks prior to determining whether a JCTD project should be initiated.  Selected effort will be small, focused, and executable in less than one year and require a concrete deliverable (prototype hardware and\/or software, integrated subsystem, tech assessment report, etc.).  Desired ET attributes include technology maturation, leads to risk mitigation, partner contributions, and directly responds to COCOM needs. In FY 2014 a new project code (P264) was initiated for Disruptive Demonstrations.  ET funds allocated to that effort in FY 2013 are now reflected in project code P264."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.050"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.050"
                                            },
                                            "Text": {
                                                "val": "Projects will continue to be determined based on the rapid assessment or maturing of emerging capabilities requested by COCOMs, interagency partners, and\/or DoD leadership that are intended to mitigate technical risks prior to determining whether a JCTD project should be initiated."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Smart Power Infrastructure Demonstration for Energy Reliability and Security (SPIDERS)"
                                    },
                                    "Description": {
                                        "val": "SPIDERS will demonstrate cyber-secure “smart” micro-grids with demand side management and integration of renewable energy and storage on military installations, in partnership with Department of Homeland Security (DHS) and Department of Energy (DOE).  The expected output and efficiency to be demonstrated is a reduction in the “unacceptably high risk” of extended electric grid outages by developing the capability to “island” installations while maintaining operational surety and security."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.690"
                                            },
                                            "Text": {
                                                "val": "Conducted first circuit level technical and operational demonstration at Joint Base Pearl Harbor-Hickam (JBPHH), HI.  Transitioned JBPHH micro-grid ownership to Navy Facilities Engineering Command, HI.  Held first SPIDERS industry day to share results.  Conducted second technical demonstration at Fort Carson Army Base in Colorado.  Fort Carson adds more complexity to the micro-grid including electric vehicles."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.013"
                                            },
                                            "Text": {
                                                "val": "Perform second operational demonstration at Fort Carson, CO.  Transition micro-grid to Fort Carson tenants.  Conduct second SPIDERS industry day to share results.  Complete micro-grid design for third phase at Camp Smith, HI  Begin construction to install micro-grid technologies at Camp Smith."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.575"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.575"
                                            },
                                            "Text": {
                                                "val": "Perform third and final technical and operational demonstration on the entire installation at Camp Smith, Hawaii to include an economic opportunity to save electrical costs at the base.  Transition micro-grid to Camp Smith stakeholders.  Complete the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Computer Adaptive Network Defense-in-Depth (CANDID)"
                                    },
                                    "Description": {
                                        "val": "CANDID will demonstrate the integration of Virtual Secure Enclaves (VSEs) inside existing tactical networks to enable network defense-in-depth and ensure Command and Control (C2) capabilities despite hostile attempts to hack, disrupt, and deny computer networks.  CANDID will increase security of vital C2 capabilities in a cyber-contested environment; prevent infiltration from external threats, ex-filtration of protected information, and C2 denial of service; and deliver cyber surveillance and situational awareness through fusion of heterogeneous sensor data."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.280"
                                            },
                                            "Text": {
                                                "val": "Hardened leave behind\/transition ready VSE Secret Internet Protocol Router Network (SIPRNET) C2 capability at U.S. Pacific Command, U.S. Pacific Fleet\/Joint Task Force 519, and functional components.  Transitioned capability to U.S. Navy."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.227"
                                            },
                                            "Text": {
                                                "val": "Complete transition to Defense Information Systems Agency.  Complete the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Collaborative Coalition Collection Environment (C3E)"
                                    },
                                    "Description": {
                                        "val": "C3E is a language independent intelligence data collection interface usable by US and Coalition forces with initial fielding to support the Operational Control (OPCON) transformation on the Korean Peninsula.  C3E reduces data collection errors by guiding the user to choose a variety of options using cascading drop-down menus.  C3E will enable U.S.\/Korean personnel to describe their requirements in general military terms, symbols, and graphics within their native language.  C3E reduces reliance on specialized skills, language, and process that are beyond the shared experience of coalition operators.  It improves the ability to gather, manage, and understand collection requirements and tasks in real time."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.061"
                                            },
                                            "Text": {
                                                "val": "Conducted final Technical Demonstration event.  Conducted final Operational Demonstration event.  Provided Joint\/Military Utility Assessment.  Finalized Concept of Operations (CONOPs).  Provided United States Pacific Command with a leave behind capability to support current missions.  Initiated transition through Technology Transfer Agreements (TTA).  Completed the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint Warfighting Integrated Network Operations (NetOps) (JWIN)"
                                    },
                                    "Description": {
                                        "val": "JWIN consolidates independent Situational Awareness (SA) data sources into an integrated network management framework for analysis, planning, and display.  JWIN translates Service specific network information into a common actionable format.  This approach enables employment of Network Operations tools to enhance the Joint Force Commander (JFC) or Joint Task Force (JTF) Commander’s decision making process over tactical edge network resources.  Key benefits include enhanced situational awareness to understand the impact of network events on critical operations and network distributed policy collaboration and management capabilities used to communicate authoritative direction over tactical network resources.  Concept of Operations (CONOPS) is developed to ensure a Joint procedural construct is established, and proposed Joint Tactics, Techniques and Procedures (JTTPs) will be identified during initial prototype fielding at United States Pacific Command (USPACOM).  Providing the JFC\/JTF a consolidated network view affords them the ability to monitor and influence tactical NETOPS supporting associated missions to implement the commander’s intent."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.431"
                                            },
                                            "Text": {
                                                "val": "Conducted final Technical Demonstration and Operational Demonstration.  Provided Joint\/Military Utility Assessment.  Finalized CONOPs and proposed JTTPs.  Provided USPACOM with a leave behind capability.  Completed the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Autonomous Technologies for Unmanned Aerial Systems (ATUAS)"
                                    },
                                    "Description": {
                                        "val": "ATUAS will integrate a series of technologies and demonstrate autonomous precision delivery and retrograde to and from a forward point of need in operationally relevant conditions.  It will demonstrate increased mission level autonomy through onboard enhanced autonomous navigation and contingency management software for single operator\/multi-vehicle control of two Unmanned Aerial Systems (UAS) reducing the risks to the Warfighter and enabling improved operational readiness."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.888"
                                            },
                                            "Text": {
                                                "val": "Installed Electro-Optical\/Infrared (EO\/IR) Camera, Beyond Line of Sight (BLOS), 3D Light Detection and Ranging (LiDAR) and upgraded BLOS data link onto K-MAX (an unmanned helicopter).  Integrated and tested autonomous en route re-programming (Dynamic Route Planner).  Conducted Operational Utility Assessment focusing on autonomous delivery of multiple loads to multiple locations and retrograde operations.  Transitioned the technologies to new Navy Autonomous Aerial Cargo Utility System (AACUS) Program of Record and Joint Cargo UAS Programs of Record.  Determined the military utility of the technologies and procedures demonstrated.  Completed the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Countermeasure Expendable with Replaceable Block Elements for Reactive Unmanned Systems Multi-Mission Jammer (CERBERUS)"
                                    },
                                    "Description": {
                                        "val": "CERBERUS delivers a net-enabled modular expendable jamming system based on the Air Force Miniature Air-Launched Decoy (MALD) that employs replaceable nosecone payloads to counter emerging threats in the PACOM area of responsibility.  CERBERUS reduces overall mission costs by providing reconfigurable & flexible mission weapons."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.339"
                                            },
                                            "Text": {
                                                "val": "Completed advanced radar jamming payload assembly and data link electronic attack payload assembly.  Conducted technical demonstration of first nose cone assembly."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.225"
                                            },
                                            "Text": {
                                                "val": "Integrate final nose cone assemblies.  Complete Operational Utility Assessment.  Complete the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Regional Domain Awareness (RDA)"
                                    },
                                    "Description": {
                                        "val": "RDA demonstrates a standards-based unclassified framework for information sharing between U.S. government agencies and international partners.  RDA will install government off the shelf software to integrate air, land, and sea sensor data to create a multi-domain unclassified information sharing framework between U.S. interagency and local, tribal, and international partners.  RDA will demonstrate (1) assured integration from air, maritime, and land sensors and networks; (2) user defined monitoring and alerting; (3) selective sharing of situational awareness and alerts to multiple defined users; (4) Concept of operations and Tactics, Techniques & Procedures supporting the sharing of unclassified information to non-PKI (Public Key Infrastructure) users; and (5) access to unclassified data and services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.346"
                                            },
                                            "Text": {
                                                "val": "Finalized development and Information Exchange Package Documents (IEPD) for defined data sets.  Completed RDA Certification and Accreditation.  Conducted Technical Demonstration number two which demonstrated data sharing between U.S. Southern Command and the Joint Inter-Agency Task Force-South, U.S. Africa Command, and U.S. European Command.  Finalized Management and Transition Plan and Technology Transition Agreement.  Deployed RDA with U.S. Navy’s 6th Fleet and initiated transition deployment to the Defense Information Systems Agency Multi-National Information Systems portfolio."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.817"
                                            },
                                            "Text": {
                                                "val": "Conduct Operational Demonstration and Operational Utility Assessment (OUA).  Complete transition to Defense Information Systems Agency and U.S. Southern Command.  Complete the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Three Dimensional Landing Zone (3D-LZ)"
                                    },
                                    "Description": {
                                        "val": "3D-LZ will deliver an integrated sensor suite capable of providing rotorcraft pilots with situational awareness during degraded visual environments encountered on takeoff and landings, cable warning and obstacle avoidance cues, and general terrain awareness for safety of flight.  The program will deliver an integrated turret to the Global Reach Program Office."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.486"
                                            },
                                            "Text": {
                                                "val": "Conducted technical demonstrations of sensor package in flight tests."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.622"
                                            },
                                            "Text": {
                                                "val": "Complete Operational Utility Assessment.  Transition to Air Force Global Reach Program Office.  Complete the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Anti-Jam Precision Guided Munitions (AJPGM)"
                                    },
                                    "Description": {
                                        "val": "AJPGM will deliver precision navigation capability to severely Global Positioning System (GPS)-jammed environments.  AJPGM will also deliver home-on-jam capability.  Specifics related to technologies, current capability, and threats are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.031"
                                            },
                                            "Text": {
                                                "val": "Completed home-on-jam sensor assembly.  Completed laboratory demonstrations.  Completed Anti-jam sensor assemblies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.130"
                                            },
                                            "Text": {
                                                "val": "Integrate sensor assemblies.  Conduct technical demonstrations and final operational demonstration on integrated assemblies.  Complete Operational Utility Assessment.  Transition to Air Combat Program of Record. Complete the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint Strike Fighter (JSF) Enterprise Terminal (JETpack fifth to fourth)"
                                    },
                                    "Description": {
                                        "val": "JETpack fifth to fourth supports the airborne gateway needs to distribute fifth Generation (Gen) data to fourth Gen fighters by translating their tactical data link into Link-16 messages that can be viewed by the fourth Gen aircraft.  JETpack will demonstrate:  (1) four flyable prototype dual-band, multi-beam antennas, (2) two JET terminals, and (3) two dual-band remote electronics."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.865"
                                            },
                                            "Text": {
                                                "val": "Conducted technical demonstrations of the Joint Enterprise Terminal (JET) radio with Intra-Flight Data Link through a series of early flight tests and a limited operational utility assessment.  Completed development and range test of a prototype dual-band, multi-beam antenna and dual band remote electronics."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.070"
                                            },
                                            "Text": {
                                                "val": "Complete operational utility demonstration of a complete flyable JETpack shipset.  Initiate transition to the F-15C community."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Autonomous Mobility Appliqué System (AMAS)"
                                    },
                                    "Description": {
                                        "val": "AMAS will equip existing military ground vehicles with scalable modes of robotic technology through the integration of modular kits, common interfaces, and a common architecture.  AMAS will be comprised of a By-Wire kit that will provide active safety functionality and a standard control approach that will allow for current and future robotics to be implemented relatively seamlessly onto military tactical vehicles, and an Autonomy kit that will contain the primary sensing and intelligence for scalable modes of autonomy and leader\/follower behaviors for convoy operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.185"
                                            },
                                            "Text": {
                                                "val": "Conducted Technical Demonstration One (TD-1) of the By-Wire and Autonomy kits installed on four Army and Marine tactical vehicles."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.594"
                                            },
                                            "Text": {
                                                "val": "Complete final development of autonomy system.  Conduct second Technical Demonstration (TD-2) and Operational Demonstration (OD-1) culminating with final Military Utility Assessment.  Residuals planned for transition to Army and Marine Corps users.  AMAS JCTD technologies will spiral into existing Army Husky Mounted Detection System Program of Record and proposed Route Clearance and Integration System Program of Record.  AMAS also plans to transition to the proposed new Army Semi-Autonomous Convoy Operations (SACO) Program of Record.  Complete the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "CELESTIAL REACH"
                                    },
                                    "Description": {
                                        "val": "CELESTIAL REACH addresses the limitations placed on high-priority and senior leader communications existing as a result of current Communications Satellite (COMSAT) capability and data throughput.  Presently limited to a maximum data rate of 256 kilo bites per second (kbps) to\/from the aircraft, capacity to maintain global communications is further impacted by peak-period COMSAT user saturation.  This JCTD provides U.S. Special Operations Command the capability and capacity to communicate effectively using a robust C-17 portable hatch mounted satellite antenna (HMSA) during crisis in response to the Chairman, Joint Chiefs of Staff Concept of Operations Plan and other contingency requirements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.317"
                                            },
                                            "Text": {
                                                "val": "Completed Technical Demonstration #1, a static over-the-air test, and the preliminary HMSA fit-check on the C-17."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.996"
                                            },
                                            "Text": {
                                                "val": "Complete the antenna-to-hatch integration.  Conduct the in-flight Operational Demonstration; Joint Utility Assessment; and deliver HMSA flight certified prototype.   Deliver the JCTD Final Report.  Complete the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Deep Seaweb (DSW)"
                                    },
                                    "Description": {
                                        "val": "DSW provides a capability to persistently detect and monitor high traffic maritime areas of interest to find\/fix\/track illicit traffickers in source and transit zones.  DSW will deliver an undersea-network of fixed bottom sensor nodes, mobile unmanned communication gateways, and an operations center server that will provide autonomous 24\/7 tripwire surveillance that cue coalition forces of trafficking threats including fully submersible vessels.  This information will be available to the tactical decision makers for near real-time action by U.S. or partner nation detection and monitoring assets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.760"
                                            },
                                            "Text": {
                                                "val": "Fabricated two sensor-node-systems, one mobile gateway, and prototype system server\/clients.  Updated concepts of employment and operations.  Conducted a technical demonstration in deep water to validate undersea communication ranges and data-throughput.  Evaluated procedures for deep water sensor node deployment, sensor node localization, and recovery.  Conducted end-to-end system tests from bottom nodes through the communications gateway to demonstrate connectivity to operational center.  Developed Technical Demonstration Two plan to include data processing\/classification, and mobile gateway acoustic communications to satellite communications interface.  Identified\/funded Joint Test Assessment Group.  Updated concepts of employment and operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.220"
                                            },
                                            "Text": {
                                                "val": "Procure remaining five bottom-nodes, one-gateway, and deployment hardware.  Conduct Technical Demonstration two (two-node, one-gateway) in operationally representative environment to detect, classify (sensor node processing acoustic signature to yield type\/course\/speed\/etc.), pass to mobile gateway for forwarding to shore facility via email to evaluate integration with operations center workflow.  Complete manufacture of seven sensor-node-systems and two mobile gateways and server.  Conduct Operational Utility Assessment, operational demonstration and JCTD Final Report.  Transition operations to Joint Inter-Agency Task Force, South.  Complete the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Defense Installation Access Control (DIAC)"
                                    },
                                    "Description": {
                                        "val": "DIAC will develop an identity management enterprise service's architecture that will provide timely, accurate, and actionable information to support the installation access control decision-making process based on authoritative data sources such as the National Crime Information Center and Terrorist Screening Database in order to initially and continuously vet all personnel prior to entry to DoD installations worldwide."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.324"
                                            },
                                            "Text": {
                                                "val": "Identified and coordinated resolution of relevant policy and privacy issues.  Integrated installation access control systems with the Defense Enrollment Eligibility Reporting System, DoD local population database, Interoperability Layer Service, and Continuous Information Management Engine.  Demonstrated the full architecture integrating National Crime Information Center."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.482"
                                            },
                                            "Text": {
                                                "val": "Conduct technical and operational demonstrations of the architecture with the added input from the Terrorist Screening Database, Service Criminal Justice System databases, and non-DoD credential revocation lists.  Conduct final operational demonstration at selected military installations and complete independent assessor report.  U.S. Northern Command sponsor will issue final operational utility determination.  Transition DIAC capabilities into Programs of Record.  Complete the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Foliage Penetrating Airborne Light Detection and Ranging (LIDAR) for Reconnaissance Imaging (FALCON-I)"
                                    },
                                    "Description": {
                                        "val": "FALCON-I will provide a unified foliage penetrating (FOPEN) sensing system that collects, processes, and fuses LIDAR and Ultra High Frequency (UHF) Synthetic Aperture Radar (SAR) to produce a comprehensive three dimensional (3D) view of human activity, terrain, and lines of communication obscured by foliage.  The ultimate goal of the FALCON-I is to provide analysts and Warfighters a simple to understand 3D image of foliage obscured target areas of interest."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.679"
                                            },
                                            "Text": {
                                                "val": "Completed FALCON-I system integration and testing.  Performed FOPEN\/Polarimetric LIDAR testing and demonstration to include new algorithms for data fusion and exploitation, enhancement of existing hardware for dissemination, storage, visualization, and recovery of data.  Developed Concept of Operations and Tactics, Techniques and Procedures, and an initial polarimetric LIDAR assessment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.393"
                                            },
                                            "Text": {
                                                "val": "Complete Operational Testing, Demonstration, and Joint Military Utility Assessment.  Complete the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Information Volume & Velocity (IV2)"
                                    },
                                    "Description": {
                                        "val": "IV2 will provide a data discovery and processing capability that enables users to identify and visualize patterns, trends and changes in publicly available information over time and space to enhance decision-making purposes.  It will leverage technologies and processes from successful commercial applications to deliver accurate and actionable information to support: the strategic decision-making process; real-time situational awareness; and long-term proactive analytics for strategic planning.  The capability will be a cloud-based system that gathers data from personal and mainstream media, including audio, video, and geo-location, and will sort, analyze, and display that data."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.438"
                                            },
                                            "Text": {
                                                "val": "Established a Control Board to oversee the protection of personal information in response to the Office of General Counsel’s concerns over personally identifiable information (PII).  Developed and executed a prototype user interface and web-based application.  Conducted an operational demonstration using the Kenyan elections as a test case, examining multiple data types, integrating with other analytical tools, and gathering user feedback for improvement of the tool.  Developed the architectural documentation to support transition of the capability.  Finalized the operations requirements document and placed the developer on contract."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.575"
                                            },
                                            "Text": {
                                                "val": "Develop a final application for use by Combatant Commands including lessons learned from the IV2 prototype application.  Test application for acceptance of multiple data types and integration.  Test the system in multiple operational scenarios, and refine the system based on operator feedback.  Test for scalability and begin the Certification and Accreditation process.  Transition of the IV2 capability to the Defense Information Systems Agency."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Kestrel Eye"
                                    },
                                    "Description": {
                                        "val": "Kestrel Eye is a very small, 25 kilogram class satellite that provides “good enough” 1.5 meter resolution and visible imagery.  Imagery tasking and delivery is controlled directly by the Combatant Commander to ensure sufficient timelines for near real-time situational awareness and decision-making in the field.  The cost of less than $1.500 million enables an affordable constellation for persistence, near continuous converge between 45 degrees North\/South.  The primary outputs and efficiencies are:  (1) Finish one Block one “proof of concept” design, launch Block one Kestrel Eye and conduct on-orbit evaluation and upgrade Block two design with propulsion system and improved telescope pointing using a star tracker.  The JCTD will build and launch three Block two design Kestrel Eye satellites."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.221"
                                            },
                                            "Text": {
                                                "val": "Launched one Block  one design.  Completed construction of three Block two design Kestrel Eyes, adding propulsion for station-keeping and a star tracker for increasing pointing accuracy."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.229"
                                            },
                                            "Text": {
                                                "val": "Depending on launch opportunities, launch three Block two design Kestrel Eyes and conduct operational demonstrations and assessments.  Initiate transition to the U.S. Army Program Executive Office, Missiles & Space.  Complete the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Kinetic\/Non-kinetic Integrated Force Effects (KNIFE)"
                                    },
                                    "Description": {
                                        "val": "KNIFE will provide Combatant Commanders with four dimensional (4D) views of composite effects that dynamically updates to inform strategic and operation decision-making in a compressed timeframe.  KNIFE provides an integrated, enterprise capability that models multiple effects for planner collaboration and Commander decision.  The integrated disciplines are comprised of cyber, electronic warfare, kinetic and space effects.  The primary metric is more robust, accurate and timely targeting management during planning and execution."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.670"
                                            },
                                            "Text": {
                                                "val": "Dynamically updated and shared 4 dymentional views of effects.  Provided machine to machine consumption of cyber, electronic warfare, space, and kinetic data.  Produced composite effects and collection objectives.  Conducted Operational Demonstration."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.266"
                                            },
                                            "Text": {
                                                "val": "Publish sequenced tasks for in-line approval by decision makers.  Address Diplomatic, Informational and Economic effects analysis and incorporate into KNIFE.  Complete the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rapid Open Geospatial User Environment (ROGUE)"
                                    },
                                    "Description": {
                                        "val": "ROGUE will deliver operational open geospatial analytic and Volunteered Geospatial Information (VGI) services, Concept of Operations, Tactics, Techniques, and Procedures (TTPs), and work flows\/processes.  ROGUE will provide Web-based geospatial capability linking Joint Task Force Headquarters components to the tactical edge of mixed U.S., partner nation, interagency components, and private sector non government Organizations.  ROGUE will facilitate accessibility from multiple user platforms (Web-portal, Desktops, Smart Phones, etc.) to enable partnering with agencies and countries conducting Humanitarian Assistance\/Disaster Relief support missions in support of Theater Security Cooperation and Humanitarian Assistance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.645"
                                            },
                                            "Text": {
                                                "val": "Developed and implemented five applications addressing differing classes of functionality.  Integrated software solutions to the Geospatial software platform.  Developed open back-end services to include the incorporation and managing of geospatial updates from various sources.  Developed four location based applications that have a direct connection to data storage and Support Service Oriented Software and Cloud implementation with scalability based upon the virtual Machine Template.  Developed “end to end” Geographical Information System service.  Performed developmental testing and operational assessments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.967"
                                            },
                                            "Text": {
                                                "val": "Perform final operational utility demonstration and complete independent assessor report.  Transition ROGUE tools and standards across the community of interest.  Complete the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space & Missile Defense Command (SMDC) Nanosatellite Program (SNaP-3)"
                                    },
                                    "Description": {
                                        "val": "SNaP-3 provides low orbit tactically integrated beyond-line-of-sight communications nanosatellites for the U.S. as well as for partner nations' radios and unattended ground sensors.  It provides user service on demand with minimal training requirements.  The JCTD will have three nanosatellites built and tested.  It will launch and conduct the operational demonstration and Utility Assessment and provides a residual operational capability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.494"
                                            },
                                            "Text": {
                                                "val": "Completed the building and testing of three nanosatellites and associated ground hardware."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.317"
                                            },
                                            "Text": {
                                                "val": "Launch three nanosatellite.  Conduct an operational demonstration and utility assessment.  Initiate transition."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier-Warfighter Operationally Responsive Deployer for Space (SWORDS)"
                                    },
                                    "Description": {
                                        "val": "SWORDS provides a dedicated, low cost, rapid and predictable launch of small satellites to precise, optimum orbits.  It provides the capability to satisfy Combatant Command’s urgent needs for augmentation of persistent imagery or communications in their area of responsibility.  When in production, SWORDS is targeted to cost $1.000 million per launch of 25 kilogram payloads up to a 750 kilometers circular orbit from a wide variety of ranges, including austere locations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.946"
                                            },
                                            "Text": {
                                                "val": "Prime contractor incorporated changes in the propulsion engine and the first stage separation design as a result of analyses provided by National Aeronautics and Space Administration (NASA). Completed conceptual design of launch vehicle, ground support equipment, Concept of Operations, and procured materials for fabrication of engines and launch vehicle first stage.  Completed wind tunnel testing of launch vehicle.  Completed avionics hardware design and began procurement of components.  Constructed and test fired first stage engine in ground test stand.  Designed and began fabrication of full scale first stage ground test article."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.782"
                                            },
                                            "Text": {
                                                "val": "Conduct sub-orbital flight test.  Conduct orbital flight test. Initiate transition through the US Army Program Executive Office Missiles & Space (PEOMS)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Unified Command and Control (UC2)"
                                    },
                                    "Description": {
                                        "val": "The UC2 JCTD provides the capability that will support discretionary information sharing on a common network with compartmented network protection.  UC2 will provide network enclaves to allow operational commanders to manage cyber risk to their own mission without introducing risk to the Global Information Grid.  UC2 will provide key lessons learned for assured terrestrial transport to protect core Command and Control (C2) in anti-access\/area denial environments and will allow greater access to assured C2 with Component Commanders, Joint Task Forces, and functional component headquarters."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.444"
                                            },
                                            "Text": {
                                                "val": "Installed and tested the Common Mission Network Transport (CMNT) and Agile Virtual Enclave (AVE) at three U.S. Pacific Component Commanders for data exchange with Defense Information Systems Agency and Services on DoD networks.  Conducted technical demonstrations"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.306"
                                            },
                                            "Text": {
                                                "val": "Install and test CMNT and AVE at three additional sites.  Conduct the Operational Demonstration and Joint Utility Assessment.  Transition to Defense Information Systems Agency and U.S. Navy for sustainment.  Complete the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Vector"
                                    },
                                    "Description": {
                                        "val": "Vector will demonstrate two cube satellites for an on-orbit Technical Demonstration (TD), Operational Demonstration (OD) and Operational Utility Assessment (OUA).  The system will continue to be used for operations until reaching their respective end-of-life.  Additional details are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.648"
                                            },
                                            "Text": {
                                                "val": "Completed Information Assurance assessment; final end-to-end testing; flight readiness review and pre-ship review.  Shipped two Cube Satellites to Kirtland Air Force Base, New Mexico for launch vehicle integration."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.060"
                                            },
                                            "Text": {
                                                "val": "Launch two Cube Satellites, complete on-orbit checkout and conduct TD and OD.  Conduct Operational Utility Assessment.  Complete Final Report and finalize Joint Capabilities Integration and Development System documentation for transition.  Complete the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Minor Resource Projects"
                                    },
                                    "Description": {
                                        "val": "Provide resources for approved JCTD projects requiring less than one million dollars."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.025"
                                            },
                                            "Text": {
                                                "val": "Completed and transitioned, Arctic Collaborative Environment (ACE), a web-based, open-source military, civilian system that integrates disparate data focused on arctic sea ice flow and temperature to observe climate adjustments and military applicability.  Completed Cooperative Security & Engagement (CSE), a regionally based interagency adaptive planning, decision-making and assessment framework for cooperative security operations with external partners.  Completed Fixed Wing Advanced Precision Kill Weapon System (FW APKWS), a precision 2.75 rocket for Low-collateral-damage.  Completed Hardened Installation Protection for Persistent Operation (HIPPO), a scalable, resilient-structured solution to enhance continuity of operations in the face of major disruptions from war.  Completed Maritime Predator (MP), an unmanned underwater delivery system and other classified capabilities.  Completed Preferred Force Generation (PFG), a planning capablity to automatically generate preferred force lists with greater speed and fidelity to support planning processes and assessments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.875"
                                            },
                                            "Text": {
                                                "val": "Continue to provide resources for approved projects requiring less than one million dollars."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.875"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.875"
                                            },
                                            "Text": {
                                                "val": "Continue to provide resources for approved projects requiring less than one million dollars."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SPICE 202 (CLASSIFIED)"
                                    },
                                    "Description": {
                                        "val": "Details are Classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.444"
                                            },
                                            "Text": {
                                                "val": "Details are Classified."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.431"
                                            },
                                            "Text": {
                                                "val": "Details are Classified."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Weapons Enhanced by Submarine Unmanned Aerial System against Mobile targets (AWESUM)"
                                    },
                                    "Description": {
                                        "val": "AWESUM will deliver an undersea launched Unmanned Aerial System (UAS), optimized for deployment through existing submarine three inch countermeasure launcher to perform targeting, Intelligence Surveillance and Reconnaissance (ISR), and the potential for limited attack capabilities. This effort will specifically address requirements from an Anti-Access Area Denial (A2AD) perspective and the unique challenges to US Forces. It will enhance the ability to find, fix, target, and track maritime targets to support standoff weapon engagements, provide targeting for long range torpedo engagements, enhance ISR and Battle Damage Assessment capabilities and provide Special Operations support functions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.575"
                                            },
                                            "Text": {
                                                "val": "Tested a redesigned Switchblade Unmanned Aerial Vehicle (UAV) from submarine three inch launcher.  Improved submarine and UAS antenna.  Integrated a multiple UAV control to provide a targeting solution over a tactical data link during an at-sea demonstration event in a Tactical Development Exercise."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.926"
                                            },
                                            "Text": {
                                                "val": "Continue shipboard integration activities, increase UAV endurance, encrypt UAV communications, and increase inert lethality upgrades."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.812"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.812"
                                            },
                                            "Text": {
                                                "val": "Conduct Operational Demonstration during an at-sea United States Fleet Forces Experimentation event.  Transition AWESUM capabilities into a Program of Record.  Complete the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2014 Combatant Commands' (COCOM) Priorities"
                                    },
                                    "Description": {
                                        "val": "FY 2014 will be a transition year for the JCTD program as it shifts its focus from supporting the current fight to developing technologies that will support future threats and capability shortfalls.  As a result, the FY 2014 JCTD Program will primarily work with the Combatant Commands (COCOMs) and Services to develop JCTD projects to address Defense strategic initiatives that can be identified from the Chairman’s Risk Assessment or multi-service technology challenges in response to DoD priorities.  In addition, the JCTD Program will work with the acquisition community, via the AT&L Defense Acquisition Board process, to identify acquisition challenges facing the Department that can be addressed by the JCTD Program through the initiation of development and operational prototypes.  Operational prototypes will focus in areas of concepts for space defense, solid state technologies for maritime defense, advancements in counter electronic systems and space capability without a space layer (precision navigation and timing, communications, battle-space awareness, international and interagency collaboration (Australian, Canadian, Department of Homeland security))."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "41.812"
                                            },
                                            "Text": {
                                                "val": "Fund the first year of FY 2014 projects selected by Senior Department Leadership or COCOM Commanders to solve COCOM priority shortfalls."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "40.250"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "40.250"
                                            },
                                            "Text": {
                                                "val": "Fund the second year of the FY 2014 projects that are scheduled to proceed to a second year."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FY 2015 Combatant Commands (COCOM) Priorities"
                                    },
                                    "Description": {
                                        "val": "In FY 2015, the JCTD Program will seek a balance between projects that address the broader strategic DoD priorities that support future threats and capability shortfalls, as well as traditional JCTD projects that address the Combatant Commands' (COCOMs’) capability gaps and their most pressing needs not being addressed by the Service programs.  These COCOM-focused projects will be identified through the traditional candidate identification and selection process.  In addition, the JCTD Program will continue to develop JCTD projects to address broader Defense strategic initiatives in areas such as anti-access \/ anti-denial, defense support to civil authorities, and counter weapons of mass destruction. Operational prototypes will focus in areas of concepts for space defense, solid state technologies for maritime defense, advancements in counter electronic systems and space capability without a space layer (precision navigation and timing, communications, battle-space awareness, international and interagency collaboration (Australian, Canadian, Department of Homeland security))."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "30.223"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "30.223"
                                            },
                                            "Text": {
                                                "val": "Fund the first year of the FY 2015 projects that are selected by Senior Leadership.  Complete JCTD projects started in FY 2013 and FY 2014.  Work closely with the Joint Staff and the various Combatant Commanders to develop technology to shape future engagements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Body Wearable Antenna (BWA)"
                                    },
                                    "Description": {
                                        "val": "BWA will demonstrate a meta-material based antenna design to replace multiple conventional whip antennas worn by all service radio operators.  BWA offers greater performance and concealment than whip antennas, increasing the capability and survivability of the Warfighter.  The prototype antenna will be integrated onto the load-bearing belt with mission necessary enhanced features identified and addressed.  BWA also predicts greater performance and signal strength at several different positions versus current whip antennas, including the limiting prone position.  BWA will replace four distinct whip antennas, totaling over five pounds, necessary to cover the same communication band.  BWA weighs three lbs creating a lighter load and increasing operator maneuverability by dispersing weight around the waist.  Radiation patterns for BWA will demonstrate much lower radiation levels to the head compared to legacy antennas."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.100"
                                            },
                                            "Text": {
                                                "val": "Initiated planning and concepts of operations development."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.610"
                                            },
                                            "Text": {
                                                "val": "Complete subsystem development:  systems requirement definitions; integrate with communications systems; preliminary verification testing; and, operational utility assessment. Complete the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Coalition Tactical Awareness and Response (CTAR)"
                                    },
                                    "Description": {
                                        "val": "CTAR provides the capability to maintain adequate awareness of the Theater maritime domain and austere operating environments by sharing information to insure maritime security is maintained in national systems architecture.  CTAR's wide area Synthetic Aperture Radar (SAR) field of view will be used to cue commercial Electro-Optical imaging satellites for higher resolution collection against vessels of interest."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.100"
                                            },
                                            "Text": {
                                                "val": "Procured a commercial 2.4 meter X-band antenna and integrated it into the Mobile Ground Terminal (MGT) system with signal downlink processor, universal image processor, ship detection software application, communications suite and transportable shelter."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.003"
                                            },
                                            "Text": {
                                                "val": "Conduct functional demonstration of MGT receiving\/processing SAR data at Department of Homeland Security's (DHS) Customs and Border Control (CBP) Air Maritime Operations Center (AMOC) in Riverside Ca, and during U.S. Africa Command (AFRICOM) exercise in West Africa."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.908"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.908"
                                            },
                                            "Text": {
                                                "val": "Operate CTAR system at the Naval Research Laboratory to demonstrate support of other DoD agency functional capability requirements.  Conduct CTAR JCTD operational demo in AFRICOM theater."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Dense Pack Access Retrieval and Transit (DPART)"
                                    },
                                    "Description": {
                                        "val": "DPART will demonstrate a suite of remotely controlled lithium-ion (Li-Ion) and Hybrid (Diesel\/Li-Ion) powered material handling equipment (MHE) to selectively access wheeled\/tracked vehicles and containers and omni-directionally move them throughout confined spaces (including ships underway, hangars, and land based facilities) and ready them for movement to shore."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.100"
                                            },
                                            "Text": {
                                                "val": "Integrated wheeled propulsion to the existing flat surface Container Lift and Maneuver System (C-LMS).  Began work on the detailed design of the Autonomous Naval Transport, Large Wheeled Vehicle (ANT-LWV) and the production of the common remote control for the system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.632"
                                            },
                                            "Text": {
                                                "val": "Complete the wheeled propulsion integration effort to the Container Lift and Maneuver System (C-LMS) and test the capability of the system to transport loads up and down internal ship ramps.  DPART will also conclude the design of the ANT-LWV and begin the development of the full scale prototype of that system.  Pursue certification of the required Li-ion battery system for shipboard use.  Complete final in-house testing of the battery system and the common remote control.  Conduct Technical Demonstration One (TD-1)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.313"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.313"
                                            },
                                            "Text": {
                                                "val": "Complete the development and construction of the full scale prototype of the ANT-LWV, and conduct its Operational Demonstration and Operational Utility Assessment on all systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint Biological Agent Decontamination System (JBADS)"
                                    },
                                    "Description": {
                                        "val": "JBADS will provide biological decontamination by employing an innovative closed-loop, hot \/humid forced air technique to significantly decontaminate the exterior\/interior of a fully encapsulated aircraft.  The system provides a significant leap forward from the currently approved use of hot, soapy water without the corrosive properties inherent with commonly used biological disinfectants used for rolling stock but not permitted on aircraft.  This fully air-transportable green technique is designed for aircraft, however, the building block approach of the Thermal Decontamination Containment System allows for infinite configurations to encapsulate contaminated equipment in the future"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.100"
                                            },
                                            "Text": {
                                                "val": "Completed one of two Biological Thermal Units that provided the hot\/humid environment required for biological decontamination and wrote the contract for the second Biological Thermal Unit.  Began the design and construction phase of a stand-alone rigid Thermal Decontamination Containment System that will fully encapsulate a C-130 test aircraft."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.956"
                                            },
                                            "Text": {
                                                "val": "Complete and integrate the second Biological Thermal Unit with the Thermal Decontamination Containment System and successfully demonstrate the capability to provide the environment needed to decontaminate an aircraft.  Conduct the operational assessment; publish Joint\/Interagency Concept of Operations, Tactics, Techniques and Procedures, and doctrine change recommendations.  Complete the JCTD."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.575"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.575"
                                            },
                                            "Text": {
                                                "val": "Maintain a residual operational capability for biological decontamination that is also easily adaptable for rolling stock and other aircraft sizes."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint Operational Long Term Evolution Deployable Tactical Cellular System (JOLTED TACTICS)"
                                    },
                                    "Description": {
                                        "val": "JOLTED TACTICS will demonstrate a joint architecture for an interoperable, lightweight, portable, ground mobile, airborne, and\/or maritime communications-on-demand packages that allow users to quickly establish secure (Sensitive But Unclassified (SBU) and Suite-B for classified) wireless Long Term Evolution (LTE) Line-of-Sight and Beyond-Line-Of-Sight networks anytime, anywhere with minimal training and equipment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.100"
                                            },
                                            "Text": {
                                                "val": "Initiated the JCTD and completed the Implementation Directive.  Conducted Technical Demonstration number one with an integrated SBU capability."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.415"
                                            },
                                            "Text": {
                                                "val": "Conduct Operational Demonstration number one with an integrated SBU capability and complete the Limited Operational Utility Assessment.  Conduct Technical Demonstration number two and Operational Demonstration number two both with integrated Suite-B for classified capability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.495"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.495"
                                            },
                                            "Text": {
                                                "val": "Complete Information Assurance Certification; complete the Operational Utility Assessment; deliver the JCTD Final Report, complete the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mobility"
                                    },
                                    "Description": {
                                        "val": "Mobility allows the use of Commercial of the Shelf (COTS) mobile devices to wirelessly access multiple security domains using security enhanced thin-client applications and thick-client solutions in sanctuary and expeditionary environments.  Mobility will provide the ability for classified and unclassified access on a single hand-held device with the use of National Security Agency commercial cryptography.  Access will be provided to mobile domains through various communications transports in enterprise and expeditionary environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.100"
                                            },
                                            "Text": {
                                                "val": "Completed JCTD Implementation Directive, Management Plan, and Technical Transition Agreement."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.099"
                                            },
                                            "Text": {
                                                "val": "Integrate key technologies in unclassified networks.  Obtain security approval to operate on unclassified Network.  Conduct Operational Demonstration number one."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.610"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.610"
                                            },
                                            "Text": {
                                                "val": "Integrate key technologies on classified networks.  Obtain security approval to operate on Classified networks.  Conduct Operational Demonstration Conduct operational user assessment, provide operational utility assessment, determine military utility and conduct close-out."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi Domain Simultaneous Access Virtual Environment (MD-SAVE)"
                                    },
                                    "Description": {
                                        "val": "MD-SAVE reduces overall networking infrastructure and allows a single workstation to access multiple domains utilizing one wire, while maintaining security separation.  This solution will reduce the total cost of ownership of the networks.  MD-SAVE leverages technology to enable the collapse of multi-tower workstations into one box.  This approach is hardware-based and a prototype exists.   Current design will allow for the collapse of up to 16 domains, ensuring physical separation and no cross-domain information flow.  The result is a reduced multi-domain workspace that is certified and accredited saving space, weight and power at U.S. Central Command (USCENTCOM) Headquarters."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.100"
                                            },
                                            "Text": {
                                                "val": "Conducted a technical demonstration at USCENTCOM demonstrating a Technology Readiness Level seven."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.968"
                                            },
                                            "Text": {
                                                "val": "Conduct a Limited Utility Assessment (LUA) with multiple MD-SAVE Desktop Workstations to test at multiple levels.  Complete certification and accreditation (Secret and Below Information and Top Secret and Below Information), and complete an operational demonstration to an enterprise network."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Signal Intelligence Derived Electromagnetic Spectrum (SDEST)"
                                    },
                                    "Description": {
                                        "val": "SDEST will leverage National Security Agency (NSA) modernization initiatives to deliver ElectoMagnetic Spectrum (EMS) Target Folders (TF) providing a comprehensive view of the environment.  It will compile relevant EMS Object Models (OM) supporting Kinetic\/Non-Kinetic targeting, utilizing data from across the Global Cryptologic Enterprise.  SDEST uses Cloud, Public Key Infrastructure (PKI), Smart Data Tagging and Cyber-Pilot technologies to enable timely and legal extraction and dissemination.  It will deliver OMs via Electromagnetic Space Analysis Center (E-Space) managed Secret Internet Protocol Router Network and Joint Worldwide Intelligence Communications System widget query capabilities, and develop subscription services tailored to user-specified criteria."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.100"
                                            },
                                            "Text": {
                                                "val": "Initiated planning and concepts of operations development."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.600"
                                            },
                                            "Text": {
                                                "val": "Define information flow and data environment Identify information needs for desired OM\/TFs.  Develop OM\/TF delivery and display capabilities (details are classified)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.514"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.514"
                                            },
                                            "Text": {
                                                "val": "Incorporate OM\/TFs utilizing Cloud-based data processing and correlation, Smart Data Tagging and PKI access, widget\/app-based query\/subscription mechanism and thin client display\/analysis tools.  Complete the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tactical Infrastructure Enterprise Services (TIES)"
                                    },
                                    "Description": {
                                        "val": "TIES provides capabilities to perform web services in the Denied- Disconnected Intermittent Limited (D-DIL) environment and the enterprise needs capabilities to pass data to the Tactical Edge (TE).  TIES enable this information sharing environment by delivering reference implementations for federated services: Collaboration (chat), Security Framework (Identity Management)); optimize D-DIL information exchange to US Army (USA), US Air Force (USAF), US Navy (USN), US Marine Corps (USMC) and Special Operations Command and Control (SOF C2) systems for exchanging data based compression, prioritization, synchronization, replication, and aggregation in the D-DIL environment.  TIES will transition these TE secured reference implementations to the Services tactical C2 systems for the D-DIL environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.100"
                                            },
                                            "Text": {
                                                "val": "Completed JCTD Implementation Directive Management Plan and Technical Transition Agreement."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.300"
                                            },
                                            "Text": {
                                                "val": "Provide TE implementations for USA, USAF, USN, USMC C2 systems to exchange data in D-DIL environment.  Conduct Operational Demonstration number one."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.610"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.610"
                                            },
                                            "Text": {
                                                "val": "Provide TE secured implementations.  Provide TE implementation for Unclassified Information Sharing Service (UISS) to exchange information with USN ships in the D-DIL Operational.  Conduct Operational Demonstration number two.  Conduct operational user assessment.  Complete the JCTD."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "JCTD capabilities that demonstrate operational utility transition to acquisition via one of several methods:\n- The capabilities address a documented capability gap in an existing Program of Record, so that the existing Program can acquire, further develop, sustain, and provide the capability under existing program documentation.\n- The capabilities address capability gaps that naturally fit with an existing Program of Record, but program documentation addressing the new capabilities does not exist.  In these cases, existing program documentation (such as the Capabilities Development Document or Capabilities Production Document) is revised to include the new capabilities from the JCTD, and the JCTD capabilities transition to the Program of Record.\n- The capabilities address a current operational need without requiring Program of Record changes.  In these cases, the JCTD capabilities may transition directly to operational use, with sustainment (operations and maintenance) funding arranged through the gaining command.  \n- The capabilities may be widely applicable commodity products, useful to many commands.  In these cases, the commodity products listed on General Services Administration schedule, and made available for purchase by any commands needing the capability, using procurement funds."
                        },
                        "PerformanceMetrics": {
                            "val": "Strategic Goals Supported in FY 2015:\n- Project Selection Focus\n- Spiral Technologies to Fielded Capabilities\n- Time to Final Demonstration\n- 70 Percent Transition Rate \n- Adequately Shared Funding and Visibility\n- Independent Assessment Capability\n- Successful Military Utility Assessment (MUA)\n\nThe majority of funding from this program element is forwarded to the Services\/Defense Agencies that execute the individual JCTD projects.  The Director, JCTD Program, maintains and provides overall programmatic oversight for the JCTD program, to include the individual JCTD projects.  The JCTD performance metrics center on how fast relevant joint and\/or transformational technologies can be demonstrated and provided to the joint warfighter.  These metrics are driven by the overall business process which includes six parts:  (1) selection focus; (2) ability to spin-off spiral technologies; (3) time necessary to complete a final demonstration; (4) adequately resourced projects with appropriate oversight; (5) capability to complete an independent assessment of the technology; and (6) the number of successful capabilities that are actually transitioned to the warfighter.  \n\nMEASURABLE OUTCOMES:  Metrics include:  all JCTDs will deliver products within 12 months to enable assessment for project continuation; 50 percent of JCTDs will provide an operationally-relevant prototype within 12 months and 75 percent will complete final demonstration within 24 months of Implementation Directive signature.  JCTDs will spiral products and deliverables during the demonstration.  At least 75 percent of JCTD projects will transition products to Programs of Record (POR), sustained residual operations, or availability for procurement from the General Services Administration Schedule.\n\nTransition Achievement:  The JCTD program has been achieving actual transition rates of over 80 percent, well in excess of the Assistant Secretary of Defense (Research and Engineering) stated goal of 40 percent.  The JCTD Program defines transition as all or components of the demonstrated JCTD going to a new or existing POR, providing fieldable-prototypes (residual capabilities) sustained by non-JCTD funds in direct support of operations, or commodity-type capabilities entered onto GSA schedule for procurement by Department users.  In FY 2013, 12 of 12 completions successfully transitioned."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P264"
                    },
                    "ProjectTitle": {
                        "val": "Disruptive Demonstrations"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "12.600"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "The \"Disruptive Demonstrations\" Program code was inserted to support development\/demonstration of time-sensitive capabilities that address Secretary\/ Department Strategic Vectors, and Chairman’s Gap Assessment of capability shortfalls.  As a result, we anticipate less partner funding for those strategic investment areas and will have to rely on greater partner funding for other JCTD projects.  Overall we envision fewer JCTD projects that will be longer in duration.\n\nIn FY 2015,  funds will be transferred from the JCTD Program Element to PE 0603289D8Z (Advanced Innovative Analysis & Concepts)."
                        },
                        "ProjectMissionDescription": {
                            "val": "The program will allocate a portion of the JCTD funding for Disruptive Demonstrations to solve priority shortfalls identified by Department Senior Leadership and the Chairman's Gap Assessment.."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Disruptive Demonstrations"
                                    },
                                    "Description": {
                                        "val": "In FY 2014, the department will allocate a portion of the Joint Capability Technology Demonstration funding line to technology demonstrations specifically aligned to the Department's strategic vectors (Asian-Pacific, low cost, small footprint operations) and the Chairman's Gap Assessment for capability shortfalls.  As part of The Strategic Capabilities Office development efforts, analysis and demonstration of diagnostics for Department of Defense networks; cognitive Intelligence,\nSurveillance, and Reconnaissance tools to enhance Theater Security Cooperation Plan activities; Command and Control tools for pre- and post-conflict periods; and enhanced Operations Security procedures to protect critical acquisition and operational data will be developed to meet Combatant Command urgent operational requirements. Due to nature of this project, specific descriptions and detailed plans are available at higher classification levels."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.600"
                                            },
                                            "Text": {
                                                "val": "As part of Strategic Capabilities Office development efforts, analysis, prototyping, and subsystem testing of game-changing uses of existing technologies will be conducted to meet a critical Combatant Commander requirement. These efforts include:\n\n- Completing Preliminary Design Reviews of four prototype designs,\n- Completing approximately 100 subsystem data collections to develop high-fidelity models,\n- Completing proof-of-principle demonstrations of four prototype systems to anchor high-fidelity modeling and simulation,\n- Completing mission-level analysis of system effectiveness in partnership with the Combatant Commands.\nDue to nature of these efforts, specific descriptions and detailed plans are available at higher classification levels."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The primary acquisition strategy for funding Disruptive Demonstrations will be through Military Inter-Departmental Purchase Requests (MIPRS).  The specifics of each MIPR will be dependent upon the development center, laboratory, contractor or agency requirements and needs.  If an Inter-Agency agreement is required, compliance and coordination of the agreement will be completed in coordination with the receiving activity and Federal Acquisition Regulation 17.5."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics are specific to each Disruptive Demonstration effort and include measures identified in the management approach, Statement of Work (SOW) and Period of Performance (POP).  In addition, completions and successes are monitored against schedules and deliverables stated in the initiative's management approach.  Generic performance metrics applicable to the RDT&E initiatives includes attainment of DoD Strategic Objective 3.5.2D.  The title of this objective is \"Maintain a strong technical foundation within the Department's Science and Technology (S&T) program\" and the metrics for this objective is to transition 40 percent of completing demonstration programs per year."
                        }
                    }
                }
            ]
        }
    }
}