{
    "id": "7483edced778e653925b6a253416289d11ca432d",
    "meta": {
        "filename": "dod-2015_RDTE_2015_AIRFORCE_V3A_RDTE_JustificationBook_Air_Force_PB_2015.zzz_unzipped_RDTE_JustificationBook_Air_Force_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0101113F"
        },
        "ProgramElementTitle": {
            "val": "B-52 SQUADRONS"
        },
        "R1LineNumber": {
            "val": "122"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "17.951"
            },
            "CurrentYear": {
                "val": "17.007"
            },
            "BudgetYearOne": {
                "val": "55.457"
            },
            "BudgetYearOneBase": {
                "val": "55.457"
            },
            "BudgetYearTwo": {
                "val": "62.642"
            },
            "BudgetYearThree": {
                "val": "28.653"
            },
            "BudgetYearFour": {
                "val": "20.328"
            },
            "BudgetYearFive": {
                "val": "4.365"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "206.403"
            }
        },
        "ProgramElementNote": {
            "val": "In FY 2015, 675048, 1760 IWBU includes new start efforts."
        },
        "ProgramElementMissionDescription": {
            "val": "B-52 SYSTEM IMPROVEMENTS (BPAC 675039)\nProject 675039 System Improvements, changed from B-52 Modernization.\n\nB-52 System Improvements is a comprehensive project to ensure B-52 viability to perform current and future wartime missions to include datalinks, navigation, sensors, weapons, electronic warfare (EW), and training capabilities. B-52 System Improvements integrates and adds both tactical and global datalink communications for real time command and control, targeting, and intelligence. It upgrades antiquated Air Traffic Management (ATM) systems with those supported by three key functions using satellite technology: Communications, Navigation and Surveillance (CNS). B-52 System Improvements upgrades training devices to support aircrew and maintenance training with the latest B-52 capability. In addition, it improves conventional warfare capability with additional MIL-STD-1760 smart weapons and improved weapons carriage and fully integrates advanced targeting pods with the offensive avionics system. It studies, analyzes, and tests aircraft systems' hardness to Chemical, Biological, Radiological, and Nuclear (CBRN) weapons effects, such as Low Level Continuous Wave (LLCW) and High altitude Electromagnetic Pulse (HEMP) Survivability tests. It upgrades mission critical systems to survive in CBRN environments. B-52 System Improvements upgrades or replaces legacy defensive EW systems to include the radar warning receiver, jammers, chaff and flare dispensers and situational awareness displays as well as integration of offensive EW such as the Miniature Air-Launched Decoy (MALD) and MALD-Jammer (MALD-J).\n\nEngineering Studies & Analysis and Test & Evaluation\nB-52 system improvements funds test activities at the Air Force Flight Test Center (AFFTC), engineering and planning studies for potential future weapon system enhancements (weapons, sensors, avionics, and EW) and emerging requirement on current projects, upgrades to the B-52 Systems Integration Laboratory (SIL), Avionics Integration Support Facility (AISF), and Weapon System Trainers (WSTs), and weapon system operational\/safety, supportability, reliability, and Total Ownership Cost (TOC) improvements.\n\nAdditional Efforts\nB-52 system improvements funds additional efforts that stem from the operation and maintenance of a 50-plus-year-old aircraft, such as parts obsolescence, Diminishing Manufacturing Sources (DMS), and emerging requirements to add to or maintain the existing capabilities. Examples include, but are not limited to upgrades to outdated avionics computers, mission planning interfaces to Joint Mission Planning Software (JMPS), Air Force Mission Support System (AFMSS), upgrades to the EW suite, and studies and analysis. All B-52 development projects support planned requirements for unique identification in their production phases.\n\nB-52 COMBAT NETWORK COMMUNICATIONS TECHNOLOGY (CONECT) (BPAC 675050)\nThe B-52 CONECT acquisition project supports nuclear and conventional operations by upgrading the B-52 fleet with tactical datalink and voice communications capabilities along with improved threat and situational awareness to support participation in network centric operations. The CONECT upgrade includes new Multi-Functional Color Displays (MFCDs) and a digital interphone system, which will survive and function through the nuclear environment to enhance crew interaction and situational awareness. To enable net centric operations, the CONECT upgrade integrates: on-board client\/server architecture supporting distributed processing with independent control functions; UHF Beyond Line-Of-Sight (BLOS) Joint Range Extension (JRE) capability via ARC-210 Warrior radio to exchange J-Series messaging within theater; Intelligence Broadcast Receiver (IBR); limited Internet Protocol (IP) based UHF BLOS link supporting voice, e-mail and file transfers; and Improved Data Modem (IDM)-based digital Variable Message Format (VMF) datalink to significantly enhance close air support (CAS) missions. This integrated suite will provide the B-52 fleet with a machine-to-machine data transfer capability supporting aircraft re-tasking and retargeting of Conventional Air Launched Cruise Missile (CALCM) and J-series weapons across the range of B-52 military operations and missions. This requirement's Capability Development Document (CDD) was validated by the Air Force Requirement's Oversight Capability Council (AFROCC) on 18 March 2004.\n\nTrainers and Upgrades for CONECT\nIn order to maintain currency with the latest aircraft configuration, the CONECT project will update existing trainers or use computer-based training to add CONECT functionality to meet user-training requirements, and update\/maintain the SIL for the WSTs.\n\nB-52 1760 INTERNAL WEAPONS BAY UPGRADE (IWBU) (BPAC 675048)\nThe 1760 IWBU requires the integration of the 1760 weapons capability into the bomb bay on 78 B-52H aircraft, which includes two Ground Instructional Training Aircraft (GITA), utilizing 44 Common Strategic Rotary Launcher (CSRLs) converted into Conventional Rotary Launchers (CRLs), where three of the CRLs will be modified under Engineering Manufacturing and Development (EMD) for test purposes. This requirement's Capability Development Document (CDD) was validated by the AFROCC in April 2013. The 1760 IWBU project provides internal and external carriage for eight weapons and consists of two sub increments: 1.1 and 1.2.\n\nIncrement 1.1 consists of internal carriage of eight Joint Direct Attack Munitions (JDAM) and variants, to include Laser JDAM (LJDAM), on a rotary launcher. Additionally, this increment develops the capability for external carriage for 16 LJDAM.\n\nIncrement 1.2 develops the capability for internal carriage of eight Joint Air-to-Surface Standoff Missiles (JASSM) and its variants, to include JASSM-Extended Range (JASSM-ER), and eight Miniature Air Launched Decoys (MALD) and its variants, to include MALD Jammer (MALD-J). This increment also develops the capability for external carriage for 12 JASSM-ER.\n\nB-52 MODE S\/5 IFF (BPAC 675049)\nMode S\/5 Identification, Friend or Foe (IFF) is part of the Communication Navigation Surveillance\/Air Traffic Management (CNS\/ATM) effort and will develop and integrate modern IFF technology into the B-52 to enable it to operate in the evolving air traffic environment. This effort is driven by International Civil Aviation Organization (ICAO) and Federal Aviation Administration (FAA) mandates to comply with performance standards to allow the B-52 to operate safely in controlled airspaces. Aircraft not equipped with appropriate capabilities will not be able to operate in airspace where new separation standards and air traffic management procedures are implemented. An additional benefit is the significant fuel savings that will result in being able to fly at optimum and more efficient routes and altitudes. DoD mandates Joint Requirements Oversight Council Memorandum (JROCM) 047-07 (signed March 2007) and JROCM 122-08 (signed June 2008) dictate replacement of the B-52's APX-64 IFF (Identification, Friend or Foe) Transponder with a modern Mode S\/5 transponder.  This requirement was validated by Air Force Form 1067, signed in November 2011.\n\nB-52 ANTI-SKID REPLACEMENT (BPAC 675051)\nThe B-52 Anti-skid system is used to maintain control of aircraft during landings and taxi operations. The B-52 Anti-skid system prevents aircraft skidding by sensing the exact amount of brake pressure needed for safe braking under all runway conditions without tire damage. Previous B-52 Anti-skid supportability analysis, completed in 2006 by General Atomics indicated a supportability end date of 2011, based on parts obsolescence, a lack of test equipment, and a lack of repair personnel. Parts obsolescence continues to be a major supportability factor. However, since the previous analysis, test equipment and new depot maintenance procedures to refurbish previously failed Anti-skid detectors have been put in place in order to provide spares through 2015 when the replacement will be available. The Anti-skid Replacement project develops and installs a new system. This effort includes an upgrade of the maintenance trainers. This requirement was validated by Air Force Form 1067, signed in July 2009.\n\nARMS CONTROL ACTIVITIES (Funding is in the ARMS Control PE, 0305145F)\nArms Control Activities under the New START Treaty drives the need to modify a number of B-52s to a conventional only role by removing the Code Enable Switch and associated equipment. This effort requires a complete design to remove the equipment from the aircraft and install metal plates prohibiting reinstallation of removed equipment to comply with treaty protocols.\n\nThese projects are in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "53.208"
                },
                "CurrentYear": {
                    "val": "24.007"
                },
                "BudgetYearOne": {
                    "val": "20.187"
                },
                "BudgetYearOneBase": {
                    "val": "20.187"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "17.951"
                },
                "CurrentYear": {
                    "val": "17.007"
                },
                "BudgetYearOne": {
                    "val": "55.457"
                },
                "BudgetYearOneBase": {
                    "val": "55.457"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-35.257"
                },
                "CurrentYear": {
                    "val": "-7.000"
                },
                "BudgetYearOne": {
                    "val": "35.270"
                },
                "BudgetYearOneBase": {
                    "val": "35.270"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.025"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "-34.700"
                    },
                    "CurrentYear": {
                        "val": "-7.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.532"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "35.270"
                                },
                                "BudgetYearOneBase": {
                                    "val": "35.270"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY13 adjustments: -$34.7M Congressional Mark for CONECT Restructure, -$.532 for Small Business Innovation Research (SBIR), and -$.025M in Congressional General Reductions.\n\nFY14 adjustments:  -$3.0M Congressional Mark 1760 Internal Weapons Bay Upgrade Flight Test Delay, and -$4.0M Program decrease.\n\nFY15 adjustments:  +$2.40M for fully funded CONECT (76 acft), and +$32.87M for fully funded 1760 IWBU Inc 1.1 and Inc 1.2"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "675039"
                    },
                    "ProjectTitle": {
                        "val": "B-52 System Improvements"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.052"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "0.052"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "B-52 SYSTEM IMPROVEMENTS\nProject 675039 System Improvements, changed from B-52 Modernization.\n\nB-52 System Improvements is a comprehensive project to ensure B-52 viability to perform current and future wartime missions to include datalinks, navigation, sensors, weapons, electronic warfare (EW), and training capabilities.  B-52 System Improvements integrates and adds both tactical and global datalink communications for real time command and control, targeting, and intelligence.  It upgrades antiquated Air Traffic Management (ATM) systems with those supported by three key functions using satellite technology:  Communications, Navigation and Surveillance (CNS).  B-52 System Improvements upgrades training devices to support aircrew and maintenance training with the latest B-52 capability.  In addition, it improves conventional warfare capability with additional MIL-STD-1760 smart weapons and improved weapons carriage and fully integrates advanced targeting pods with the offensive avionics system.  It studies, analyzes, and tests aircraft systems' hardness to Chemical, Biological, Radiological, and Nuclear (CBRN) weapons effects, such as Low Level Continuous Wave (LLCW) and High altitude Electromagnetic Pulse (HEMP) Survivability tests.  It upgrades mission critical systems to survive in CBRN environments.  B-52 System Improvements upgrades or replaces legacy defensive EW systems to include the radar warning receiver, jammers, chaff and flare dispensers and situational awareness displays as well as integration of offensive EW such as the Miniature Air-Launched Decoy (MALD) and MALD-Jammer (MALD-J).   \n\nBA7- This project is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "B-52 Radar Modernization Program Initiative (RMP)"
                                    },
                                    "Description": {
                                        "val": "Campaign-level modeling and simulation (M&S) effort to support a future B-52 RMP initiative.  Specifically, M&S will provide quantitative justification highlighting the increased reliability and operational leverage a new active electronically scanned array (AESA) radar will provide current and future mission sets to support the Defense Strategic Guidance and the President's rebalance to the Pacific."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.052"
                                            },
                                            "Text": {
                                                "val": "Completed studies for Campaign-level M&S effort to support a future B-52 Radar Modernization Program initiative."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "RDTE: BA07: PE 0305145F"
                                    },
                                    "Title": {
                                        "val": "Arms Control Implementation"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "4.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "4.000"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF: BA 05: Line Item # B05200"
                                    },
                                    "Title": {
                                        "val": "Arms Control Implementation"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.500"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.198"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.198"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.099"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.198"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "0.995"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The RMP M&S effort was conducted organically by AFGSC\/A5B and various AFLCMC (Wright-Patterson AFB) organizations."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0101113F_BPAC_675039_0.jpg"
                                }
                            }
                        ]
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "675048"
                    },
                    "ProjectTitle": {
                        "val": "1760 INTERNAL WEAPONS BAY UPGRADE (IWBU)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "15.659"
                        },
                        "CurrentYear": {
                            "val": "4.373"
                        },
                        "BudgetYearOne": {
                            "val": "41.134"
                        },
                        "BudgetYearOneBase": {
                            "val": "41.134"
                        },
                        "BudgetYearTwo": {
                            "val": "60.665"
                        },
                        "BudgetYearThree": {
                            "val": "26.277"
                        },
                        "BudgetYearFour": {
                            "val": "15.370"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "163.478"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "In FY 2015, 675048, 1760 IWBU includes new start efforts."
                        },
                        "ProjectMissionDescription": {
                            "val": "MIL-STD-1760 Internal Weapons Bay Upgrade (IWBU) requires the integration of the 1760 weapons capability into the bomb bay on 78 B-52H aircraft, which includes two Ground Instructional Training Aircraft (GITA), utilizing 44 Common Strategic Rotary Launcher (CSRLs) converted into Conventional Rotary Launchers (CRLs), where three of the CRLs will be modified under Engineering Manufacturing and Development (EMD) for test purposes. The 1760 IWBU project is segmented into increments.  Increment 1.0 provides internal and external carriage for eight weapons and consists of two sub increments: 1.1 and 1.2. This requirement's Capability Development Document (CDD) was validated by the Air Force Requirements Oversight Capability Council (AFROCC) in April 2013.\n\nIncrement 1.1 \n\nIncrement 1.1 consists of internal carriage of eight Joint Direct Attack Munitions (JDAM) and variants, to include Laser JDAM (LJDAM), on a rotary launcher. This increment also develops the capability for external carriage for 16 LJDAM. The CRL Hardware modification consists of Group A (equipment racks and electrical wiring) and Group B (one Survivability\/Vulnerability (SV) junction box and one Integrated Weapons Interface Unit (IWIU) per CRL). The IWIU Line Replaceable Unit (LRU) was previously developed under the Advanced Weapons Integration (AWI) project. No CSRL replacements will be required as a result of this project.  Increment 1.1 completed Preliminary Design Review in February 2013 and awarded an EMD contract in September 2013.  Critical Design Review (CDR) was conducted in October 2013.\n\nAircraft Hardware Development:  None\n\nSoftware Development: Consists of modifying aircraft Operational Flight Program (OFP) software, JDAM Stores Management Overlays (SMO) and ground based Joint Mission Planning System (JMPS).\n\nCRL Hardware Development: Consists of modifying USSTRATCOM provided CSRLs by replacing nuclear mission equipment with Group B hardware and wiring interfaces. Group A includes equipment racks and electrical wiring; Group B includes one Survivability\/Vulnerability (SV) junction box and one IWIU per CRL. The IWIU LRU was previously developed under the AWI project and work was previously accomplished during a 2005 demonstration and developed using 2006 and 2007 Congressional Add funding.  Three CSRLs will be modified using RDT&E funds.\n\nSupport Equipment:  Consists of developing software and 38 rotary launcher cable adapter sets on existing Multi-Use System Tester Armament Next Generation (MUSTANG) testers to interface with the CRL. \n\n\nIncrement 1.2 \n\nIncrement 1.2 develops the capability for internal carriage of eight Joint Air-to-Surface Standoff Missiles (JASSM) and its variants, to include JASSM Extended Range (JASSM-ER), and eight Miniature Air Launched Decoys (MALD) and its variants, to include MALD Jammer (MALD-J).  This increment also develops the capability for external carriage for 12 JASSM-ER.\n\nAircraft Hardware Development:  Development of Group A wiring and circuit breakers to supply additional power to the CRL per JASSM-ER requirements, for all 76 operational B-52H aircraft, and two GITA aircraft. \n\nSoftware Development: Development of a modification to existing aircraft SMO and weapon (JASSM and MALD) OFP software to allow for internal and external carriage and modification to ground based JMPS.\n\nCRL Hardware Development: Develops Group A associated interface hardware and two Group B LRUs (one power supply and one power distribution box).  Three CRLs will be modified using RDT&E funds.\n\nSupport Equipment:  Consists of developing software updates to the existing MUSTANG to interface with the CRL and the development of additional ground handling support equipment.\n\n\nBA7- This project is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1760 IWBU Inc 1.1"
                                    },
                                    "Description": {
                                        "val": "Provides internal J-series weapons capability through modification of CSRLs with IWIUs and upgraded weapon management software."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.659"
                                            },
                                            "Text": {
                                                "val": "Continued Increment 1.1 activities:  Conducted SEEK EAGLE safe separation analysis, preliminary design review, critical design review, technical readiness review, continued formal qualification testing of JDAM SMO software, and entered the EMD phase.  Continued B-52 JMPS development, testing, and certification.   Began the design, coding, and testing of the ground maintenance computer program software."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.373"
                                            },
                                            "Text": {
                                                "val": "Continue Increment 1.1 development:  Continue SEEK EAGLE safe separation analysis. Conduct ground testing of CRL prototype and JDAM SMO.  Continue B-52 JMPS and Trainer\/Ground Maintenance Computer Program (GMCP) software.  Finalize drawings for CRL, and test support equipment modification kits to support Milestone C activity. Continue development of technical orders in preparation for kit-proof. Modify three prototype CRLs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.140"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.140"
                                            },
                                            "Text": {
                                                "val": "Continue Increment 1.1 development:  Continue SEEK EAGLE safe separation analysis. Continue ground and initiate flight testing of CRL prototype and JDAM SMO.  Continue B-52 JMPS and Trainer\/GMCP software.  Finalize drawings for CRL, and test support equipment modification kits to support Milestone C activity. Continue development of technical orders in preparation for kit-proof. Continue modification of three prototype CRLs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "1760 IWBU Inc 1.2"
                                    },
                                    "Description": {
                                        "val": "Provides internal J-series weapons capability through modification of CSRLs with IWIUs, aircraft hardware modifications, and upgraded weapon management software."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "24.994"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "24.994"
                                            },
                                            "Text": {
                                                "val": "Implement Increment 1.2 development:  Enter Tech Development phase.  Award Tech Development and Weapon Operational Flight Program Software contracts.  Begin designing and coding of software."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "APAF: BA05: Line Item # B05200"
                                    },
                                    "Title": {
                                        "val": "B-52"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "6.724"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "6.724"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "14.599"
                                        },
                                        "BudgetYearThree": {
                                            "val": "3.763"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.377"
                                        },
                                        "BudgetYearFive": {
                                            "val": "41.986"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF:  BA06:  Line Item # 000999"
                                    },
                                    "Title": {
                                        "val": "Initial Spares\/Repair Parts"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.449"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.449"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "1.093"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.952"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.112"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF:  BA07:  Line Item # B05200"
                                    },
                                    "Title": {
                                        "val": "Depot Activation"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "3.960"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The 1760 Internal Weapons Bay Upgrade project will acquire software development and hardware design via a sole-source contract to Boeing Defense, Space & Security (DSS), Oklahoma City, OK. Deliverables include an updated J-series weapon SMOs (software), three prototype modified CSRLs, six Low Rate Initial Production (LRIP) assets, logistics support, ground and flight test support, and engineering drawings.  The project will competitively procure the CRL modification kits for full rate production, and installs of the kits will be completed via Contract Field Teams (CFTs).\n\nIncrement 1.1 consists of internal carriage of eight JDAM and variants, to include LJDAM, on a rotary launcher. This increment also develops the capability for external carriage for 16 LJDAM. The CRL Hardware modification consists of Group A (equipment racks and electrical wiring) and Group B (one SV junction box and one IWIU per CRL). \n\nIncrement 1.2 develops the capability for internal carriage of eight JASSM and its variants, to include JASSM-ER, or eight MALD and its variants, to include MALD-J.  This increment also develops the capability for external carriage for 12 JASSM-ER."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0101113F_BPAC_675048_0.jpg"
                                }
                            }
                        ]
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "675049"
                    },
                    "ProjectTitle": {
                        "val": "MODE S\/5 IFF"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.511"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "1.511"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "4"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "The RDT&E effort for this project ends with FY13 funding."
                        },
                        "ProjectMissionDescription": {
                            "val": "Mode S\/5 IFF\nMode S\/5 Identification, Friend or Foe (IFF) is part of the Communication Navigation Surveillance\/Air Traffic Management (CNS\/ATM) effort and will develop and integrate modern IFF technology into the B-52 to enable it to operate in the evolving air traffic environment.  This effort is driven by International Civil Aviation Organization (ICAO) and Federal Aviation Administration (FAA) mandates to comply with performance standards to allow the B-52 to operate safely in controlled airspaces.  Aircraft not equipped with appropriate capabilities will not be able to operate in airspace where new separation standards and air traffic management procedures are implemented. An additional benefit is the significant fuel savings that will result in being able to fly at optimum and more efficient routes and altitudes. DoD mandates Joint Requirements Oversight Council Memorandum (JROCM) 047-07 (signed March 2007) and JROCM 122-08 (signed June 2008) dictate replacement of the B-52's APX-64 IFF (Identification, Friend or Foe) Transponder with a modern Mode S\/5 transponder.  This requirement was validated by Air Force Form 1067, signed in November 2011.   \n\nCNS\/ATM \nCapabilities identified under CNS\/ATM activities will include Frequency Modulation (FM) immunity management, digital communications (voice and data), improved navigation accuracy such as Required Navigation Performance (RNP) or Global Positioning System (GPS) enhancements, Reduced Vertical Separation Minimum (RVSM), enhanced situational awareness such as Mode S\/Mode 5 IFF, Communications Management Unit, HF Data Link, Auto Dependent Surveillance-Broadcast (ADS-B), Selective Availability Anti-spoofing Module (SAASM) and any follow-on activities to associated components\/systems resulting from modifications to CNS\/ATM systems.\n\nBA7- This project is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Mode S\/5 IFF"
                                    },
                                    "Description": {
                                        "val": "Integrates modern IFF technology onto the B-52 by replacing the current system with APX-119 required by DoD, FAA and the ICAO."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.511"
                                            },
                                            "Text": {
                                                "val": "Upgraded the Systems Integration Lab (SIL); created developmental and operational test procedures; modified Electromagnetic Interference\/Electromagnetic Compatibility (EMI\/EMC) (safety of flight) test procedures; identified long-lead components; completed all fabrication drawings; developed Installation drawing packages; conducted SIL testing; supported ground\/flight testing and completed Air Traffic Control Radar System IFF Mark XII\/Mark XIIA, Air Traffic Control Radar Beacon System (ATCRBS);  IFF, Mark XII\/XIIA, Systems (AIMS); completed AFLCMC\/HBAI Systems platform certification; and reported certification results.  Updated technical orders and weapon system trainer configurations to include Mode S\/5 IFF.  Maintained interoperability with multiple configurations in the B-52 fleet."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "APAF: BA05: Line Item # B05200"
                                    },
                                    "Title": {
                                        "val": "B-52"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "9.590"
                                        },
                                        "BudgetYearOne": {
                                            "val": "10.626"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "10.626"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "2.488"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF: BA06: Line Item # 000999"
                                    },
                                    "Title": {
                                        "val": "Initial Spares\/Repair Parts"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.143"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.896"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.896"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.074"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF:  BA07:  Line Item # B05200"
                                    },
                                    "Title": {
                                        "val": "Depot Activation"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "1.460"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1.460"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Mode S\/5 IFF Program's EMD contract is sole source to Boeing Defense, Space and Security (DSS), Oklahoma City, OK.  This modification will be implemented via Contract Field Team (CFT)."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0101113F_BPAC_675049_0.jpg"
                                }
                            }
                        ]
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "675050"
                    },
                    "ProjectTitle": {
                        "val": "CONECT"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "12.634"
                        },
                        "BudgetYearOne": {
                            "val": "14.323"
                        },
                        "BudgetYearOneBase": {
                            "val": "14.323"
                        },
                        "BudgetYearTwo": {
                            "val": "1.977"
                        },
                        "BudgetYearThree": {
                            "val": "2.376"
                        },
                        "BudgetYearFour": {
                            "val": "4.958"
                        },
                        "BudgetYearFive": {
                            "val": "4.365"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "40.633"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "2"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "PRIOR YEAR COSTS FOR CONECT FY 05 - FY 12 ARE CONTAINED IN BPAC 675039 B-52 MODERNIZATION. THIS DOCUMENT REFLECTS NEW BPAC 675050 WHICH WAS ESTABLISHED FY 13."
                        },
                        "ProjectMissionDescription": {
                            "val": "The B-52 Combat Network Communications Technology (CONECT) acquisition project supports nuclear and conventional operations by upgrading the B-52 fleet with tactical datalink and voice communications capabilities along with improved threat and situational awareness to support participation in network centric operations. The CONECT upgrade includes new Multi-Functional Color Displays (MFCDs) and a digital interphone system, which will survive and function through the nuclear environment to enhance crew interaction and situational awareness. To enable net centric operations, the CONECT upgrade integrates:  on-board client\/server architecture supporting distributed processing with independent control functions;  UHF Beyond Line-Of-Sight (BLOS) Joint Range Extension (JRE) capability via ARC-210 Warrior radio to exchange J-Series messaging within theater; Intelligence Broadcast Receiver (IBR); limited Internet Protocol (IP)-based UHF BLOS link supporting voice, e-mail and file transfers; and Improved Data Modem (IDM)-based digital Variable Message Format (VMF) datalink to significantly enhance close air support (CAS) missions. This integrated suite will provide the B-52 fleet with a machine-to-machine data transfer capability supporting aircraft re-tasking and re-targeting of Conventional Air Launched Cruise Missile (CALCM) and J-series weapons across the range of B-52 military operations and missions.  This requirement's Capability Development Document (CDD) was validated by the Air Force Requirement's Oversight Capability Council (AFROCC) on 18 March 2004.\n\nAdditional funds have been added to the project for the completion of the CONECT capability development and the CONECT capability inclusion into the required B-52 training systems, and production\/installation\/initial support for a total of 76 CONECT capable aircraft (2 kits were funded in EMD).  The LRIP Lot 1 contract awarded in May 2013. The test aircraft will maintain the installed CONECT configuration and will be used to evaluate efforts to maintain and\/or update B-52 CONECT capabilities.  As the CONECT upgrade brings additional capability to the B-52, emerging communication requirements (upgrades to IBR, JRE messages, etc.) and aircraft upgrades (1760 Internal Weapons Bay Upgrade, Mode S\/Mode 5 Identification, Friend or Foe (IFF), etc.) may require study for potential impacts to CONECT. \n\nTRAINERS AND UPGRADES FOR CONECT\nIn order to maintain currency with the latest aircraft configuration, the CONECT project will update existing trainers or use computer-based training to add CONECT functionality to meet user-training requirements, and update\/maintain the system integration laboratory (SIL) for the Weapon System Trainers (WST).\n  \nThis project is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "CONECT"
                                    },
                                    "Description": {
                                        "val": "Continue Diminishing Manufacturing Source (DMS) redesign development and test effort.  Continuation of engineering design of CONECT capability into the B-52 training systems. Begin incorporating changes required due to updates in Government Furnished Equipment (GFE) and crypto modernization requirements.  Incorporate\/integrate CONECT with recurring updates of the B-52 software baseline.   As the CONECT upgrade brings additional capability to the B-52, emerging communication requirements (upgrades to the IBR, JRE messages, etc.) and aircraft upgrades (1760 Internal Weapons Bay Upgrade, Mode S\/Mode 5 IFF, etc.) may require study for potential impacts to CONECT. CONECT will begin update of the existing trainers or use computer-based training to add CONECT functionality to meet user-training requirements, and update\/maintain the SIL for the WST."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.634"
                                            },
                                            "Text": {
                                                "val": "Continue DMS redesign development and test effort.  Continuation of engineering design of CONECT capability into the B-52 training systems. Incorporate changes required due to updates in GFE and crypto modernization requirements.  Incorporate\/integrate CONECT with recurring updates of the B-52 software baseline. As the CONECT upgrade brings additional capability to the B-52, emerging communication requirements (upgrades to the IBR, JRE messages, etc) and aircraft upgrades (1760 Internal Weapons Bay Upgrade, Mode S\/Mode 5 IFF, etc) may require study for potential impacts to CONECT. CONECT will begin update of the existing trainers or use computer-based training to add CONECT functionality to meet user-training requirements, and update\/maintain the SIL for the WST."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.323"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.323"
                                            },
                                            "Text": {
                                                "val": "Complete DMS redesign development and test effort.  Continuation of engineering design of CONECT capability into the B-52 training systems. Incorporate changes required due to updates in GFE and crypto modernization requirements.  Incorporate\/integrate CONECT with recurring updates of the B-52 software baseline. As the CONECT upgrade brings additional capability to the B-52, emerging communication requirements (upgrades to the IBR, JRE messages, etc) and aircraft upgrades (1760 Internal Weapons Bay Upgrade, Mode S\/Mode 5 IFF, etc) may require study for potential impacts to CONECT. CONECT will begin update of the existing trainers or use computer-based training to add CONECT functionality to meet user-training requirements, and update\/maintain the SIL for the WST."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "APAF: BA05: Line Item # B05200"
                                    },
                                    "Title": {
                                        "val": "B-52"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "74.221"
                                        },
                                        "BudgetYearOne": {
                                            "val": "153.778"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "153.778"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "142.606"
                                        },
                                        "BudgetYearThree": {
                                            "val": "123.631"
                                        },
                                        "BudgetYearFour": {
                                            "val": "81.921"
                                        },
                                        "BudgetYearFive": {
                                            "val": "56.840"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF: BA06: Line Item # B05200"
                                    },
                                    "Title": {
                                        "val": "Initial Spares\\Repair Parts"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "2.226"
                                        },
                                        "BudgetYearOne": {
                                            "val": "5.966"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "5.966"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "5.504"
                                        },
                                        "BudgetYearThree": {
                                            "val": "4.366"
                                        },
                                        "BudgetYearFour": {
                                            "val": "1.688"
                                        },
                                        "BudgetYearFive": {
                                            "val": "1.888"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF: BA07: Line Item # B05200"
                                    },
                                    "Title": {
                                        "val": "Post Production Support"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "7.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "5.249"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "5.249"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "7.041"
                                        },
                                        "BudgetYearThree": {
                                            "val": "8.731"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF:BA07: Line Item # B05200"
                                    },
                                    "Title": {
                                        "val": "Depot Activation"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.198"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.198"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.198"
                                        },
                                        "BudgetYearThree": {
                                            "val": "1.488"
                                        },
                                        "BudgetYearFour": {
                                            "val": "13.208"
                                        },
                                        "BudgetYearFive": {
                                            "val": "15.901"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The B-52 CONECT EMD prime contract is a sole source to Boeing Defense, Space & Security (DSS), Oklahoma City, OK.  Boeing designs, develops, tests and procures necessary equipment from their subcontractors; developed engineering drawings, logistic and technical data, and time compliance technical order (TCTO) for installation on the B-52.  Pro-Active Systems is the current contractor for the trainer update to integrate CONECT into the existing trainers."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0101113F_BPAC_675050_0.jpg"
                                }
                            }
                        ]
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "675051"
                    },
                    "ProjectTitle": {
                        "val": "ANTI-SKID"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.729"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "0.729"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "2"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "The RDT&E effort for this project ends with FY13 funding."
                        },
                        "ProjectMissionDescription": {
                            "val": "The B-52 Anti-skid system is used to maintain control of aircraft during landings and taxi operations.  The B-52 Anti-skid system prevents aircraft skidding by sensing the exact amount of brake pressure needed for safe braking under all runway conditions without tire damage.  Previous B-52 Anti-skid supportability analysis, completed in 2006 by General Atomics indicated a supportability end date of 2011, based on parts obsolescence, a lack of test equipment, and a lack of repair personnel.  Parts obsolescence continues to be a major supportability factor.  However, since the previous analysis, test equipment and new depot maintenance procedures to refurbish previously failed Anti-skid detectors have been put in place in order to provide spares through 2015 when the replacement will be available.  The Anti-skid Replacement project develops and installs a new system.  This effort includes an upgrade of the maintenance trainers.  This requirement was validated by Air Force Form 1067, signed in July 2009.\n\nBA7- This project is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Anti-skid"
                                    },
                                    "Description": {
                                        "val": "Replaces legacy B-52 Anti-skid system with modernized system improving safety and cockpit display.  Anti-skid detector has been identified a critical obsolescence item, which begins to be unsupportable in FY15.  Development activities completed in FY13."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.729"
                                            },
                                            "Text": {
                                                "val": "Completed flight test activities and flight test reports."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "APAF: BA05: Line Item # B05200"
                                    },
                                    "Title": {
                                        "val": "B-52"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "4.637"
                                        },
                                        "BudgetYearOne": {
                                            "val": "5.879"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "5.879"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.891"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.907"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.924"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.941"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF: BA06: Line Item # B05200"
                                    },
                                    "Title": {
                                        "val": "Initial Spares\/Repair Parts"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.384"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.583"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.583"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.048"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The B-52 Anti-skid program is a combined effort between the Oklahoma City Air Logistics Complex (OC-ALC) and the Ogden Air Logistics Complex (OO-ALC).  The modification will be implemented via Contract Field Team (CFT)."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0101113F_BPAC_675051_0.jpg"
                                }
                            }
                        ]
                    }
                }
            ]
        }
    }
}