{
    "id": "75615066fa99dc44758d3d06091f61c02db1ad8d",
    "meta": {
        "filename": "dod-2015_RDTE_2015_OSD_RDTE_JustificationBook_Office_of_Secretary_Of_Defense_PB_2015.zzz_unzipped_RDTE_JustificationBook_Office_of_Secretary_Of_Defense_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602234D8Z"
        },
        "ProgramElementTitle": {
            "val": "Lincoln Laboratory"
        },
        "R1LineNumber": {
            "val": "11"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "34.444"
            },
            "PriorYear": {
                "val": "32.637"
            },
            "CurrentYear": {
                "val": "41.868"
            },
            "BudgetYearOne": {
                "val": "51.875"
            },
            "BudgetYearOneBase": {
                "val": "51.875"
            },
            "BudgetYearTwo": {
                "val": "53.993"
            },
            "BudgetYearThree": {
                "val": "53.459"
            },
            "BudgetYearFour": {
                "val": "55.628"
            },
            "BudgetYearFive": {
                "val": "62.303"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Lincoln Laboratory (LL) research line program is an advanced technology research and development effort conducted through a cost reimbursable contract with the Massachusetts Institute of Technology (MIT).  The LL Program funds innovations that directly lead to the development of new system concepts, technologies, components and materials in support of Lincoln Laboratory’s missions in Advanced Electronics Technology, Communications Systems, Intelligence, Cyber Security and Information Sciences, Surveillance and Reconnaissance Systems and Technology, Tactical Systems, Space Control, and Air and Missile Defense.  In FY 2013 the LL Program supported these missions by conducting research and development in five core science and engineering disciplines and four technical initiatives:\n- Advanced Devices, with emphasis on development of materials, devices, and subsystems utilizing microelectronic, photonic, biological, and chemical technologies to enable new system approaches to Department of Defense (DoD) sensors.\n- Optical Systems and Technologies, including the development of focal planes, integrated imagers, imaging and spectroscopic detection systems.\n- RF Systems and Technologies, including the development of novel active and passive Radio Frequency (RF) sensors and development of electronic protection and electronics attack technologies and system concepts.\n- Information, Computation, and Exploitation, which seeks to develop novel architectures, tools, and techniques for the processing, fusion, interpretation, computation, and exploitation of multi-sensor, multi-intelligence data. \n- Cyber Security, includes developing technologies and new techniques for the protection of systems against cyber attack and exploitation.\n- Technical Initiatives, include biological sciences to aid the warfighter and develop tools for biological research; autonomous systems technologies with the objective of developing mobile, autonomous, robotic platforms that demonstrate key capabilities needed for a wide range of defense applications; quantum information sciences to develop basic technologies that support the storage, transport, and computation of quantum information; and novel and engineered materials that utilize nano-manufacturing techniques to create meta or other materials with unique physical and optical properties not readily found in nature.\n\nSupporting these and other priority technology and capability areas are work efforts entitled Technical Intelligence and Testbed for Comparative Analysis:\n- Technical Intelligence is working to develop a comprehensive understanding of technology emergence and advancement in a range of relevant scientific areas such as nanotechnology, directed energy, and propulsion.  Some details are classified, but one focus area is working to establish a broad horizon scanning and technology forecasting capability through a collaborative effort by the Department of Defense (DoD) and the Intelligence Community.  This effort will develop insight into our relative position in science and technology around the world over time, as well as determine potential impacts on DoD capability development and future threat environments.  \n- The Testbed for Comparative Analysis will enable the evaluation of quantitative, horizon scanning and technology forecasting techniques for discovering disruptive technologies that may impact the DoD.  This effort will provide the DoD with objective ways to evaluate the accuracy of existing and future horizon scanning and technology forecasting efforts."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "36.826"
                },
                "CurrentYear": {
                    "val": "46.875"
                },
                "BudgetYearOne": {
                    "val": "51.452"
                },
                "BudgetYearOneBase": {
                    "val": "51.452"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "32.637"
                },
                "CurrentYear": {
                    "val": "41.868"
                },
                "BudgetYearOne": {
                    "val": "51.875"
                },
                "BudgetYearOneBase": {
                    "val": "51.875"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-4.189"
                },
                "CurrentYear": {
                    "val": "-5.007"
                },
                "BudgetYearOne": {
                    "val": "0.423"
                },
                "BudgetYearOneBase": {
                    "val": "0.423"
                }
            },
            "AdjustmentDetails": {
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "-3.152"
                    },
                    "CurrentYear": {
                        "val": "-5.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "-0.049"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.974"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Strategic Efficiency Savings"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "0.423"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.423"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC Adjustments"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "-0.007"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.014"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The reduction is a strategic efficiency approach to reduce funding and staffing.  As a result, we provide a better alignment of funding and provide support to a smaller military force."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P534"
                    },
                    "ProjectTitle": {
                        "val": "Lincoln Laboratory"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "27.877"
                        },
                        "PriorYear": {
                            "val": "29.048"
                        },
                        "CurrentYear": {
                            "val": "32.865"
                        },
                        "BudgetYearOne": {
                            "val": "41.846"
                        },
                        "BudgetYearOneBase": {
                            "val": "41.846"
                        },
                        "BudgetYearTwo": {
                            "val": "44.707"
                        },
                        "BudgetYearThree": {
                            "val": "43.634"
                        },
                        "BudgetYearFour": {
                            "val": "49.709"
                        },
                        "BudgetYearFive": {
                            "val": "55.450"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Lincoln Laboratory (LL) research line program is an advanced technology research and development effort conducted through a cost reimbursable contract with the Massachusetts Institute of Technology (MIT).  The LL Program funds innovations that directly lead to the development of new system concepts, technologies, components and materials in support of Lincoln Laboratory’s missions in Advanced Electronics Technology, Communications Systems, Intelligence, Cyber Security and Information Sciences, Surveillance and Reconnaissance Systems and Technology, Tactical Systems, Space Control, and Air and Missile Defense.  For FY 2013 the LL Program will support these missions by conducting research and development in five core science and engineering disciplines and four technical initiatives:\n- Advanced Devices, with emphasis on development of materials, devices, and subsystems utilizing microelectronic, photonic, biological, and chemical technologies to enable new system approaches to Department of Defense (DoD) sensors.\n- Optical Systems and Technologies, including the development of focal planes, integrated imagers, imaging and spectroscopic detection systems.\n- RF Systems and Technologies, including the development of novel active and passive Radio Frequency (RF) sensors and development of electronic protection and electronics attack technologies and system concepts.\n- Information, Computation, and Exploitation, which seeks to develop novel architectures, tools, and techniques for the processing, fusion, interpretation, computation, and exploitation of multi-sensor, multi-intelligence data. \n- Cyber Security, includes developing technologies and new techniques for the protection of systems against cyber attack and exploitation.\n- Technical Initiatives, include biological sciences to aid the warfighter and develop tools for biological research; autonomous systems technologies with the objective of developing mobile, autonomous, robotic platforms that demonstrate key capabilities needed for a wide range of defense applications; quantum information sciences to develop basic technologies that support the storage, transport, and computation of quantum information; and novel and engineered materials that utilize nano-manufacturing techniques to create meta or other materials with unique physical and optical properties not readily found in nature.\n\nSupporting these and other priority technology and capability areas is a work effort titled Technical Intelligence.  Technical Intelligence supports comprehensive understanding of technology emergence and advancement in a range of relevant scientific areas such as nanotechnology, directed energy, and propulsion.  Some details are classified, but one collaborative effort by DoD and the Intelligence community is focused on establishing a broad horizon scanning and technology forecasting capability.  This effort will develop insight over time into our relative position in science and technology around the world and potential impacts on capability development and future threat environments."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Information, Computation, and Exploitation Sciences"
                                    },
                                    "Description": {
                                        "val": "Seeks to develop novel architectures, tools, and techniques for the processing, fusion, interpretation, computation, and exploitation of multi-sensor, multi-intelligence data."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.926"
                                            },
                                            "Text": {
                                                "val": "Extended video analytics work to enable end user customization and composability of video analytics engine.  Developed theoretical framework for threat detection in networks and graphs.  Developed a data-intensive cloud analytics infrastructure to enable collection, fusion, and exploitation of structured and unstructured datasets."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.117"
                                            },
                                            "Text": {
                                                "val": "Begin demonstration of large-scale multi-intelligence data fusion, exploitation, and visualization for specific application domains."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.118"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.118"
                                            },
                                            "Text": {
                                                "val": "Continue demonstration of large-scale multi-intelligence data fusion, exploitation, and visualization for specific application domains."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cyber Security"
                                    },
                                    "Description": {
                                        "val": "Developing technologies and new techniques for the protection of systems against cyber attack and exploitation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.595"
                                            },
                                            "Text": {
                                                "val": "Developed tools to improve cyber situation awareness and simulation environments to model the impact of cyber attacks on mission effectiveness.  Developed automated methods to reverse engineer malicious computer codes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.770"
                                            },
                                            "Text": {
                                                "val": "Evaluate cyber situational awareness tools on operational networks.  Evaluate the impact of cyber attacks on simulated networks and develop strategies to maximize mission effectiveness."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.198"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.198"
                                            },
                                            "Text": {
                                                "val": "Continue to evaluate cyber situational awareness tools on operational networks and evaluate the impact of cyber attacks on simulated networks and develop strategies to maximize mission effectiveness."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Devices"
                                    },
                                    "Description": {
                                        "val": "Development of materials, devices, and subsystems utilizing microelectronic, photonic, biological, and chemical technologies to enable new system approaches to Department of Defense (DoD) sensors."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.750"
                                            },
                                            "Text": {
                                                "val": "Evaluated new materials for short-wavelength infrared (SWIR) imagers.  Developed proof-of-concept, ultra-low power electronics for processors.  Fabricated silicon photonic devices for heterogeneous integration into coherent analog systems.  Demonstrated arrays of high-power, semiconductor lasers optimized for incorporation into directed energy systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.029"
                                            },
                                            "Text": {
                                                "val": "Fabricate and test new SWIR imagers.  Develop design and processes for full-scale, ultra-low power processors.  Extend heterogeneous photonic component performance from the radio frequency (RF) to the microwave regime.  Increase power scaling of directed energy laser components."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.185"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.185"
                                            },
                                            "Text": {
                                                "val": "Continue to test new SWIR imagers.  Develop design and processes for full-scale, ultra-low power processors.  Extend heterogeneous photonic component performance from the radio frequency (RF) to the microwave regime.  Increase power scaling of directed energy laser components."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Optical Systems"
                                    },
                                    "Description": {
                                        "val": "Development of focal planes, integrated imagers, imaging and spectroscopic detection systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.816"
                                            },
                                            "Text": {
                                                "val": "Developed optical systems and components for space surveillance.  Developed components and techniques for high-power, high-efficiency mid-wavelength infrared (MWIR) and long-wavelength infrared (LWIR) transmitters.  Evaluated the performance of new concepts for extending the range of coherent laser radars."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.051"
                                            },
                                            "Text": {
                                                "val": "Continue technology development and evaluate performance of new optical space surveillance systems.  Demonstrate high-efficiency MWIR\/LWIR transmitters.  Develop components for coherent laser radar imaging."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.000"
                                            },
                                            "Text": {
                                                "val": "Continue technology development and evaluate performance of new optical space surveillance systems.  Demonstrate high-efficiency MWIR\/LWIR transmitters.  Develop components for coherent laser radar imaging."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Radio Frequency (RF) Systems"
                                    },
                                    "Description": {
                                        "val": "Development of novel active and passive RF sensors and development of electronic protection and electronics attack technologies and system concepts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.895"
                                            },
                                            "Text": {
                                                "val": "Completed fabrication and testing of a high-performance, low-power tunable receiver on a chip.  Developed and evaluate concepts to extend the linearity of RF analog devices.  Design and fabricate photonic components needed for massively channelized RF receivers.  Developed RF techniques for electronic protection and attack."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.134"
                                            },
                                            "Text": {
                                                "val": "Design next generation RF receiver chips with enhanced linearity.  Test components for massively channelized photonic RF receiver.  Design and fabricate new RF components."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.380"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.380"
                                            },
                                            "Text": {
                                                "val": "Test next generation RF receiver chips with enhanced linearity.  Test components for massively channelized photonic RF receiver.  Design and fabricate new RF components."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Technical Initiatives"
                                    },
                                    "Description": {
                                        "val": "Technical Initiatives includes:  Biological sciences to aid the warfighter and develop tools for biological research.  Autonomous systems technologies with the objective of developing mobile, autonomous, robotic platforms that demonstrate key capabilities needed for a wide range of defense applications.  Quantum information sciences to develop basic technologies that support the storage, transport, and computation of quantum information.  Novel and engineered materials that utilize nano-manufacturing techniques to create meta or other materials with unique physical and optical properties not readily found in nature."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.066"
                                            },
                                            "Text": {
                                                "val": "Biosciences:  Grew techniques and platforms for synthetic biology research, focusing on digital-based gene synthesis.  Developed tools and methods for rapid assessment of traumatic brain injury.  Developed low Size, Weight and Power (SWaP) tools for physiological load monitoring.  Autonomous systems:  Focused on growth of shared-perception for autonomous systems, cognitive robotics (including demonstration) and multi-unmanned aerial vehicle\/unmanned ground vehicle (UAV\/UGV) cooperative mission operations.  Quantum Information Sciences:  Focused on demonstration of multi-qubit computation and development of quantum protected communications.  Novel and Engineered Materials:  Developed meta material designs and test material properties in support of the development of high-frequency, tunable mirrors in the mid to long-wave infrared.  Developed designs and test miniature broad-band antennas utilizing negative index of refraction materials."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.764"
                                            },
                                            "Text": {
                                                "val": "Biosciences:  Conduct synthetic biology research, focusing on digital-based gene synthesis.  Evaluate methods for rapid assessment of traumatic brain injury.  Evaluate low Size, Weight and Power (SWaP) tools for physiological load monitoring.  Autonomous systems:  Develop hardware optimized for autonomous control and planning.  Quantum Information Sciences: Narrow focus of qubit research to one or more competing schemes.  Focus on demonstration of multi-qubit computation.  Demonstrate quantum protected communications.  Novel and Engineered Materials:  Develop high-frequency, tunable mirrors in the mid to long-wave infrared.  Test miniature broad-band antennas."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.965"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.965"
                                            },
                                            "Text": {
                                                "val": "Biosciences:  Conduct synthetic biology research, focusing on digital-based gene synthesis.  Evaluate methods for rapid assessment of traumatic brain injury.  Evaluate low Size, Weight and Power (SWaP) tools for physiological load monitoring.  Autonomous systems:  Develop hardware optimized for autonomous control and planning.  Quantum Information Sciences: Narrow focus of qubit research to one or more competing schemes.  Focus on demonstration of multi-qubit computation.  Demonstrate quantum protected communications.  Novel and Engineered Materials:  Develop high-frequency, tunable mirrors in the mid to long-wave infrared.  Test miniature broad-band antennas."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Applied Research Analyses for Advancing S&T Priorities"
                                    },
                                    "Description": {
                                        "val": "In FY 2014 the Lincoln Laboratory (LL) program will include an additional project area to support studies, analyses and experiments across a wide range of complex systems problems that face the DoD.  Emerging conflicts, shifting global priorities, natural disasters, and dwindling federal resources, to name a few, are all factors that will tax our ability to provide a timely and cost-effective military defense of the nation.  LL will develop an agile analytical and experimental methodology for addressing the impact of proposed solutions on complex-systems-engineering challenges and will reduce this method to practice on specific problems selected by the Assistant Secretary of Defense for Research and Engineering (ASD(R&E))."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Assess one or more specific time-critical problems of interest to the DoD with the goal of providing a clear understanding of the source of the problem, proposed solution space, cost, and resources required to validate the proposed solutions, and conduct experimentation and analyses to support specific courses of action.  The objective of these studies are to provide quick and thorough reactive or proactive analyses that will aid in the DoD specific short term conflict resolution and long term strategic decision making."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "Assess various time-critical problems of interest to the DoD with the goal of providing a clear understanding of the source of the problem, proposed solution space, cost, and resources required to validate the proposed solutions, and conduct experimentation and analyses to support specific courses of action.  The objective of these studies are to provide quick and thorough reactive or proactive analyses that will aid in the DoD specific short term conflict resolution and long term strategic decision making."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P535"
                    },
                    "ProjectTitle": {
                        "val": "Technical Intelligence"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "3.687"
                        },
                        "PriorYear": {
                            "val": "3.263"
                        },
                        "CurrentYear": {
                            "val": "8.638"
                        },
                        "BudgetYearOne": {
                            "val": "10.029"
                        },
                        "BudgetYearOneBase": {
                            "val": "10.029"
                        },
                        "BudgetYearTwo": {
                            "val": "9.286"
                        },
                        "BudgetYearThree": {
                            "val": "9.825"
                        },
                        "BudgetYearFour": {
                            "val": "5.919"
                        },
                        "BudgetYearFive": {
                            "val": "6.853"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "(U) The Technical Intelligence program provides global scientific and technological (S&T) awareness – an understanding of relevant fields, developments, applications, and opportunities of S&T topics – in order to assist decision-makers in the Office of the Assistant Secretary for Research and Engineering (OASD(R&E)) to prepare for an uncertain future. \n\n(U) The Technical Intelligence program provides this support through three over-arching areas: Current Threat and Capability Estimates, Technical Watch and Horizon Scanning (TW\/HS), and Technical Assessments. The current threat and capability estimate focus area coordinates with multiple U.S. government agencies to characterize today’s global S&T environment – to include threats and opportunities – using intelligence-derived and open source information as well as developing proof-of-concept systems to address identified threats. The TW\/HS focus area identifies nascent and disruptive technologies that will shape the future S&T landscape through novel TW\/HS tools and engagement with international partners. The technical assessment focus area identifies the military relevance, research opportunities, and policy recommendations for existing and future technologies. Each of these areas is supported by a robust outreach program."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Technical Intelligence"
                                    },
                                    "Description": {
                                        "val": "The Technical Intelligence program provides global scientific and technological (S&T) awareness – an understanding of relevant fields, developments, applications, and opportunities of S&T topics – in order to assist decision-makers in the Office of the Assistant Secretary for Research and Engineering (OASD(R&E)) to prepare for an uncertain future."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.263"
                                            },
                                            "Text": {
                                                "val": "(U) In FY2013, the Technical Intelligence program focused on programs which aligned with the Office of Technical Intelligence’s (OTI) focus areas: Current Threat and Capability Estimates, Technology Watch and Horizon Scanning, and Technical Assessments. Specifically:\n     •  (U\/\/FOUO) JASON Program: sponsored three JASON studies on national security topics: 1) Hypersonic Synthetic Aperture Radar (SAR); 2) Missile Threat; and 3) Space Intelligence.   The study results are classified. \n     •  (U\/\/FOUO) AS-US Bilateral Program: sponsored multiple DSTO studies that include Agile Manufacturing, Cold Atom Technology, Metamaterials, Future Technologies in Synthetic Biology, Attitude Toward Application of Biotechnologies to Humans, Cognitive Neuroscience and Augmentation, Efficient Heuristics for Hamiltonian Cycle Problem, and Batteries Deep Dive Study.\n     •  (U\/\/FOUO) Technical Assessment Program: sponsored efforts to support the technical assessment program.  Assessment topics include: directed energy weapons, human performance modifications, synthetic biology, and quantum magnetometers.  The assessment results are at both the unclassified and higher classification levels."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.638"
                                            },
                                            "Text": {
                                                "val": "(U) In FY 2014, the Technical Intelligence program will continue to focus on supporting efforts which align with our focus areas: Current Threat and Capability Estimates, TW\/HS, and Technical Assessments. Specifically:\n     •  (U\/\/FOUO) Morning Express Program:  OTI will sponsor the development of a countermeasure system(s) to protect forces and infrastructure from attack.  Additional information on this effort is at a higher classification level. \n     •  (U) JASON Program: OTI will sponsor the JASON group to support focused technical assessments on defense relevant problems.  The topic areas include metamaterials, photonics, and autonomy.\n     •  (U) Open-Source Capability Development: OTI will complete the development of a contemporary website based on the OASD(R&E) S&T News Bulletin which showcase S&T news stories and academic publications.\n     •  (U) Technical Assessment Program: will sponsor multiple technical assessment activities to include Human Performance, Synthetic Biology, Printed Electronics, Quantum Magnetometry, Metamaterials, Human-Systems Integration, and Autonomy."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.029"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.029"
                                            },
                                            "Text": {
                                                "val": "(U) In FY2015, the Technical Intelligence program will continue to focus on supporting efforts which align with our focus areas: Current Threat and Capability Estimates, TW\/HS, and Technical Assessments.  Specifically:\n    •  (U\/\/FOUO) OTI will identify additional areas to explore proof-of-concept counter measure development. : OTI will sponsor the development of an electronic countermeasure system(s) to protect forces and infrastructure from attack.  Additional information on these effort are at a higher classification level. \n   •  (U)  OTI will sponsor the JASON group to support focused technical assessments on defense relevant problems.  \n   •  (U)  OTI will sponsor efforts to continue the development of the TW\/HS program.  These efforts may include identification of alternate TW\/HS tool exploitation.\n   •  (U)  OTI will sponsor multiple efforts to support the technical assessment program based of emerging and disruptive technology lists developed nationally and with international partners."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P536"
                    },
                    "ProjectTitle": {
                        "val": "Testbed for Comparative Analysis"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "2.880"
                        },
                        "PriorYear": {
                            "val": "0.326"
                        },
                        "CurrentYear": {
                            "val": "0.365"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "(U) The Testbed for Comparative Analysis program supports the Technical Watch and Horizon Scanning (TW\/HS) efforts within the Office of Technical Intelligence (OTI). The TW\/HS focus area identified nascent and disruptive technologies that will shape the future S&T landscape through the exploitation of novel TW\/HS tools. The Testbed for Comparative Analysis program provides OTI the ability to quantitatively and qualitatively test and evaluate techniques for technology forecasting and horizon scanning."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Testbed for Comparative Analysis"
                                    },
                                    "Description": {
                                        "val": "(U) The Testbed for Comparative Analysis program supports the Technical Watch and Horizon Scanning (TW\/HS) efforts within the Office of Technical Intelligence (OTI). The TW\/HS focus area identified nascent and disruptive technologies that will shape the future S&T landscape through the exploitation of novel TW\/HS tools. The Testbed for Comparative Analysis program provides OTI the ability to quantitatively and qualitatively test and evaluate techniques for technology forecasting and horizon scanning."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.326"
                                            },
                                            "Text": {
                                                "val": "(U) In FY2013, the Testbed for Comparative Analysis program supports efforts which aligned with the TW\/HS focus area. Specifically:\n•\t(U) Tech Watch and Horizon Scanning Pilot System: OTI sponsored two efforts in the continuation of the TW\/HS automated system development effort.  These efforts included the purchasing of SCOPUS data to support the query sets of the TW\/HS pilot system and technical support from GTRI and NSWC in the development of a request for information to industry, academia, and government research centers\/laboratories in identifying a solution to developing an automated TW\/HS operating system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.365"
                                            },
                                            "Text": {
                                                "val": "(U) In FY2014, the Testbed for Comparative Analysis program will continue to focus on supporting efforts which align with the TW\/HS. Specifically:\n     •  (U) TW\/HS Pilot System Development:  OTI will continue to sponsor efforts towards developing an autonomous TW\/HS prototype operating system which may provide early identification of emerging and developing technologies.\n     •  (U) TW\/HS Tool Exploitation: OTI will sponsor efforts on exploiting TW\/HS tools to 1)  identify existing and unrecognized patterns;  specifically providing insight into non-obvious relationships, using open source information; and 2) develop a better understanding on how to incorporate private-sector data analysis regarding technology development, trends, and potentially disruptive developments."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}