{
    "id": "7767ff6d012256911a869dde69d35475ee6d8f9e",
    "meta": {
        "filename": "dod-2015_RDTE_2015_NAVY_BA7_RDTE_JustificationBook_Navy_PB_2015.zzz_unzipped_RDTE_JustificationBook_Navy_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0205658N"
        },
        "ProgramElementTitle": {
            "val": "Navy Science Assistance Progr"
        },
        "R1LineNumber": {
            "val": "193"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "15.325"
            },
            "PriorYear": {
                "val": "3.131"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "18.456"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Naval Science Advisor Program ensures the Fleet\/Force (F\/F) helps shape the Department of the Navy (DoN) investment in Science and Technology (S&T), develops teaming relationships to rapidly demonstrate and transition technology, supports development of technology-based capability options for naval forces, and enables warfighting innovations based on technical and conceptual possibilities.  This is accomplished through proactive connectivity and collaboration between DoN S&T and Joint, Navy, and Marine Corps commands worldwide.  The program accomplishes this through several methods. It provides Science Advisors to Joint, Navy, and Marine Corps operational and strategic planning commands. Science Advisors facilitate and disseminate Joint Capabilities Integration and Development System (JCIDS) requirements provided by the F\/F Commanders to the Director of Navy Test and Evaluation and Technology Requirements (OPNAV N091). Science Advisors collaborate with the F\/F to identify specific solutions to known operational capability needs and provide the means to develop and demonstrate prototype systems.  As a result, Science Advisors provide insight into issues associated with Naval Warfighting Capabilities that influence S&T program decision making.  The program develops leaders among civilian scientists and engineers in the Naval Research Enterprise (NRE).  Upon completion of their tours, Science Advisors return to the NRE with first hand knowledge of the F\/F, warfighting issues, and strategic decision making.  The Office of Naval Research (ONR) Science Advisor program enables continuous communication and collaboration between the warfighters, the technical community, and strategic development commands.\n\nEffective FY14, funding for the Naval Science Advisor Program moved to PE 0602236N"
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "3.450"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "3.131"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.319"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.024"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.006"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.001"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.288"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Not applicable.\n\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0834"
                    },
                    "ProjectTitle": {
                        "val": "LAB Fit Support"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "15.325"
                        },
                        "PriorYear": {
                            "val": "3.131"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "18.456"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Naval Science Advisor (SA) Program under 6.7 funding ensures the critical Naval Fleet\/Forces input help shape the Department of the Navy (DON) investment in Operational Systems Development S&T.  This is accomplished by providing technical experts into Joint, Navy, and Marine Corps operational and strategic planning commands worldwide to connect and collaborate with DON S&T. \n\nSAs facilitate and disseminate Joint Capabilities Integration and Development System (JCIDS) requirements and Future Naval Capabilities (FNC) engagement, providing the Fleet\/Forces Commander recommendations to the Director of Navy Test and Evaluation and Technology Requirements for systems development.  SAs collaborate with the Fleet\/Forces to identify specific solutions to known operational needs and provide the means to develop and demonstrate prototype systems.  As a result, SAs provide critical insight into issues associated with naval warfighting capabilities that influence S&T program decision making.  The SA Program enables continuous communication and collaboration between the warfighters, the technical community, and strategic development commands."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "NAVAL SCIENCE ADVISOR PROGRAM"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.131"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The Science Advisors (SA) are a conduit between the Fleet Forces, Office of Naval Research (ONR) and the Naval Research Establishments (NRE).  Specific Fleet\/Forces Science Advisors activities included the following:\n\nCommander Seventh Fleet (C7F) SA engaged with ONR and the Naval Research Enterprise (NRE) as follows: briefed senior level audiences, participated in discussions on relevant technology and S&T gaps in the areas of Information Operations (IO), Electronic Warfare, Computer Network Operations, Information Analysis & Communications, Survivability & Self Defense, Strike, and Anti-Submarine Warfare in the context of the Navy's S&T Focus Areas and Sea Power 21 Pillars.\n\nCommander US Naval Forces Central Command (C5F) SA provided leadership and guidance towards identification and response of C5F warfighting capability gaps based on threats having a critical impact on major campaign operations and combat readiness in the CENTCOM Area of Responsibility (AOR).\n\nCommander US Fleet Forces Command (USFFC) SA facilitated integration and articulation of Fleet warfighter and readiness requirements influencing DOD RDT&E resourcing by leading a team from the Fleet, force providers and Naval Component Commands articulating the requirements to the S&T community. \n\nCommander Submarine Forces (CSF) SA established a team based structure to advance Undersea Enterprise (USE) S&T needs to achieve warfighting capabilities through the USE Chief Technology Officer (CTO), OPNAV N87, and the NRE.  Evaluated, refined, and supported FY-13 FNC proposals and four Enabling Capabilities (EC) were approved for new start; Towed Array Reliability Improvement, ASW Fusion for Remote sensors, Alternate Anti-Surface Warfare Torpedo Homing and Target Discrimination, and Simulation Toolset for Analysis of Mission, Personnel, and Systems.\n\nCommander Naval Surface Forces (SURFOR) SA provided continuous engagement with ONR, and Fleet and Systems Command senior leaders in the creation, modification, and promulgation of Total Ownership Cost, Anti-Surface Warfare (ASW) and Integrated Air and Missile Defense (IAMD) gaps used as the basis for the development of FNC EC products. \n\nCommander Third Fleet (C3F) SA led the demonstration planning efforts for an IO Technology Demonstration that was tasked by the CNO.  Completed a survey of game changing or disruptive S&T efforts throughout the NRE, and as result of the survey, developed a Future Capabilities Needs List, detailing areas of future S&T investment. This IO demonstration will continue to build on gained knowledge to implement new technologies and tactics.\n\nUS Naval Forces Europe\/Africa, C6F SA managed the deployment of the Computer Aided Maritime Threat Evaluation System, a rules based information technology to aid C6F in assessing the risk of commercial shipping within the AOR.  Codified an enduring technical exchange with the NATO Undersea Research Center (NURC) under a memorandum of agreement to facilitate greater interoperability and the transition of NURC technologies into Naval Forces Europe\/Africa, C6F exercises and operations.\n\nCommanding General 1st Marine Expeditionary Force and Marine Forces Central Command (CG I MEF\/MARCENT) SA supported deployed force requirements definition and innovation insertion into Iraq and Afghanistan.\n\nCommander, US Marine Corps Forces Command (MARFORCOM) SA continued a cohesive and close teaming relationship with ONR Global SA at I MEF, II MEF, III MEF, and MARFORPAC that coordinated United States Marine Corps operating force's voice on S&T matters.\n\nCommander, Naval Air Forces (NAVAIRFOR) SA continued the development and installation efforts of weapons systems EO\/IR upgrade on 2 aircraft carriers and one amphibious assault ship for detection and identification of small boat threats to aircraft carrier strike groups.\n\nIII Marine Expeditionary Force (III MEF) SA worked with other USMC SAs to establish a new Operational Advisory Group (OAG) for the Marine Corps in Operational Science Technology and Experimentation (OSTE).  Designed and proposed a new Science and Technology Review Committee (STC) at III MEF that will be used to inform the new OSTE OAG of MEF requirements and provide oversight, guidance and ownership of S&T work at III MEF in Okinawa, Japan.\n\nCommanding General II Marine Expeditionary Force (II MEF) SA provided support to the standup and deployment of II MEF FWD, briefing the Operations Officers and S&T Officers on emerging technology\/ capabilities to be encountered in Afghanistan during II MEF FWD rotation.\n\nCommander, USMC, Pacific (MARFORPAC) SA focused on addressing operational and strategic needs with technology by engaging with the joint S&T community both within the Pacific and across DOD. Proposed, secured funding, and started installation of Micro Auto Gasification System (MAGS), a small scale in-situ waste management system for tactical and garrison environments.\n\nCommander Pacific Fleet (PACFLT) SA improved capabilities across the Pacific AOR through rapid technology pull in various mission areas including Maritime Security Operations, ASW and Counter-Intelligence Surveillance Reconnaissance.  Engaged S&T, acquisition, industry, university, other government agencies, and coalition partners to identify warfighting gaps and possible long-term solutions and collaborative efforts.\n\nUS Pacific Command (USPACOM) SA developed a command-wide S&T strategy to address operational shortfalls and synchronize S&T engagement with the USPACOM Theater Campaign Plan.  Established and executed multi-phase action plan to inform service RDT&E enterprise of command warfighting shortfalls and identify candidate mitigation capabilities via USPACOM S&T Integrated Priority List.\n\nCommander Submarine Forces Pacific Fleet (SUBPAC) SA continued to expand the capabilities of the Unmanned Aerial System (UAS, aka SOTHOC, Submarine Over-The-Horizon Organic Capability).  Two successful tactical development exercises with the UAS have occurred to evaluate counter detection.  These exercises used UAS for over-the-horizon targeting of high-valued units in a multi-ship formation.\n\nSA, Commander, Navy Expeditionary Combat Command (NECC), updated the NECC S&T Strategy Plan as the warfighters demand signal to the Navy Expeditionary Combat Enterprise (NECE).  Conducted technical demonstrations and the operational demonstration of the Riverine and Intercoastal Operations (RIO) JCTD unattended sensor system.\n\nSA, Commander, C10F, served as the senior representative\/liaison in all interactions with S&T oriented government, military, academia, and industry organizations.  Functioned as the FORCEnet Operational Agent S&T representative, Naval Space Operations S&T.\n\nSA, Commander Second Fleet (C2F), led the planning efforts for two Sea Trial sponsored events.  Coordinated the MK 38 Laser Weapons System initiative which demonstrates the capabilities of a ship based directed energy weapon system for self-defense against small watercraft, UAS and other threats. \n\nCommander Fourth Fleet (C4F) SA was responsible for concepts of operation, science and technology, experimentation, exercises and programs of record relating to all aspects of Joint, Naval and Coalition warfare in support of the Maritime Strategy, U.S. SOUTHERN COMMANDs Campaign Plan with a focus on Countering Transnational Organized Crime (CTOC) and Theater Security Cooperation Plan, and Maritime Operations Center (MOC) capabilities.  For successful implementation, the C4F SA was required to engage with personnel from USNAVSOs COCOM, U.S. SOUTHERN COMMAND, Navy Warfare Development Command, the other Navy Operational Agents (THIRD Fleet, NNWC), the platform agents (Submarine Forces, Naval Air Forces, Surface Forces, Navy Expeditionary Combat Command), US Fleet Forces Command and others as necessary.  The C4F SA worked closely with SOUTHCOMS experimentation cell to integrate new technology for CTOC missions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Goal: Provide leadership with timely S&T advice on issues.\n\nMetric: Monthly reports by Science Advisors to the Office of Naval Research and senior leadership within\ntheir assigned commands."
                        }
                    }
                }
            ]
        }
    }
}