{
    "id": "79c351d43e963da08ff7bd016ad2a3c82a84722b",
    "meta": {
        "filename": "dod-2015_RDTE_2015_ARMY_BA2_RDTE_JustificationBook_Army_PB_2015.zzz_unzipped_RDTE_JustificationBook_Army_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602783A"
        },
        "ProgramElementTitle": {
            "val": "COMPUTER AND SOFTWARE TECHNOLOGY"
        },
        "R1LineNumber": {
            "val": "24"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "8.886"
            },
            "CurrentYear": {
                "val": "10.434"
            },
            "BudgetYearOne": {
                "val": "10.764"
            },
            "BudgetYearOneBase": {
                "val": "10.764"
            },
            "BudgetYearTwo": {
                "val": "12.742"
            },
            "BudgetYearThree": {
                "val": "13.896"
            },
            "BudgetYearFour": {
                "val": "14.089"
            },
            "BudgetYearFive": {
                "val": "14.225"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) develops and evaluates hardware and software algorithms enabling enhanced understanding and accelerating the decision cycle time for commanders and leaders operating in a mobile, dispersed, highly networked environment.  Project Y10 supports research on information and communications technology.  \n\nWork in this PE complements and is fully coordinated with efforts in PE 0602705A (Electronics and Electronic Devices), 0602716A (Human Factors Engineering Technology), PE 0602782A (Command, Control, Communications Technology), PE 0603772A (Advanced Tactical Computer Science and Sensor Technology), and PE 0603008A (Command, Control, Communications Advanced Technology). \n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the U.S. Army Research Laboratory (ARL) at the Adelphi and Aberdeen Proving Ground, MD locations."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "9.830"
                },
                "CurrentYear": {
                    "val": "10.439"
                },
                "BudgetYearOne": {
                    "val": "10.501"
                },
                "BudgetYearOneBase": {
                    "val": "10.501"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "8.886"
                },
                "CurrentYear": {
                    "val": "10.434"
                },
                "BudgetYearOne": {
                    "val": "10.764"
                },
                "BudgetYearOneBase": {
                    "val": "10.764"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.944"
                },
                "CurrentYear": {
                    "val": "-0.005"
                },
                "BudgetYearOne": {
                    "val": "0.263"
                },
                "BudgetYearOneBase": {
                    "val": "0.263"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.020"
                    },
                    "CurrentYear": {
                        "val": "-0.005"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.150"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "0.263"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.263"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments 1"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.774"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "Y10"
                    },
                    "ProjectTitle": {
                        "val": "Computer\/Info Sci Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "8.886"
                        },
                        "CurrentYear": {
                            "val": "10.434"
                        },
                        "BudgetYearOne": {
                            "val": "10.764"
                        },
                        "BudgetYearOneBase": {
                            "val": "10.764"
                        },
                        "BudgetYearTwo": {
                            "val": "12.742"
                        },
                        "BudgetYearThree": {
                            "val": "13.896"
                        },
                        "BudgetYearFour": {
                            "val": "14.089"
                        },
                        "BudgetYearFive": {
                            "val": "14.225"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops and evaluates information and communications processing software to automate the delivery of  information for planning, rehearsal, and execution by ground commanders. Efforts develop communication\/network architectures and software and the information fusion software necessary to simplify the understanding and interactions from humans to humans, humans to computers, computers to humans.  Research enables enhanced understanding of many information sources and accelerates the decision cycle time for commanders and leaders operating in mobile, dispersed, highly networked environment envisioned for the future force.\n\nThis project supports Army science and technology efforts in the Command, Control, Communications, and Intelligence portfolio.  Work in this project is fully coordinated with PE 0603008A (Command, Control, Communications Advanced Technology)and PE 0603772A (Advanced Tactical Computer Science and Sensor Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the U.S. Army Research Laboratory (ARL), Adelphi and Aberdeen Proving Ground, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Information Processing"
                                    },
                                    "Description": {
                                        "val": "This effort develops and evaluates fusion software to improve the completeness and timeliness of decision-making in command and control (C2) operations. The goal of this effort is to develop software applicable to the Distributed Common Ground Station-Army (DCGS-A) architecture (an integrated architecture of all ground\/surface systems) and for future force assessment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.161"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued to develop scalable decision support and social network analysis algorithms; evaluated network and information visualization software for cellular wireless environments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.237"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Extract\/resolve and exploit social network information from multi-source data in order to provide timely accurate assessments of social and cultural influences for small unit decision making."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.248"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.248"
                                            },
                                            "Text": {
                                                "val": "Will evaluate techniques for predicting crowd attitudes, intent and behaviors from fused text sources; and develop concepts for integrating social network analysis into the command and control process."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Information Assurance"
                                    },
                                    "Description": {
                                        "val": "This effort designs and evaluates software for the protection of information and networks in wireless tactical environments.  The goal is to develop software algorithms that detect and defeat malicious activities of adversaries in the bandwidth constrained tactical networks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.108"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Designed and evaluated new software algorithms and architectures, along with predictive models, for distributed intrusion detection of cyber attacks in bandwidth-constrained environments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.215"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Evaluate experimental implementation of intrusion detection software algorithms and architectures; and develop and analyze predictive models for distributed intrusion detection of cyber attacks in bandwidth constrained environments to improve ability to detect and defeat malicious activities on Army networks and hosts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.194"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.194"
                                            },
                                            "Text": {
                                                "val": "Will design and evaluate an intrusion prevention architecture that dynamically monitors host and network data to detect, analyze, respond, and protect against unauthorized cyber activity in bandwidth and power-constrained environments; investigate models that will be used to develop and evaluate secure protocols that may be used in tactical networks; and explore active protection approaches that may be managed and\/or deployed locally, centrally or in a distributed environment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Information Exchange"
                                    },
                                    "Description": {
                                        "val": "This effort will investigate and develop software that integrates sensor data from local and external information sources.  The goal is to enable tactical users to cooperatively share relevant and timely tactical information within a distributed wireless environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.186"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed and assessed fusion and information exchange software to reduce network bandwidth necessary to transmit information; and evaluated the software using tactically realistic equipment and text\/video data."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.264"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop workflow and algorithms to enable end-user's ability to define and refine the collection, correlation, and aggregation of raw and processed data from both local and higher echelon information sources to produce summaries that are directly relevant to the user's current operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.280"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.280"
                                            },
                                            "Text": {
                                                "val": "Will develop and evaluate text, image, and full motion video processing algorithms for use within representative state transfer services operating across a suite of distributed nodes using realistic network connectivity and data sources."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Language Translation"
                                    },
                                    "Description": {
                                        "val": "This effort develops and assesses computational multilingual algorithms and software frameworks to enable commanders and troops to bridge language barriers in order to counter adversaries and collaborate with allies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.361"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed and evaluated adaptive optical character recognition and machine translation (OCR\/MT) workflow analysis software to improve the quality of automated reasoning techniques when applied to human intelligence documents (both foreign and English)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.104"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop an experimental framework for evaluation of state-of the-art academic OCR\/MT, entity extraction, and entity resolution algorithms using realistic, representative data; develop, refine, and test advanced algorithms to improve multilingual and machine translation technologies in three areas: (a) OCR of noisy and degraded document images typical of field-captured materials, (b) domain-specific machine translation targeting domains and genres outside of commercial interest, and (c) recognition of key content in handwritten documents typical of materials commonly encountered in the field to facilitate the rapid transition of promising candidate technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.142"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.142"
                                            },
                                            "Text": {
                                                "val": "Will develop, refine, and test advanced algorithms to improve machine translation technologies by incorporating data subset selection techniques into algorithms to generalize existing MT modules to new domains of military interest."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Network Theory"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and designs theory based software models to evaluate and validate emerging network protocols and structures.  The goal of this effort is to develop software algorithms that maintain effective communications in networks in spite of disruptive effects such as task reorganization, mobility of friendly forces, and adversarial attacks on friendly networks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.632"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued to investigate and evaluate algorithms to improve delivery time and quality of information in unreliable tactical mobile networks; and investigated and evaluated software algorithms that exploit network user movement and usage to improve communication and information delivery."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.887"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigate and evaluate techniques for improving network performance and Soldier decision making by adapting data processing and delivery behaviors based on current network abilities and user information quality preferences; develop and evaluate non-traditional communications techniques, such as optical and ultra violet (UV), to provide alternative means of communications in radio frequency (RF)-challenged environments; and investigate techniques for using mobile infrastructure and user movement to improve communication networks and information delivery in hybrid (wired & wireless) networks."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.171"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.171"
                                            },
                                            "Text": {
                                                "val": "Will develop and evaluate UV communications components that attach to the RF common sensor radio; use simulation to investigate how mobility and autonomy may be exploited to maintain connectivity; and investigate mapping connectivity regions to blend with mobility planning and sensing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Heterogeneous Computing and Computational Sciences"
                                    },
                                    "Description": {
                                        "val": "This effort researches and develops software algorithms to allow information processing across different computing hardware platforms. The goal of this research is to provide high performance computing (HPC) equivalent processing capabilities to the Soldier on the battlefield."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.519"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed and evaluated scalable algorithms for battle command applications, such as modeling electromagnetic propagation in urban areas on a HPC cloud hybrid computing platform; evaluated algorithm performance and accuracy for developing high fidelity models of complex battlefield scenarios."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.682"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop, implement and validate discrete mathematical algorithms for high fidelity electromagnetic propagation and electromagnetic interference for use in real time modeling and optimization of ad hoc mobile networks; test, analyze, and optimize the performance of current and proposed mobile ad hoc network simulations; develop code enabling algorithm deployment for extremely large networks using inter-core load balancing between standard computing cores and specialized accelerators such as Graphics Processing Units; and perform validation of the models and results based using standard battle command benchmarks."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.673"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.673"
                                            },
                                            "Text": {
                                                "val": "Will investigate approaches for computational off-loading to disparate, hybrid cores focused on extracting maximum performance from the parallel nature of many-core pervasive technologies; create new models to describe offered load and computational capacity within cloudlet-based services in Army-centric mobile and ad hoc networked technologies; and develop software engineering protocols and methods to promote portability while maintaining efficiency with heterogeneous systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Material Modeling-Force Protection"
                                    },
                                    "Description": {
                                        "val": "This effort designs and evaluates software to improve parallel processing for computational intensive physics.  Intent is to create a computational science environment to assist researchers from different disciplines to work collaboratively and to exchange models and results."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.919"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Designed new parallel computational science environment architecture, as well as theory and implementation strategies for coupling multi-physics modeling software; and evaluated new data models and formats for using petascale data from multi-physics applications to enable higher resolution\/fidelity simulations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.045"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop parallel computational common software environment on emerging multi-core petaflop high performance computing (HPC) systems; and implement interface algorithm, data models and formats to solve multi-scale\/multi-physics software developed for coupling between molecular dynamics and finite element methods."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.056"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.056"
                                            },
                                            "Text": {
                                                "val": "Will develop and extend capabilities to couple multi-scale\/multi-physics software that will be designed to achieve efficiency across a growing base of computing cores; and investigate the use of domain specific languages to couple novel HPC capabilities within the material modeling domain and facilitate rapid software deployment."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}