{
    "id": "7bf5b399e3fdf2530742befba14577783d09d3ba",
    "meta": {
        "filename": "dod-2015_RDTE_2015_AIRFORCE_V3A_RDTE_JustificationBook_Air_Force_PB_2015.zzz_unzipped_RDTE_JustificationBook_Air_Force_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0207410F"
        },
        "ProgramElementTitle": {
            "val": "Air & Space Operations Center (AOC)"
        },
        "R1LineNumber": {
            "val": "152"
        },
        "MdapCode": {
            "val": "N42"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "264.584"
            },
            "PriorYear": {
                "val": "70.925"
            },
            "CurrentYear": {
                "val": "22.332"
            },
            "BudgetYearOne": {
                "val": "41.066"
            },
            "BudgetYearOneBase": {
                "val": "41.066"
            },
            "BudgetYearTwo": {
                "val": "21.333"
            },
            "BudgetYearThree": {
                "val": "17.734"
            },
            "BudgetYearFour": {
                "val": "18.081"
            },
            "BudgetYearFive": {
                "val": "18.425"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "In FY 2014, project number 675117, Integration Development, AOC Increment 10.2, efforts were transferred to PE 0604458F, AOC Increment 10.2, project number 644945, AOC Increment 10.2, in order to improve transparency of ACAT 1 Acquisition programs.\n\nAOC Increment 10.2 received a Milestone B decision 11 October 2013.  Beginning in FY 2015, PE 0604458F Air & Space Ops Center project number 644945 AOC Increment 10.2 development efforts are transferred to PE 0605458F Air & Space Ops Center 10.2 RDT&E project number 654945 AOC 10.2 Development, to align post Milestone B development efforts with funding in RDT&E Budget Activity 05, System Development & Demonstration (SDD).\n\nIn FY13, AOC 10.2 is PRCP Program Number(PNO) N42.  In FY14, AOC 10.2 is PNO N46.  Beginning in FY15, AOC 10.2 is PNO N91"
        },
        "ProgramElementMissionDescription": {
            "val": "The Air and Space Operations Center Weapon System (AOC WS) program element provides development of Command and Control (C2) capabilities across the entire spectrum of air and space operations from the strategic to the tactical level.  There are four funded projects within the AOC WS program element:\n\nIntegration Development supports the AOC WS, AN-USQ-163 Falconer, the senior element of the Theater Air Control System (TACS).  AOC WS is the weapon system the Commander, Air Force Forces (COMAFFOR) provides the Combined\/Joint Force Air Component Commander (C\/JFACC) for planning, executing and assessing theater-wide air and space operations.  \n\nApplications Development provides worldwide operational level C2 capabilities, which include: air battle planning, management, and execution; operational level C2 of Integrated Air and Missile Defense (IAMD); as well as personnel recovery C2 in support of DoD, Coalition Partners, and other government agencies.  \n\nUnit Level (UL) supports two primary mission areas: UL Operations software systems provide both the scheduling and mission preparation activities at the wing and squadron level and the capabilities to report and track the success of each mission and influence decisions on future Air Battle Planning to refine future missions.  UL intelligence capabilities ensure detailed threat, target and imagery information readily available to mission commanders and aircrews planning current flight operations. \n\nPersonnel Recovery Command and Control (PRC2): Provides an adaptive, networked, decentralized and situationally-appropriate personnel recovery command and control system which supports personnel accountability and recovery missions worldwide.  PRC2 delivers a globally accessible, collaborative, interoperable and integrated system to prevent, prepare for and respond to isolating events across the Range of Military Operation in the joint\/coalition operating environment.  The system collects, stores and delivers personnel\/identity biometric data, emergency locator beacon registrations, isolated personnel reports, evasion plans of action, incident reports and other information management capabilities for predictive, preventive and personnel vulnerability analysis\/assessment in support of Personnel Recovery across Department of Defense and other national and international entities.\n\nThis program is in Budget Activity 7, Operational System Development, these budget activities includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "76.315"
                },
                "CurrentYear": {
                    "val": "22.820"
                },
                "BudgetYearOne": {
                    "val": "41.578"
                },
                "BudgetYearOneBase": {
                    "val": "41.578"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "70.925"
                },
                "CurrentYear": {
                    "val": "22.332"
                },
                "BudgetYearOne": {
                    "val": "41.066"
                },
                "BudgetYearOneBase": {
                    "val": "41.066"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-5.390"
                },
                "CurrentYear": {
                    "val": "-0.488"
                },
                "BudgetYearOne": {
                    "val": "-0.512"
                },
                "BudgetYearOneBase": {
                    "val": "-0.512"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.100"
                    },
                    "CurrentYear": {
                        "val": "-0.488"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.397"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-3.893"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.512"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.512"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2013: Other Adjustments reduction of -$3.893M due to sequestration.\n\nFY 2014: Project number 675117, Integration Development, AOC Increment 10.2 efforts transferred to PE 0604458F, AOC Increment 10.2, project number 644945, AOC Increment 10.2, in order to improve transparency of ACAT 1 Acquisition programs."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "675117"
                    },
                    "ProjectTitle": {
                        "val": "Integration Development"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "264.584"
                        },
                        "PriorYear": {
                            "val": "49.329"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "313.913"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "In FY 2014, project number 675117, Integration Development, AOC Increment 10.2, efforts were transferred to PE 0604458F, project number 644945, AOC Increment 10.2, in order to improve transparency of ACAT 1 Acquisition programs.\n\nIn FY 2015, PE 0604458F, Air & Space Ops Center project number 644945 AOC Increment 10.2, development efforts were transferred to PE 0605458F Air & Space Ops Center 10.2 project number 654945, AOC 10.2 Development, in order to align post Milestone B development efforts with funding in RDT&E Budget Activity 05, System Development & Demonstration (SDD)."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Air Operations Center Weapons System (AOC WS), AN\/USQ-163 Falconer, the senior element of the Theater Air Control System (TACS), is the weapon system the Commander, Air Force Forces (COMAFFOR) provides the Combined\/Joint Force Air Component Commander (C\/JFACC) for planning, executing, and assessing theater-wide air and space operations.  The C\/JFACC provides air, space and cyber support to the Combined\/Joint Forces Commander (C\/JFC) by coordinating, deconflicting and assessing the progress of various weapon systems to advance the C\/JFC's campaign.  The AOC WS develops operations strategy and planning documents.  The weapon system also disseminates tasking orders; executes day-to-day peacetime and combat air, space and cyber operations; and provides rapid reaction to immediate situations by exercising positive control of friendly forces. \n\nThe AOC Integration Development program keeps the AOC interoperable, certified, supportable, and compliant through the integration, testing and fielding of new capabilities and sustainment upgrades to the AOC WS baseline.  The program supports mission requirements at Geographic and Functional AOCs, as well as Support and Manpower Augmentation units.  To keep the AOC current and interoperable with the COCOMs, cyber requirements, and fifth generation weapon system\/weapons, the AOC WS program plans to evolve the AOC through the integration and test of progressively improving capabilities.  These activities ensure a system of systems engineering perspective for the AOC WS, and include weapon system standardization activities as defined by AOC WS requirements documents.  Integrated Air and Missile Defense (IAMD) establishes critical IAMD improvements in the AOC WS to maximize the allocation, planning, and execution of IAMD.  The Modernization contractor, which was awarded the Modernization contract on 25 October 2011, has commenced with AOC 10.2 pre-Engineering and Manufacturing Development (EMD) activities, including a Systems Requirements Review (SRR), an Interim Design Review (IDR), and a delta-Preliminary Design Review (delta-PDR).  In accordance with AOC 10.2 Milestone Decision Authority (MDA) direction (23 Jun 2010), the AOC 10.2 Modernization program conducted prototyping and Limited Early Install (LEI) activities through an iterative build methodology prior to Milestone B (MS B) to reduce integration risk and improve user feedback in the acquisition process.  \n\nActivities also include studies and analysis to support both current program planning and execution, as well as future program planning.\n\nIn FY13, AOC 10.2 is PRCP Program Number (PNO) N42.  In\nFY14, AOC 10.2 is PNO N46.  Beginning in FY15, AOC 10.2 is PNO N91"
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "AOC WS Inc 10.2"
                                    },
                                    "Description": {
                                        "val": "AOC 10.2 infrastructure modernization and mission capability integration.  Development of a robust, open, Net-Centric infrastructure with a Services Oriented Architecture."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "48.736"
                                            },
                                            "Text": {
                                                "val": "Accomplished pre-EMD activities on the Modernization contract to obtain MDA approved MS B.  The program conducted system prototyping, LEI activities, Warfighter Assessment Workshops, and Delta Preliminary Design Review (PDR) to support risk reduction and operational feedback."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "AOC WS Inc 10.2 Test and Evaluation"
                                    },
                                    "Description": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.593"
                                            },
                                            "Text": {
                                                "val": "Planned and implemented comprehensive testing (in-plant integration and test, functional testing, security testing, etc.), Developmental Test and Evaluation (DT&E), and Operational Test and Evaluation (OT&E) on the AOC 10.2 baseline.  Efforts included test planning, conducting, and documentation review."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "RDTE: BA04: PE 0604458F"
                                    },
                                    "Title": {
                                        "val": "AOC Increment 10.2"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "58.861"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "194.370"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTE: BA05: PE 0605458F"
                                    },
                                    "Title": {
                                        "val": "AOC Increment 10.2"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "85.938"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "85.938"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "47.946"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "135.509"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "OPAF: BA03: Line Item # 834530"
                                    },
                                    "Title": {
                                        "val": "Air & Space Operations Ctr - WPN SYS"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "27.623"
                                        },
                                        "CurrentYear": {
                                            "val": "22.974"
                                        },
                                        "BudgetYearOne": {
                                            "val": "23.690"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "23.690"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "12.033"
                                        },
                                        "BudgetYearThree": {
                                            "val": "12.439"
                                        },
                                        "BudgetYearFour": {
                                            "val": "7.524"
                                        },
                                        "BudgetYearFive": {
                                            "val": "7.780"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "OPAF: BA03 Line Item # 834560"
                                    },
                                    "Title": {
                                        "val": "Air and Space Operations Ctr Inc.10.2"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "24.405"
                                        },
                                        "BudgetYearThree": {
                                            "val": "51.283"
                                        },
                                        "BudgetYearFour": {
                                            "val": "43.585"
                                        },
                                        "BudgetYearFive": {
                                            "val": "32.313"
                                        },
                                        "CostToComplete": {
                                            "val": "286.340"
                                        },
                                        "TotalCost": {
                                            "val": "437.926"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The acquisition strategy builds on existing capabilities using evolutionary acquisition to standardize, modernize and sustain the AOC.  The AOC Modernization Contract was competitively awarded on 25 October 2011, but due to contract protests and associated delays, the actual start date was 20 December 2011.  The Modernization contractor is using a system of systems perspective, and is following systems engineering rigor, to evolve AOC to a Net-Centric environment, compliant with DoD Services Oriented Architecture (SOA) standards."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "In FY 2014, project number 675117, Integration Development, AOC Increment 10.2, efforts were transferred to PE 0604458F, project number 644945, AOC Increment 10.2, in order to improve transparency of ACAT 1 Acquisition programs.\n\nIn FY 2015, PE 0604458F, Air & Space Ops Center project number 644945 AOC Increment 10.2, development efforts were transferred to PE 0605458F Air & Space Ops Center 10.2 project number 654945, AOC 10.2 Development, in order to align post Milestone B development efforts with funding in RDT&E Budget Activity 05, System Development & Demonstration (SDD)."
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "10.1 Integration & Version Upgrades"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Lockheed Martin-WSI"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Colorado Springs, CO"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "67.247"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "67.247"
                                                    },
                                                    "TargetValue": {
                                                        "val": "67.823"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "10.1 Integration & Version Upgrades (Organic)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various,"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.396"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.396"
                                                    },
                                                    "TargetValue": {
                                                        "val": "3.343"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "IAMD"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD,"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.490"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.490"
                                                    },
                                                    "TargetValue": {
                                                        "val": "17.762"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "10.2 Modernization"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various,"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "22.969"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "8.553"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "31.522"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "10.2 Modernization Contract"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Northrop Grumman"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Herndon, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "85.863"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "31.019"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "116.882"
                                                    },
                                                    "TargetValue": {
                                                        "val": "119.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Training"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various,"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "11.471"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "11.471"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Prototyping"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Jacobs"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hanscom AFB, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "20.559"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "20.559"
                                                    },
                                                    "TargetValue": {
                                                        "val": "7.000"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Test 10.1 Integration and Version Upgrades"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various,"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "7.421"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "7.421"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Test 10.2 Modernization"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various,"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.300"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.593"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.893"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Systems Engineering"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MITRE"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Bedford, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "19.459"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "4.268"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "23.727"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Program Management Administration"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hanscom AFB, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "24.409"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "4.896"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "29.305"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0207410F_BPAC_675117_0.jpg"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "AOC Increment 10.2 Preliminary Design Review (PDR)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "AOC Increment 10.2 Critical Change Report (CCR)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "AOC Increment 10.2 Milestone B (MS B)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "AOC Increment 10.2 Design \/ Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "675218"
                    },
                    "ProjectTitle": {
                        "val": "Applications Development"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "15.771"
                        },
                        "CurrentYear": {
                            "val": "14.796"
                        },
                        "BudgetYearOne": {
                            "val": "29.550"
                        },
                        "BudgetYearOneBase": {
                            "val": "29.550"
                        },
                        "BudgetYearTwo": {
                            "val": "11.588"
                        },
                        "BudgetYearThree": {
                            "val": "7.496"
                        },
                        "BudgetYearFour": {
                            "val": "7.643"
                        },
                        "BudgetYearFive": {
                            "val": "7.789"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project funds operational development necessary to acquire, modify, and sustain segments of Air Force's Command and Control (C2) capabilities and services.  Applications Development provides worldwide operational capabilities for AF C2 in support of DoD, Coalition Partners, and other government agencies.  These efforts focus on, but are not limited to, support of the Joint Forces Air Component Commander (JFACC) that provides air, space and cyber support as presented to the AOC and to other C2 systems.  Applications Development efforts deliver capabilities identified in the Joint Command and Control (JC2) Capability Development Document (CDD) (2013).  Applications Development activities include but are not limited to the following: 1) Command and Control Air Operations Suite-Command and Control Information Services (C2AOS-C2IS) needs identified in the Capability Definition Package (CDP) (2012).  C2AOS-C2IS I creates web-enabled information services to expose air operations data using standardized schemas, such as those developed by the Air Operations Community of Interest (AO COI).  C2AOS-C2IS I also develops, matures, fields, and maintains modular net-centric C2 applications for air battle planning, execution, and management functions to include Network Enabled Weapons (NEW); 2) Command and Control Air Operations Suite-Command and Control Information Services II (C2AOS-C2IS II) will focus on but not be limited to, the remainder of CDP and Theater Battle Management Core Systems-Force Level (TBMCS-FL) functionality not addressed in C2AOS-C2IS I as well as providing new C2 capabilities for planning and execution of 4th & 5th Generation Fighter Platforms, interoperability with other evolving Global Command & Control System Family of Systems (GCCS FoS) and other Service programs, and for Force Level data migration; and 3) Personnel Recovery Command and Control (PRC2) program which develops and delivers tools and services for collaborating, planning and managing search and rescue efforts, and disseminating related information.  The Joint Personnel Recovery Initial Capabilities Document (ICD) (2012) articulates capabilities needed for PRC2.\n\nCore activities for Applications Development include but are not limited to the following: 1) developing capabilities to support planning and replanning of the Air Battle Plan; generation and dissemination of the Air Tasking Order; defense planning and execution; targeting; weaponeering; personnel recovery tasks; other applications and services supporting C2 in the joint environment; 2) providing support to and participating in the Air Operations Community of Interest (AO COI) to improve air operations information interoperability among all joint and coalition systems within the Air Operations (AO) domain; 3) developing and assessing C2 air, space, intelligence, surveillance, reconnaissance, and cyber technologies that will improve joint and coalition warfighter interoperability, including participation in North Atlantic Treaty Organization (NATO) and Coalition interoperability exercises, demonstrations, trials, and activities; 4) transitioning existing C2 capabilities to a net-centric environment; and 5) improving operational level C2 of Integrated Air and Missile Defense (IAMD).  Applications Development efforts include evaluation and maturation of future air, space, and cyber C2 concepts identified through research, risk reduction, prototyping, current operations, exercises, and demonstrations.  \n\nActivities also include studies and analysis to support both current program planning and execution, as well as future program planning.\n\nThis program is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "NATO"
                                    },
                                    "Description": {
                                        "val": "NATO and International Cooperation Research and Development.  Efforts to develop air, space, intelligence, surveillance, reconnaissance and cyber Information Exchange Requirements and capabilities between U.S. and NATO \/ Coalition systems to promote interoperability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.430"
                                            },
                                            "Text": {
                                                "val": "Developed technologies to improve joint and coalition warfighter capability."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.435"
                                            },
                                            "Text": {
                                                "val": "Continue to develop technologies that improve joint and coalition warfighter capability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.430"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.430"
                                            },
                                            "Text": {
                                                "val": "Continue with the development of technologies that improve joint and coalition warfighter capability."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "C2AOS-C2IS I"
                                    },
                                    "Description": {
                                        "val": "C2AOS-C2IS I develops modular net-centric C2 applications for air battle planning, execution and management functions and creates web-enabled information services to expose air operations data in TBMCS applications and systems using standardized schemas including Capablility Packages (CP) 1 & 2.  \n\n- CP 1: Air Tasking Order Management System (ATOMS), Request Information Services for Command and Control (RISC2) & Network Enabled Weapons (NEW)\n\n- CP 2: IAMD Planner and Airspace Management Application - Airspace Information Service (ASMA - ASIS)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.827"
                                            },
                                            "Text": {
                                                "val": "Awarded Fixed Price Incentive Firm contract 21 Dec 2012 for ATOMS and Cost Plus Incentive Fee contract for 20 Dec 2012 Request Information Services for C2 (RISC2) capabilities.  Competed and awarded follow-on contract(s) for but not limited to the development of Air Space Management Application - Air Space Information Service (ASMA-ASIS) and C2 of IAMD capabilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.384"
                                            },
                                            "Text": {
                                                "val": "Continue with the development of but not limited to ATOMS, RISC2, ASMA-ASIS and C2 of IAMD capabilities.  Beginning testing and potential fielding of ATOMS & RISC2."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.831"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.831"
                                            },
                                            "Text": {
                                                "val": "Will continue with the development of but not limited to ATOMS, RISC2, ASMA-ASIS and C2 of IAMD capabilities.  Beginning testing and potential fielding of ATOMS, RISC2, ASMA-ASIS & IAMD PLANNER."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "PRC2"
                                    },
                                    "Description": {
                                        "val": "PRC2 develops and delivers tools and services for collaborating, planning and managing search and rescue efforts, and disseminating related information.  The system collects, stores and delivers personnel\/identity biometric data, emergency locator beacon registrations, isolated personnel reports, evasion plans of action, incident reports and other information management capabilities for predictive, preventive and personnel vulnerability analysis\/assessment in support of Personnel Recovery across Department of Defense and other national and international entities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.170"
                                            },
                                            "Text": {
                                                "val": "Tested and supported the fielding decision for PRMS Mission Manager v1.0 which provides mission management capabilities, captures data regarding events, collaborates and automates event information collection for incident reports.  Refined requirements for multiple increments of Mission Manager with a Joint Working Group to identify Air Force other Services capability needs\/priorities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2014, Personnel Recovery Command and Control (PRC2), efforts can be found under project number 675221, Personnel Recovery Command and Control (PRC2)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "C2AOS-C2IS II"
                                    },
                                    "Description": {
                                        "val": "C2AOS-C2IS II develops modular net-centric C2 applications for air battle planning, execution and management functions and creates web-enabled information services to expose air operations data in TBMCS applications and systems using standardized schemas.  As well as providing new C2 capabilities for planning, execution and interoperability with other evolving GCCS FoS and other Service programs, and for Force Level data migration."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.298"
                                            },
                                            "Text": {
                                                "val": "Developed the remainder of TBMCS-FL functionality not addressed in C2AOS-C2IS I requirements, and new C2 capabilities for planning and execution of 4th & 5th Generation Fighter Platforms, NEW, interoperability with other evolving GCCS FoS and other Service programs, and Force Level data migration."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.877"
                                            },
                                            "Text": {
                                                "val": "Planning for the development of the remainder of TBMCS-FL functionality as well as interoperability with other evolving GCCS FoS and other Service programs, and for Force Level data migration.  Potential opportunities to conduct protyping to allow for better requirements refinement."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.537"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.537"
                                            },
                                            "Text": {
                                                "val": "Will continue to plan for and execute the development of the remainder of TBMCS-FL functionality as well as interoperability with other evolving GCCS FoS and other Service programs, and for Force Level data migration.  Potential opportunities to conduct protyping to allow for better requirements refinement."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Description": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.046"
                                            },
                                            "Text": {
                                                "val": "Test and Evaluation focused on DT&E and OT&E, which included test planning, conduct and documentation review."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.100"
                                            },
                                            "Text": {
                                                "val": "Test and Evaluation continuing to focus on DT&E and OT&E, to include test planning, conduct and documentation review."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.752"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.752"
                                            },
                                            "Text": {
                                                "val": "Test and Evaluation will continue to focus on DT&E and OT&E, to include test planning, conduct and documentation review."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPAF: BA03: Line Item # 834520"
                                    },
                                    "Title": {
                                        "val": "Theater Battle Management C2 System"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "1.205"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Projects will be awarded following full and open competition and will use an evolutionary acquisition strategy based on incremental development leveraging the C2 Applications and Information Services Development (C2AD) Indefinite Delivery\/Indefinite Quantity (ID\/IQ) contract."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0207410F_BPAC_675218_0.jpg"
                                }
                            }
                        ]
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "675220"
                    },
                    "ProjectTitle": {
                        "val": "Unit Level"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "5.825"
                        },
                        "CurrentYear": {
                            "val": "5.397"
                        },
                        "BudgetYearOne": {
                            "val": "9.100"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.100"
                        },
                        "BudgetYearTwo": {
                            "val": "7.311"
                        },
                        "BudgetYearThree": {
                            "val": "7.803"
                        },
                        "BudgetYearFour": {
                            "val": "7.956"
                        },
                        "BudgetYearFive": {
                            "val": "8.107"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project funds operational development to develop, integrate, field, and maintain Unit Level \/ Unit Command and Control (UL\/UC2) as an evolving sequence of increasing software capabilities that support the execution of the air battle plan and the air tasking order message received from the AOC.  UL\/UC2 operations software systems meet needs identified in the TBMCS Operational Requirements Document (ORD) (2001) by providing both the scheduling and mission preparation activities at the wing, group and squadron level, and the capabilities to report and track the success of each mission and influence decisions on future air battle planning.  UL\/UC2, also referred to as Unit Command and Control (UC2), is fielded to the Wing Operations Center (WOC), the Maintenance Operations Center (MOC), the Squadron Operations Center (SOC), and many other work-centers.  UC2 requirements will be identified using the system modification request process.  \n\nActivities also include studies and analysis to support both current program planning and execution, as well as future program planning."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Software Development"
                                    },
                                    "Description": {
                                        "val": "UL\/UC2 and UC2 capabilities development\/integration."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.120"
                                            },
                                            "Text": {
                                                "val": "Completed testing of UL\/UC2 Ops Increment 2.  Finished planning activities for UC2 MR1 which provided migration of UL\/UC2 into a service oriented infrastructure capable of meeting the Net-Ready key performance parameter, implementing elements of the Installation Control Center (ICC) Enabling Concept."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.997"
                                            },
                                            "Text": {
                                                "val": "Writing the UC2 MR1 System Requirements Document and program office cost estimate.  Planning for and awarding of the contract for UC2 MR1. UC2 MR1 will provide service oriented infrastructure capable of meeting the Net-Ready key performance parameters.  Accelerating should cost initiatives for virtualization and open source replacement of application server software into Inc2 Service Patch 3 (SP3)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.550"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.550"
                                            },
                                            "Text": {
                                                "val": "Complete development of UC2 MR1.  Begin testing of MR1 and prepare for fielding.  Start UC2 MR2 planning."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Testing and Test Support"
                                    },
                                    "Description": {
                                        "val": "Testing and test support activities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.705"
                                            },
                                            "Text": {
                                                "val": "Completed testing and test support activities for UL\/UC2 Ops Increment 2 and Inc 2 Service Pack 1 (SP1)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.400"
                                            },
                                            "Text": {
                                                "val": "Continue testing and evaluation involved in UL\/UC2 Inc 2 SP2.  Starting Inc 2 SP3 testing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.550"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.550"
                                            },
                                            "Text": {
                                                "val": "Will continue testing and evaluation of UL\/UC2 Inc 2 SP3.  Start testing on UC2 MR1."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPAF: BA03: Line Item # 834520"
                                    },
                                    "Title": {
                                        "val": "Theater Battle Management C2 System"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "3.873"
                                        },
                                        "CurrentYear": {
                                            "val": "3.247"
                                        },
                                        "BudgetYearOne": {
                                            "val": "3.825"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "3.825"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "3.950"
                                        },
                                        "BudgetYearThree": {
                                            "val": "4.161"
                                        },
                                        "BudgetYearFour": {
                                            "val": "4.235"
                                        },
                                        "BudgetYearFive": {
                                            "val": "4.311"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Projects will be awarded following full and open competition and will use an evolutionary acquisition strategy based on incremental development while incorporating agile testing principals"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0207410F_BPAC_675220_0.jpg"
                                }
                            }
                        ]
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "675221"
                    },
                    "ProjectTitle": {
                        "val": "Personnel Recovery Command and Control (PRC2)"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "2.139"
                        },
                        "BudgetYearOne": {
                            "val": "2.416"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.416"
                        },
                        "BudgetYearTwo": {
                            "val": "2.434"
                        },
                        "BudgetYearThree": {
                            "val": "2.435"
                        },
                        "BudgetYearFour": {
                            "val": "2.482"
                        },
                        "BudgetYearFive": {
                            "val": "2.529"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "FY 2013 Personnel Recovery Command and Control (PRC2) efforts can be found under project number 675218, Applications Development, Personnel Recovery Command and Control (PRC2)."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project funds operational development necessary to acquire, modify, and sustain a segment of Air Force's C2 capabilities and services associated with Personnel Recovery.  The Personnel Recovery Command and Control (PRC2) program develops and delivers tools and services for planning, collaborating and managing search and rescue efforts, as well as disseminating related information to all personnel recover mission coordinators across PR network.  PRC2 provides an adaptive, networked, decentralized and timely situational awareness information for personnel recovery supporting personnel accountability and recovery missions worldwide.  PRC2 delivers a globally accessible, collaborative, interoperable and integrated system to prevent, prepare for and respond to isolating events across a broad spectrum of US government which may include in the joint\/coalition military and civilian rescue mission.  The Joint Personnel Recovery (JPR) ICD (2012) articulates capabilities needed for PRC2.\n\nThe system collects, stores and delivers personnel\/identity biometric data, emergency locator beacon registrations, isolated personnel reports, evasion plans of action, incident reports and other information management capabilities. The information is used for predictive, preventive and personnel vulnerability analysis and assessment in support of Personnel Recovery across Department of Defense and other national and international entities. \n\nActivities also include studies and analysis to support both current program planning and execution, as well as future program planning."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "PRC2"
                                    },
                                    "Description": {
                                        "val": "Personnel Recovery Command and Control (PRC2) developing and delivering tools and services for planning and managing search and rescue efforts, and disseminating related information."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.039"
                                            },
                                            "Text": {
                                                "val": "Developing and delivering Personnel Recovery Mission Software (PRMS) 2.1.7 Maintenance Release: Provides compatibility with Internet Explorer 9\/10.  Developing and delivering PRMS 2.1.8 web services to enable net-centric capability exposing data to joint users and to support future PR Mission Manager (PRMM) development.  Developing and delivering PRMM initial capability, Search Widgets: Provides the capability to query the PRMS\/Joint SARSAT Electronic Tracking System (JSETS) database without logging into the PRMS website.  Search Widgets also provide advanced search definitions not available via the PRMS website.  Continue developing PRMM Capability Mission Folders: Allows for management and storage of all PR incident information in a single case file."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.216"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.216"
                                            },
                                            "Text": {
                                                "val": "PRMS 3.1.0 development will continue in FY15.  This will normalize the PRMS database and will provide an increased net-centric capability while reducing lifecycle costs.  PRMS 3.2.0 virtualization development will continue in FY15.  Virtualization will provide increased availability and more robust security while decreasing sustainment costs.  Will continue to develop PRMS 3.3.0 Mission Folders.  Will develop PRMS 4.0 Mission Manager creating a collaborative environment for the Joint Personnel Recovery Coordinator (JPRC)\/Personnel Recovery Coordinator Cell to access situational awareness data to recover isolated personnel.  This will provide situational awareness including geo-spatial visualization of IP location, weather, threat environment, airspace, and Air Tasking Order data."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Description": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.100"
                                            },
                                            "Text": {
                                                "val": "Continuing Test and Evaluation focusing on testing activities to integrate PRMS Inc 2 capabilities to include web-services and PR Search Widget. Bringing test suites up to PRMS 2.1.8 baseline.  Follow on activities focusing on finalizing test documentation to support the development of Mission Manager in the Joint environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.200"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.200"
                                            },
                                            "Text": {
                                                "val": "Continuing Test and Evaluation will focus on test activities to field 3.1.0 Tech Refresh, 3.2.0 Virtualization, and 3.3.0 Mission Folder capability.  Follow on activities will focus on finalizing test documentation to support the development of Mission Manager in the Joint environment"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPAF: BA03: Line Item # 834520"
                                    },
                                    "Title": {
                                        "val": "Theater Battle Management C2 System"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "1.240"
                                        },
                                        "BudgetYearOne": {
                                            "val": "1.261"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1.261"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "1.270"
                                        },
                                        "BudgetYearThree": {
                                            "val": "1.279"
                                        },
                                        "BudgetYearFour": {
                                            "val": "1.302"
                                        },
                                        "BudgetYearFive": {
                                            "val": "1.325"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Projects will be awarded following full and open competition and will use an evolutionary acquisition strategy based on incremental development."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0207410F_BPAC_675221_0.jpg"
                                }
                            }
                        ]
                    }
                }
            ]
        }
    }
}