{
    "id": "7d629b8e006cd3440153c63d3ce79ffcd461f85e",
    "meta": {
        "filename": "dod-2015_RDTE_2015_TJS_RDTE_JustificationBook_The_Joint_Staff_PB_2015.zzz_unzipped_RDTE_JustificationBook_The_Joint_Staff_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "The Joint Staff",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0604787J"
        },
        "ProgramElementTitle": {
            "val": "Joint Systems Integration"
        },
        "R1LineNumber": {
            "val": "107"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "The Joint Staff"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "3.230"
            },
            "CurrentYear": {
                "val": "7.402"
            },
            "BudgetYearOne": {
                "val": "7.002"
            },
            "BudgetYearOneBase": {
                "val": "7.002"
            },
            "BudgetYearTwo": {
                "val": "6.839"
            },
            "BudgetYearThree": {
                "val": "6.938"
            },
            "BudgetYearFour": {
                "val": "7.086"
            },
            "BudgetYearFive": {
                "val": "7.086"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "3.273"
                },
                "CurrentYear": {
                    "val": "7.402"
                },
                "BudgetYearOne": {
                    "val": "7.009"
                },
                "BudgetYearOneBase": {
                    "val": "7.009"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "3.230"
                },
                "CurrentYear": {
                    "val": "7.402"
                },
                "BudgetYearOne": {
                    "val": "7.002"
                },
                "BudgetYearOneBase": {
                    "val": "7.002"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.043"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.007"
                },
                "BudgetYearOneBase": {
                    "val": "-0.007"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.043"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Change"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.007"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.007"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Additional resources allocated to support mission requirements that transitioned to the Joint Staff after U.S. Joint Forces Command (JFCOM) disestablishment.\n\nFY 2014 Changes:\n\nIn FY 2014, funding transferred out of TJS O&M account to RDT&E to more appropriately fund the Joint Systems Integration mission to conduct interoperability assessments and develop solutions to improve integration of Services, Defense Agencies, and coalition Command, Control, Communication, and Computer (C4) systems."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P787"
                    },
                    "ProjectTitle": {
                        "val": "Joint Systems Integration"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "3.230"
                        },
                        "CurrentYear": {
                            "val": "7.402"
                        },
                        "BudgetYearOne": {
                            "val": "7.002"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.002"
                        },
                        "BudgetYearTwo": {
                            "val": "6.839"
                        },
                        "BudgetYearThree": {
                            "val": "6.938"
                        },
                        "BudgetYearFour": {
                            "val": "7.086"
                        },
                        "BudgetYearFive": {
                            "val": "7.086"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "In support of the Chairman’s responsibility for the assessment of the capability and adequacy of United States forces to successfully execute the National Military Strategy, the Joint Systems Integration (JSI) Program Element provides mission funding for the Joint Staff Command, Control, Communications, and Computers (C4) directorate (J6) to conduct interoperability assessments, and develop solutions\/recommendations to improve integration of Service, Defense Agency, and coalition systems. \n\nC4 Assessments performed in the Persistent Command and Control Environment replicate an operational environment and provides Combatant Commands, Services, Agencies and Coalition partners at the joint force headquarters level, a laboratory and assessment venue for the warfighter and capability developer to identify and solve interoperability and integration issues with current and near-term joint and coalition capabilities.  This capability assesses system of systems interoperability, operational capability, procedural compliance, and technical suitability of emerging and existing systems and programs to confirm readiness for deployment.  \n\nBy establishing ground truth for interoperability and suggesting remedies for demonstrated shortfalls, C4 Assessments is an enabler for the Chairman’s priorities to:  pioneer new ways to combine and employ emergent capabilities, drive jointness deeper, sooner in-capability development, move quickly toward joint information and simulation networks that support secure and agile command and control, expand the envelope of interagency and international cooperation, and promote multilateral security approaches and architectures."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Interoperability Assessments (IA) and Interoperability Technology Demonstration Center (ITDC)"
                                    },
                                    "Description": {
                                        "val": "Primary outcome for this effort is seamless interoperability between DoD and coalition C2 systems supporting the warfighter.  IA supports the interoperability assessment of systems in five categories: operational, system of systems, technical, software, and procedural. These assessments provide supporting justification for continued development of a program within the acquisition system and resolve capability shortfalls of fielded systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.233"
                                            },
                                            "Text": {
                                                "val": "(1) Continued the efforts initiated for FY 2012 and responded to unpredictable operational issues and shortfalls. Interoperability assessments were conducted to solve warfighter problems, including coalition challenges.  FY 2013 assessment objectives were focused on: Information Sharing Capabilities, Intelligence support to Command and Control, Joint Fires Capabilities, Data Strategy Implementation, Tactical Edge Integration, and Cyberspace.\n  \n(2) Afghanistan Mission Network (AMN) Coalition Interoperability Assurance Validation (CIAV) Assessments – AMN is the primary Coalition, Command, Control and Communication and Computer, Intelligence, Surveillance, and Reconnaissance (C5ISR) network for International Security Assistance Forces (ISAF) in Afghanistan.  C4AD is supporting the assessment of Coalition Mission Threads (CMTs) and Coalition Tactics, Techniques and Procedures (CTTPs) to identify and correct ISAF interoperability problems.  FY 2013 AMN mission areas included:  Joint ISR, Battlespace Management, and Service Management.\n\n(3) Bold Quest 2013 (BQ13) Technical Support and Interoperability Assessments – Assessed interoperability and documented identified deficiencies of select systems during BQ13 operational venues.\n  \n(4) Joint Fires Support Joint Mission Thread (JFS JMT) – Assessed and documented deficiencies in the operational fire support system interoperability matrix.  Fire support systems evaluated include: Advanced Field Artillery Tactical Data System (AFATDS),  Distributed Command Ground Station (DCGS), Joint Automated Deep Operations Coordination System (JADOCS), Theater Battle Management Core System (TBMCS), and Joint Targeting Tool-Kit (JTT).\n\n(5) Unified Cross Domain Management Office (UCDMO) Enterprise Cross Domain Solutions (ECDS) Owl File Transfer Interoperability Assessment – Conducted a capability assessment of the Owl Enterprise Cross Domain Solution, measuring the functional strengths and weaknesses against UCDMO prescribed criteria.\n\n(6) Coalition Warrior Interoperability Experiment (CWIX) 2013 Interoperability Assessments – Conducted interoperability assessments between selected systems within the following mission areas; Coalition Fires, Coalition Intelligence, Surveillance, Reconnaissance (ISR), and Coalition Ballistic Missile Defense during the Coalition Warrior Interoperability Exercise (CWIX) event.\n\n(7) Joint Cross Domain eXchange (JCDX) Interoperability Assessment – Assessed JCDX, a multi-level security capability, designed to exchange the common operational picture and support record\/tactical communications between U.S. and Coalition forces.\n\n(8) NATO Modeling & Simulation Centre of Excellence (M&S COE) – U.S. Command and Control Interoperability Assessment – Assessed the exchange of C2 data between the U.S. Global Command and Control System Joint (GCCS-J) and the Italian Sistema Automatizzato di Commando e Controllo (SIACCON) system.  SIACCON is a distributed C2 system that provides battle management support across a range of functions for the Italian Army.\n\n(9) Automated NATO Database Interface (ANDI) Interoperability Assessment – Assessed data transfer functions between Global Command and Control System-Joint (GCCS-J) targeting application and the NATO Integrated Command and Control (ICC) system.\n\n(10) JC2 Map-based Adaptive Planning Course of Action Tool (MAPCAT) Technical and Operational Assessment – Assessed MAPCAT using USEUCOM and service components to determine the operational value of the system. \n\n(11) Network Effects Emulation System Technical Assessment (NE2S TA) – Conducted a technical assessment of NE2S to validate functionality and performance.\n\n(12) Mission Partner Environment (MPE) Joining, Membership and Exit Instructions (JMEI) Assessments – Assessed baseline group of JMEI templates during Exercise Combined Endeavor."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.894"
                                            },
                                            "Text": {
                                                "val": "(1) Continue the efforts initiated for FY 2013 and respond to unpredictable operational issues and shortfalls.  Interoperability assessments will be conducted to solve warfighter problems, including coalition challenges.  FY 2014 assessment objectives are focused on: Cyberspace, Mission Partner Environment, Common Operational Picture, Wireless to the Tactical Edge, Joint Fires Capabilities, Data Strategy Implementation, and Information Sharing Capabilities.\n  \n(2) Afghanistan Mission Network (AMN) Coalition Interoperability Assurance Validation (CIAV) Transition and Assessments – AMN is the primary Coalition, Command, Control and Communications and Computers, Intelligence, Surveillance, and Reconnaissance (C5ISR) network for International Security Assistance Forces (ISAF) in Afghanistan.  C4AD is supporting the assessment of Coalition Mission Threads (CMTs) and Coalition Tactics, Techniques and Procedures (CTTPs) to identify and correct interoperability problems.\n  \n(3) Bold Quest 2014 (BQ14) Technical Support and Interoperability Assessments – Assess interoperability and document identified deficiencies of select systems within the joint fires mission thread during BQ14 operational venues.\n\n(4) Digitally-Aided Joint Fires Support and Assessment – Assess the implementation of various messaging standards for Close Air Support (CAS) mission execution.\n\n(5) Coalition Interoperability Assessments – Conduct interoperability assessments between selected systems during the Coalition Warrior Interoperability Experiment (CWIX) 2014 event.\n\n(6) Deliberate and Dynamic Targeting Interoperability Assessment – Assess the system interoperability of selected systems during Exercise Terminal Fury 2014.\n\n(7) C4-Intelligence, Surveillance, Reconnaissance (C4ISR) Interoperability Assessments – Assess interoperability of Service systems to Global Command and Control System-Joint (GCCS-J).\n\t\n(8) Unified Cross Domain Management Office (UCDMO) Enterprise Cross Domain Solutions (ECDS) Capability Assessment – Conduct a capability assessment of the specified ECDS, measuring the functional strengths and weaknesses against UCDMO prescribed criteria.\n\n(9) Mission Partner Environment (MPE) U.S. Development and Assessment and Federated Mission Networking (FMN) Development and Support – Provide interoperability assessments of selected U.S. and Coalition systems.\n\n(10) Network Integration Evaluation (NIE) Interoperability Assessment – Assess potential networked and non-networked capabilities in a robust operational environment.\n\n(11) Tactical Infrastructure Enterprise Services (TIES) Coalition Warfare Program (CWP) Interoperability Assessments – Assess the capability of sharing data from authoritative data sources using web services in a C2 Core conformant, standardized data format.\n\n(12) Distributed Common Ground System-Army (DCGS-A) Interoperability Assessment – Assess DCGS-A v3.1.7 (3.2x) interface to the Modernized Integrated Database (MIDB)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.738"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.738"
                                            },
                                            "Text": {
                                                "val": "Continue the efforts initiated for FY 2014 and respond to unpredictable operational issues and shortfalls.  Interoperability assessments will be conducted to solve warfighter problems, including coalition challenges.  FY 2015 assessment objectives remain focused on: Cyberspace, Mission Partner Environment, Common Operational Picture, Wireless to the Tactical Edge, Joint Fires Capabilities, Data Strategy Implementation, and Information Sharing Capabilities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Technical Assessments and Integration (TA&I)"
                                    },
                                    "Description": {
                                        "val": "Primary Outcome (objective) for this effort is near-term technical solutions for integration, assessment, and delivery of operational capabilities that address near-term operational and tactical requirements.  TA&I use organic laboratory resources, equipment, and technical personnel to integrate emerging technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.080"
                                            },
                                            "Text": {
                                                "val": "(1) Continued initiatives investigating technology advances in wireless devices, mesh and ad-hoc networking, satellite modem technology, and small lightweight secure digital capabilities on warfighter command and control capabilities to match emerging critical warfighter requirements with the technologies to identify near-term solutions supporting Combatant Commanders.  Areas of concentration included Tactical Edge Integration and Joint Command and Control Capabilities.\n\n(2) Celestial Reach Joint Capability Technical Demonstration (JCTD) Assessment – Integrated a wide-band antenna solution for joint air, ground, and maritime operations and assessed the capability’s utility in providing wide-band communications that support Command and Control (C2) and Intelligence Surveillance and Reconnaissance (ISR) applications to enroute users.\n\n(3) National Security Agency (NSA) Commercial Solutions for Classified (CSfC) Secure Wireless Local Area Network (SWLAN) Integration Assessment – Assisted NSA in the development and assessment of a Suite B software encryption solution. This capability supported communicating over SECRET wireless networks without using Type-1 hardware solutions (e.g., SecNet 54, Talon, or KG-250s).\n\n(4) Air\/Event Information Sharing Service (A\/EISS) Integration Assessment – Integrated an automated data handling capability that fuses and shares decision support data from national level authoritative sources enabling senior decision makers to make time-critical decisions during air events over North America via desktop or mobile devices.\n\n(5) C2 Applications over Broadband Cellular (C2 ABC) Integration and Assessment – Integrated and assessed emerging C2 and tailored applications using broadband cellular technologies to provide the warfighter at the tactical edge with expanded situational awareness.\n\n(6) Joint Operational Long Term Evolution Deployable (JOLTED) Tactical Cellular System (TACTICS) Integration Project – JOLTED TACTICS is an Internet Protocol (IP) based system designed to provide robust communications to tactical users.  This system leverages innovations in Fourth Generation (4G) LTE Cellular technologies and mobile Ka band spread spectrum satellite communications to deliver megabits of data to mobile and dismounted teams armed with mobile devices such as smartphones or netbooks.\n\n(7) Tactical Mobility Security Integration and Assessment (TMSIA) Spiral II – Integrated in partnership with the National Security Agency a security architecture for lightweight, man-portable communications-on-demand packages that allow the user to quickly establish secure 4G cellular wireless networks."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.429"
                                            },
                                            "Text": {
                                                "val": "(1) Continue FY 2013 initiatives investigating impacts of technology advances in wireless devices, mesh and ad-hoc networking, satellite modem technology, and small lightweight secure digital capabilities on warfighter command and control capabilities and match emerging critical warfighter requirements with the technologies to identify near-term technology solutions supporting Combatant Commanders.  Areas of concentration include Wireless to the Tactical Edge Integration, Cyberspace, and Common Operational Picture.\n\n(2) Joint Operational Long Term Evolution Deployable (JOLTED) Tactical Cellular System (TACTICS) Joint Capability Technical Demonstration (JCTD) - Technical Manager – JOLTED TACTICS is an Internet Protocol (IP) based system designed to provide robust communications to tactical users.  This system leverages innovations in Fourth Generation (4G) LTE Cellular technologies and mobile Ka band spread spectrum satellite communications to deliver megabits of data to mobile and dismounted teams armed with mobile devices such as smartphones or netbooks.\n\n(3) C2 Applications over Broadband Cellular (C2 ABC) Integration and Assessment – Integrate and assess emerging C2 and tailored applications using broadband cellular technologies to provide the warfighter at the tactical edge with expanded situational awareness.\n\n(4) Celestial Reach Joint Capability Technical Demonstration (JCTD) Assessment – Continue integrating a wide-band antenna solution for joint air, ground, and maritime operations and assessing the capability’s utility in providing wide-band communications that support Command and Control (C2) and Intelligence Surveillance and Reconnaissance (ISR) applications to enroute users.\n\n(5) National Security Agency (NSA) Commercial Solutions for Classified (CSfC) Secure Wireless Local Area Network (SWLAN) Integration Assessment – Continue assisting NSA in the development and assessment of a Suite B software encryption solution. This capability supports communicating over SECRET wireless networks without using Type-1 hardware solutions (e.g., SecNet 54, Talon, or KG-250s).\n\n(6) Tactical Mobility Security Integration and Assessment (TMSIA) Spiral II – Continue integrating in partnership with the National Security Agency a security architecture for lightweight, man-portable communications-on-demand packages that allow the user to quickly establish secure 4G cellular wireless networks.\n\n(7) Broad Band Cellular System Integration (B2CI) – Integrate cellular technologies with mobile Ka band spread spectrum satellite communications to deliver megabits of data to dismounted users equipped with mobile devices such as smartphones or netbooks."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.297"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.297"
                                            },
                                            "Text": {
                                                "val": "Continue FY 2014 initiatives investigating impacts of technology advances in wireless devices, mesh and ad-hoc networking, satellite modem technology, and small lightweight secure digital capabilities on warfighter command and control capabilities to match emerging critical warfighter requirements with the technologies to identify near-term technology solutions supporting Combatant Commanders.  Areas of concentration include Wireless to the Tactical Edge Integration and Common Operational Picture."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Persistent Command and Control Environment"
                                    },
                                    "Description": {
                                        "val": "The persistent command and control environment provides a reconfigurable Joint Task Force national and coalition laboratory that supports the rapid assessment and integration of existing and emerging C4 capabilities.  It is a venue for the Department and allied partners to collaborately assess capability and interoperability of current and future warfighting systems and when connected with other joint service agencies and coalition laboratories provides a robust and tailorable system of systems assessment and engineering environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.917"
                                            },
                                            "Text": {
                                                "val": "Continued initiatives by engaging the Services and Communities of Interest (COI) to leverage the capabilities of the Persistent Command and Control Environment by bringing joint solutions through C4AD's integration and operational assessment process.  Also continue to expand existing relationships with Service and Coalition laboratory and engineering organizations.\n\nCyber Assessment Event Number 1 – Provided a command and control node within an Enterprise Cyber Range Environment (ECRE) to facilitate replication of Joint C2 events for assessment of C2 system vulnerabilities to red team exploitation and improvement of blue team responses.\n\nC4AD Project Engineering Support – Provided infrastructure, communications, network, information assurance, security, and engineering support as required."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.079"
                                            },
                                            "Text": {
                                                "val": "(1) Continue FY 2013 initiatives by engaging the Services and Communities of Interest (COI) to leverage the capabilities of the Persistent Command and Control Environment by bringing joint solutions through C4AD's integration and operational assessment process.  Provide a comprehensive Joint Task Force (JTF) environment required to also support cyber training, cyber capability development, and cyber assessment by expanding the connectivity and capability of the existing persistent environment to support the Enterprise Cyber Range Environment (ECRE) focused on user requirements, architectures, standards, measures, metrics, instrumentation, and data collection requirements. \n\n(2) C4AD Project Engineering Support – Provide infrastructure, communications, network, information assurance, security, and engineering support as required.\n\n(3) Cyber Assessment Event Number 1 – Continue providing a representative Joint Task Force (JTF) Headquarters node within the Enterprise Cyber Range Environment (ECRE) to assess C2 system vulnerabilities to red team exploitation and improve blue team responses.\n\n(4) Cyber Assessment Event Numbers 2-5 – Provide a representative Joint Task Force (JTF) Headquarters node within the Enterprise Cyber Range Environment (ECRE) to assess C2 system vulnerabilities to red team exploitation and improve blue team responses."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.967"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.967"
                                            },
                                            "Text": {
                                                "val": "Continue FY 2014 initiatives by engaging the Services and Communities of Interest (COI) to leverage the capabilities of the Persistent Command and Control Environment by bringing joint solutions through C4AD's integration and operational assessment process.  Provide a comprehensive Joint Task Force (JTF) environment required to also support cyber training, cyber capability development, and cyber assessment by expanding the connectivity and capability of the existing persistent environment to support the Enterprise Cyber Range Environment (ECRE) focused on user requirements, architectures, standards, measures, metrics, instrumentation, and data collection requirements."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "C4AD supports interoperability of systems selected for acquisition, integration and fielding.  C4AD is a forcing function to discover and provide interoperable joint solutions as a means to foster rapid, near-term insertion of command and control and cyber technology by promoting the ability to meet the DoD direction for spiral development and evolutionary acquisition.  Services and Defense Agencies are responsible for conducting acquisition activities in Programs of Record (POR)."
                        },
                        "PerformanceMetrics": {
                            "val": "FY 2013 Strategic Goals Supported:  Chairman’s Priorities to “Achieve our National Objectives in our Current Conflicts and Develop Joint Force 2020”:\n\n(1) Drove resolution of C4 interoperability problems with actionable recommendations stemming from technical and operational assessments of existing and emerging C4 capabilities. \n(2) Integrated and assessed technical solutions that provide gap-filling capabilities to satisfy near-term operational requirements.\n(3) Replicated an operational Joint Task Force Headquarters Environment to support interoperability, cybersecurity, and integration assessments.\n(4) Achieved planned body of work in support of the Chairman’s priorities in a fiscally constrained environment."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "General\/Contractor Engineering Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "General Dynamics"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Hampton Roads, VA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.297"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "4.102"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.384"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.384"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Government Engineering Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various DoD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various DoD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.392"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.700"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.935"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.935"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Travel"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various DoD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various DoD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.134"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.300"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.134"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.134"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Government Communications Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various DoD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various DoD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.252"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.300"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.332"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.332"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "PC4 Environment\/Laboratories"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.155"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.217"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.217"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}