{
    "id": "7e2b599e499da8794d58a7236eb44fab50d6a9fd",
    "meta": {
        "filename": "dod-2015_RDTE_2015_OSD_RDTE_JustificationBook_Office_of_Secretary_Of_Defense_PB_2015.zzz_unzipped_RDTE_JustificationBook_Office_of_Secretary_Of_Defense_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0603225D8Z"
        },
        "ProgramElementTitle": {
            "val": "Joint DOD\/DOE Munitions Technology Development"
        },
        "R1LineNumber": {
            "val": "37"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "19.538"
            },
            "PriorYear": {
                "val": "17.828"
            },
            "CurrentYear": {
                "val": "19.292"
            },
            "BudgetYearOne": {
                "val": "19.335"
            },
            "BudgetYearOneBase": {
                "val": "19.335"
            },
            "BudgetYearTwo": {
                "val": "19.514"
            },
            "BudgetYearThree": {
                "val": "19.634"
            },
            "BudgetYearFour": {
                "val": "19.707"
            },
            "BudgetYearFive": {
                "val": "19.858"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The mission of the Joint Department of Defense (DoD)\/Department of Energy (DOE) Munitions Technology Development Program (JMP) is to develop new and innovative warhead, explosive, fuzing, and lifecycle technologies and modeling tools to enable major improvements in conventional munitions.  The JMP supports the development and exploration of advanced munitions concepts and enabling technologies that precede Service-specific system engineering.  A Memorandum of Understanding signed in 1985 by DoD and DOE provides the basis for the cooperative effort and for cost-sharing the long-term commitment to this effort.  The DoD funds budgeted in this justification are matched dollar for dollar by DOE funds.  Through this interdepartmental cooperation, DoD’s relatively small annual investment leverages DOE’s substantial investments in intellectual capital and highly specialized skills, advanced scientific equipment and facilities, and computational tools not available within DoD.  Under the auspices of the JMP, the integration of DOE technologies with Joint and Individual Services’ needs has provided major advances in warfighting capabilities over many years and continues to play a crucial role in the exploration, development, and transition of new technologies needed by the Services.\n\nThe JMP seeks to develop:  improved modeling and simulation tools for munitions design and evaluation, including evaluation of vulnerability (for example: design of insensitive munitions (IM)); novel experimental techniques and material property databases to support modeling and simulation and materials characterizations; higher power and safer energetic materials (EMs)(e.g., explosives and propellants); miniaturized, lower-cost, and higher reliability fuzes, initiators, power systems, and sensors; design tools to enable development of higher performance warheads and weapons—such as penetrators—that are hardened against high impact loads; and tools to assess the health and reliability of the munitions stockpile and predict lifetimes based on these assessments.\n\nThe JMP is aligned with Department strategic plans and policies such as:\n\n•\tAdvancing munitions for contingency operations, particularly for the reduction of unintended collateral effects.\n•\tReducing time and cost for acquisition of munitions.\n•\tRapidly transitioning science and technology (S&T) to support the warfighter in today’s conflicts.\n•\tEstablishing future core capabilities and maintaining our national S&T capabilities through joint investment and interagency cooperation and teaming.\n•\tAiding in recruiting and retaining high-caliber scientists and engineers at DoD S&T organizations.\n•\tDeveloping advanced munitions technologies to support the increased role of conventional weapons to deter and respond to non-nuclear attack, as described in the Nuclear Posture Review report.\n•\tDeveloping safer munitions that are compliant with IM standards to meet statutory and Department policy requirements.\n\nThe JMP has established a successful collaborative community of DoD and DOE scientists and engineers. This community develops technologies of interest to both Departments within a structured framework of technical reviews and scheduled milestones.  The JMP is administered and monitored by the Office of the Secretary of Defense (OSD) and reviewed annually by the Technical Advisory Committee (TAC), which is comprised of over 25 senior executives from the Army, Navy, Air Force, Special Operations Command, the Defense Threat Reduction Agency, OSD, and DOE.  Projects are organized in eight Technology Coordinating Groups (TCG) that bring together the disciplines necessary to properly evaluate technical content, relevance, and progress.  The TCGs conduct semi-annual technical peer reviews of JMP projects and plans.  DoD Service laboratory technical experts lead each of the TCGs to ensure that the technologies under development address high-priority DoD needs.  The JMP also promotes more in-depth technical exchange via short-term visiting scientist and engineer assignments at both the DOE and the DoD laboratories.\n\nThe JMP has a long history of successful transitions and significant Return on Investment (ROI).\n\n•\tThe JMP is the primary provider of high performance, physics-based, structural mechanics computer codes used by DoD.  The Department expects this heavy reliance on DOE codes to grow for several reasons including: preference for using DOE codes because they are export-controlled; DOE codes are scalable, incorporate multiphysics modules, run on massively parallel computer systems, and the Department can obtain source codes to modify the tools for individual Service needs.  According to the FY 2014 High Performance Computing Modernization Program (HPCMP) Requirements Analysis Report, the DOE computer codes are used for over 82 percent of all (classified and unclassified) structural mechanics simulations and for virtually all of the classified calculations run by DoD on HPCMP platforms.  The CPU (central processing unit) hours for CTH alone grew by eight fold between FY12 to FY14 (from 63 million CPU hours to 584 CPU hours).\n•\tA significant number of defense industrial contractors also use the DOE structural mechanics computer codes.\n•\tCheetah, a standalone thermochemical computer code, is the most widely used code by DoD and defense contractors for predicting performance of energetic materials.\n•\tThe Army Research & Engineering Development Center (ARDEC) has stated that the DOE computer codes are now routinely used to design all new warheads.  The use of these tools has reduced the number of validation tests required for each new warhead from about five to one with concomitant cost and time savings.  For example, DOE codes were used to analyze the fusible plug for Excalibur, saving the department close to $2 million dollars.\n•\tThe Army Research Laboratory has used DOE computer codes to develop and deploy new armor solutions to Iraq and Afghanistan with unprecedented speed.\n•\tNew munitions’ case material and explosive fill technologies provide the warfighter with a lethal and low collateral damage capability.  These technologies have been transitioned to the Focused Lethality Munition variant of the Small Diameter Bomb, which is currently fielded.  The technologies are also the basis for a new GBU 129 weapon that is currently under rapid development to meet a Joint Urgent Operational Need requirement for a low-collateral Mk-82 class weapon.\n•\tThe Joint Improvised Explosive Device Defeat Organization (JIEDDO) has supported applications of JMP technologies, including:  new compact, lightweight synthetic aperture radar (SAR) systems for counter-Improvised Explosive Device (IED) efforts; pre-deployment training of military personnel by DOE explosive experts on how to recognize feed stocks and processes for homemade explosives; and use of massively parallel, multiphysics computer codes to understand how explosive blast waves cause brain injury and how to mitigate these injuries.\n•\tAn erosive initiator technology developed under the JMP has been transitioned to the Services for use in selectable output weapons and self-destruct capabilities.\n•\tA novel approach to controlling the sensitivity and therefore the initiability of explosives using microwave energy, as well two new, insensitive energetic materials have transitioned to development projects in the Joint IM Technology and Joint Fuze Technology Programs.\n•\tReliability analysis tools were used by Army Missile Command to assess Rolling Airframe Missile (RAM), Advanced Medium Range Air to Air Missile (AMRAAM), and Tube-launched, Optically-tracked, Wire command data-linked guided Missile (TOW).\n•\tRobotic demilitarization processing systems were installed at several locations, including a system at Hawthorne Army Depot, to recover copper shape charge liners, Comp A5, and grenade bodies.\n\nThe JMP works with the Defense Ordnance Technology Consortium (DOTC) and the National Warheads and Energetics Consortium (NWEC) of industrial suppliers to equitably and efficiently transition JMP technologies to defense industrial contractors. In addition to the computer codes mentioned earlier, the JMP has transitioned case technology for low-collateral weapons, low-temperature co-fired ceramic technology for smaller, less expensive fuze electronic components, and erosive initiator technology for selectable effects weapons to defense industrial suppliers.\n\nThe integrated DoD and DOE efforts within the JMP are transitioning new munitions’ technologies to the Department and the defense industrial base through the advanced development process. The JMP is a focal point for collaborative work by nearly 300 DoD and DOE scientists and engineers. Executive and technical leaders from both Departments consider the JMP a model of cooperation, both within their respective departments and between departments. The highly challenging technical objectives of the approximately 35 JMP projects require multi-year efforts and sustained, long-term investments to achieve success.\n\nThe JMP projects are divided into five technical focus areas: Computational Mechanics and Material Modeling; Energetic Materials; Initiators, Fuzes, and Sensors; Warhead and Penetration Technology; and Munitions Lifecycle Technologies."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "20.032"
                },
                "CurrentYear": {
                    "val": "19.305"
                },
                "BudgetYearOne": {
                    "val": "20.628"
                },
                "BudgetYearOneBase": {
                    "val": "20.628"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "17.828"
                },
                "CurrentYear": {
                    "val": "19.292"
                },
                "BudgetYearOne": {
                    "val": "19.335"
                },
                "BudgetYearOneBase": {
                    "val": "19.335"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.204"
                },
                "CurrentYear": {
                    "val": "-0.013"
                },
                "BudgetYearOne": {
                    "val": "-1.293"
                },
                "BudgetYearOneBase": {
                    "val": "-1.293"
                }
            },
            "AdjustmentDetails": {
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "-1.621"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "-0.026"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.557"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Strategic Efficiency Savings"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-1.293"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.293"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC Adjustments"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "-0.013"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The reduction is a strategic efficiency approach to reduce funding and staffing.  As a result, we provide a better alignment of funding and provide support to a smaller military force."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P225"
                    },
                    "ProjectTitle": {
                        "val": "Joint DOD\/DOE Munitions"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "19.538"
                        },
                        "PriorYear": {
                            "val": "17.828"
                        },
                        "CurrentYear": {
                            "val": "19.292"
                        },
                        "BudgetYearOne": {
                            "val": "19.335"
                        },
                        "BudgetYearOneBase": {
                            "val": "19.335"
                        },
                        "BudgetYearTwo": {
                            "val": "19.514"
                        },
                        "BudgetYearThree": {
                            "val": "19.634"
                        },
                        "BudgetYearFour": {
                            "val": "19.707"
                        },
                        "BudgetYearFive": {
                            "val": "19.858"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The mission of the Department of Defense (DoD)\/Department of Energy (DOE) Joint Munitions Technology Development Program (JMP) is to develop new and innovative warhead, explosive, fuzing, and lifecycle technologies and tools to enable major improvements in conventional munitions.  The JMP supports the development and exploration of advanced munitions concepts and enabling technologies that precede Service-specific system engineering.  A Memorandum of Understanding signed in 1985 by DoD and DOE provides the basis for the cooperative effort and for cost-sharing the long-term commitment to this effort.  The JMP funds budgeted in this justification are matched dollar for dollar by DOE funds.  Through this interdepartmental cooperation, DoD’s relatively small investment leverages DOE’s substantial investments in intellectual capital and highly specialized skills, advanced scientific equipment and facilities, and computational tools not available within DoD.  Under the auspices of the JMP, the integration of DOE technologies with Joint and Individual Services’ needs has provided major advances in warfighting capabilities over many years and continues to play a crucial role in the exploration, development, and transition of new technologies needed by the Services.\n\nThe JMP seeks to develop: improved modeling and simulation tools for munitions design and evaluation, including evaluation of vulnerability (for example:  design of insensitive munitions (IM)); novel experimental techniques and material property databases to support modeling and simulation; higher power and safer explosives and propellants; miniaturized, lower-cost, and higher reliability fuzes, initiators, power systems, and sensors; design tools to enable development of higher performance warheads and weapons—such as penetrators—that are hardened against high impact loads; and tools to assess the health and reliability of the munitions stockpile and predict lifetimes based on these assessments.\n\nThe JMP is aligned with Department strategic plans and policies such as:\n\n– Munitions for contingency operations, particularly for the reduction of unintended collateral effects.\n– Reducing time and cost for acquisition of munitions.\n– Rapidly transitioning science and technology (S&T) to support the warfighter in today’s conflicts.\n– Establishing future core capabilities and maintaining our national S&T capabilities through joint investment and interagency cooperation and teaming.\n– Aiding in recruiting and retaining high-caliber scientists and engineers at DoD S&T organizations.\n– Developing advanced munitions technologies to support the increased role of conventional weapons to deter and respond to non-nuclear attack, as described in the Nuclear Posture Review report.\n– Developing safer munitions that are compliant with IM standards to meet statutory and Department policy requirements.\n\nThe JMP has established a successful collaborative community of DoD and DOE scientists and engineers.  This community develops technologies of interest to both Departments within a structured framework of technical reviews and scheduled milestones.  The JMP is administered and monitored by the Office of the Secretary of Defense (OSD) and reviewed annually by the Technical Advisory Committee (TAC), which is comprised of over 25 senior executives from the Army, Navy, Air Force, Special Operations Command, the Defense Threat Reduction Agency, OSD, and DOE.  Projects are organized in eight Technology Coordinating Groups (TCG) that bring together the disciplines necessary to properly evaluate technical content, relevance, and progress.  The TCG conduct semi-annual technical peer reviews of JMP projects and plans. DoD Service laboratory technical experts lead each of the TCG to ensure that the technologies under development address high-priority DoD needs.  The JMP also promotes more in-depth technical exchange via short-term visiting scientist and engineer assignments at both the DOE and the DoD laboratories.\n\nThe JMP has a long history of successful transitions and significant Return on Investment (ROI).\n\n– The JMP is the primary provider of high performance structural mechanics computer codes used by DoD.  According to the FY 2010 High Performance Computing Modernization Program (HPCMP) Requirements Analysis Report, the DOE computer codes are used for over 70 percent of all (classified and unclassified) structural mechanics simulations and for virtually all of the classified calculations run by DoD on HPCMP platforms.  The Department expects this heavy reliance on DOE codes to grow for several reasons including: preference for using DOE codes because they are export-controlled; DOE codes are scalable, incorporate multiphysics, and run on massively parallel computer systems; and the Department can obtain source codes to modify for individual Service needs.\n– A significant number of defense industrial contractors also use the DOE structural mechanics computer codes.\n– CHEETAH, a standalone thermochemical computer code, is the most widely used code by DoD and defense contractors for predicting performance of energetic materials.\n– The Army Armament Research, Development & Engineering Center (ARDEC) has stated that the DOE computer codes are now routinely used to design all new warheads. The use of these tools has reduced the number of validation tests required for each new warhead from about five to one with concomitant cost and time savings.\n– The Army Research Laboratory has used DOE computer codes to develop and deploy new armor solutions to Iraq and Afghanistan with unprecedented speed.\n– New munitions’ case material and explosive fill technologies provide the warfighter with a lethal and low collateral damage capability.  These technologies have been transitioned to the Focused Lethality Munition variant of the Small Diameter Bomb, which is currently fielded.  The technologies are also the basis for a new GBU 129 weapon that is currently under rapid development to meet a Joint Urgent Operational Need requirement for a low-collateral Mk-82 class weapon.\n– The Joint Improvised Explosive Device Defeat Organization (JIEDDO) has supported applications of JMP technologies, including: compact synthetic aperture radar (SAR) systems for counter-Improvised Explosive Device (IED) efforts; pre-deployment training of military personnel by DOE explosive experts on how to recognize feed stocks and processes for homemade explosives; and use of massively parallel, multiphysics computer codes to understand how explosive blast waves cause brain injury and how to mitigate these injuries.\n– An erosive initiator technology developed under the JMP has been transitioned to the Services for use in selectable output weapons and self-destruct capabilities.\n– A novel approach to controlling the sensitivity and therefore the initiability of explosives using microwave energy, as well two new, insensitive energetic materials have transitioned to development projects in the Joint IM Technology and Joint Fuze Technology Programs.\n– Reliability analysis tools were used by Army Missile Command to assess Rolling Airframe Missile (RAM), Advanced Medium Range Air to Air Missile (AMRAAM), and Tube-launched, Optically-tracked, Wire command data-linked guided Missile (TOW).\n– Robotic demilitarization processing systems were installed at several locations, including a system at Hawthorne Army Depot to recover copper shape charge liners, Comp A5, and grenade bodies. \n\nThe JMP also works with the Defense Ordnance Technology Consortium (DOTC) and the National Armaments Consortium (NAC) of industrial suppliers to equitably and efficiently transition JMP technologies to defense industrial contractors.  In addition to the computer codes mentioned earlier, the JMP has transitioned case technology for low-collateral weapons, low-temperature co-fired ceramic technology for smaller, less expensive fuze electronic components, and erosive initiator technology for selectable effects weapons to defense industrial suppliers.\n\nThe integrated DoD and DOE efforts within the JMP are transitioning new munitions’ technologies to the Department and the defense industrial base through the advanced development process.  The JMP is a focal point for collaborative work by nearly 300 DoD and DOE scientists and engineers.  Technical leaders from both Departments consider the JMP a model of cooperation, both within their respective departments and between departments.  The highly challenging technical objectives of the approximately 35 JMP projects require multi-year efforts and sustained, long-term investments to achieve success.\n\nThe JMP projects are divided into five technical focus areas:  Computational Mechanics and Material Modeling; Energetic Materials; Initiators, Fuzes, and Sensors; Warhead and Penetration Technology; and Munitions Lifecycle Technologies."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Computational Mechanics and Material Modeling"
                                    },
                                    "Description": {
                                        "val": "Projects in this technical focus area develop physics-based computational tools, material models, and calibration and validation databases which support the design and development of weapon systems. These capabilities are intended to predict the complex phenomena across significant length (meso to continuum) and time (microsecond to minute) scales. The tools will provide coupled, multi-physics and chemistry modeling capabilities that are scalable to massively parallel architectures for solving very diverse problems across the weapons systems’ research and development and acquisition communities. Numeric tools are the foundation that makes possible the integration of mechanics, materials science, physics, and chemistry.  This focus area also includes an extensive experimental component consisting of phenomenological or “discovery” experiments that drive model development; calibration experiments to compliment models; and experiments for model and code validation.\n\nThe specific projects in computational mechanics and material modeling are:\n\n-  CTH shock physics and SIERRA \/ Solid Mechanics (SM) codes & model development and experiments: impact initiation of high explosives; composite material modeling; mesoscale experiments, model development, and analysis; coupled physics code development; and models for localization and failure.\n-  Arbitrary Lagrangian-Eulerian (ALE3D) code and model development.\n-  Composite case technology and modeling.\n-  Dynamic properties of materials.\n-  Energetic materials and polymers under dynamic and thermal loading.\n-  Fragment impact and response experiments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.444"
                                            },
                                            "Text": {
                                                "val": "-  Mechanical Threshold Stress (MTS) constitutive model algorithm developed for implementation into FEM (Finite Element Modeling) codes.\n-  Generalized Multi-Scale Shell Theory (GMSST) formulated for shell structural elements.\n-  Developed Dilational-ViscoPlastic-Fast Fourier Transform (D-VP-FFT) model to allow consideration of shocked, voided polycrystals; supported with 3D in situ and ex situ data sets of damage evolution.\n-  Characterized the mechanical and ignition properties of MinSmoke propellant (MSP).\n-  Implemented the ViscoSCRAM High Explosive mechanical model in the Material Point Method (MPM) code CartaBlanca.\n-  Delivered data to clarify the role of unique deformation mechanisms for relevant energetic materials.\n-  Performed mechanical experiments on DoD explosive AFX (Air Force Explosive) 757.\n-  Completed ball impact experiments for PBX (Plastic Bonded Explosive) 9501, PBX 9502, PBX N9 and HPP (High Performance Propellant).\n-  Floret test was completed for 46 samples of PBX 9501 with variable density and damage.\n-  Executed Taylor impact experiments using an oblique view to provide time-resolved information on deformation, failure and dispersal of HPP (High Performance Propellant).\n-  Several enhancements to ALE3D code to improve usability and enlarge application space including:  improved element erosion criteria; geometry imports for Pro\/Engineer models now include beams, shells, and 3D tetrahedra overlaid on 2D meshes; new condition number (CN) mesh relaxer to optimize element shapes; addition of \"mortar\" slides for improved mechanics across faceted surfaces; new material models for cast iron and cellular foam; void insertion coupled directly through Gurson D model for failure and fragmentation modeling; and, implemented crystal plasticity model with porosity.\n-  Developed dynamic DSD (Detonation Shock Dynamics) to calculate lighting times on deformed HE (High Explosive) geometries.\n-  Characterized thermal sensitivity and thermally-driven damage of composites of interest.\n-  Development of a framework to capture damage and response of chopped fiber composites initiated.\n-  Line Velocity Interferometer System for Any Reflector (VISAR) measurements of shocked PBX 9501, PBX 9502, and PBX N-9 performed to support heterogeneous material modeling.\n-  Equation of State (EOS) characterization of IMX (Insensitive Munitions Explosive) 101 and IMX 104 explosives.\n-  SIERRA release (v4.28 in April 2013) distributed to DoD HPC (High Performance Computing) sites.\n-  Distributed Beta versions of the CompSim user interface (UI) to DoD sites.\n-  SIERRA explosives finite element model (XFEM) generalized and extended to model pervasive failure mechanisms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.978"
                                            },
                                            "Text": {
                                                "val": "- Incorporate shear into two-component localization model to move toward a general damage model capability.\n- Develop and apply methods to incorporate 3-dimensional microstructure data into continuum calculations.\n- Incorporate phase transitions in material models to increase accuracy of constitutive models in any calculations involving high-pressure shocks.\n- Perform impact and direct initiation experiments on off-specification PBXN-9 to ascertain change in performance and safety.\n- Complete analysis of PBXN-9 data set to provide consistent parameter sets for DoD and the DOE codes.\n- Implement rate-sensitive damage model into ALE3D or other codes validated against experimental data.\n- Complete initial manufacturing variable study of composite materials.\n- Release of ALE3D with improvements in updated high explosive lighting times, with detonation shock dynamics as the analysis progresses.\n- Enhance the ALE3D\/ALE3D code coupling through FEusion interface by providing a parallel implementation.\n- Complete energetics damage experiments (rubbery tear, interfacial damage, friability).\n- CTH Versions 11.2 and 11.3 will be released:  Improve memory management, and improved parallel processing\/communications.\n- Implement robust and accurate coupling between Sierra\/SM and CTH."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.902"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.902"
                                            },
                                            "Text": {
                                                "val": "-  Implement shell structural element into ALE3D.  Demonstrate on an applicable problem, such as the simulation of impact and penetration of a composite structure rocket motor case, by one or more projectiles.\n-  Implement dynamic strength model \/ rate-sensitive damage model into ALE3D or other codes and validate against experimental data.\n-  Complete integrated 3D damage simulation w\/ mesoscale input for CartaBlanca calculation.  Begin transition of CartaBlanca as general tool for use in typical DoD weapon calculations.\n-  Transition Mechanically Activated Thermal Chemistry (MATCH)-ignition model to DOE code teams.\n-  Design and conduct new experiments to further validate or refine the ignition criterion.\n-  Enhance ALE3D code capabilities through continued development of implicit multi-physics.\n-  Develop improved continuum models that couple void nucleation to shear band failure.\n-  Implement realistic EOS of failed composite material into ALE3D or other codes.\n-  Characterize shock and damping response of commonly used carbon fiber materials, and explore relevant modeling techniques. \n-  Develop methods for analyzing and fitting thermodynamic data of energetic materials.\n-  Release CTH Versions 11.3 and 12.0 with exascale improvements (12.0)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Energetic Materials (EM)"
                                    },
                                    "Description": {
                                        "val": "The goals of this technical focus area are to develop new energetic materials (EMs) and supporting technologies to satisfy the competing requirements for smaller, more lethal, and safer munitions.  Work is primarily focused on explosives, gun and rocket propellants, and, to a lesser extent, pyrotechnics.  The projects include development of: new EMs, including new molecules in a range of particle sizes and morphologies; new EM formulations; a fundamental understanding of energetic properties and performance; and computational tools for analysis of performance and sensitivity.  New materials and formulations are developed with the recognition that costs must be reasonable, chemical feed stocks reliable, and manufacturing processes suitable for scale-up to production levels.\n\nBoth Federal statute and Department policy direct the development of safer, less sensitive munitions.  Making munitions less sensitive while maintaining explosive or propellant performance is a difficult challenge.  This goal is best attained through a combination of new EM development, EM characterization, and more sophisticated modeling and simulation tools.  It is cost prohibitive to qualify weapons for compliance with insensitive munitions requirements through testing alone.  A better, and in many cases, the only means to qualify these weapons is with the combination of analysis based on validated computational tools and a few well-designed tests.\n\nThe Department also needs munitions that provide selectable effects.  To achieve these effects, weapons designers need to thoroughly understand the performance of EMs used in both the main weapon fill and the initiation systems.  Distributed fuzing systems can provide selectable effects as well as safer munitions, but such complex, small-scale systems require more complete knowledge of EM detonation physics and in some cases, new EMs designed for this application.\n\nThe desire for smaller and lighter munitions is driven in large part by the increasing dependence on unmanned weapons platforms and to some extent by the need to reduce logistical burden, especially energy consumption.  New EMs are needed to meet the munitions weight and size requirements while maintaining lethality and safety.\n\nThe Department is working to increase the range and velocity of weapons and to develop weapons against hardened targets.  These applications subject EMs to high accelerations and shock loads.  To support the development of these new systems, we need to improve our ability to model EM under higher impact loads and to characterize relevant properties to determine their ability to survive in these aggressive environments.  We may also need to develop new, more robust EMs that survive impact loads while maintaining lethality and initiability.\n\nThe specific projects in the energetic materials technical focus area are:\n-  Synthesis, properties, and scale-up of new energetic compounds.\n-  Insensitive munitions and surety.\n-  New energetic materials formulation and characterization.\n-  Cheetah thermochemical code development and experiments.\n-  Micro- and nano-energetics synthesis and initiation.\n-  Hazards analysis of energetic materials.\n-  Reaction processes of energetic materials.\n-  Microfluidic reactor synthesis of sensitive explosives.\n-  Energetics chemistry and properties.\n-  Microstructural and kinetic effects on energetic materials behavior.\n-  Microwave sensitization and initiation of energetic materials."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.150"
                                            },
                                            "Text": {
                                                "val": "- Completed synthesis and characterization of insensitive energetic materials for booster applications.\n- Designed deflagration to detonation transition experiments for proton radiography.\n- Compared simulations with pop plot behavior and onionskin experiments for microwave-sensitized explosives.\n- Released CHEETAH version seven, which will provide enhanced accuracy for a wide range of energetic formulations, including those containing fluorine, chlorine, bromine, boron, silicon, and tungsten.\n- Expanded detonation calorimetry capabilities with post-shot analysis techniques.\n- Completed mesoscale simulations of energetic materials under stress and pressure\/confinement.\n- Developed technique to characterize high-pressure deflagration.\n- Scaled-up the syntheses of new energetic material compounds to produce 20-30 grams for performance testing and heat of formation measurements.\n- Scaled thin-film deposition of explosives to gram scale.\n- Developed and validated models for thermally induced damage in TATB explosives and AP propellants.\n- Completed thermal decomposition study of propellant binder PNO with and without candidate stabilizers.\n- Determined low and moderate temperature reaction networks for pyrotechnic actuator materials.\n- Completed initial microfluidic nitration reactor experiments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.302"
                                            },
                                            "Text": {
                                                "val": "-  Develop new tunable sensitivity formulations based on TATB\/HMX\/KelF or Estane\/BDNPA-F mixtures using graphite as a microwave absorber.\n-  Investigate the complex permittivity of PBX 9502, Composition B (CompB) and IMX 101 under x-ray exposure.\n-  Determine the dielectric strength of selected booster explosives.\n-  Demonstrate sensitivity control for a 1.9” hemispherical booster.\n-  Perform burn rate studies on promising burn rate modifiers including tetranitrobiimidazole (N4BIM) salts.\n-  Perform synthesis of C,H,N,O oxidizer materials.\n-  Deliver thermal data on IMX 104.\n-  Perform pre-ignition x-ray experiments on IMX 104.\n-  Develop consistent ionic thermodynamics model to improve equation of state (EOS) and speciation predictions for all energetic materials, including halogenated formulations, metal-loaded explosives, propellants, etc. Test and validate model against EOS data and small scale experiments (cylinder, plate push, detonation calorimeter, etc.) using Cheetah and hydro\/Cheetah calculations.\n-  Develop post-detonation carbon kinetics models for conventional and insensitive high explosives. Test and validate against small scale experiments (e.g. cylinder) for TNT-based explosives, TATB-based explosives, conventional explosives, NTO-based explosives, etc. Integrate reactive flow calculations and carbon kinetics modeling with ionic thermodynamics capability.\n-  Develop Cheetah thermochemistry for major metallic additives (Al, Si, B, Mg) and other relevant elements (W, Ti, Zr, Bi, Sb, P, Hf, Ni, K, Na, etc.) and compounds, e.g. oxides, fluorides, nitrides, carbides, etc. to enable thermochemical predictions for complex and novel formulations.\n-  Perform EOS and\/or sound speed measurements in support of Cheetah modeling development. Ex.: TiF4, ZrF4, H2O+HCl, H2O+HF, N2+CO, N2+H2O, B2O3, possibly SiF4, etc.\n-  Capture reaction (ignition) front measurements in damaged energetic materials.\n-  Complete the spiral 1 deflagration-induced deconsolidation model.\n-  Perform porous and pristine minimum signature propellant (MSP) shock initiation experiments for recompaction ignition of damaged material (XDT) model\n-  Deliver completed Disc Acceleration Experiment (DAX) design for conventional EMs (½ to ¾ in.).\n-  Synthesize and scale-up new plasticizer materials.\n-  Synthesize 25-50 grams of LLM-196 and LLM-198 and their nitrogenous salts for evaluation by Navy partners.\n-  Develop preparation-structure relationship for Hexanitrostilbene (HNS).  Test effect of deposition conditions on HNS microstructure.  Relate surface roughness to microstructure.\n-  Determine conditions for multiple material (e.g. co-crystal) formation and test for homogeneous or heterogeneous nucleation.\n-  Characterize the damage evolution of PBX 9502 and Ammonium Perchlorate (AP) propellant, including the determination of permeability as a function of temperature history.\n-  Perform aging study of RDX.\n-  Characterize the chemical interactions that control thermal response of IMX-104.\n-  Investigate the reactive processes that control release of reactive oxygen in KClO4 pyrotechnic oxidizers.\n-  Report on interaction between two Navy Propellants."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.512"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.512"
                                            },
                                            "Text": {
                                                "val": "-  Deliver the fully integrated (electromagnetic, heat transport, kinetic, mechanical, and hydrodynamic) model for down-selected energetic materials.\n-  Report on the overall performance results for shock and thermal initiation, including environmental effects, model predictions, etc. of down-selected energetic materials.\n-  Investigate the sensitivity properties of synthesized C, H, N, O oxidizers.\n-  Systematically evaluate and improve code predictions at low pressure\/high temperature for specific impulse calculations and gun propellants by expanding library of gaseous and condensed products available for such calculations, as well as available ingredients.\n-  Benchmark High Explosive Reaction to Mechanical Stimulus (HERMES) model to sub-detonative fragment impact response experiments.\n-  Perform cook-off-induced Deflagration to Detonation Transition (DDT) experiments.\n-  Deliver completed DAX design for non-ideal EMs.\n-  Scale-up the syntheses of new compounds (e.g. LLM-200, LLM-196, LLM-198, LLM-175 and LLM-201) to produce 20-30 grams for performance testing and heat of formation measurements.\n-  Understand effects of incorporated metal film on propagation (detonation).  Complete experiments on incorporation of metal films (one metal, two configurations) into deposited explosives (one explosive).\n-  Publish best available models and Sandia instrumented thermal ignition (SITI) data for pressure dependence and gas generation rates of thermal decomposition of a representative MSP and Pentaerythritol tetranitrate (PETN).\n-  Complete aging study of underwater explosive formulations and\/or ingredients.\n-  Investigate reactive processes that occur during shock loading of PETN and\/or HNAB."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Initiators, Fuzes, and Sensors"
                                    },
                                    "Description": {
                                        "val": "The goals of this technical focus area are to develop new materials, components, diagnostic techniques, and modeling and simulation tools for fuzing systems. Initiators, fuzes, and sensors must work reliably together to prevent unintended detonation, to correctly detect intended targets, and to initiate detonation when required.   Projects in this focus area support the Department’s needs to miniaturize fuzing systems.  Smaller systems are required for several reasons including: compatibility with smaller and lighter weapons systems; trading volume in munitions for other components such as additional explosives, higher energy and power density power sources, or enhanced guidance systems; increasing reliability through redundancy (use of two or more smaller initiating systems); and upgrading existing sub-munitions with smarter and more reliable fuzing systems. \n\nThe miniaturization of fuzing systems requires new material and components, new power systems, new diagnostic techniques, and improved modeling tools for microdetonics.  The Department also needs weapons systems with selectable effects and these effects may be achieved with multi-point initiation systems.  Such systems are inherently more complex and require improved characterization of initiator materials and components, as well as more sophisticated modeling and simulation tools.  To attain greater precision and to avoid unintended collateral effects when weapons are used in the complex environment of counter-insurgency or counter-terrorist operations, target sensors must be reliable and provide high-fidelity discrimination.  Projects in this focus area are developing technologies to achieve this level of performance in compact packages.\n\nThe specific projects in the initiators, fuzes, and sensors technical focus area are:\n\n-  Firing systems technology: FireMod firing set code model development and validation, 1.6 hazard classification detonator development, and initiation and detonation physics on the millimeter scale.\n-  Safe, Arm, Fuze and Fire Technology: Initiation & Detonation; Advanced Firing System Components.\n-  Advanced initiation systems: diagnostics development, microdetonics, miniature initiation systems, and detonators for enhanced safety.\n-  Thermal Battery Performance Modeling.\n-  MESASAR synthetic aperture radar (SAR) sensors.\n-  Vertical cavity surface emitting laser (VCSEL) sensors for proximity fuzing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.022"
                                            },
                                            "Text": {
                                                "val": "-  Completed an electrochemical model which can predict voltage and current output for a single cell test.  \n-  Validated the mechanical model developed to describe the thermal battery separator and the height displacement; the model was within 10 percent of the experimental data. \n-  Implemented one-dimensional thermal battery electrochemical model into SIERRA code.\n-  Performed a full series of 2-D axi-symmetric small-scale gap tests to study detonation across gaps for explosive materials.\n-  Performed fundamental studies in hydrocode calculations involving overdriven high explosive systems.\n-  Integrated Schlieren Inverse Analysis Software (SIAS) has been updated to use ALE3D in a genetic algorithm to iterate a hydro code simulation towards a solution that mimics detonator output.\n-  Utilized photonic doppler velocimetry (PDV) diagnostic suite to characterize the output of large size detonators in order to provide baseline performance data.\n-  Demonstrated ALE3D model of DoD slapper detonator.\n-  Assessed modified three phase equation of state for metals for predicting slapper performance.\n-  Performed experiments to assess the effect of spot size on LX-10 (high explosive).\n-  Utilized larger printhead (200 µm) to deposit a potential lead azide replacement.\n-  Created validated tabular equation of state for the explosive HNS.\n-  Determined burn model parameters (reaction rates, run distance) for the explosive HNS.\n-  Determined initiation threshold and performance data for micronized PBX 9502.\n-  Developed a methodology to assess the safety and reliability of slapper-based fuze systems based on initiation threshold criterion.\n-  Developed physics-based model of exploding foil initiator (EFI) bridge burst and flyer launch.\n-  Filed non-provisional patents for barium titanate (BTO) nanoparticle synthesis and for Lead zirconate titanate (PLZT) nanoparticle synthesis.\n-  Released packaging Design Guide II summarizing the computational packaging study of a single component on a board in quasi-statics & dynamics.\n-  Built and tested second prototype flyback transformer using new tape-cast materials.\n-  Completed the fabrication and initial evaluation testing of the 2nd iteration Ku-Band transmit \/ receive (T\/R) module.\n-  Completed the detailed design of the Ku-Band active array antenna (AAA) incorporating 24 T\/R modules.\n-  Designed and tested low-divergence high-power vertical cavity surface laser emitter array designs for proximity fuzing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.243"
                                            },
                                            "Text": {
                                                "val": "-  Deliver data packages on DOD detonators to the respective technical POCs as the tests are completed.\n-  Build and release tabular equation of state (EOS) for CL-20\n-  Demonstrate electrochemical modeling for a single cell battery with the Sierra framework\n-  Demonstrate methodology for using microstructural data and performance data in grain-scale and continuum simulations.\n-  Perform microstructural characterization of CL-20 and HMX\n-  Validate ALEGRA-MHD (magneto hydrodynamics) simulations of flyer launch for EFI’s\n-  Increase mechanical robustness of explosives\n-  Optimize tape-cast BTO device using nanoparticle precursors.\n-  Develop platform and process for measuring the permittivity of discrete nanoparticles in solution.\n-  Develop process for field assisted sintering (FAST) of BTO nanoparticles.\n-  Perform additional iterations of build and test of flyback transformers using new tape formulations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.359"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.359"
                                            },
                                            "Text": {
                                                "val": "-  Measurement of temperature dependent impedance of battery separator as a function of applied load.\n-  Delivery of desktop code with a Graphical User Interface (GUI) for coupled thermal & mechanical capability for axisymmetric battery geometry materials designed to start explosive decomposition via photo-dissociation.\n-  Perform experiments to assess wave divergence in charge transfer systems by measuring the effect of corner turning on booster diameter for insensitive explosives.\n-  Develop next generation of the four-channel embedded Fiber Bragg Grating (FBG) for detonation wave diagnostics.\n-  Determine the performance parameters (including combustion & detonation, deposition surface mobility and susceptibility to boundary conditions) of energetic materials deposited using microelectromechanical systems (MEMS) compatible techniques.\n-  Develop tabular equations of state for explosives (e.g. TATB, PETN) and binder\/HE combinations (e.g. RSI-007, PBX’s).\n-  Nanoparticle coatings for tape-cast capacitors optimized to maximize dispersion and loading while mitigating breakdown.\n-  Assess performance of encapsulated components in fuze-like geometries in quasi-static & dynamic environments.\n-  Additional iterations of build and test of flyback transformers using new tape formulations.\n-  Develop lower-divergence 980nm emitter arrays for VCSEL-based proximity fuze."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Warhead and Penetration Technology"
                                    },
                                    "Description": {
                                        "val": "This focus area supports the development of new warheads and penetrator weapons through advances in materials processing and characterization, instrumentation, and computational codes.  In recent years there have been significant increases in warhead performance directly attributed to our ability to understand and accurately model the physics and fine details of new warhead designs, and to advances in increasingly sophisticated material processing.  The Department’s requirement to achieve more precise weapon effects with minimum collateral damage is supported by work on controlled fragmentation, non-fragmenting warhead cases, and multiphase blast explosives (MBX).  More recently, increases in performance and reductions in vulnerability are being achieved through improved warhead integration into munitions using a systems-oriented approach. \n\nThe goals for penetrator weapons are to investigate, develop, and transition advanced technologies for the design, development, and performance assessment of the next generation of high performance, precision strike weapons.  This effort directly supports national initiatives to defeat hard and deeply buried targets, which are proliferating worldwide, and to deny\/defeat weapons of mass destruction.  The work addresses high-velocity penetration into granular materials (sand and soil), penetration into high strength concrete, new penetrator materials and designs, and non-inertial onboard instrumentation.\n\nThe specific projects in the warhead and penetration technology focus area are:\n\n-  Multiphase blast munitions (MBX) technology.\n-  Erosive initiation technology.\n-  Dynamic behavior of sand.\n-  Integrated munitions modeling & experimentation.\n-  Modeling of strategic structures.\n-  Concrete perforation and penetration modeling & experiments.\n-  High-g MEMS sensor development.\n-  Structural dynamics and vibration effects.\n-  High-speed pressure-shear experiments on granular materials.\n-  Explosive\/metal interactions.\n-  Structure, mechanical & shock-loading response, & modeling of materials.\n-  Controlled effects warhead materials."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.429"
                                            },
                                            "Text": {
                                                "val": "-  Conducted sweeping detonation-wave loading experiment on Fe to quantify the effect on phase transition.\n-  Completed characterization of tantalum EFP (explosively formed penetrator) liners to support research and development efforts at U.S. Army Armament Research, Development and Engineering Center (ARDEC).\n-  Completed first sweeping-wave spallation experiment on zirconium to determine shock effects on the microstructure of munitions materials.\n-  Completed characterization of the strength and damage behavior of depleted-uranium. \n-  Processed and characterized the first batch of W-Fe-Ni alloy powder samples with dilute concentrations of low melting point Bi-Sn alloy powders.\n-  Processed and characterized the first batch of 4340 steel powder samples with dilute concentrations of low melting point Bi-Sn alloy powders.\n-  Rigorously applied melt infiltration methods in the composite processing methodology.\n-  Completed fragmentation calculations on 4340 steel pipe bomb experiments.\n-  Completed a suite of validated erosive initiation computational models including: three ALE3D models of zirconia-lined shaped charges; ALE3D models which utilize experimentally measured force data to provide a computational boundary loading; and meso-scale models which explicitly model individual particles of the granular jet.\n-  Implemented improvements to the multiphase model in ALE3D: demonstrated usability for MBX munition design and deployment (2-D & 3-D); improved the usability of the multiphase model; corrected numerical implementation errors; added Lagrangian particle drag model; added slider collision model for Lagrangian particles to model particle-particle interaction; added momentum back-coupling of aerodynamics forces between particles and multiphase; added energy back-coupling of work due to aerodynamic forces between particles and multiphase; added interpolation of velocity and fluid scalar quantities to particle location for more accurate calculation of forces on the particles; added the pressure gradient force on Lagrangian Particles from multiphase flows; and improved computational efficiency of Lagrangian particles.\n-  Initial release of the Kraken fragment-analysis software with inputs from Sierra Solid Mechanics; the software is capable of outputting fragment mass and velocity distributions and writing a z-data file for use in DoD lethality software.\n-  Applied the Kracken fragment-analysis software to analyze results of an ARDEC fragmentation test.\n-  Lagrangain Marker implemented, which allows for nonlinear elasticity and advanced mechanics of materials, finished with beta release in CTH.\n-  Completed validation of mesoscale simulations of granular materials (i.e. sand) against split hopkinson pressure bar (SHPB) data in order to probe the physical mechanisms driving comminution in sand.\n-  Provided a synthetic database for use in constitutive model development of granular materials; the data from the mesoscale simulations will be used to “fit” the constitutive model.\n-  Implemented  the Sandia Concrete Model (SANDCON) into a prototype version of CTH; the SANDCON model was developed to improve the ability to model the brittle behavior observed for high strength concrete with an unconfined compressive strength of 10-15 ksi.\n-  Completed instrumented small scale penetration experiments into generic ultra-high performance concrete targets."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.626"
                                            },
                                            "Text": {
                                                "val": "-  Complete baseline data collection on alloy steel 4340, titanium, and copper to determine the effect of geometric scale, shell thickness (strain rate), heat treatment \/ annealing states and defect density have on fragment size, homogeneous background strain and time to fragmentation.\n-  Implement multi-field techniques for the description of explosive \/ metal interactions into validated computer codes (Pagosa+).\n-  Complete oblique high explosive-driven shock hardening & damage microstructural quantification on Ta, Zr, and complete initial oblique HE-driven spall on U-6Nb.\n-  Implement tensile plasticity model (TEPLA) into CartaBlanca and compare improved representation of plate impact response to Lagrange code representation.\n-  Perform laser based shock experiments on first batch of 4340 steel powder composites to understand the phase transforming behavior of the composite architecture.\n-  Conduct a parametric study on the laser-based shock experiments using ALE3D with microstructures generated through Particle Pack.\n-  Implement improvement to the multiphase model in ALE3D:  enhanced detonics capability with particle movements guided by meso-scale simulations and validation experiments; this will benefit the design and optimization of multiphase munitions.\n-  Complete cylinder-expansion and perforation-test simulations using Sierra Solid Mechanics and assess the capability of peridynamics for this class of problems.\n-  Incorporate the second iteration of the multifield theory into CTH with advanced Lagrangian and Eulerian numerics.\n-  Deliver improved constitutive sand model to the GEODYN material library.\n-  Perform field scale penetrator tests into sand and update model.\n-  Complete feasibility study of methods to measure or calculate the full projectile trajectory into complex targets.\n-  Complete evaluation of coupled finite element \/ peridynamics algorithms in Sierra to improve simulations of ballistic events into complex targets."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.448"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.448"
                                            },
                                            "Text": {
                                                "val": "-  Complete application of full field interferometry to dynamic defect studies at the nucleation scale of metals.\n-  Investigate the jet formation melting of the eutectic Ag-Cu to probe the effects of allotropic and thermal phase transitions.\n-  Complete oblique HE driven shock hardening and damage microstructural characterization on Zr & Cu-Pb alloy.\n-  Develop modeling & simulation (M&S) tools  that will enable optimization of engineering microstructures with multi-phase material fragmentation. \n-  Implement improvements to the multiphase model in ALE3D.\n-  Complete ARDEC test simulations using Sierra Solid Mechanics and assess the capability of peridynamics for DoD and DOE fragmentation problems.\n-  Complete the incorporation of the multi-field theory into CTH; this will allow for multiple material interactions controlled through internal boundary conditions that are inherent to the numerical techniques.\n-  Complete full scale simulations into sand and update model.\n-  Issue experimental dynamic friction database containing characterizations of mechanical (shear, compression and tensile) interfaces.\n-  Evaluate CTH- (Material Point Methods (MPM)-Multi-field capabilities for modeling penetration into complex targets."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Munitions Lifecycle Technologies"
                                    },
                                    "Description": {
                                        "val": "This focus area supports improving the Department’s ability to understand, measure, predict, and mitigate safety and reliability problems caused by materials aging and degradation in weapons systems.  Current stockpile assessment methods typically focus on addressing materials aging and reliability problems after they occur, rather than anticipating and avoiding future problems or failure mechanisms.  The overall objective of this work is to develop a toolset of computational models that are able to quantitatively predict materials aging processes and ultimately improve the long-term reliability of weapons systems, subassemblies, and\/or components.  These objectives are achieved by: identifying aging mechanisms, quantifying the rates at which those aging mechanisms occur, developing predictive models, and using these models to predict the munitions stockpile reliability.  An additional objective of this work is to develop technologies and methodologies to enable munitions health management and condition-based maintenance.\n\nThe specific projects in the munitions lifecycle technologies focus area are:\n\n-  Predictive materials aging including: solder interconnect reliability, corrosion of electronics, and adhesive degradation.\n-  Microelectromechanical systems (MEMS) reliability.\n-  Military use of commercial off-the-shelf (COTS) electronics.\n-  Complex system health assessment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.783"
                                            },
                                            "Text": {
                                                "val": "-  Developed methodology for integrating unit-by-unit summaries into inputs for Environmental¬ Science¬ Condition-based ¬Reliability (ESCR) process.\n-  Tested statistical methodology for reliability predictions on 50 caliber round stockpile data.\n-  Developed a method for measuring a packaged MEMS device seal strength.\n-  Developed engineered aging structures with measurement and data acquisition capabilities that can be used to monitor corrosion in-situ in electronics. \n-  Determined silicon on insulator (SOI) sidewall and high temperature degradation of MEMS silicon at high temperatures."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.143"
                                            },
                                            "Text": {
                                                "val": "- Validate bondpad corrosion model with modified plastic encapsulated microelectronics (PEM) parts.\n- Assess the role of adhesive swelling due to water absorption on the stress state of the adhesive. \n- Quantify initial predictive aging and reliability model with results from COTS MEMS device testing.\n- Methodology and software to perform multiple objective assessments of resource allocation and general management strategies of weapon system usage.\n- Validation of a general model to connect condition-based measures (age, environmental factors) at the component level failure mode to system reliability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.114"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.114"
                                            },
                                            "Text": {
                                                "val": "-  Develop a software program for general reliability resource allocation problems that will allow the user to understand the robustness of different choices.\n-  Develop a methodology to combine the multiple failure mode models at the component level into an overall model, capable of estimating and predicting system reliability.\n-  Build GUI for connector and bondpad corrosion models\n-  Assess the role of adhesive swelling due to water absorption on the stress state of the adhesive within the napkin-ring joint and on the stress at failure observed for the joint\n-  Compile the dormant storage data both internal and external to the Hellfire missile case.\n-  Validate the most promising tin whisker mitigation methods in actual operating environments."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "1.  Transition of technologies developed by the Joint Munitions Technology Program are tracked and documented.  In FY 2013 there were more than 45 transitions to DoD.\n2.  Attendance and technical interactions at the biannual meetings of the eight Technology Coordinating Groups (TCGs) are tracked and documented.\n3.  Laboratory Five Year Plans are prepared, evaluated, and analyzed by management and technical staff.\n4.  TCG Chairmen's Annual Assessments for each TCG are critically reviewed by the Technical Advisory Committee to determine progress, validate transition plans, and verify relevance of each project.\n5.  Project progress toward goals and milestones is assessed at each biannual TCG meeting and critically reviewed annually by the Technical Advisory Committee.\n6.  Annual technical reports and papers are tracked and documented."
                        }
                    }
                }
            ]
        }
    }
}