{
    "id": "81e1fa0f9a18b670d8049a114b5663e55855fdff",
    "meta": {
        "filename": "dod-2015_RDTE_2015_OSD_RDTE_JustificationBook_Office_of_Secretary_Of_Defense_PB_2015.zzz_unzipped_RDTE_JustificationBook_Office_of_Secretary_Of_Defense_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603727D8Z"
        },
        "ProgramElementTitle": {
            "val": "Joint Warfighting Program"
        },
        "R1LineNumber": {
            "val": "58"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "10.276"
            },
            "PriorYear": {
                "val": "7.335"
            },
            "CurrentYear": {
                "val": "3.425"
            },
            "BudgetYearOne": {
                "val": "7.405"
            },
            "BudgetYearOneBase": {
                "val": "7.405"
            },
            "BudgetYearTwo": {
                "val": "7.683"
            },
            "BudgetYearThree": {
                "val": "8.011"
            },
            "BudgetYearFour": {
                "val": "8.505"
            },
            "BudgetYearFive": {
                "val": "9.194"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Joint Warfighting Program (JWP) is a relatively small but pivotal resource that synchronizes two Department-wide domains, military requirements and acquisition, with shared analyses and actionable assessments.  The account underwrites two related activities supporting development of the Department's joint warfighting capability.  These resources are a slim residual of much larger accounts supporting unique warfare capability analyses for joint customers including major combatant commander staffs and the Joint Staff.  These analyses and assessments deliver independent perspectives on ways to align Service and Agency investments and potential solutions for capability gaps created by evolving threats not aligned to single Component missions.  Iterative military budget reductions to joint mission support programs significantly increased demand for JWP support from joint staffs and “units in the field” assigned to joint missions. \n\nThe JWP resources are dedicated to analytic support for joint capability analysis and joint customers.  JWP provides a safety net for analytic support responding to emergent joint capability requirements and capability gaps for identifying potential material solutions.  Typical projects funded with JWP include translation of capability gap assessments into actionable military needs statements, identification of candidate solutions via experimentation, translation of solution concepts into field demonstrations, and remedy of joint capability gaps in partnership with Defense agents for doctrine changes and technology development.  JWP resources dedicated to direct support joint commands provides analytic expertise not normally allocated via formal staffing billets.  In this activity, JWP underwrites small grants to invigorate employment of experimentation and analysis, to formulate strategies to resolve joint capability gaps, and to stimulate participation in the Department enterprises for joint experimentation and joint capability development.  JWP resources also support Mission Area Portfolio Assessments (MAPA), and the development of tools supporting joint analytic efforts.\n\nThe balance of JWP funds contributes resources to examination of potential remedies for joint mission capability gaps.  These early assessments of potential capability gap solutions can accelerate engineering development, subsequent field experiments, and capability demonstrations in field conditions.  This segment of JWP often represents the first effort to define alternative solutions across the range of Doctrine, Organization, Training, Material, Leadership and Personnel-Facilities.  The resources sustain a small segment of civilian operation research analysis (currently hosted by the Institute for Defense Analysis – IDA and the Naval Postgraduate School - NPS).  Administered by the Joint Operations Support (JOS) division within OSD’s AT&L organization, JOS works closely and continuously with joint customers around the world.  Analytic project selection is undertaken in consultation with the OSD staffs serving AT&L and Policy and with elements of the Joint Staff."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "8.403"
                },
                "CurrentYear": {
                    "val": "8.431"
                },
                "BudgetYearOne": {
                    "val": "8.643"
                },
                "BudgetYearOneBase": {
                    "val": "8.643"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "7.335"
                },
                "CurrentYear": {
                    "val": "3.425"
                },
                "BudgetYearOne": {
                    "val": "7.405"
                },
                "BudgetYearOneBase": {
                    "val": "7.405"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.068"
                },
                "CurrentYear": {
                    "val": "-5.006"
                },
                "BudgetYearOne": {
                    "val": "-1.238"
                },
                "BudgetYearOneBase": {
                    "val": "-1.238"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Baseline Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-1.068"
                                },
                                "CurrentYear": {
                                    "val": "-5.006"
                                },
                                "BudgetYearOne": {
                                    "val": "-1.238"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.238"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2013 baseline adjustments due to sequestration.\nFY 2014 baseline adjustments from NDAA for 2014. (Reductions not requested by DoD).\nFY 2015 baseline of work is based on current level of demand from OSD Joint Staff and operational customers projected into FY15 program work. Typically JWP is capable of covering only a relatively small percentage of demand for Joint Capability Analysis."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P727"
                    },
                    "ProjectTitle": {
                        "val": "Joint Warfighting"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "10.276"
                        },
                        "PriorYear": {
                            "val": "7.335"
                        },
                        "CurrentYear": {
                            "val": "3.425"
                        },
                        "BudgetYearOne": {
                            "val": "7.405"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.405"
                        },
                        "BudgetYearTwo": {
                            "val": "7.683"
                        },
                        "BudgetYearThree": {
                            "val": "8.011"
                        },
                        "BudgetYearFour": {
                            "val": "8.505"
                        },
                        "BudgetYearFive": {
                            "val": "9.194"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The OSD JWP account underwrites two related activities supporting development of the Department's joint warfighting capability.  These are resources dedicated to support joint capability analysis for joint customers and undertaken by Combatant Command staffs, and resources dedicated for independent analysis of joint warfare (currently conducted by the Institute for Defense Analysis – IDA and the Naval Postgraduate School - NPS).  Iterative military budgets decrements leave JWP as the primary resource dedicated to analytic assessment of joint capability gaps and potential solutions.  During a period of force resetting and realignment, this resource becomes even more essential to staffs and military units dedicated to evolving joint missions.\n\nThe JWP resources are dedicated to analytic support for joint capability analysis and joint customers.  JWP provides a safety net for analytic support responding to emergent joint capability requirements and capability gaps for identifying potential material solutions.  Typical projects funded with JWP include translation of capability gap assessments into actionable military needs statements, identification of candidate solutions via experimentation, translation of solution concepts into field demonstrations, and remedy of joint capability gaps in partnership with Defense agents for doctrine changes and technology development.  JWP resources dedicated to projects in partnership with joint commands provide analytic expertise not normally allocated via formal staffing billets.  In this activity, JWP underwrites small grants to invigorate employment of experimentation and analysis, to formulate strategies to resolve joint capability gaps, and to stimulate participation in the Department enterprises for joint experimentation and joint capability development.  JWP resources also support Mission Area Portfolio Assessments (MAPA), and the development of tools supporting joint commander analytic efforts.\n\nThe balance of JWP funds resource the Joint Warfare Independent Analysis segment, an independent source to examine potential remedies for mission capability gaps.  This segment of JWP often represents the first effort to define alternative solutions across the range of Doctrine, Organization, Training, Material, Leadership and Personnel-Facilities.  The resources sustain a small segment of operation research analysis (currently hosted by the Institute for Defense Analysis – IDA).  Administered by the Joint Operations Support (JOS) division within OSD\/AT&L, JOS works closely and continuously with joint customers around the world.  Analytic project selection is undertaken in consultation with the OSD staffs serving AT&L and Policy and with elements of the Joint Staff."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Support for Joint Capability Analysis"
                                    },
                                    "Description": {
                                        "val": "JWP resources are dedicated to analytic support for joint capability analysis and joint customers.  JWP supports joint capabilities by promoting analyses and assessments to address challenges specific to their theater or functional missions.  It aims to reinvigorate joint military staff capabilities to employ rigorous analysis and experimentation methodologies in support of specific mission assignments. It support joint commander identification of capability gaps and selectively funds limited objective experiments experiment to understand a concept or technology that addresses a specific joint mission challenge. JWP also resources Mission Area Portfolio Assessments (MAPA) serving the need of joint capability clients."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.425"
                                            },
                                            "Text": {
                                                "val": "-Conducted joint Mission Area Assessment of portfolios and explored capability gap mitigation strategies serving both critical review of Major Defense Acquisition Programs (MDAPs) and evolving joint threats.\n-Supported USNORTHCOM’s investigation and analysis of Over the Horizon Radar (OTHR) capability against cruise missile targets against the United States.\n-Initiated the Joint Innovation Field Experiment with Naval Post Graduate School to provide Combatant Commands a pre-acquisition field experiment environment to define capability requirements.\n-Supported USPACOM’s Cyber War Center development of test and experimentation use case plans to integrate cyber operations.\n-Supported RDA Task Force with Kill Chain Analysis, and solutions development for scenarios.\n-Supported path-finding operational energy study project to analyze planning assumptions and shortfalls for critical logistics support in Combatant Command OPLANS."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.569"
                                            },
                                            "Text": {
                                                "val": "-Direct emphasis to Mission Area Portfolio Assessment (MAPA) of Service acquisition investments to support acquisition decisions addressing joint capability shortfalls projected in the future, and emphasis on joint capability development serving the needs of joint commanders and joint clients.  Provide direct analytical support responding to emergent joint military staffs requests.  \n-Develop analyses examining emergent joint capability gaps and to developmental military needs for material solutions.  \n-Continue to support and develop the joint innovation field experimentation (JIFX) initiative hosted by Naval Post Graduate School to support joint commander development of credible, analytically sound military capability requirements including desired Key Performance Parameters (KPPs) and Key System Attributes (KSAs) for subsequent formal acquisition.  \n-Continue to provide resources to joint military staffs to enable minimal experimentation cells to explore capability gaps, potential solutions, and understanding of new technologies and concepts.  \n-Empower joint military staffs and OSD elements to employ rigorous analysis and experimentation methodologies in support of their specific mission assignments, to assess military needs critically and to examine viable capability gap solutions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.425"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.425"
                                            },
                                            "Text": {
                                                "val": "Continue emphasis on Mission Area Portfolio Assessment (MAPA) to provide insights for acquisition decisions focused on capability development serving the needs of joint commanders and joint clients.  Provide direct analytical support responding to emergent joint military staffs to identify capability gaps and military needs for material solutions.  Continue to support joint innovation field experimentation (JIFX) effort hosted by Naval Postgraduate School. Support joint commanders to develop and refine capability requirements.  Continue to partner with joint military staffs, encouraging experimentation cells to address mission capability gaps, explore potential solutions, and improve understanding of new technologies and concepts in response to evolving missions and military threats.  Empower the joint military staffs to employ rigorous analysis and experimentation methodologies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Analytic Development of Joint Military Requirements Addressing Evolving Threats \/ Missions"
                                    },
                                    "Description": {
                                        "val": "This segment underwrites innovative, responsive and timely analytic support on joint capability development serving the needs of joint staffs and units in partnership with acquisition authorities.  It provides an independent source to examine potential remedies for mission capability gaps and can establish a framework for subsequent field experiments, capability demonstrations or accelerated acquisition.  Joint warfare independent analysis often represents the first effort to define alternative solutions across the range of Doctrine, Organization, Training, Material, Leadership and Personnel-Facilities.  These resources leverage a small analytic framework (currently consisting of analysts at the Institute for Defense Analysis – IDA, and the Naval Postgraduate School - NPS).  Administered by the Joint Operations Support cell within OSD\/AT&L, this fund capability gap definition and technology based initiatives.  Project selection is undertaken in consultation with the OSD staffs serving AT&L and Policy and with elements of the Joint Staff."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.910"
                                            },
                                            "Text": {
                                                "val": "-Analyzed Combatant Command Integrated Priority Lists (IPLs) for common capability gaps where material solutions might mitigate Department risks.\n-Supported Joint Staff capability portfolio analysis of potential remedies for mission capability gaps and frameworks for accelerated acquisition and capability demonstrations (Radiant Blue ISR).\n-Developed a pictorial representation of Defense Department's interconnected modeling and simulation tools (PRIME) to enable users to examine the relationships between models and the user's area of interest. This tool was developed to categorize and link campaign level models with underlying data bases and models. \n-Assessed the sufficiency of gaming in the Department for Adaptive Planning.\n-Assessed analytic tools available for joint military examination of time-sensitive targets in conventional campaigns."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.856"
                                            },
                                            "Text": {
                                                "val": "Impaired by abrupt resource reduction mid-year 2014, this segment will still aim to provide an independent innovative, responsive and timely capability development pathway and recommendations for rapid acquisition, field experiments conducted by joint commands in partnership with acquisition authorities.  It will provide an independent source for enabling capability development suitable for joint experimentation undertaken by the joint commanders.  The findings of these investigative analyses frequently explore joint capability development via experiments and prototype demonstrations leading toward potential material solutions.  It will enable experiments in field conditions that address regional capability gaps, explore potential innovative solutions, and improve understanding of the potential warfare applications of mature technologies.  It will empower joint military staffs to employ rigorous analysis and experimentation methodologies in support of their specific mission assignments, to assess their own needs critically and to examine viable capability gap solutions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.980"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.980"
                                            },
                                            "Text": {
                                                "val": "This segment will provide independent analysis of joint issues and capability gaps.  It will provide responsive and timely capability development pathways and recommendations for rapid acquisition, field experiments conducted by joint military staffs and units.  It will provide an independent source for enabling capability development suitable for joint experimentation undertaken by joint authorities.  The findings of these investigative analyses frequently explore joint capability development via experiments and prototype demonstrations leading toward potential material solutions.  It will enable COCOMs to do experiments in the field that addresses regional capability gaps, explores potential solutions, and improves understanding of new technologies.  As before, it will empower the joint staffs to employ rigorous analysis and experimentation methodologies in support of their specific mission assignments, to assess their own needs critically and to examine viable capability gap solutions."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Performance is measured through metrics including (1) objective validation of enhanced CCMD capabilities to perform joint missions in their assigned theaters and areas of responsibility, (2) documented delivery effective joint operational concepts, (3) confirmed production of refined and validated capability descriptions."
                        }
                    }
                }
            ]
        }
    }
}