{
    "id": "824f8d2c581e9addb3ee978b9588294a15581be6",
    "meta": {
        "filename": "dod-2015_RDTE_2015_NAVY_BA6_RDTE_JustificationBook_Navy_PB_2015.zzz_unzipped_RDTE_JustificationBook_Navy_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604256N"
        },
        "ProgramElementTitle": {
            "val": "Threat Simulator Development"
        },
        "R1LineNumber": {
            "val": "147"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "27.843"
            },
            "CurrentYear": {
                "val": "43.261"
            },
            "BudgetYearOne": {
                "val": "45.272"
            },
            "BudgetYearOneBase": {
                "val": "45.272"
            },
            "BudgetYearTwo": {
                "val": "41.861"
            },
            "BudgetYearThree": {
                "val": "22.359"
            },
            "BudgetYearFour": {
                "val": "21.400"
            },
            "BudgetYearFive": {
                "val": "22.064"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This is a continuing program that consolidates the design, fabrication and integration of Naval Electronic Warfare (EW) threat simulators for increased managerial emphasis and coordination. These simulator development efforts provide realistic Developmental and Operational Test and Evaluation environments to test EW systems and defensive tactics. These projects develop threat Anti-Air and Anti-Ship weapon system simulators in accordance with the Services' requirements.\n\nThe 0602 Project, Electronic Warfare Environment Simulation, directly supports the Test and Evaluation resource requirements for all Naval Air EW development programs to include multi-spectral situational awareness and countermeasures. Programs in development and future programs include: ALR-67(v) 3, Integrated Defensive Electronic Countermeasures Suite ALQ-214, the AAR-47 (v) 3, AVR-2, Advanced 6\" Expendable, Advanced Strategic Tactical Expendable, ALQ-144A, Joint and Allied Threat Awareness System, Joint Strike Fighter, EA-18G, LR700, Low Band Transmitter, P-8A, and the Next Generation Jammer.\n\nJUSTIFICATION FOR BUDGET ACTIVITY: This program is funded under RESEARCH, DEVELOPMENT, TEST and EVALUATION MANAGEMENT SUPPORT because it supports efforts directed toward sustaining or modernizing installations or operations required for general research, development, test and evaluation."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "30.790"
                },
                "CurrentYear": {
                    "val": "43.261"
                },
                "BudgetYearOne": {
                    "val": "43.084"
                },
                "BudgetYearOneBase": {
                    "val": "43.084"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "27.843"
                },
                "CurrentYear": {
                    "val": "43.261"
                },
                "BudgetYearOne": {
                    "val": "45.272"
                },
                "BudgetYearOneBase": {
                    "val": "45.272"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.947"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "2.188"
                },
                "BudgetYearOneBase": {
                    "val": "2.188"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.428"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "8.600"
                                },
                                "BudgetYearOneBase": {
                                    "val": "8.600"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-6.412"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-6.412"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-2.519"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Not applicable.\n\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0602"
                    },
                    "ProjectTitle": {
                        "val": "Eletronics W\/F Env Simulation (ECHO)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "15.624"
                        },
                        "CurrentYear": {
                            "val": "30.151"
                        },
                        "BudgetYearOne": {
                            "val": "30.536"
                        },
                        "BudgetYearOneBase": {
                            "val": "30.536"
                        },
                        "BudgetYearTwo": {
                            "val": "27.466"
                        },
                        "BudgetYearThree": {
                            "val": "7.607"
                        },
                        "BudgetYearFour": {
                            "val": "7.078"
                        },
                        "BudgetYearFive": {
                            "val": "7.223"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The objective of this project is development of necessary simulation facilities and approaches to allow determination of the effectiveness of Electronic Warfare (EW) in real world engagement situations and to support the introduction of modern, effective systems into Naval Aviation. The heavy use of test resources by all Services demonstrates the importance of these assets. The Navy has been very successful in executing all of its major programs, and to date has had no major technical problems.\n\nThe Electronic Warfare Environment Simulation project is unique because it is the only program within the Department of Defense which develops and provides Naval anti-air warfare threat assets for Test and Evaluation (T&E).\n\nThis project directly supports the T&E resource requirements for all Naval Air EW development programs, to include multi-spectral situational awareness and countermeasures. Programs in development and future programs include: ALR-67(v) 3, Integrated Defensive Electronic Countermeasures Suite ALQ-214, the AAR-47 (v) 3, AVR-2, Advanced 6\" Expendable, Advanced Strategic Tactical Expendable, ALQ-144A, Joint and Allied Threat Awareness System, Joint Strike Fighter, EA-18G, LR700, Low Band Transmitter, P-8A, and the Next Generation Jammer.\n\nThis project provides for the development of an Integrated Air Defense T&E capability to be fielded at each of the three sites comprising the Navy's Tri-Center complex: Naval Air Warfare Center Weapons Division, China Lake and Point Mugu in CA, and Naval Air Warfare Center Aircraft Division, Patuxent River, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RADIO FREQUENCY (RF) THREAT CAPABILITIES"
                                    },
                                    "Description": {
                                        "val": "Provide the test community with the modern threat systems necessary for T&E of airborne RF alert, Situation Awareness, targeting systems and airborne RF response systems.\n\nThe projects that have been grouped in the Radio Frequency Threat Capabilities accomplishment area through FY 2013 will realign to either the Acquisition and Measurement Capabilities accomplishment or the Engagement Capabilities accomplishment starting in FY 2014.  This change was made to allow a more detailed tracking for those projects."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.645"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued the upgrade to the J-32B Advanced Threat System at Electronic Combat Range (ECR). Project realigned to the Engagement Capabilities accomplishment in FY 2014.\n- Continued the development of an advanced Early Warning and Acquisition radar hybrid laboratory simulator. Project realigned to the Acquisition and Measurement Capabilities accomplishment in FY 2014.\n- Continued the development of the Long Range Threat System (LRTS) at ECR. Project realigned to the Engagement Capabilities accomplishment in FY 2014.\n- Continued the update to existing laboratory simulators of foreign radars. Project realigned to the Acquisition and Measurement Capabilities accomplishment in FY 2014.\n- Continued the development of a Digital Radio Frequency Memory Jammer simulator. Project realigned to the Engagement Capabilities accomplishment in FY 2014.\n- Completed the development of the LRTS in laboratories.\n- Initiated the upgrade and integration of missile simulation models. Project realigned to the Engagement Capabilities accomplishment in FY 2014.\n- Initiated the upgrade of open-loop threat simulators at ECR. Project realigned to the Acquisition and Measurement Capabilities accomplishment in FY 2014.\n- Initiated the development of an open air radio frequency beam measurement capability. Project realigned to the Acquisition and Measurement Capabilities accomplishment in FY 2014.\n- Initiated the development of a closed-loop threat surface to air missile system simulator. Project realigned to the Engagement Capabilities accomplishment in FY 2014.\n- Initiated the conversion of a threat system. Project realigned to the Engagement Capabilities accomplishment in FY 2014."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "ACQUISITION AND MEASUREMENT CAPABILITIES"
                                    },
                                    "Description": {
                                        "val": "Provide the test community with the modern threat acquisition systems and effectiveness measurement systems necessary for Test and Evaluation of airborne alert, Situation Awareness, targeting systems and airborne response systems. \n\nThe Acquisition and Measurement Capabilities accomplishment was created to allow a more detailed tracking for some of the projects that were previously grouped under the Radio Frequency (RF) Threat Capabilities accomplishment.  All projects listed as continue or complete under this accomplishment were realigned from the RF Threat Capabilities accomplishment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.006"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Projects listed as Continue or Complete under this accomplishment were realigned from the RF Threat Capabilities accomplishment.\n\n- Continue the update to existing laboratory simulators of foreign radars that was realigned from the RF Threat Capabilities accomplishment.\n- Continue the upgrade of open-loop threat simulators at Electronic Combat Range (ECR) that was realigned from the RF Threat Capabilities accomplishment.\n- Continue the development of an open air radio frequency beam measurement capability that was realigned from the RF Threat Capabilities accomplishment.\n- Initiate the upgrade of open air radio frequency signal density enhancement systems.\n- Complete the development of an advanced Early Warning and Acquisition radar hybrid laboratory simulator that was realigned from the RF Threat Capabilities accomplishment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.030"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.030"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Complete the update to existing laboratory simulators of foreign radars.\n- Continue the upgrade of open-loop threat simulators at ECR.\n- Continue the development of an open air radio frequency beam measurement capability.\n- Continue the upgrade of open air radio frequency signal density enhancement systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "REQUIREMENTS AND VALIDATION"
                                    },
                                    "Description": {
                                        "val": "Validate and track intel updates of the threat systems necessary for the operation and continuous improvement of Navy laboratories and ranges which provide engineering support, testing and analysis to the developers, integrators, testers and users of systems and technologies that counter or penetrate air defenses."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.979"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued to provide program management, systems engineering, and requirements identification for the development of simulators and foreign material acquisition.\n- Continued to validate simulators and stimulators at the Navy tri-lab centers."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.981"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue to provide program management, systems engineering, and requirements identification for the development of simulators and foreign material acquisition.\n- Continue to validate simulators and stimulators at the Navy tri-lab centers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.981"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.981"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue to provide program management, systems engineering, and requirements identification for the development of simulators and foreign material acquisition.\n- Continue to validate simulators and stimulators at the Navy tri-lab centers."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "ENGAGEMENT CAPABILITIES"
                                    },
                                    "Description": {
                                        "val": "Provide the test community with the modern threat engagement systems necessary for Test and Evaluation of airborne alert, Situation Awareness, targeting systems and airborne response systems. \n\nThe Engagement Capabilities accomplishment was created to allow a more detailed tracking for some of the projects that were previously grouped under the Radio Frequency (RF) Threat Capabilities accomplishment.  All projects listed as continue or complete under this accomplishment were realigned from the RF Threat Capabilities accomplishment.\n\nFunding increases from FY 2014 to FY 2015 due to the need for additional test capability for the Next Generation Jammer and the Joint Strike Fighter programs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.164"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Projects listed as Continue or Complete under this accomplishment were realigned from the Radio Frequency (RF) Threat Capabilities accomplishment.\n\n- Continue the upgrade and integration of missile simulation models that was realigned from the RF Threat Capabilities accomplishment.\n- Continue the development of a closed-loop threat surface to air missile system simulator that was realigned from the RF Threat Capabilities accomplishment.\n- Continue the conversion of a threat system that was realigned from the RF Threat Capabilities accomplishment.\n- Complete the development of the Long Range Threat System (LRTS) simulator at Electronic Combat Range (ECR) that was realigned from the RF Threat Capabilities accomplishment.\n- Complete the development of a Digital Radio Frequency Memory Jammer simulator that was realigned from the RF Threat Capabilities accomplishment.\n- Complete the upgrade to the J-32B Advanced Threat System at ECR that was realigned from the RF Threat Capabilities accomplishment.\n- Initiate the minor upgrades to open air and laboratory threat systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.525"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.525"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue the upgrade and integration of missile simulation models.\n- Continue the development of a closed-loop threat surface to air missile system simulator.\n- Continue the conversion of a threat system.\n- Continue the minor upgrades to open air and laboratory threat systems.\n- Complete the development of the LRTS simulator at ECR."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Successfully achieve Initial Operational Capability of Navy Threat Simulation projects within 60 days of approved schedule and have test capabilities scheduled in support of Navy test programs within 180 days."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "0672"
                    },
                    "ProjectTitle": {
                        "val": "Effect Nav E\/W (ENEWS)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "12.219"
                        },
                        "CurrentYear": {
                            "val": "13.110"
                        },
                        "BudgetYearOne": {
                            "val": "14.736"
                        },
                        "BudgetYearOneBase": {
                            "val": "14.736"
                        },
                        "BudgetYearTwo": {
                            "val": "14.395"
                        },
                        "BudgetYearThree": {
                            "val": "14.752"
                        },
                        "BudgetYearFour": {
                            "val": "14.322"
                        },
                        "BudgetYearFive": {
                            "val": "14.841"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The objective of the Effectiveness of Navy Electronic Warfare (EW) Systems (ENEWS) Project is the development and application of necessary simulation assets to determine the effectiveness of EW for Navy ships in simulated real-world engagement situations.  The project primarily supports the introduction of modern, effective shipboard and off-board EW systems, and tactics for the Surface Navy.  The heavy use of ENEWS resources by Naval Sea Systems Command, Operational Test and Evaluation (OT&E) Force, Special Operations, and other EW Research, Development, Test and Evaluation (T&E) agencies speaks to the overall importance of this project.  The project provides support for EW system design, Engineering Test (ET), Development Test (DT), Operational Test (OT), and the development of utilization tactics.  In the past ENEWS quick reaction capabilities have had great impact on crisis situations such as the Libyan crises, Iran threat, Persian Gulf crisis, and Operation Desert Shield\/Storm.  Simulation Display (SIMDIS) is an ENEWS modeling tool that was developed to support T&E.  SIMDIS has been adopted by most Department of Defense (DoD) T&E and training ranges to provide visualization of T&E and training scenarios.  One of the primary threats to surface ships is Anti-Ship Capable Missile systems.  The ENEWS Project is unique in that it is the only project within DoD dedicated to developing and providing realistic Anti-Ship Capable Missile assets to test and evaluate the effectiveness of shipboard EW systems and tactics against these type threats.  The ENEWS Project is a critical part of the Office of the Secretary of Defense Test Resource Master Plan.  This plan employs many of the ENEWS assets for planning, analysis, testing, and verification of shipboard and off-board EW systems techniques and tactics.  As part of its normal activities, ENEWS provides Development Test and Evaluation (DT&E), OT&E, and Follow-on Operational Test and Evaluation (FOT&E) support to the surface Navy for all ship classes.  DT, OT and FOT&E support includes AN\/SLQ-32 Surface Electronic Warfare Improvement Program (SEWIP),  Nulka, Rapid Anti-ship Integrated Defense System, all MK245 Giant tests, advanced InfraRed (IR) decoys, decoy placement, ship IR signature and radar cross section measurement of DDG-51, LPD-17, DD-21 and PC class ships, High Power Microwave program, and other ship self-defense initiatives, including T&E of Future Naval Capability process.  In addition, ENEWS assets are regularly employed to test the effectiveness of North Atlantic Treaty Organization (NATO) ships' EW systems in joint allied exercises. ENEWS assets also support Joint EW exercises that are conducted with Rim of the Pacific (RIMPAC) nations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "CLASSIFIED PROGRAM"
                                    },
                                    "Description": {
                                        "val": "Details about this program are classified.\n\nDetails about this program and any changes are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.650"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Details are of a higher classification."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.626"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Details are of a higher classification."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.500"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.500"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Details are of a higher classification."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HARDWARE SIMULATION SYSTEMS"
                                    },
                                    "Description": {
                                        "val": "Maintain and perform Hardware and Software Upgrades to the inventory of ENEWS flyable and shore based Anti-Ship Capable Missile (ASCM) Electro-Optic\/Infrared (EO\/IR), Visible and Radio Frequency (RF) Simulators.  Perform characterization of IR and RF simulators as part of periodic evaluation of simulation performance and collect performance data for comparison with previously recorded data.  Development and maintenance of all simulator control panels.\n\nThe increase between FY 2014 and FY 2015 is due to the Effectiveness of Naval EW Systems Technical Change. This funding increase supports critical simulator capability upgrades necessary to test, evaluate and demonstrate the effectiveness of Surface Electronic Warfare."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.887"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued annual maintenance of ENEWS simulators to support flight\/shore based tests.\n- Completed software intelligence upgrades to the FOXTROT 3 TOWSIM.\n- Completed characterization of NOVEMBER Va\/Vb simulator.\n- Initiated software intelligence upgrades to the MEIR 3 and MIKE 3.\n- Initiated and completed characterization of the OMEGA simulator."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.800"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue annual maintenance of ENEWS simulators to support flight\/shore based tests.\n- Complete software intelligence upgrades to the MEIR 3 and MIKE 3 simulators.\n- Initiate hardware upgrades to the SUMMIT Simulator.\n- Initiate software upgrades to the VICTOR Standard Instrumentation (SIP)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.786"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.786"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2014 less those noted completed below.\n- Initiate hardware upgrades to the FOXTROT 3 TOWSIM."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SIMULATION VALIDATION AND REQUIREMENTS"
                                    },
                                    "Description": {
                                        "val": "Provides for the validation of hardware simulators and digital models.  Develops reports that contain detailed descriptions and parametric data of the threat simulators or digital models and compares the simulator's parametric data to the actual threats parametric data.  Provide technical management functions in support of the ENEWS project; engineering and technical support requirements for the overall efforts of ASCM simulator and digital model development to meet DT\/OT testing requirements, development of detailed test resource requirements and provides an interface between OPNAV N2\/N6, Office of Naval Research, Naval Post Graduate School (NPS) and other ENEWS oversight activities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.904"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued management of the SVWG.\n- Completed QUESTION and UNIFORM hardware validation reports.\n- Completed OMEGA and GAMMA hardware validation reports.\n- Deferred FOXTROT 3 TOWSIM hardware validation report.\n- Initiated and completed update of the FY 2013 Program Management Plan.\n- Initiated and completed FY 2013 quarterly reports, earned value management analysis, progress tracking and analysis.\n- Initiated SIGMA hardware validation report."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.845"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue participation in the SVWG.\n- Continue SIGMA simulator hardware validation report.\n- Initiate and complete update of the 2014 Program Management Plan.\n- Initiate and complete FY2014 monthly reports, performance based management and analysis, financial execution reporting and assessment.\n- Initiate OMEGA 2 and ZETA simulator hardware validation report."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.649"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.649"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2014 less those noted completed below.\n- Complete SIGMA, OMEGA 2 and ZETA simulator hardware validation reports.\n- Initiate and complete update of the 2015 Program Management Plan.\n- Initiate and complete FY2015 monthly reports, performance based management and analysis, financial execution reporting and assessment.\n- Initiate LAMBDA simulator hardware validation report."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SUPPORT AND COMPUTERS SIMULATION SYSTEMS"
                                    },
                                    "Description": {
                                        "val": "Perform maintenance and intelligence upgrades to EO\/IR, Digital, and RF Laboratory Simulation testing facilities and flight support equipment based on existing and emerging complex threat systems.  Development of T&E scenarios and environmental modeling to support electronic support (ES) and electronic attack (EA) testing; modify ASCM Digital Models based on the latest intelligence data obtained from threat databases.\n\nThe increase between FY 2014 and FY 2015 is due to the Effectiveness of Naval EW Systems Technical Change. This funding increase to support critical simulator capability upgrades and digital model development necessary to test, evaluate and demonstrate effectiveness of Surface Electronic Warfare."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.778"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued maintenance and upgrades to shore-based test facilities and mobile test vans as required to conduct testing in support of SEWIP, Nulka and multi-function EW programs. \n- Continued to transition environmental, threat and platform simulations from Subversion to Mercurial Distributed Version Control System. \n- Continued upgrades to configuration control software library as new releases became available.\n- Continued to develop new digital models of Anti-ship Cruise Missile (ASCM) threats as they became available.\n- Continued upgrades and maintenance of flight support systems as necessary to support the IR\/RF ENEWS simulators.\n- Continued improvements and intelligence upgrades to digital models including INDIA I, II, III, LIMA I, II, NOVEMBER, OMEGA and GAMMA digital models. \n- Continued upgrades and user friendly enhancements to the Simulation Display (SIMDIS) toolset\n- Completed user friendly enhancements for the TANGO and TANGO II digital models.\n- Initiated user friendly enhancements for the NOVEMBER IV digital model."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.839"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of 2013, less those noted as completed below.\n- Complete simulator user friendly enhancements for the NOVEMBER IV digital model.\n- Complete improvements and intelligence upgrades to the mmW digital models. \n- Initiate development of LIMA III and LIMA IV digital models"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.801"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.801"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of 2014, less those noted as completed below.\n- Continue development of LIMA III and LIMA IV digital models. \n- Initiate digital model upgrades to support Surface Electronic Warfare Improvement Program (SEWIP) Block 3 test and evaluation."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics are discussed within each project (R2a)."
                        }
                    }
                }
            ]
        }
    }
}