{
    "id": "850e4fc0882865034518b9c68384279c06b9467b",
    "meta": {
        "filename": "dod-2015_RDTE_2015_DARPA_RDTE_JustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2015.zzz_unzipped_RDTE_JustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0603286E"
        },
        "ProgramElementTitle": {
            "val": "ADVANCED AEROSPACE SYSTEMS"
        },
        "R1LineNumber": {
            "val": "40"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "168.376"
            },
            "CurrentYear": {
                "val": "144.804"
            },
            "BudgetYearOne": {
                "val": "129.723"
            },
            "BudgetYearOneBase": {
                "val": "129.723"
            },
            "BudgetYearTwo": {
                "val": "178.043"
            },
            "BudgetYearThree": {
                "val": "186.011"
            },
            "BudgetYearFour": {
                "val": "189.790"
            },
            "BudgetYearFive": {
                "val": "193.755"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Advanced Aerospace Systems program element is budgeted in the Advanced Technology Budget Activity because it addresses high pay-off opportunities to dramatically reduce costs associated with advanced aeronautical systems and provide revolutionary new system capabilities for satisfying current and projected military mission requirements.  Research and development of integrated system concepts, as well as enabling vehicle subsystems will be conducted.  Studies conducted under this project include examination and evaluation of emerging aerospace threats, technologies, concepts, and applications for missiles, munitions, and vehicle systems."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "174.316"
                },
                "CurrentYear": {
                    "val": "149.804"
                },
                "BudgetYearOne": {
                    "val": "184.227"
                },
                "BudgetYearOneBase": {
                    "val": "184.227"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "168.376"
                },
                "CurrentYear": {
                    "val": "144.804"
                },
                "BudgetYearOne": {
                    "val": "129.723"
                },
                "BudgetYearOneBase": {
                    "val": "129.723"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-5.940"
                },
                "CurrentYear": {
                    "val": "-5.000"
                },
                "BudgetYearOne": {
                    "val": "-54.504"
                },
                "BudgetYearOneBase": {
                    "val": "-54.504"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.240"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "-12.697"
                    },
                    "CurrentYear": {
                        "val": "-5.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "7.500"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "4.254"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-4.757"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-54.504"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-54.504"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2013:  Decrease reflects Congressional reductions for Sections 3001 & 3004, sequestration adjustments, the SBIR\/STTR transfer offset by Congressional  adds and reprogrammings.\nFY 2014:  Decrease reflects a reduction for prior year carryover. \nFY 2015:  Decrease reflects transition of LRASM work to the Services and drawdown of the Persistent Close Air Support program."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "AIR-01"
                    },
                    "ProjectTitle": {
                        "val": "ADVANCED AEROSPACE SYSTEMS"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "168.376"
                        },
                        "CurrentYear": {
                            "val": "144.804"
                        },
                        "BudgetYearOne": {
                            "val": "129.723"
                        },
                        "BudgetYearOneBase": {
                            "val": "129.723"
                        },
                        "BudgetYearTwo": {
                            "val": "178.043"
                        },
                        "BudgetYearThree": {
                            "val": "186.011"
                        },
                        "BudgetYearFour": {
                            "val": "189.790"
                        },
                        "BudgetYearFive": {
                            "val": "193.755"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Advanced Aerospace Systems program element is budgeted in the Advanced Technology Budget Activity because it addresses high pay-off opportunities to dramatically reduce costs associated with advanced aeronautical systems and provide revolutionary new system capabilities for satisfying current and projected military mission requirements.  Research and development of integrated system concepts, as well as enabling vehicle subsystems will be conducted.  Studies conducted under this project include examination and evaluation of emerging aerospace threats, technologies, concepts, and applications for missiles, munitions, and vehicle systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Persistent Close Air Support (PCAS)"
                                    },
                                    "Description": {
                                        "val": "The Persistent Close Air Support (PCAS) program will significantly increase close air support (CAS) capabilities by developing a system to allow continuous CAS availability and lethality to the supported ground commander.  The enabling technologies are: manned\/unmanned attack platforms, next generation graphical user interfaces, data links, digital guidance and control, and advanced munitions.  PCAS will demonstrate the ability to digitally task a CAS platform from the ground to attack multiple\/simultaneous targets.  PCAS will allow the Joint Tactical Air Controller (JTAC) the ability to rapidly engage multiple moving targets simultaneously within the area of operation.  PCAS's ability to digitally task a CAS platform to attack multiple\/simultaneous targets would improve U.S. ground forces operations and speed of attack.  The system will be designed to reduce collateral damage and potential fratricide to friendly forces.  The anticipated transition partners are the Air Force, Special Operations Command, and the United States Marine Corps."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "22.792"
                                            },
                                            "Text": {
                                                "val": "-  Integrated subcomponent developer critical enabling technology components into system integrator A-10 and JTAC kit designs.\n-  Performed field testing of Government furnished JTAC targeting software with the United States Marine Corps and Special Forces.\n-  Designed modifications to A-10 demonstration aircraft and conducted software and hardware ground testing of avionics equipment.\n-  Completed designs of next generation JTAC kit and performed hardware and software breadboard testing in a laboratory environment.\n-  Commenced new technology development to benefit manned\/unmanned aircraft conducting close air support, including a smart-rail device that will contain the elements necessary to execute PCAS capability across a variety of platforms.\n-  Coordinated with flight testing entities and Government safety partners to ensure safety of flight of PCAS air technologies to include avionics and weapons engagement algorithms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "26.304"
                                            },
                                            "Text": {
                                                "val": "-  Perform ground test of A-10 demonstration aircraft architecture, networking, and avionics.\n-  Conduct flight tests of PCAS aircraft equipped with LITENING targeting Pod with advanced datalink capabilities.\n-  Complete hardware\/software fabrication and field test of prototype PCAS kit for dismounted JTAC.\n-  Conduct technical readiness review of PCAS aircraft systems and JTAC kit.\n-  Prepare for and commence live fire demonstrations of PCAS prototype system."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.723"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.723"
                                            },
                                            "Text": {
                                                "val": "-  Complete flight testing of PCAS prototype system.\n-  Transition elements of PCAS air and ground systems to targeted Service partners."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Aerospace System Concepts"
                                    },
                                    "Description": {
                                        "val": "Studies conducted under this program examine and evaluate emerging aerospace technologies and system concepts for applicability to military use.  This includes the degree and scope of potential impact\/improvements to military operations, mission utility, and warfighter capability.  Studies are also conducted to analyze emerging aerospace threats along with possible methods and technologies to counter them.  The feasibility of achieving potential improvements, in terms of resources, schedule, and technological risk, is also evaluated.  The results from these studies are used, in part, to formulate future programs or refocus ongoing work.  Topics of consideration include: methods of defeating enemy anti-aircraft attacks; munition technologies to increase precision, range, endurance, and lethality of weapons for a variety of mission sets; novel launch systems; air vehicle control, power, propulsion, materials, and architectures; and payload and cargo handling systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.381"
                                            },
                                            "Text": {
                                                "val": "-  Performed trade studies and modeling and simulation for novel technologies.\n-  Conducted enabling technology and sub-system feasibility experiments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "-  Define performance constraints and determine design flexibility.\n-  Validate sub-system performance and conduct sub-system risk reduction testing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "-  Conduct brassboard demonstrations of novel technologies.\n-  Initiate studies of emerging concepts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tactically Exploited Reconnaissance Node (TERN)"
                                    },
                                    "Description": {
                                        "val": "The goal of the Tactically Exploited Reconnaissance Node (TERN) program is to develop a systems approach for, and perform technical demonstration of, a Medium-Altitude, Long-Endurance Unmanned Aerial Vehicle (MALE UAV) capability from smaller ships.  The program will demonstrate the technology for launch and recovery of large unmanned aircraft capable of providing persistent 24\/7 Intelligence, Surveillance, and Reconnaissance (ISR) and strike capabilities at long radius orbits.  By extending the ISR\/strike radius and simultaneously increasing time on station beyond current capabilities from smaller ships, TERN will enable novel operational concepts including maritime surveillance and responsive, persistent deep overland ISR and strike, without requirement for forward basing.  To achieve these goals, the program will create new concepts for aircraft launch and recovery, aircraft logistics and maintenance, and aircraft flight in regimes associated with maritime operating conditions.  The program will culminate in a launch and recovery demonstration.  Application of TERN technologies and operational concepts will enable a novel and cost efficient approach for multiple mission sets.  The anticipated transition partner is the Navy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.185"
                                            },
                                            "Text": {
                                                "val": "-  Initiated launch and recover technique evaluations and trade studies.\n-  Initiated studies on integration with existing Service systems and systems architectures."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.000"
                                            },
                                            "Text": {
                                                "val": "-  Define the launch and recovery technique through evaluations and trade studies.\n-  Complete studies on integration with existing Service systems and systems architectures.\n-  Study aircraft design trades and approaches to best meet performance goals at minimum lifecycle cost.\n-  Begin development of simulation and control schemes to achieve high precision approach.\n-  Identify equipment and interface requirements for ship launch and recovery systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "32.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "32.000"
                                            },
                                            "Text": {
                                                "val": "-  Continue technology maturation and preliminary design.\n-  Initiate risk reduction simulations and testing.\n-  Begin fabrication and testing of demonstrator system hardware."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aerial Reconfigurable Embedded System (ARES)"
                                    },
                                    "Description": {
                                        "val": "Current and future land and ship-to-shore operations will require rapid and distributed employment of U.S. forces on the battlefield.  The Aerial Reconfigurable Embedded System (ARES) program will develop a vertical take-off and landing (VTOL), modular unmanned air vehicle that can carry a 3,000 lb useful load at a range of 250 nautical miles on a single tank of fuel.  ARES will enable distributed operations and access to compact, high altitude landing zones to reduce warfighter exposure to hostile threats and bypass ground obstructions.  ARES modular capability allows for different mission modules to be quickly deployed at the company level.  This enables the flexible employment of the following capabilities: cargo resupply, casualty evacuation, reconnaissance, weapons platforms, and other types of operations.  The enabling technologies of interest include adaptive wing structures, ducted fan propulsion system, lightweight materials, and advanced flight controls for stable transition from vertical to horizontal flight.  Additionally, the program will explore new adaptable landing gear concepts to enable operations from irregular landing zones and moving launch\/recovery platforms.  ARES vehicles could be dispatched for downed airman recovery, for evacuating injured personnel from difficult-to-access locations, or to resupply isolated small units.  ARES is well suited for enhanced company operations concepts which would provide the warfighter\/team increased situational awareness for operations in an urban environment.  In FY13, this program was funded from PE 0602702E, Project TT-07.  The anticipated transition partners for this effort are the Army, Marine Corps, and Special Operations Forces."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "23.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete Critical Design Review for the ARES system.\n-  Fabricate custom components, acquire powerplant and drivetrain components.\n-  Perform one third scale powered tunnel test of flight module with cargo module.\n-  Conduct component testing and static propulsion testing, showing feasibility and function of critical technology components.\n-  Complete development of flight control software to ensure successful flight and ground testing.\n-  Conduct subsystem testing and integration of components into the full scale prototype ARES system.\n-  Complete hardware-in-the-loop and software-in-the-loop testing with fully integrated full scale prototype ARES system.\n-  Conduct a test readiness review in preparation for ground and test demonstrations of the prototype vehicle."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "23.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "23.000"
                                            },
                                            "Text": {
                                                "val": "-  Conduct ground demonstrations of the prototype vehicle.\n-  Conduct flight test demonstrating that the prototype meets program objectives."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Hypersonic Air-breathing Weapon Concept (HAWC)"
                                    },
                                    "Description": {
                                        "val": "The objective of the Hypersonic Air-breathing Weapon Concept (HAWC) program, an outgrowth of the Integrated Hypersonics program, is to develop and demonstrate technologies that will enable transformational changes in responsive, long-range strike against time-critical or heavily defended targets.  HAWC will pursue flight demonstration of the critical technologies for an effective and affordable air-launched hypersonic cruise missile.  These technologies include advanced air vehicle configurations capable of efficient hypersonic flight, hydrocarbon scramjet-powered propulsion to enable sustained hypersonic cruise, thermal management approaches designed for high-temperature cruise, and affordable system designs and manufacturing approaches.  HAWC technologies also extend to reusable hypersonic air platforms for applications such as global presence and space lift.  The HAWC program will leverage advances made by the previously funded Falcon, X-51, and HyFly programs.  This is a joint program with the Air Force, and HAWC technologies are planned for transition to the Air Force after flight testing is complete."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.000"
                                            },
                                            "Text": {
                                                "val": "-  Conduct hypersonic air-breathing missile objective system trades studies and conceptual design definition.\n-  Derive hypersonic air-breathing missile demonstration system design from the objective system and begin developing the suite of enabling technologies.\n-  Begin developing flight testing plans for the hypersonic air-breathing missile demonstrator.\n-  Initiate risk reduction testing of enabling subsystem technologies for the hypersonic air-breathing missile demonstrator."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "25.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "25.000"
                                            },
                                            "Text": {
                                                "val": "-  Continue risk reduction testing of subsystem technologies for hypersonic air-breathing missile demonstrator.\n-  Complete preliminary design of hypersonic air-breathing missile flight demonstration system.\n-  Complete detailed plans for flight testing of the air-breathing missile demonstration system.\n-  Begin procurement of long lead hardware for hypersonic air-breathing missile flight demonstration vehicle."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tactical Boost Glide"
                                    },
                                    "Description": {
                                        "val": "The Tactical Boost Glide (TBG) program, an outgrowth of the Integrated Hypersonics program,  is a Joint DARPA \/ Air Force effort that will develop and demonstrate technologies to enable air-launched tactical range hypersonic boost glide systems, including a flight demonstration of a vehicle that is traceable to an operationally relevant weapon that can be launched from current platforms.  The program will also consider traceability to, and ideally compatibility, with the Navy Vertical Launch System (VLS).  The metrics associated with this objective include total range, time of flight, payload, accuracy, and impact velocity.  The program will address the system and technology issues required to enable development of a hypersonic boost glide system considering (1) vehicle concepts possessing the required aerodynamic and aero-thermal performance, controllability and robustness for a wide operational envelope, (2) the system attributes and subsystems required to be both survivable and lethal in relevant operational environments, and (3) approaches to reducing cost and improving affordability for both the demonstration system and future operational systems.  TBG capabilities are planned for transition to the Air Force and the Navy."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "28.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete trade space analysis for tactical range hypersonic boost glide systems.\n-  Begin development of TBG Concept of Operations (ConOps).\n-  Begin development of TBG Operational System (OS) conceptual designs and system capabilities.\n-  Begin development of TBG Demonstration System (DS) conceptual design and system requirements.\n-  Begin initial technology maturation plans (TMPs)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete TBG Operational System conceptual design reviews and system capability documentation.\n-  Complete TBG Demonstration System conceptual design and systems requirements reviews.\n-  Complete initial TMPs.\n-  Select booster and launch platforms.\n-  Conduct initial test range and range safety coordination.\n-  Select TBG demonstration test range.\n-  Complete Phase I aerodynamic and aerothermal concept testing.\n-  Complete first generation aero databases.\n-  Develop initial flight test plan."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Collaborative Operations in Denied Environment"
                                    },
                                    "Description": {
                                        "val": "The goal of the Collaborative Operations in Denied Environment (CODE) program is to enhance mission performance, reduce cost, confound adversaries, and reduce reliance on space assets for navigation and communication by distributing mission functions such as sensing, communication, precision navigation, kinetic, and non-kinetic effects to small platforms and increasing their level of autonomy.  Collaboration of multiple assets offers new possibilities to conduct military missions using smaller air platforms to enhance survivability, reduce overall acquisition cost, create new effects, increase communications range and robustness in denied environments, increase search area, increase areas held at risk, reduce target prosecution reaction time, and provide multi-mission capabilities by combinations of assets.  This program is an outgrowth of the Manned-Unmanned Collaborative Autonomy program budgeted in PE 0602702E, TT-13.  This 6.3 effort will specifically focus on developing and demonstrating approaches that will expand the mission capabilities of legacy air assets though autonomy and collaborative behaviors."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.000"
                                            },
                                            "Text": {
                                                "val": "-  Initiate systems engineering phase.\n-  Perform trade studies and decompose selected missions. \n-  Develop collaborative algorithms, autonomous tactics, concepts for communication, and supervisory interface. \n-  Develop software module specifications compliant with standard based open architecture including OSD umanned aircraft system Control Segment. \n-  Evaluate algorithms, tactics, communication and interfaces, in high fidelity non-real time simulation against key performance parameters."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.000"
                                            },
                                            "Text": {
                                                "val": "-  Implement algorithms in first release of flightworthy software (release 1) hosted in mission computer compatible with demonstration platform and objective operational platforms. \n-  Modify demonstration platform to include mission computer and mesh network capable radio. \n-  Demonstrate in-flight capabilities of release 1 focused on vehicle level autonomy, including on-board real time sensor processing, contingency management, complex flight path planning. \n-  Demonstrate release 1 collaboration algorithms in real time simulation, including low bandwidth sensor fusion and collaborative tasking that maximizes system effectiveness.\n-  Develop collaborative algorithms, tactics, concepts for communication, and human interface.\n-  Evaluate algorithms, tactics, communication and interfaces, in non-real time simulation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Next Generation Air Dominance Study"
                                    },
                                    "Description": {
                                        "val": "The Next Generation Air Dominance study will define the projected threat domains and capability gaps for the 2020-2050 timeframe.  DARPA will conduct a study of current air dominance efforts in coordination with the United States Air Force and Navy and explore potential technology developmental areas to ensure the air superiority of the United States in the future.  The study will consider roles of manned and unmanned platforms; the relative performance of alternative integrated systems concepts that combine various mixes of capabilities networked together; and the cost effectiveness of alternative balances of platforms and systems that provide surveillance, command and control, electronic warfare, and weapons functions.  Innovative concepts for platform, propulsion, sensors, weapons integration, avionics, and active and passive survivability features will be explored as part of the concept definition effort.  This effort will also explore the expanded development and use of automated and advanced aerospace engineering design tools, modeling, and simulation in areas that can increase the likelihood of producing more capable products with improved efficiency.  Following the initial multi-agency study, DARPA will present technical challenges to industry to allow them to explore and present potential solutions as part of the technical feasibility and system integration studies.  Enabling technologies are advanced networking capabilities, reliable navigation, passive and active defense, electronic attack, area denial, advanced sensors, and cyber technologies.  After the study, it is envisioned that high potential prototype programs will emerge to develop technologies for future air dominance.  Early planning for future technologies will also help to define the funding baselines for DoD research and development and acquisition programs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Defined projected 2020-2050 threat domains and capability gaps.\n-  Identified funded baselines for DoD efforts for R&D and acquisition.\n-  Identified high value technologies and prototype opportunities.\n-  Out-briefed senior leadership on threat picture and high value opportunities.\n-  In-briefed industry and obtained feedback on potential technology opportunities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Conduct technology feasibility and system integration studies of identified high value technologies.\n-  Conduct Technical Interchange Meeting (TIM) to coordinate between development efforts.\n-  Out-brief senior leadership on results of technology development efforts, with high-potential prototype programs recommendations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Long Range Anti-Ship Missile Demonstration (LRASM)"
                                    },
                                    "Description": {
                                        "val": "In response to emerging threats, DARPA is building upon recent technology advances to develop and demonstrate standoff anti-ship strike technologies to reverse the significant and growing U.S. naval surface strike capability deficit.  The Long Range Anti-Ship Missile (LRASM) program is investing in advanced component and integrated system technologies capable of providing a dramatic leap ahead in U.S. surface warfare capability focusing on organic wide area target discrimination in a network denied environment, innovative terminal survivability in the face of advanced defensive systems, and high assurance target lethality approaches.  Specific technology development areas will include: robust precision guidance, navigation and control with GPS denial, multi-modal sensors for high probability target identification in dense shipping environments, and precision aimpoint targeting for maximum lethality.  Component technologies are being developed, demonstrated, and integrated into a complete weapon system.  The program will result in a high fidelity demonstration to support military utility assessment.  LRASM is a joint DARPA\/Navy effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "59.005"
                                            },
                                            "Text": {
                                                "val": "-  Conducted high fidelity independent government performance assessment of detailed designs against key performance criteria.\n-  Updated supporting documentation including concepts of operations, flight test and safety plans, lifecycle cost estimates, and transition plans.\n-  Completed final integration and checkout of initial guided test vehicle in preparation for flight testing.\n-  Completed end-to-end system flight demonstration of initial test missile.\n-  Developed booster adapter structure which mates standard Mk-114 booster clamp to missile body aft end.\n-  Completed detailed design of new hybrid canister.\n-  Analyzed shock and fly-out performance for the missile and canister.\n-  Completed minor airframe design modifications for canister fit and internal structure\/composite skin strengthened to react to vertical launch loads."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.500"
                                            },
                                            "Text": {
                                                "val": "-  Complete missile and canister integration for a surface launched system.\n-  Perform one controlled test vehicle flight from the Vertical Launching System.\n-  Validate demonstrated system performance.\n-  Complete final integration and checkout of final guided test vehicles in preparation for flight testing.\n-  Complete end-to-end system flight demonstrations on final test missiles."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Integrated Hypersonics (IH)"
                                    },
                                    "Description": {
                                        "val": "The goal of the Integrated Hypersonics (IH) program was to develop, mature, and test next-generation technologies needed for tactical to global-range, maneuverable, hypersonic flight.  IH sought to achieve technological advances in the areas of: next generation aero-configurations; thermal protection systems and hot structures; hypersonic airbreathing propulsion, adaptive guidance, navigation, and control; enhanced range and data collection methods; and advanced propulsion concepts, including real-time trajectory planning.  The IH program addressed technical challenges and improved understanding of boost-glide and airbreathing hypersonic flight through innovative ground-based testing, expanded modeling and simulation, and advanced analytic methods.  The Integrated Hypersonics (IH) program results are planned for transition to the Air Force and the Navy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.540"
                                            },
                                            "Text": {
                                                "val": "-  Implemented improvements in highly coupled hypersonic toolsets incorporating assessed uncertainties of key technologies from prior flight tests and ground testing.\n-  Refined hypersonic boost glide knowledge base and designs through enhanced developmental testing in the areas of aerodynamics, aerothermodynamics, guidance, navigation and control, and instrumentation.\n-  Improved high temperature materials base for hypersonic flight and re-entry vehicles applications through improved manufacturing, modeling, and ground based testing.\n-  Improved flight test range asset affordability and mission flexibility including options for large scale telemetry collection.\n-  Initiated focused hypersonic technology development efforts to advance the state-of-the-art in analytic methods, computational modeling and simulation, and ground-based testing of technologies.\n-  Began trade space analysis for tactical range hypersonic boost glide systems.\n-  Completed Hypersonic Test Vehicle-2 remediation activities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Integrated Sensor Is Structure (ISIS)"
                                    },
                                    "Description": {
                                        "val": "The joint DARPA\/Air Force Integrated Sensor Is Structure (ISIS) program performed technology risk reduction to support prospective future development of a stratospheric airship containing a radar of unprecedented dimensions that will address the nation's need for persistent wide-area surveillance, tracking, and engagement of time-critical air and ground targets.  The ISIS risk-reduction effort melded next-generation technologies for lightweight antenna apertures and components and lightweight multi-purpose structures.  The ISIS technology concept goal was to provide greater than ninety percent on-station 24\/7\/365 availability for simultaneous Airborne Moving Target Indicator (AMTI) (600 kilometers) and Ground-Based Moving Target Indicator (GMTI); greater than five years of autonomous, unmanned flight; in-theater communications links; and CONUS-based sensor analysis and operation.  The current technology risk-reduction efforts were focused on demonstrating the key technologies that would enable these capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Conducted X-band metrology testing in anechoic chamber, demonstrating that the metrology algorithms can automatically compensate for array distortions.\n-  Formulated ISIS test plan to support ground testing of the ISIS risk reduction radar.\n-  Developed hardware\/firmware for back-end processing of ISIS radar data.\n-  Conducted trade studies and materials characterizations to select seaming material\/processes.\n-  Conducted trade studies and analyses to support development of low-damage fabrication and assembly processes for airship hull assembly.\n-  Redesigned the power system to use alternate membrane technology.\n-  Developed an ISIS fuel cell subsystem based on alternate membrane technology and evaluated subsystem performance.\n-  Installed a combination of UHF\/X-band dual band panels and UHF-only panels and radar back end into ISIS test facility.\n-  Tested, characterized, and evaluated ISIS risk-reduction radar and demonstrated the radars ability to detect, track, and locate airborne targets."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Triple Target Terminator (T3)"
                                    },
                                    "Description": {
                                        "val": "The Triple Target Terminator (T3) program developed a high speed, long-range missile to engage air, cruise missile, and air defense targets.  T3 would be carried internally on stealth aircraft or externally on fighters, bombers, and UAVs.  The enabling technologies are: air breathing propulsion, advanced networking and data links, and flexible guidance and control.  T3 would allow any aircraft to rapidly switch between air-to-air and air-to-surface capabilities.  T3's speed, maneuverability, and network-centric capabilities would significantly improve U.S. aircraft survivability and increase the number and variety of targets that could be destroyed on each sortie.  The program is jointly funded with, and will transition to the Air Force."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "42.700"
                                            },
                                            "Text": {
                                                "val": "-  Fabricated and ground tested flight test articles.\n-  Obtained final flight test approval from Point Mugu Test Range.\n-  Conducted propulsion testing of flight weight engines.\n-  Completed flight qualification of Flight Termination System (FTS).\n-  Completed qualification of several subsystem components.\n-  Completed ground tests of flight test articles.\n-  Conducted captive carry test of flight test articles.\n-  Conducted separation tests of flight test articles.\n-  Completed propulsion testing of flight weight engines.\n-  Completed build and assembly of flight test articles.\n-  Conducted boost tests of flight test articles.\n-  Conducted airborne launch demonstrations of test articles against three target types.\n-  Completed and delivered final test report."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Vulture"
                                    },
                                    "Description": {
                                        "val": "The objective of the Vulture program was to demonstrate the required technology to enable an airborne payload to remain persistently on-station, uninterrupted and unreplenished, for over five years performing strategic and tactical communications, position\/navigation\/timing (PNT) and intelligence, surveillance, and reconnaissance missions over an area of interest.  The Vulture concept envisioned a re-taskable, persistent pseudo-satellite capability, in a notional aircraft package.  The program conducted subscale demonstration activities to prove out critical technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.773"
                                            },
                                            "Text": {
                                                "val": "-  Conducted tests of anti-reflective coatings for the solar arrays and provided the anti-reflective analysis report.\n-  Completed solar array iteration #1 testing.\n-  Developed engineering ground demonstrator and flight-like ground demonstrator for energy storage system.\n-  Completed the design and analysis for a peak power tracker for the solar arrays.  \n-  Completed an open-loop system design for an energy storage system.\n-  Completed the energy storage system composite materials report."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "Integrated Sensor Is Structure"
                                    },
                                    "Title": {
                                        "val": "Air Force PE 0305205F, Project 675372F"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "13.001"
                                        },
                                        "CurrentYear": {
                                            "val": "1.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "Integrated Sensor Is Structure:"
                                    },
                                    "Title": {
                                        "val": "Air Force PE 0603203F, Project 665A"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.750"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "Triple Target Terminator (T3)"
                                    },
                                    "Title": {
                                        "val": "Air Force"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "41.730"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                }
            ]
        }
    }
}