{
    "id": "85b8568114229d44c02939a92b968505f3ccfad4",
    "meta": {
        "filename": "dod-2015_RDTE_2015_AIRFORCE_V2_RDTE_JustificationBook_Air_Force_PB_2015.zzz_unzipped_RDTE_JustificationBook_Air_Force_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604281F"
        },
        "ProgramElementTitle": {
            "val": "Tactical Data Networks Enterprise"
        },
        "R1LineNumber": {
            "val": "61"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "21.355"
            },
            "CurrentYear": {
                "val": "42.745"
            },
            "BudgetYearOne": {
                "val": "39.110"
            },
            "BudgetYearOneBase": {
                "val": "39.110"
            },
            "BudgetYearTwo": {
                "val": "50.373"
            },
            "BudgetYearThree": {
                "val": "36.250"
            },
            "BudgetYearFour": {
                "val": "36.943"
            },
            "BudgetYearFive": {
                "val": "24.608"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Tactical Data Networks Enterprise (TDNE) contributes to the development, delivery and deployment of the next generation aerial layer network through a portfolio of legacy and advanced waveforms and airborne network management\/development efforts that advance interoperability and connectivity.  This will be accomplished via fielded and future ground and gateway investments while addressing warfighter urgent demands through the establishment of Quick Reaction Capabilities (QRC).  The TDNE conceptualizes, acquires and fields aerial layer networking capabilities supporting legacy, current, in-development, future and proposed systems across all domains of information exchange enabling strike, mobility, special operations, command and control (C2), intelligence, surveillance and reconnaissance (ISR), air, surface, subsurface and space operations.  These capabilities ensure a robust and agile extension of the global information domain out to the tactical edge in support of increasing air domain awareness.\n\nFunding will provide for the study (acquisitions current and proposed), analysis, enhancement, development, integration, demonstration, test, and evaluation of Tactical Data Links (TDLs) as a subset of the broader aerial layer networks.  TDLs are used in both peace time and combat environments to exchange information such as character-oriented and fixed-formatted messages, data, radar tracks, target information, platform status, imagery, free-text messaging and command assignments.  TDLs provide interoperability, local and global connectivity, and situational awareness to the user when operating under rapidly changing operational conditions.  TDLs increase mission effectiveness by providing enhanced air domain situational awareness, positive combat identification of aircraft in the network, fusion\/correlation of on- and off-board sensor data, digital sharing of machine to machine target and threat information, thereby, enabling time critical targeting and other mission assignment tasking. TDLs are used by all service theater command and control (C2) elements, weapons platforms, and sensors. TDLs include, but are not limited to: Link 16, Link 11, Situational Awareness Data Link (SADL), Variable Message Format (VMF), Intra-Flight Data Link (IFDL), and other Advanced TDL Link technologies, such as Tactical Targeting Network Technology (TTNT) and Multifunction Advanced Data Link (MADL). \n\nFunding also supports Family of Gateways study (acquisitions current and proposed), analysis, enhancement, development, integration, demonstration, test, and evaluation efforts that will allow joint combat forces to exchange information quickly and accurately by bridging discrete airborne, terrestrial, maritime, and space-based C4ISR networks producing operational effects not possible within individual networks (i.e. Battlefield Airborne Communication Node (BACN).  Gateway functions include enabling interoperability between data formats, protocols, and communication mediums.  Additionally, gateway functions extend connectivity range, consolidate data from multiple networks into high capacity links for transmission to key C4ISR nodes, route information between disadvantaged users, and fuse\/correlate data from multiple sources to improve accuracy.  Gateway functions also provide application hosting, shared data storage, on-demand information access, smart data forwarding, and system monitoring\/network management.  Funding will also support quick reaction response capability requests by the warfighter and support activities (including ramp-up) associated with the Joint Aerial Layer Network (JALN) Enterprise Analysis of Alternatives and its follow-on activities as directed by the JALN Council, in line with applicability of existing TDL performance, upgrade plans, engineering analysis, cost analysis of system designs and TDN Performance Improvements.  This includes studies and planning for a gateway node with the JALN Enterprise.\n\nThis program is in Budget Activity 5, System Development and Demonstration (SDD), it has passed Milestone B approval and is conducting engineering and manufacturing development tasks aimed at meeting validated requirements prior to full-rate production."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "24.534"
                },
                "CurrentYear": {
                    "val": "51.456"
                },
                "BudgetYearOne": {
                    "val": "46.999"
                },
                "BudgetYearOneBase": {
                    "val": "46.999"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "21.355"
                },
                "CurrentYear": {
                    "val": "42.745"
                },
                "BudgetYearOne": {
                    "val": "39.110"
                },
                "BudgetYearOneBase": {
                    "val": "39.110"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-3.179"
                },
                "CurrentYear": {
                    "val": "-8.711"
                },
                "BudgetYearOne": {
                    "val": "-7.889"
                },
                "BudgetYearOneBase": {
                    "val": "-7.889"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.033"
                    },
                    "CurrentYear": {
                        "val": "-0.423"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "-8.288"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.618"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-2.528"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-7.889"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-7.889"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY13 funding decreased due to a sequestration reduction of $2.528M.\n\nFY14 funding decreased due to Congressional Directed Reductions of $8.288M ($6.788M - Program Decrease, and $1.500M 5th to 4th Generation Gateway - Program Delay).\n\nFY15 funding decreased due to transferring $7.4M out of Project 657003, Airborne Networking Enterprise, to a DISA PE."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "655050"
                    },
                    "ProjectTitle": {
                        "val": "TDL System Integration"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "17.973"
                        },
                        "CurrentYear": {
                            "val": "14.262"
                        },
                        "BudgetYearOne": {
                            "val": "18.764"
                        },
                        "BudgetYearOneBase": {
                            "val": "18.764"
                        },
                        "BudgetYearTwo": {
                            "val": "34.883"
                        },
                        "BudgetYearThree": {
                            "val": "36.250"
                        },
                        "BudgetYearFour": {
                            "val": "36.943"
                        },
                        "BudgetYearFive": {
                            "val": "24.608"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Funding will provide for the study, analysis, enhancement, development, integration, demonstration, costing, test, and evaluation of Tactical Data Links (TDL) as a subset of the broader aerial layer network.  TDLs are used in both peacetime and combat environments to exchange information such as character-oriented and fixed-formatted messages, data, radar tracks, target information, platform status, imagery, free-text messaging and command assignments.  TDLs provide interoperability, local and global connectivity, and situational awareness to the user when operating under rapidly changing operational conditions.  TDLs increase mission effectiveness by providing enhanced air domain situational awareness, positive combat identification of aircraft in the network, fusion\/correlation of on- and off-board sensor data, digital sharing of machine to machine target and threat information and, thereby, enabling time critical targeting and other mission assignment tasking. TDLs are used by all service theater command and control (C2) elements, weapons platforms, and sensors.  \n\nThe number of Air Force platforms hosting TDLs has expanded from C2 aircraft (E-3, E-8, E-11A, EQ-4B, or other JALN analyzed platforms, etc.) to the fighter, bomber, intelligence, surveillance and reconnaissance (ISR), tanker, airlift and other tactical fleets (F-15, F-16, F-22A, Rivet Joint, B-1, B-2, B-52, etc.), as well as to precision guided munitions. Utilization of TDLs in a joint environment requires the integration of terminals into host platforms and interoperability of TDL networks across all deployed joint and coalition platforms.  TDLs have become the primary means of tactical, battlefield communications.\n\nEfforts in this project include waveform and integration activities. \n\nWaveform:\nWaveform activities include, but are not limited to, enabling and supporting Joint Interoperability of Tactical Command and Control Systems (JINTACCS), interoperable System Management and Requirements Transformation (iSMART), Coalition Interoperability, and Link 16 Enhancements.  Funding will provide training, logistics development, certification of individual TDL implementations to joint\/allied standards, establishment of service-wide network management procedures\/operations, and system wide enhancements\/testing.\n\nIntegration:\nIntegration activities include, but are not limited to, Data Link Test Facility (DTF), Air Force Participating Test Unit (AFPTU), Joint Airborne Network Tactical Edge (JAN-TE), Network Centric Capability Assessment (NCCA), Tactical Edge Network C2 (TEN C2), integration analysis of the Joint Warfighting Integrated NetOps (JWIN) Joint Concept Technology Demonstration (JCTD), Cursor on Target (CoT), Tactical Communications Suite (TCS), and analysis of integration on platforms of existing TDN systems, system-of-systems analysis.  Funding will ensure continued enhanced interoperability of Air Force and joint assets through efforts such as early systems engineering and use of the POET (Political, Operational, Economic and Technical) process for program requirements analysis and architectural design development\/coordination of all TDN standards and management capabilities, configuration management, platform\/system interoperability assessments, development of government reference architectures, and interoperability certification testing.\n\nActivities also include studies and analysis (engineering and cost) to support both current program planning and execution and future program planning efforts for Tactical Data Networks, including development of joint concepts for C2 of JALN, JALN AoA follow-on analysis, JALN gateway planning, and the Joint Tactical Air Picture (JTAP).\n\nThis program is in Budget Activity 5, System Development and Demonstration (SDD), it has passed Milestone B approval and is conducting engineering and manufacturing development tasks aimed at meeting validated requirements prior to full-rate production."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Tactical Data Networks (TDN) Integration"
                                    },
                                    "Description": {
                                        "val": "Tactical Data Networks (TDN) Integration activities include, but are not limited to, Data Link Test Facility (DTF), Air Force Participating Test Unit (AFPTU), Network Centric Capability Assessment (NCCA), Coalition Interoperability, Joint Aerial Layer Network (JALN) Analysis of Alternatives (AoA) follow-on, JALN gateway planning, and Joint Warfighting Integrated NetOps (JWIN) Joint Concept Technology Demonstration (JCTD)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.354"
                                            },
                                            "Text": {
                                                "val": "Funding provided training, logistics, development, and certification to individual Tactical Data Link (TDL) implementations to joint\/allied standards."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.733"
                                            },
                                            "Text": {
                                                "val": "Funding is providing training, logistics, development, and certification to individual Tactical Data Link (TDL) implementations to joint\/allied standards. Funding is also providing management with the necessary engineering, costing, technical, and administrative support needed to facilitate development."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.481"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.481"
                                            },
                                            "Text": {
                                                "val": "Funding will provide training, logistics, development, and certification to individual Tactical Data Link (TDL) implementations to joint\/allied standards, and will provide management with the necessary engineering, technical and administrative support needed to facilitate development.  Activities include support to TDL interoperability testing of development and fielded systems through the Data Link Test Facility (DTF); DoD mandated TDL MIL-STD conformance testing and interoperability assessments for all TDL capable Air Force platforms through the Air Force Participating Test Unit (AFPTU); and aerial layer network focused studies and analysis that support data link enhancements, and assessment of tactical airborne network and network management gaps that are validated in existing requirements documents through the Network Centric Capability Assessments (NCCA).  Activities will also include studies and analysis that include but are not limited to supporting both current program planning and execution and future program planning efforts for Tactical Data Networks, including development of joint concepts for Command & Control (C2) and network management of the Joint Aerial Layer Network (JALN), and JALN gateway planning.  Activities will also include Coalition Interoperability that provides program office system engineering to support Foreign Military Sales (FMS) case development, FMS planning for tech refresh modifications, and Crypto-Modernization."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint Interoperability of Tactical Command and Control Systems (JINTACCS)"
                                    },
                                    "Description": {
                                        "val": "Joint Interoperability of Tactical Command and Control Systems (JINTACCS) ensures interoperability of AF Tactical Data Link (TDL) systems with associated joint, allied, and coalition systems and includes development, interoperability certification, Tactical Data Link (TDL) message standard implementation utilizing interoperable System Management and Requirements Transformation (iSMART) (e.g., Links 11A\/B, 16, 22, Variable Message Format (VMF), Integrated Broadcast Service (IBS), Multifunction Advanced Data Link (MADL), and configuration management of standards."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.909"
                                            },
                                            "Text": {
                                                "val": "Funding ensured compatibility and interoperability of Tactical Data Links (TDLs) by conducting necessary joint compatibility and interoperability tests."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.369"
                                            },
                                            "Text": {
                                                "val": "Funding is ensuring compatibility and interoperability of Tactical Data Links (TDLs) by conducting necessary joint compatibility and interoperability tests.  Funding is also providing management with the necessary engineering, technical, and administrative support needed to facilitate development."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.729"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.729"
                                            },
                                            "Text": {
                                                "val": "Funding will ensure compatibility and interoperability of Tactical Data Links (TDLs) by conducting necessary joint compatibility and interoperability tests.  Funding will also provide management with the necessary engineering, technical, and administrative support needed to facilitate development."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cursor on Target (CoT)"
                                    },
                                    "Description": {
                                        "val": "Cursor on Target (CoT) is an extensible, 'What, When, Where' (W3) XML message format for interconnecting Command, Control, Communication & Computer (C4), intelligence, surveillance & reconnaissance (ISR) systems. The Cursor on Target (CoT) suite consists of the W3 base schema, 14 tailored sub-schemas, and a set of 10 S\/W plug-ins and translators that faciliate machine to machine (M2M) transmission of Command and Control (C2), intelligence, surveillance and reconnaissance (ISR), and situational awareness data at reduced cost compared with traditional integration methods."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.169"
                                            },
                                            "Text": {
                                                "val": "Funding supported development, test, certification and accreditation of new Cursor on Target (CoT) apps\/plug-ins\/schema, initial draft of a Cursor on Target (CoT) MIL-STD and transitioning of apps\/plug-ins\/schema to sustainment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.160"
                                            },
                                            "Text": {
                                                "val": "Funding is supporting development, test, certification and accreditation of new Cursor on Target (CoT) apps\/plug-ins\/schema, development of the Cursor on Target (CoT) MIL-STD and transitioning of apps\/plug-ins\/schema to sustainment.  Funding is also providing management with the necessary engineering, technical, and administrative support needed to facilitate development."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.554"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.554"
                                            },
                                            "Text": {
                                                "val": "Funding will support development, test, certification and accreditation of new Cursor on Target (CoT) apps\/plug-ins\/schema, development of the Cursor on Target (CoT) MIL-STD and transitioning of apps\/plug-ins\/schema to sustainment.  Funding will also provide management with the necessary engineering, technical, and administrative support needed to facilitate development."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Gateways Integration"
                                    },
                                    "Description": {
                                        "val": "Supporting integration efforts including Common Link Integration Processing (CLIP), Link 16 Alaska (LAK), Quick Reaction Capabilities (QRC), that cover work to support AF and Joint Urgent Operational Needs, and Joint Enterprise Terminal Pack (JETPack) Joint Concept Technology Demonstration (JCTD)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.541"
                                            },
                                            "Text": {
                                                "val": "Funding supported completion of the Joint Concept Technology Demonstration (JCTD) efforts including testing and verification of the Joint Enterprise Terminal Pack (JETPack) capabilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "RDTE:BA07:PE 0207448F"
                                    },
                                    "Title": {
                                        "val": "C2ISR TDL"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "1.447"
                                        },
                                        "CurrentYear": {
                                            "val": "1.406"
                                        },
                                        "BudgetYearOne": {
                                            "val": "1.782"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1.782"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "1.770"
                                        },
                                        "BudgetYearThree": {
                                            "val": "1.715"
                                        },
                                        "BudgetYearFour": {
                                            "val": "1.748"
                                        },
                                        "BudgetYearFive": {
                                            "val": "1.782"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF:BA05:Line Item #F01500"
                                    },
                                    "Title": {
                                        "val": "F-15"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.002"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.002"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "18.789"
                                        },
                                        "BudgetYearThree": {
                                            "val": "44.245"
                                        },
                                        "BudgetYearFour": {
                                            "val": "45.071"
                                        },
                                        "BudgetYearFive": {
                                            "val": "58.835"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF:BA05:Line Item #F01600"
                                    },
                                    "Title": {
                                        "val": "F-16"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "7.928"
                                        },
                                        "BudgetYearThree": {
                                            "val": "8.073"
                                        },
                                        "BudgetYearFour": {
                                            "val": "8.226"
                                        },
                                        "BudgetYearFive": {
                                            "val": "8.380"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF:BA05:Line Item #B00200"
                                    },
                                    "Title": {
                                        "val": "B-2A"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.257"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.049"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.049"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.474"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.400"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.497"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.199"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF:BA05:Line Item #B01B00"
                                    },
                                    "Title": {
                                        "val": "B-1B"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.696"
                                        },
                                        "BudgetYearOne": {
                                            "val": "1.261"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1.261"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "1.133"
                                        },
                                        "BudgetYearThree": {
                                            "val": "1.319"
                                        },
                                        "BudgetYearFour": {
                                            "val": "1.490"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF:BA05:Line Item #OTHACF"
                                    },
                                    "Title": {
                                        "val": "Other Aircraft"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.192"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.037"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.037"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "2.541"
                                        },
                                        "BudgetYearThree": {
                                            "val": "1.595"
                                        },
                                        "BudgetYearFour": {
                                            "val": "1.506"
                                        },
                                        "BudgetYearFive": {
                                            "val": "1.518"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "OPAF:BA03:Line Item #834010"
                                    },
                                    "Title": {
                                        "val": "General Information Technology"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.153"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.168"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.168"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "1.959"
                                        },
                                        "BudgetYearThree": {
                                            "val": "1.664"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.175"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.178"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Airborne Networking Directorate provides for common development, integration, and interoperability across the entire airborne network and ensures that data links are procured and maintained as a joint, end-to-end command and control system. Platform acquisition strategies vary by program, but the majority of development and integration is normally accomplished by the weapon system prime contractor."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_05_PE_0604281F_BPAC_655050_0.jpg"
                                }
                            }
                        ]
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "655262"
                    },
                    "ProjectTitle": {
                        "val": "Family of Gateways"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.382"
                        },
                        "CurrentYear": {
                            "val": "8.328"
                        },
                        "BudgetYearOne": {
                            "val": "20.346"
                        },
                        "BudgetYearOneBase": {
                            "val": "20.346"
                        },
                        "BudgetYearTwo": {
                            "val": "15.490"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Funding supports Family of Gateways study (acquisitions current and proposed), analysis, enhancement, development, integration, costing, demonstration, test, and evaluation efforts that will allow joint combat forces to exchange information quickly and accurately by bridging discrete airborne, terrestrial, maritime, and space-based C4ISR networks producing operational effects not possible within individual networks.  Gateway functions include enabling interoperability between data formats, protocols, and communication mediums.  Additionally, gateway functions extend the connectivity range, consolidate data from multiple networks into high capacity links for transmission to key C2ISR nodes, route information between disadvantaged users, and fuse\/correlate data from multiple sources to improve accuracy.  Gateway functions also provide application hosting, shared data storage, on-demand information access, smart data forwarding, and system monitoring\/network management.  Funding in this project will also support requests by the warfighter such as the Battlefield Airborne Communications Node (BACN), 5th to 4th and 5th to 5th Generation efforts, and the STRATCOM Distributed Nuclear Command and Control (DNC2) capabilities.  Additionally, funding will support activities associated with the Joint Aerial Layer Network (JALN) Enterprise Analysis of Alternatives and follow-on recommendation, in line with applicability of existing TDL performance, upgrade plans and engineering analysis of system designs and TDN Performance Improvements.  \n\nEfforts in this project include waveform, ground, and quick reaction capability activities.\n\nWaveforms:\nWaveform activities include, but are not limited to Common Link Integration Processing (CLIP), Situational Awareness Data Link (SADL), and 5th to 4th Generation efforts. CLIP is a software-only, platform-independent middleware application that provides gateway services between diverse message sets and waveforms. CLIP will initially be fielded on the B-1 and B-52 platforms.  SADL integrates US Air Force close air support aircraft with the networked battlefield via the US Army's Enhanced Position Location Reporting System (EPLRS).  The 5th to 4th Generation gateway facilitates sharing of 5th Generation aircraft track data with 4th Generation aircraft as well as C2 nodes.\n\nGround:\nGround activities include, but are not limited to the Joint Air Defense System Integrator (JADSI), Pocket J, Link 16 Alaska (LAK), Tactical Edge Network C2 (TEN C2), and Joint Range Extension (JRE)\/JRE Transparant Multi-Platform Gateway Equipment Package(JTEP).  Funding will support enhancements to the interoperability and capabilities of fielded gateways through processing capability upgrades, operating system updates, display\/graphical user interface upgrades, incorporation of additional messaging standards and protocols, and completion of gateway architecture fielding.\n\nQuick Reaction Capability:\nQuick reaction capability activities include, but are not limited to, BACN and Beyond Line of Sight Command and Control (BLOS C2).  Funding will support AF rapid acquisition requirements for communications bridging of waveforms through gateway technology.  \n\nActivities also include studies and analysis to support both current program planning and execution and future program planning efforts for Family of Gateways.\n\nThis program is in Budget Activity 5, System Development and Demonstration (SDD), it has passed Milestone B approval and is conducting engineering and manufacturing development tasks aimed at meeting validated requirements prior to full-rate production."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "STRATCOM Distributed Nuclear Command and Control (DNC2)"
                                    },
                                    "Description": {
                                        "val": "STRATCOM Distributed Nuclear Command and Control (DNC2) efforts provide for the distribution of data from airborne assets to ground components for analysis, decision-making and re-tasking of critical assets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.382"
                                            },
                                            "Text": {
                                                "val": "Funding supported development, test, and fielding of operational-hardened, wideband Ground Entry Points (GEPs) and testing with up to three aircraft to ensure functionality of the system in an operational environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.100"
                                            },
                                            "Text": {
                                                "val": "Funding is supporting development, test, and fielding of operational-hardened, wideband Ground Entry Points (GEPs) and testing with up to three aircraft to ensure functionality of the system in an operational environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "5th To 4th Generation Gateway"
                                    },
                                    "Description": {
                                        "val": "5th to 4th Generation gateway facilitates sharing of 5th Generation track data with 4th Generation aircraft as well as Command and Control (C2) nodes.  Gateway functions include enabling interoperability between data formats, protocols, and communication mediums.  Additionally, gateway functions extend the connectivity range, consolidate data from multiple networks into high capacity links for transmission to key C2ISR nodes, route information between disadvantaged users, and fuse\/correlate data from multiple sources to improve accuracy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.228"
                                            },
                                            "Text": {
                                                "val": "Funding is supporting projects including 5th to 4th Generation gateway with engineering, technical, and administrative support."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.346"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.346"
                                            },
                                            "Text": {
                                                "val": "Funding will support projects including 5th to 4th Generation gateway with engineering, technical, and administrative support."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "RDTE:BA07:PE 0207448F"
                                    },
                                    "Title": {
                                        "val": "C2ISR TDL"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "1.447"
                                        },
                                        "CurrentYear": {
                                            "val": "1.406"
                                        },
                                        "BudgetYearOne": {
                                            "val": "1.782"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1.782"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "1.770"
                                        },
                                        "BudgetYearThree": {
                                            "val": "1.715"
                                        },
                                        "BudgetYearFour": {
                                            "val": "1.748"
                                        },
                                        "BudgetYearFive": {
                                            "val": "1.782"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF:BA05:Line Item #F01500"
                                    },
                                    "Title": {
                                        "val": "F-15"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.002"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.002"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "18.789"
                                        },
                                        "BudgetYearThree": {
                                            "val": "44.245"
                                        },
                                        "BudgetYearFour": {
                                            "val": "45.071"
                                        },
                                        "BudgetYearFive": {
                                            "val": "58.835"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF:BA05:Line Item #F01600"
                                    },
                                    "Title": {
                                        "val": "F-16"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "7.928"
                                        },
                                        "BudgetYearThree": {
                                            "val": "8.073"
                                        },
                                        "BudgetYearFour": {
                                            "val": "8.226"
                                        },
                                        "BudgetYearFive": {
                                            "val": "8.380"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF:BA05:Line Item #B00200"
                                    },
                                    "Title": {
                                        "val": "B-2A"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.257"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.049"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.049"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.474"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.400"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.497"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.199"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF:BA05:Line Item #B01B00"
                                    },
                                    "Title": {
                                        "val": "B-1B"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.696"
                                        },
                                        "BudgetYearOne": {
                                            "val": "1.261"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1.261"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "1.133"
                                        },
                                        "BudgetYearThree": {
                                            "val": "1.319"
                                        },
                                        "BudgetYearFour": {
                                            "val": "1.490"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF:BA05:Line Item #OTHACF"
                                    },
                                    "Title": {
                                        "val": "Other Aircraft"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.192"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.037"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.037"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "2.541"
                                        },
                                        "BudgetYearThree": {
                                            "val": "1.595"
                                        },
                                        "BudgetYearFour": {
                                            "val": "1.506"
                                        },
                                        "BudgetYearFive": {
                                            "val": "1.518"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "OPAF:BA03:Line Item #834010"
                                    },
                                    "Title": {
                                        "val": "General Information Technology"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.153"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.168"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.168"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "1.959"
                                        },
                                        "BudgetYearThree": {
                                            "val": "1.664"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.175"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.178"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Airborne Networking Directorate provides for common development, integration and interoperability across the entire airborne network and ensures that data links are procured and maintained as a joint, end-to-end, command and control system.  Platform acquisition strategies vary by program, but the majority of development and integration is normally accomplished by the weapon system prime contractor."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_05_PE_0604281F_BPAC_655262_0.jpg"
                                }
                            }
                        ]
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "657003"
                    },
                    "ProjectTitle": {
                        "val": "Airborne Networking Enterprise"
                    },
                    "SpecialProject": {
                        "val": "1"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "20.155"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This is a classified effort.  Details provided upon request."
                        }
                    }
                }
            ]
        }
    }
}