{
    "id": "865f32370f0ea22ccbf2da5dc606954c9e4c3789",
    "meta": {
        "filename": "dod-2015_RDTE_2015_DARPA_RDTE_JustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2015.zzz_unzipped_RDTE_JustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602303E"
        },
        "ProgramElementTitle": {
            "val": "INFORMATION & COMMUNICATIONS TECHNOLOGY"
        },
        "R1LineNumber": {
            "val": "13"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "348.530"
            },
            "CurrentYear": {
                "val": "399.597"
            },
            "BudgetYearOne": {
                "val": "334.407"
            },
            "BudgetYearOneBase": {
                "val": "334.407"
            },
            "BudgetYearTwo": {
                "val": "339.844"
            },
            "BudgetYearThree": {
                "val": "336.689"
            },
            "BudgetYearFour": {
                "val": "339.393"
            },
            "BudgetYearFive": {
                "val": "359.413"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Information and Communications Technology program element is budgeted in the applied research budget activity because it is directed toward the application of advanced, innovative computing systems and communications technologies.  \n\n     The High Productivity, High-Performance Responsive Architectures project is developing the necessary computing hardware and the associated software technology base required to support future critical national security needs for computationally-intensive and data-intensive applications.  These technologies will lead to new multi-generation product lines of commercially viable, sustainable computing systems for a broad spectrum of scientific and engineering applications; it will include supercomputer, embedded computing systems, and novel design tools for manufacturing of defense systems.\n\n     The Information Assurance and Survivability project is developing the technology required to make emerging information system capabilities (such as wireless and mobile code\/mobile systems) inherently secure, and to protect DoD's mission-critical systems against attack upon or through the supporting information infrastructure.  These technologies will enable our critical systems to provide continuous correct operation even when they are attacked, and will lead to generations of stronger protection, higher performance, and more cost-effective security and survivability solutions scalable to several thousand sites.  \n\n     The Language Technology project will develop and test powerful new Human Language Technology that will provide critical capabilities for a wide range of national security needs.  This technology will enable systems to a) automatically translate and exploit large volumes of speech and text in multiple languages obtained through a variety of means; b) to have two-way (foreign-language-to-English and English-to-foreign-language) translation; c) enable automated transcription and translation of foreign speech and text along with content summarization; and d) enable exploitation of captured, foreign language hard-copy documents.\n\n     The Cyber Technology project supports long term national security requirements through the development and demonstration of technology to increase the security of military information systems.  This involves networking, people, platforms, weapons sensors, and decision aids to create a whole that is greater than the sum of its parts.  The results are networked forces that operate with increased speed and synchronization and are capable of achieving massed effects without the physical massing of forces as required in the past."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "392.421"
                },
                "CurrentYear": {
                    "val": "413.260"
                },
                "BudgetYearOne": {
                    "val": "393.462"
                },
                "BudgetYearOneBase": {
                    "val": "393.462"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "348.530"
                },
                "CurrentYear": {
                    "val": "399.597"
                },
                "BudgetYearOne": {
                    "val": "334.407"
                },
                "BudgetYearOneBase": {
                    "val": "334.407"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-43.891"
                },
                "CurrentYear": {
                    "val": "-13.663"
                },
                "BudgetYearOne": {
                    "val": "-59.055"
                },
                "BudgetYearOneBase": {
                    "val": "-59.055"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.519"
                    },
                    "CurrentYear": {
                        "val": "-0.663"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "-40.734"
                    },
                    "CurrentYear": {
                        "val": "-15.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "10.000"
                    },
                    "CurrentYear": {
                        "val": "2.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-2.464"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-10.174"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-59.055"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-59.055"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2013:  Decrease reflects Congressional reductions for Sections 3001 & 3004 and directed reductions, sequestration adjustments, reprogrammings, and the SBIR\/STTR transfer offset by Congressional adds. \nFY 2014: Decrease reflects congressional reductions for program growth, the section 8023 FFRDC reduction, offset by an increase to the Plan X program.\nFY 2015:  Decrease reflects the completion of the BOLT program in the Language Technology Project (IT-04) in addition to the ending of the Advanced Vehicle Manufacturing programs in Project IT-02 (Meta and IFab)."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "IT-02"
                    },
                    "ProjectTitle": {
                        "val": "HIGH PRODUCTIVITY, HIGH-PERFORMANCE RESPONSIVE ARCHITECTURES"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "85.540"
                        },
                        "CurrentYear": {
                            "val": "72.028"
                        },
                        "BudgetYearOne": {
                            "val": "39.800"
                        },
                        "BudgetYearOneBase": {
                            "val": "39.800"
                        },
                        "BudgetYearTwo": {
                            "val": "54.598"
                        },
                        "BudgetYearThree": {
                            "val": "50.746"
                        },
                        "BudgetYearFour": {
                            "val": "77.406"
                        },
                        "BudgetYearFive": {
                            "val": "78.746"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The High Productivity, High-Performance Responsive Architectures project is developing high-productivity, high-performance computer hardware and the associated software technology base required to support future critical national security needs for computationally-intensive and data-intensive applications.  These technologies will lead to new multi-generation product lines of commercially viable, sustainable computing systems for a broad spectrum of scientific and engineering applications; it will include both supercomputer and embedded computing systems.  One of the major challenges currently facing the DoD is the prohibitively high cost, time, and expertise required to build large complex software systems.  Powerful new approaches and tools are needed to enable the rapid and efficient production of new software, including software that can be easily changed to address new requirements and can adjust dynamically to platform and environmental perturbations.  The project will ensure accessibility and usability to a wide range of application developers, not just computational science experts."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Power Efficiency Revolution For Embedded Computing Technologies (PERFECT)"
                                    },
                                    "Description": {
                                        "val": "The Power Efficiency Revolution For Embedded Computing Technologies (PERFECT) program will provide the technologies and techniques to overcome the power efficiency barriers which currently constrain embedded computing systems capabilities and limit the potential of future embedded systems.  The warfighting problem this program will solve is the inability to process future real time data streams within real-world embedded system power constraints.  This is a challenge for embedded applications, from Intelligence, Surveillance and Reconnaissance (ISR) systems on unmanned air vehicles through combat and control systems on submarines.  The PERFECT program will overcome processing power efficiency limitations using near threshold voltage operation, massive and heterogeneous processing concurrency, new architecture concepts, and hardware and software approaches to address system resiliency, combined with software approaches to effectively utilize resulting system concurrency and data placement to provide the required embedded system processing power efficiency."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "27.370"
                                            },
                                            "Text": {
                                                "val": "-  Discovered power kernels for embedded DoD applications, including ISR and encryption capabilities.\n-  Established initial simulation infrastructures for evaluating temporal and power efficiency for DoD embedded subsystems.\n-  Developed theoretical near threshold voltage and resiliency trade-offs for power efficiency.\n-  Identified key language extensions and approaches required for the development of massively parallel software."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "38.337"
                                            },
                                            "Text": {
                                                "val": "-  Develop an analytical modeling framework for fundamental design trade-off analysis and documentation for local resilience and power optimizations and global optimization methodologies and techniques.\n-  Establish algorithmic analysis and design methodologies for power efficient and resilient processing.\n-  Define power efficient, heterogeneous, highly concurrent conceptual architectural design approaches.\n-  Define and evaluate the impact of 3D approaches for power efficient processing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "33.800"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "33.800"
                                            },
                                            "Text": {
                                                "val": "-  Incorporate test chip results - circuit, architecture, communication, power management, 3D - for design optimization and simulation refinement for continuing architectural development efforts.\n-  Develop compiler algorithms supporting communication- avoiding optimization, concepts for optimizing parallel codes and language-based auto-tuning.\n-  Deliver system-level integrated analytical modeling methodology and software analysis toolset for cross-layer, energy-constrained resilience optimization, processor, memory, and energy-reliability trade-offs.\n-  Publically release new hardware description language and modeling\/simulation infrastructure incorporating the evaluation and development of algorithms, specializers, hardware architectures, and resiliency techniques."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cortical Processor"
                                    },
                                    "Description": {
                                        "val": "Capturing complex spatial and temporal structure in high-bandwidth, noisy, ambiguous data streams to meet DoD's needs cannot be achieved even by state-of-the-art signal\/image analysis systems.  However, there is a processing structure in nature, the mammalian neocortex, that efficiently captures spatial and temporal structure and routinely solves the most difficult recognition problems in real-time and is a general purpose structure for a range of sensor data processing and motor control execution.  The Cortical Processor program will leverage simplified models of known cortical operation to develop a new processor architecture that is optimized for running a family of algorithms known as Hierarchical Temporal Memory (HTM), providing new levels of performance and capabilities to a broad range of data recognition problems.  HTM models map well to simple, massively parallel, signal processor arrays and a cortical processor leveraging advances in dense memory structures on a Complementary Metal-Oxide-Semiconductor (CMOS) chip running at a few watts can perform orders of magnitude larger tasks than an HTM system simulated by commercial efforts on large data-center clusters.  With certain specialized circuits, several orders of magnitude improvement in throughput and efficiency will be possible with the cortical processor, enabling a wide range of powerful, ultra-low power, embedded applications.\n\nExecuting large HTM models on modest-sized embedded platforms will transform the DoD's ability to convert huge quantities of data into actionable information.  By augmenting tactical sensor systems on the battlefield with the new functionalities of predictive analyses and anomaly detection, this technology will have a major impact on the abilities of autonomous vehicles, robots, and UAVs.  The Cortical Processor will adapt to changing environments while reducing the need for a man in-the-loop, providing entirely new capabilities that cannot be achieved with today's commercial hardware.  This technology will enable more complex missions, particularly for surveillance systems and portable analytics and knowledge extraction from vision sensors and multi-model integration for the DoD and intelligence communities.  Basic research for the program is budgeted in PE 0601101E, Project CCS-02."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.000"
                                            },
                                            "Text": {
                                                "val": "-  Specify cortical processor system architecture and generate performance and power estimates.\n-  Initiate design of modular HTM coprocessor\/accelerator chip.\n-  Simulate selected transition of DoD application(s) using an HTM algorithm approach demonstrating the ability to learn and adapt."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "META"
                                    },
                                    "Description": {
                                        "val": "The goal of the META program is to develop novel design flows, tools, and processes to enable a significant improvement in the ability to design complex defense systems that are verified by virtual testing.  The program seeks to develop a design representation from which system designs can quickly be assembled and their correctness verified with a high degree of certainty.  Such a \"fab-less\" design approach is complemented by a foundry-style manufacturing capability, consisting of a factory capable of rapid reconfiguration between a large number of products and product variants through bitstream re-programmability, with minimal or no resultant learning curve effects. Together, the fab-less design and foundry-style manufacturing capability is anticipated to yield substantial---by a factor of five ---compression in the time to develop and field complex defense and aerospace systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "36.169"
                                            },
                                            "Text": {
                                                "val": "-  Developed a domain-specific component model library for the chassis and survivability subsystems of an amphibious infantry fighting vehicle (IFV) through extensive characterization of desirable and spurious interactions, dynamics, and properties of all physics domains.\n-  Transmitted the winning design from the first Fast Adaptable Next Generation Ground (FANG) Challenge to the iFAB foundry for fabrication of an IFV drivetrain and mobility subsystem.\n-  Began expanded development of META tool suite to include qualitative and relational abstraction modeling, probabilistic certificate of correctness calculations, complexity metric evaluation, non-linear Partial Differential Equation (PDE) analysis and cyber design evaluation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.691"
                                            },
                                            "Text": {
                                                "val": "-  Conclude expanded development of META tool suite to include qualitative and relational abstraction modeling, probabilistic certificate of correctness calculations, complexity metric evaluation, non-linear Partial Differential Equation (PDE) analysis, and cyber design evaluation.\n-  Conduct preliminary developmental Beta testing and integrated demonstration testing for the expanded META tool suite including expanded capability features.\n-  Conduct META tool transition activity to commercial Product Lifecycle Management (PLM) tool suites.\n- Transition META software tool suite and associated technology to the Digital Manufacturing and Design Innovation Institute (DMDII) through the use of co-funded research and formal technology transition activities for industry use."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Instant Foundry Adaptive Through Bits (iFAB)"
                                    },
                                    "Description": {
                                        "val": "Instant Foundry Adaptive Through Bits (iFAB), will lay the groundwork for the development of a foundry-style manufacturing capability--taking as input a verified system design--capable of rapid reconfiguration to accommodate a wide range of design variability and specifically targeted at the fabrication of military ground vehicles.  The iFAB vision is to move away from wrapping a capital-intensive manufacturing facility around a single defense product, and toward the creation of a flexible, programmable, potentially distributed production capability able to accommodate a wide range of systems and system variants with extremely rapid reconfiguration timescales.  The specific goals of the iFAB program are to rapidly design and configure manufacturing capabilities to support the fabrication of a wide array of infantry fighting vehicle models and variants.\n\nOnce a given design is developed and verified, iFAB aims to take the formal design representation and automatically configure a digitally-programmable manufacturing facility, including the selection of participating manufacturing facilities and equipment, the sequencing of the product flow and production steps, and the generation of computer-numerically-controlled (CNC) machine instruction sets as well as human instructions and training modules.  iFAB is mostly an information architecture.  Only the final assembly capability needs to be co-located under a single roof in anything resembling a conventional fabrication facility; the rest of iFAB can be geographically distributed and can extend across corporate and industrial boundaries, united only by a common model architecture and certain rules of behavior and business practices.  The final assembly node of the iFAB Foundry for infantry fighting vehicles (IFV) is the Joint Manufacturing and Technology Center (JMTC) at the Rock Island Arsenal (RIA)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "22.001"
                                            },
                                            "Text": {
                                                "val": "-  Conducted a preliminary design review and critical design review (CDR) for the iFAB Foundry.\n-  Matured and integrated foundry infrastructure tools developed under iFAB, including manufacturing feedback and process planning.\n-  Developed foundry infrastructure tools to assess assembly processes and requirements.\n-  Upgraded the RIA final assembly facility of the iFAB Foundry, and installed equipment for the first FANG challenge for an amphibious IFV drivetrain and mobility subsystem.\n-  Tested process planning, manufacturing assessment and building capabilities of the distributed foundry through pre-challenges in preparation for the first FANG challenge for an IFV drivetrain and mobility subsystem.\n-  Provided manufacturability feedback to the META design process in support of the first FANG challenge for an IFV drivetrain and mobility subsystem.\n-  Configured the iFAB foundry to build the winning drivetrain and mobility subsystem design from the first FANG Challenge."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.000"
                                            },
                                            "Text": {
                                                "val": "-  Build and test the winning drivetrain and mobility subsystem design from the first FANG Challenge.\n-  Provide manufacturability feedback to the META design process in support of the tool validation testing.\n- Transition iFAB software tool suite and associated technology to the Digital Manufacturing and Design Innovation Institute (DMDII) through the co-funded research and formal technology transition activities for industry use.\n-  Transition all physical infrastructure for the iFAB Foundry final assembly node at RIA to JMTC."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "IT-03"
                    },
                    "ProjectTitle": {
                        "val": "INFORMATION ASSURANCE AND SURVIVABILITY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "169.595"
                        },
                        "CurrentYear": {
                            "val": "189.238"
                        },
                        "BudgetYearOne": {
                            "val": "187.925"
                        },
                        "BudgetYearOneBase": {
                            "val": "187.925"
                        },
                        "BudgetYearTwo": {
                            "val": "200.009"
                        },
                        "BudgetYearThree": {
                            "val": "204.404"
                        },
                        "BudgetYearFour": {
                            "val": "204.788"
                        },
                        "BudgetYearFive": {
                            "val": "206.128"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Information Assurance and Survivability project is developing the core computing and networking technologies required to protect DoD's information, information infrastructure, and mission-critical information systems.  These technologies will enable DoD information systems to operate correctly and continuously even when they are attacked, and will provide cost-effective security and survivability solutions.  Technologies developed under this project will benefit other projects within this program element as well as projects in the Command, Control, and Communications program element (PE 0603760E), the Network-Centric Warfare Technology program element (PE 0603766E), the Sensor Technology program element (PE 0603767E), and other projects that require secure, survivable, network-centric information systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "High Assurance Cyber Military Systems"
                                    },
                                    "Description": {
                                        "val": "The High Assurance Cyber Military Systems program will develop and demonstrate the technologies required to secure mission-critical embedded computing systems.  The DoD is making increasing use of networked computing in systems such as military vehicles, weapon systems, ground sensors, smartphones, personal digital assistants, and other communication devices.  This dependence makes it critically important that the embedded operating system provides high levels of inherent assurance.  This operating system must also integrate the computational, physical, and networking elements of the system while running on a processor with very limited size, weight, and power.  Consequently, it can only devote a limited share of its computational resources to security while satisfying hard real-time constraints.  Recent advances in program synthesis, formal verification techniques, low-level and domain-specific programming languages, and operating systems mean that fully verified operating systems for embedded devices may be within reach at reasonable costs.  The program will develop, mature, and integrate these technologies to produce an embedded computing platform that provides a high level of assurance for mission-critical military applications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.064"
                                            },
                                            "Text": {
                                                "val": "-  Performed static and dynamic baseline assessments of selected militarily relevant vehicles before any modifications were made, discovering significant vulnerabilities in all four program platforms.\n-  Developed initial techniques and built prototype tools to assist in the rapid creation of high-assurance embedded computing systems on a variety of vehicles, including domain-specific languages for building and configuring flight control software.\n-  Constructed core pieces of a high-assurance embedded operating system and attack-resilient control system for two militarily relevant vehicles using developed tools and techniques.\n-  Formally verified full functional correctness for portions of a core operating system and targeted control-systems for selected vehicles.\n-  Demonstrated required security properties that follow from correctness, specifically, non-transitive non-interference."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "23.117"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate compositionality, which is the ability to construct high assurance systems out of high assurance components.\n-  Extend the core high-assurance embedded operating system with additional functionality, including automatically generated device drivers and communication protocols.\n-  Automatically synthesize correct-by-construction control systems from high-level specifications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "29.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "29.000"
                                            },
                                            "Text": {
                                                "val": "-  Formally verify full functional correctness for the extended core operating system and the automatically synthesized control systems for selected vehicles.\n-  Demonstrate required security properties that follow from correctness for the extended core operating system and the automatically synthesized control systems.\n-  Perform static and dynamic assessments after modifications are made on the militarily-relevant vehicles to evaluate the effectiveness of the synthesis and formal methods tools."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Vetting Commodity Computing Systems for the DoD (VET)"
                                    },
                                    "Description": {
                                        "val": "The Vetting Commodity Computing Systems for the DoD (VET) program will develop tools and methods to uncover backdoors and other hidden malicious functionality in the software and firmware on commodity IT devices.  The international supply chain that produces the computer workstations, routers, printers, and mobile devices on which DoD depends provides many opportunities for our adversaries to insert hidden malicious functionality.  VET technologies will also enable the detection of software and firmware defects and vulnerabilities that can facilitate adversary attack."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.376"
                                            },
                                            "Text": {
                                                "val": "-  Defined the requirements for the three key program challenges: the discovery of likely attack scenarios, the design of program analysis tools, and the reliable execution of diagnostics on already-compromised systems.\n-  Developed concept of operations, created example supply chain attack scenarios, presented initial program analysis approaches, and specified diagnostic tool functionality.\n-  Identified the initial infrastructure required to support the development of a sufficient number of challenge programs containing hidden malicious functionality to support realistic evaluations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.954"
                                            },
                                            "Text": {
                                                "val": "-  Develop relevant application programming interfaces and define formal semantics for the programming languages to be analyzed.\n-  Produce initial prototype attack scenario generation, program analysis, and diagnostic tools.\n-  Produce initial set of challenge programs for use in a competitive evaluation.\n-  Perform a competitive engagement between research and adversarial challenge performers to produce measurements of research progress against program metrics."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "21.553"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "21.553"
                                            },
                                            "Text": {
                                                "val": "-  Improve the effectiveness of prototype tools through further competitive engagements.\n-  Expand the set of challenge programs to explore more complex forms of malicious hidden functionality.\n-  Conduct an integrated end-to-end software\/firmware-vetting technology demonstration relevant to potential transition partners."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mission-oriented Resilient Clouds (MRC)"
                                    },
                                    "Description": {
                                        "val": "The Mission-oriented Resilient Clouds (MRC) program will create technologies to enable cloud computing systems to survive and operate through cyber attacks.  Vulnerabilities found in current standalone and networked systems can be amplified in cloud computing environments.  MRC will address this risk by creating advanced network protocols and new approaches to computing in potentially compromised distributed environments.  Particular attention will be focused on adapting defenses and allocating resources dynamically in response to attacks and compromises.  MRC will create new approaches to measuring trust, reaching consensus in compromised environments, and allocating resources in response to current threats and computational requirements.  MRC will develop new verification and control techniques for networks embedded in clouds that must function reliably in complex adversarial environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "23.500"
                                            },
                                            "Text": {
                                                "val": "-  Developed new behavior-based algorithms for detecting compromised machines.\n-  Developed and demonstrated new resource allocation algorithms that maximize mission-effectiveness by allocating bandwidth and computing resources to higher priority tasks while avoiding the use of potentially compromised resources.\n-  Validated the performance of new algorithms and protocols for high-assurance computing and data analysis in cloud computing systems.\n-  Demonstrated a fault tolerant cloud computing environment that produces correct results when individual computing and network elements have been compromised or disabled.\n-  Developed protocols for cloud monitoring and control that are tolerant of disruptions and intrusions, and validated performance on a commercial cloud.\n-  Began first experiment to transition automated, distributed resource allocation algorithms to United States Pacific Command (USPACOM)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "21.571"
                                            },
                                            "Text": {
                                                "val": "-  Produce a cloud task allocation system that maximizes mission effectiveness by employing redundancy in the context of current system loads without significantly increasing hardware costs.\n-  Implement a trustworthy programmable switch controller.\n-  Demonstrate dynamic adaptation of data replication in response to estimated and predicted attack levels.\n-  Implement self-healing functionality for cloud applications.\n-  Begin evaluating technologies in Defense Information Systems Agency (DISA) testbeds to facilitate transitions into DoD clouds.\n-  Transition research product into USPACOM distributed computing environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.892"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.892"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate automated construction of diverse, redundant network flow paths that maximize communication resilience in clouds.\n-  Extend consensus protocols to work between diverse, virtualized clouds and measure improvements in mission resilience.\n-  Produce and validate a network abuse detection and mitigation system that operates in software defined networks.\n-  Develop and demonstrate hardened services through fine-grained memory access controls that determine what valid memory addresses are read or written to by each instruction in a program.\n-  Complete transition of one or more technologies into operational use by DISA and USPACOM."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Active Cyber Defense (ACD)"
                                    },
                                    "Description": {
                                        "val": "The Active Cyber Defense (ACD) program will enable DoD cyber operators to fully leverage our inherent home field advantage when defending the DoD cyber battlespace.  In the cyber environment, defenders have detailed knowledge of, and unlimited access to, the system resources that attackers wish to gain.  The ACD program will exploit emerging technologies to facilitate the conduct of defensive operations that involve immediate and direct engagement between DoD cyber operators and sophisticated cyber adversaries.  Through these active engagements, DoD cyber defenders will be able to more readily disrupt, counter, and neutralize adversary cyber tradecraft in real time.  Moreover, ACD-facilitated operations should cause adversaries to be more cautious and should increase their work factor by limiting the success from their efforts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.300"
                                            },
                                            "Text": {
                                                "val": "-  Developed initial system requirements and concept of operations.\n-  Drafted test plans and test scenarios for prototype assessments and identified key technical metrics for evaluation.\n-  Held coordination meetings with potential transition partners including NSA, U.S. Cyber Command, and others."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.500"
                                            },
                                            "Text": {
                                                "val": "-  Develop techniques for countering adversary cyber tradecraft and implement in early prototype software applications.\n-  Develop detailed system designs and design documentation.  \n-  Finalize test plans and perform initial evaluations of active cyber defense prototypes in exercises with transition partners."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.328"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.328"
                                            },
                                            "Text": {
                                                "val": "-  Integrate technologies into complete prototypes and demonstrate capabilities to transition partners.\n-  Perform final test and evaluation of integrated capabilities and obtain approval for operational deployment.\n-  Support initial operational fielding of capability."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Clean-slate design of Resilient, Adaptive, Secure Hosts (CRASH)"
                                    },
                                    "Description": {
                                        "val": "The Clean-slate design of Resilient, Adaptive, Secure Hosts (CRASH) program will develop cyber security technologies using the mechanisms of biological systems as inspiration for radically re-thinking basic hardware and system designs.  Higher level organisms have two distinct immune systems: the innate system is fast and deadly but is only effective against a fixed set of pathogens; the adaptive system is slower, but can learn to recognize novel pathogens.  Similarly, CRASH will develop mechanisms at the hardware and operating system level that eliminate known vulnerabilities exploited by attackers.  However, because novel attacks will be developed, CRASH will also develop software techniques that allow a computer system to defend itself, to maintain its capabilities, and even heal itself.  Finally, biological systems show that diversity is an effective population defense; CRASH will develop techniques that make each computer system appear unique to the attacker and allow each system to change over time."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "28.502"
                                            },
                                            "Text": {
                                                "val": "-  Implemented a compiler that automatically produces diverse instantiations of a complete Linux operating system and demonstrated that the resulting operating system is resistant to standard attacks.\n-  Demonstrated a novel form of moving target defense that employs several automatically constructed diverse implementations of the same algorithm.\n-  Produced a tool that finds and fixes bugs and attendant security vulnerabilities in operating system and utility software.\n-  Demonstrated roll-back and recovery on two production-scale applications with substantially reduced requirements for human involvement.\n-  Developed technology to mitigate vulnerabilities found in widely used embedded systems such as telephones and printers and initiated efforts to transition the technology into commercial use."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "27.536"
                                            },
                                            "Text": {
                                                "val": "-  Complete the implementation of two novel secure processors and operating systems and demonstrate the ability to resist all attacks mounted by a red-team.\n-  Demonstrate the capability to wrap C2 software codes as a means to thwart cyber attack.\n-  Demonstrate real-time, continuous validation of system compliance with security specifications.\n-  Demonstrate the ability of two or more complete systems to block, survive, and recover from multiple attacks and automatically repair vulnerabilities.\n-  Transition research products into one or more embedded systems and a secure router for military use."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.600"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.600"
                                            },
                                            "Text": {
                                                "val": "-  Automatically produce diverse instantiations of one or more complete operating systems.\n-  Deliver a web server that enables creation of secure web sites from untrusted code.\n-  Deliver a web server and browser that enable creation of secure web applications from untrusted code.\n-  Demonstrate policy-based application monitoring and hardware-assisted self-healing of multiple applications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rapid Software Development using Binary Components (RAPID)"
                                    },
                                    "Description": {
                                        "val": "The Rapid Software Development using Binary Components (RAPID) program will develop a system to identify and extract software components for reuse in new applications.  The DoD has critical applications that must be ported to future operating systems.  In many cases, the application source code is no longer available requiring these applications to continue to run on insecure and outdated operating systems, impacting operations.  Advanced technology research for the program is budgeted in PE 0603760E, Project CCC-04."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.049"
                                            },
                                            "Text": {
                                                "val": "-  Developed an initial low level virtual machine translation engine.  \n-  Completed the initial implementation of the user interface."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.198"
                                            },
                                            "Text": {
                                                "val": "-  Fully integrate technologies into a single architecture and standardize interfaces to enable partners to interoperate with the system.  \n-  Develop a single user interface that combines technical area views and supports mobile operation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.396"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.396"
                                            },
                                            "Text": {
                                                "val": "-  Develop new software component reuse capabilities to optimize application performance in realistic scenarios and enable an expanded concept of operations.  \n-  Implement new capabilities in modules designed to interoperate seamlessly with deployed RAPID prototype systems.  \n-  Integrate new modules into prototype RAPID systems deployed at transition partner sites and support initial operations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Anomaly Detection at Multiple Scales (ADAMS)"
                                    },
                                    "Description": {
                                        "val": "The Anomaly Detection at Multiple Scales (ADAMS) program will develop and apply algorithms for detecting anomalous, threat-related behavior of systems, individuals, and groups over hours, days, months, and years.  ADAMS will develop flexible, scalable, and highly interactive approaches to extracting actionable information from information system log files, sensors, and other instrumentation.  ADAMS will integrate these anomaly detection algorithms to produce adaptable systems for timely insider threat detection."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.000"
                                            },
                                            "Text": {
                                                "val": "-  Refined and created techniques for detecting malicious insiders, delineated assumptions\/conditions under which they are valid\/invalid, and specified their effective combination.\n-  Created a comprehensive library of test data and quantified probabilities of detection and false alarm for anomalous non-threat and threat behaviors.\n-  Developed technologies to manage the number of anomalies, focus computing resources on ambiguous results, and prioritize threats.\n-  Demonstrated the capability to identify anomalous behavior suggestive of a threat in real time on streaming data."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.612"
                                            },
                                            "Text": {
                                                "val": "-  Develop and implement technology to capture analyst expertise for assessing and explaining detected anomalies and incorporate such user feedback in decision loops for counter intelligence (CI) agents without highly specialized computer science knowledge.\n-  Create the capability to incorporate direct CI agent feedback to improve coverage of threat types.\n-  Develop and implement technology that is adaptable to a wide variety of organizational structures, workflows, and data sources.\n-  Develop techniques to provide the evidence needed to initiate focused response activities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.750"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.750"
                                            },
                                            "Text": {
                                                "val": "-  Develop an integrated prototype anomaly\/threat detection system suitable for rapid deployment in an operational environment.\n-  Harden prototype and obtain DoD Information Assurance Certification and Accreditation Process approval for use on military networks.\n-  Conduct and evaluate initial prototype in a large scale environment with operational partners."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Active Authentication*"
                                    },
                                    "Description": {
                                        "val": "*Previously funded in PE 0601101E, Project CYS-01.\n\nThe Active Authentication program will develop more effective user identification and authentication technologies.  Current authentication approaches are typically based on long, complex passwords and incorporate no mechanism to verify the user originally authenticated is the user still in control of the session.  The Active Authentication program will address these issues by focusing on the unique aspects of the individual (i.e., the cognitive fingerprint) through the use of software-based biometrics that continuously validate the identity of the user.  Active Authentication will integrate multiple biometric modalities to create a system that is accurate, robust, and transparent to the user."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.489"
                                            },
                                            "Text": {
                                                "val": "-  Developed open application programming interfaces to allow the ready integration of third-party software and hardware biometrics.\n-  Initiated development of an additional authentication platform suitable for deployment on DoD hardware.\n-  Implemented multiple advanced authentication mechanisms in prototype systems potentially suitable for use on DoD networks.\n-  Coordinated with U.S. Army Intelligence and Information Warfare Directorate for transition into Army biometric-enabled authentication platform."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.100"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate enhanced authentication using multiple biometrics representing complementary aspects of the individual.\n-  Evaluate the level of confidence that is achievable using multiple advanced authentication mechanisms and quantify the resulting level of security using red teaming and other techniques.\n-  Prototype an authentication platform suitable for DoD use in collaboration with potential transition sponsors.\n-  Initiate development of multiple authentication biometrics suitable for deployment on mobile hardware for potential use by the DoD."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.025"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.025"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate multiple authentication biometrics suitable for deployment on mobile hardware for potential use by the DoD.\n-  Prove flexibility of underlying prototype platform by creating an additional authentication platform suitable for DoD.\n-  Prototype an authentication platform suitable for use on mobile hardware in collaboration with potential transition sponsors."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Integrated Cyber Analysis System (ICAS)"
                                    },
                                    "Description": {
                                        "val": "The Integrated Cyber Analysis System (ICAS) program will develop techniques to automatically discover probes, intrusions, and persistent attacks on enterprise networks.  At present, discovering the actions of capable adversaries requires painstaking forensic analysis of numerous system logs by highly skilled security analysts and system administrators.  ICAS will develop technologies to allow for the correlation of interactions and behavior patterns across all system data sources and thereby rapidly uncover aberrant events and detect system compromise.  This includes technologies for automatically representing, indexing, and reasoning over diverse, distributed, security-related data and system files."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.044"
                                            },
                                            "Text": {
                                                "val": "-  Developed an approach for transforming log\/system file formats into a unified schema as the basis for an actionable view of enterprise operational security.\n-  Conceptualized indexing schemes specialized to system files\/security data and suitable for use across federated enterprise architectures.\n-  Identified potential transition partners within DoD and established operational requirements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop and implement algorithms for automatically identifying and quantifying specific security risks on enterprise networks.\n-  Conduct initial technology demonstrations including automatic indexing of data sources, common language integration, and reasoning across federated databases.\n-  Complete alpha versions of applications which meet all program objectives and test in coordination with transition partners.\n-  Integrate, evaluate, and optimize algorithms via testing against attacks\/persistent threats provided by transition partners."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete fully functional beta versions of the applications with operational stability suitable for testing at transition partner locations.\n-  Harden and deploy solutions to transition partner networks throughout the DoD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Safer Warfighter Computing (SAFER)"
                                    },
                                    "Description": {
                                        "val": "The Safer Warfighter Computing (SAFER) program is creating a technology base for assured and trustworthy Internet communications and computation, particularly in untrustworthy and adversarial environments.  SAFER creates automated processes and technologies to enable military users to send and receive content on the Internet, utilizing commercially available hardware and software, in ways that avoid efforts to deny, locate, or corrupt communications.  SAFER is also developing technology for performing computations on encrypted data without decrypting it first through fully homomorphic encryption and interactive, secure multi-party computation schemes.  This will enable, for example, the capability to encrypt queries and compute an encrypted search result without decrypting the query.  This technology will advance the capability to run programs on untrusted hardware while keeping programs, data, and results encrypted and confidential.  This mitigates the important aspect of supply chain compromise."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.680"
                                            },
                                            "Text": {
                                                "val": "-  Performed independent, adversarial assessment of the effectiveness of technologies to prevent communication localization and detection.\n-  Demonstrated two developmental technologies for anonymous web communications which are much more difficult for an adversary to detect or block.  \n-  Demonstrated an initial field programmable gate array implementation of fully homomorphic encryption offering an order of magnitude performance improvement over optimized software implementations.\n-  Performed independent benchmarks of fully homomorphic encryption, garbled-circuit secure multiparty computation, and secret-sharing secure multiparty computation.\n-  Demonstrated two orders of magnitude improvement in performance of fully homomorphic encryption."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.150"
                                            },
                                            "Text": {
                                                "val": "-  Integrate decoy routing, parallelized group messaging, dynamic traffic camouflage, and rendezvous strategy technologies into common internet browsing applications.\n-  Conduct the final independent, adversarial assessment of the effectiveness of technologies to prevent communication localization and detection, including newly developed adversarial techniques.\n-  Reduce ciphertext expansion while improving software performance in fully homomorphic encryption, garbled-circuit secure multiparty computation, and secret-sharing secure multiparty computation, and perform independent benchmarks.\n-  Demonstrate an additional two orders of magnitude improvement in the performance of fully homomorphic encryption.\n-  Refine field programmable gate array implementation of fully homomorphic encryption to yield a further order of magnitude performance improvement over optimized software implementation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.066"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.066"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate safe, anonymous internet communications applications such as web access, Voice over Internet Protocol (VOIP), and streaming video, at scale.\n-  Further optimize field programmable gate array and software implementations of fully homomorphic encryption to double performance over prior implementations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Logan"
                                    },
                                    "Description": {
                                        "val": "The Logan program will provide DoD enhanced capabilities to conduct Computer Network Attack (CNA). Techniques will be developed to disrupt and degrade adversary information systems and network operations, with particular interest in techniques likely to be robust to adversary countermeasure strategies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.000"
                                            },
                                            "Text": {
                                                "val": "-  Formulated CNA techniques and implemented these in initial software routines.\n-  Developed manual prototypes for operational transition."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.803"
                                            },
                                            "Text": {
                                                "val": "-  Automate and test prototypes in conjunction with transition partner.\n-  Optimize and harden prototypes and complete transition."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.697"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.697"
                                            },
                                            "Text": {
                                                "val": "-  Transition automated system for operational implementation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Integrity and Reliability of Integrated CircuitS (IRIS)"
                                    },
                                    "Description": {
                                        "val": "Integrated circuits (ICs) are core components of most electronic systems developed for the Department of Defense.  However, the DoD consumes a very small percentage of the total IC production in the world.  As a result of the globalization of the IC marketplace, much of the advanced IC production has moved to offshore foundries, and these parts make up the majority of ICs used in today's military systems.\n\nWithout the ability to influence and regulate the off-shore fabrication of ICs, there is a risk that parts acquired for DoD systems may not meet stated specifications for performance and reliability.  This risk increases considerably with the proliferation of counterfeit ICs in the marketplace, as well as the potential for the introduction of malicious circuits into a design.\n\nThe Integrity and Reliability of Integrated CircuitS (IRIS) program seeks to develop techniques that will provide electronic system developers the ability to validate the function of digital, analog and mixed-signal ICs non-destructively, given limited data about the chip's detailed design  specifications.  These techniques will include advanced imaging for identification of functional elements in deep sub-micrometer Complementary Metal-Oxide Semiconductor (CMOS) circuits, as well as computational methods to deal with the extremely difficult problem of determining device connectivity.\n\nFinally, the IRIS program will develop innovative methods to determine the reliability of an IC by testing a limited number of samples.  The current understanding of IC aging mechanisms, including negative bias temperature instability (NBTI), hot carrier injection (HCI), time-dependent dielectric breakdown (TDDB) and electromigration (EM) will be leveraged to develop unique diagnostic test techniques."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.500"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated the ability to identify design primitives (transistors, capacitors, resistors), memory elements and interconnects through non-destructive imaging, and derived a  net-list from these components.\n-  Demonstrated functional derivation of modified digital and mixed-signal ICs at the 45 nm CMOS node.\n-  Demonstrated reliability derivation from reduced sample sizes of modified ICs.\n-  Demonstrated non-destructive techniques for functional analysis of a digital IC.\n-  Demonstrated tools for functional derivation from third-party IP (Intellectual Property) blocks for both Application Specific Integrated Circuits (ASICs) and Field Programmable Gate Arrays (FPGAs).\n-  Developed digital and mixed-signal test articles appropriate for testing techniques for identifying unintended circuits and circuit functions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "-  Exercise completed methods for non-destructive imaging, circuit extraction and functional derivation.\n-  Demonstrate methods for reliability analysis for improved accuracy, functionality and efficacy."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Supply Chain Hardware Intercepts for Electronics Defense (SHIELD)"
                                    },
                                    "Description": {
                                        "val": "Counterfeit electronic parts are becoming ubiquitous, and pose a threat to the integrity and reliability of DoD systems. Detection of counterfeit components by current means is expensive, time-consuming, and of limited effectiveness. Maintaining complete control of the supply chain using administrative controls incurs substantial costs and has limitations. Current methods of detection involve a wide variety of techniques ranging from functional testing to physical inspections which may still miss certain classes of counterfeits.  There have also been attempts by the semiconductor market to protect electronic components through the use of technology embedded in the component or its packaging.  However, most methods are specific to a manufacturer's component and as such address only those issues deemed critical to that manufacturer. Some methods can be circumvented, or require slow, expensive, off-site forensic analysis to verify authenticity.\n\nThe Supply Chain Hardware Intercepts for Electronics Defense (SHIELD) program, leveraging and expanding on previous activities in the IRIS program, will develop a technology capable of confirming, at any time, the authenticity of once-trusted parts, even after they have transited a complex global supply chain.  SHIELD will prevent counterfeit component substitution by incorporating a small, inexpensive additional silicon chip (\"dielet\") within the Integrated Circuit (IC) package. The dielet will provide a unique and non-clonable ID as well as anti-tamper features.  The microscopic-size dielet embedded in the electronic component packaging will be inductively powered and scanned by an authentication induction coil brought into very close proximity to the packaged chip, thus allowing for verification of chip identity."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "- Develop behavioral models for SHIELD performance and power consumption.\n- Establish server communication protocols, encryption standards, network architectures.\n- Design test sites for technology, surrogate dielet structures for package tests.\n- Define process modifications needed to accommodate SHIELD insertions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.500"
                                            },
                                            "Text": {
                                                "val": "- Develop technologies to allow secure key and ID storage and prevent tampering with the dielet.\n- Design a compact encryption engine that enables a very small, low power, and low-cost dielet.\n- Define a power and communication inductive coil protocol.\n- Simulate and prototype dielet package-insertion techniques for placing SHIELD on product."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Protecting Cyber Physical Systems (PCPS)"
                                    },
                                    "Description": {
                                        "val": "The Protecting Cyber Physical Systems (PCPS) program will create new technologies for ensuring the availability and integrity of cyber physical systems.  The near-ubiquitous use of embedded computing in commercial, industrial, and medical devices, the emergence of software defined networking, and the importance of automatic control to U.S. civilian and military critical infrastructure make this a national security issue.  PCPS will develop technologies to monitor heterogeneous distributed industrial control system networks, detect anomalies that require rapid assessment, and mitigate sensor spoofing and denial of service attacks.  Mechanisms to ensure the integrity of remote firmware updates and mitigate attacks for which wireless interfaces provide a vector will also be developed.  PCPS technologies will transition to military installations and commercial industry."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.525"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.525"
                                            },
                                            "Text": {
                                                "val": "-  Develop technologies to monitor heterogeneous distributed industrial control system networks, detect anomalies that require rapid assessment, and mitigate sensor spoofing and denial of service attacks.\n-  Create mechanisms to ensure the integrity of remote firmware updates.\n-  Develop approaches for mitigating the risks associated with wireless interfaces."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Active-Reactive Cyber Systems (ARCS)"
                                    },
                                    "Description": {
                                        "val": "The Active-Reactive Cyber Systems (ARCS) program will develop technologies to enable hosts, systems, and networks to actively sense for threats and to dynamically react to attacks.  Current cyber defense technologies are statically configured to satisfy a complex set of engineering trade-offs and are rarely optimized for the dynamic environments in which they are deployed.  ARCS technologies will use organic sensors, remote instrumentation, and other sources of cyber situation awareness information to continuously optimize cyber defenses.  Host and network management and control technologies will be developed that enable systems to fight through cyber attack and provide essential mission services by repurposing resources to critical services, repairing damaged resources, and utilizing degraded resources.  ARCS software agents will protect data stores by implementing dynamic access controls that consider user and program authorization within the context of the cyber situation and network defense posture."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.500"
                                            },
                                            "Text": {
                                                "val": "-  Develop techniques that use organic sensors, remote instrumentation, and other sources of cyber situation awareness information to continuously optimize cyber defenses.\n-  Develop host and network management and control technologies that enable systems to fight through cyber attack and provide essential mission services.  \n-  Develop software agents that implement dynamic access controls that consider user and program authorization within the context of the cyber situation and network defense posture."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Adaptable Information Access and Control (AIAC)"
                                    },
                                    "Description": {
                                        "val": "The Adaptable Information Access and Control (AIAC) program will create the capability to dynamically, flexibly, and securely share highly selective information across enterprise boundaries.  In the civilian sphere, there is a recognized need for technologies that limit the sharing of information between commercial entities and U.S. government agencies to the greatest extent possible consistent with national security requirements.  Similarly, the U.S. military is increasingly involved in humanitarian operations that require highly selective sharing of data with a heterogeneous mix of allies, coalition partners, and other stakeholders.  AIAC will create confidentiality, privacy, multi-level security, discretionary access control, and policy engine technologies to allow tailored access to a specific datum but not an entire database\/file system\/corpus.  AIAC is timely due to recent progress on cryptographic techniques such as homomorphic encryption and secure multiparty computation.  Additional technologies that will be developed and incorporated include automated policy-driven releasability assessment and redaction, tactical obfuscation, and time-limited-access controls.  The program will address the diverse and stringent legal and ethical requirements related to security, privacy, authentication, authorization, auditing, monitoring, access, and control encountered in both civilian and military environments.  To facilitate deployment, AIAC technologies will be designed to work with the virtualization, cloud computing, and software-defined networking technologies now widely used in both civilian and military environments."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.093"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.093"
                                            },
                                            "Text": {
                                                "val": "-  Formulate access control schemes appropriate for diverse civilian, intelligence, law enforcement, and coalition use cases with particular focus on privacy-preserving analytics.\n-  Architect an access control policy engine for seamless interoperability with common computing and networking infrastructure software.\n-  Create technologies for confidentiality, privacy, multi-level security, discretionary access controls, automated policy-driven releasability assessment and redaction, tactical obfuscation, computing on encrypted data, and time-limited-access controls."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cyber Genome"
                                    },
                                    "Description": {
                                        "val": "The Cyber Genome program develops techniques to automatically characterize, analyze, and identify malicious code and determine the evolutionary relationship between new never-before-seen malware samples and older known malware.  This enables the automatic detection of future malware variants.  Such automation is critically important because the global production of malware is growing explosively and threatens to overwhelm current labor-intensive practices.  Cyber Genome also develops advanced capabilities to enable positive identification of malicious code substructures and functionality."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.949"
                                            },
                                            "Text": {
                                                "val": "-  Developed techniques to automatically and reliably extract forensically-meaningful traits such as authorship, compiler, toolkit, and obfuscation techniques.\n-  Enhanced co-clustering and binary analysis techniques to enable the automatic identification of re-used components.\n-  Developed operationally relevant use case test scenarios with transition partners and conducted initial use case validation tests.\n-  Implemented prototypes and evaluated their effectiveness on realistic malware samples.\n-  Executed an MoA with the FBI to evaluate the performance of the automated malware analysis tools on operational data."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.697"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate significant improvement to provenance determination through the use of the automatically extracted traits.\n-  Demonstrate final prototypes capable of detecting a single interesting targeted threat from a stream of at least 10K uninteresting mass-infection malware samples.\n-  Evaluate the effectiveness of prototype systems in conjunction with transition sponsors and complete transition."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cyber Fast Track"
                                    },
                                    "Description": {
                                        "val": "The Cyber Fast Track program created more flexible, responsive methods for securing computing systems that operate in challenging environments and reduced security risk without requiring lengthy development cycles.  Under Cyber Fast Track, small agile teams worked under rapid development cycles to create cyber security applications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.142"
                                            },
                                            "Text": {
                                                "val": "-  Expanded outreach to customers\/transition sponsors.\n-  Completed efforts and transitioned technologies to multiple DoD agencies."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "IT-04"
                    },
                    "ProjectTitle": {
                        "val": "LANGUAGE TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "59.650"
                        },
                        "CurrentYear": {
                            "val": "70.482"
                        },
                        "BudgetYearOne": {
                            "val": "39.333"
                        },
                        "BudgetYearOneBase": {
                            "val": "39.333"
                        },
                        "BudgetYearTwo": {
                            "val": "50.223"
                        },
                        "BudgetYearThree": {
                            "val": "81.539"
                        },
                        "BudgetYearFour": {
                            "val": "57.199"
                        },
                        "BudgetYearFive": {
                            "val": "74.539"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Language Technology project is developing powerful new technologies for processing foreign languages that will provide critical capabilities for a wide range of military and national security needs.  The technologies and systems developed in this project will enable our military to automatically translate and exploit large volumes of speech and text in multiple languages obtained through a variety of means.  Current U.S. military operations involve close contact with a wide range of cultures and peoples.  Warfighters need speech-to-speech translation systems that enable communication with local populations, especially two-way (foreign-language-to-English and English-to-foreign-language) translation.  In addition, foreign-language news broadcasts, web-posted content, and captured foreign-language hard-copy documents can provide insights regarding local and regional events, attitudes, and activities.  Language translation, information extraction, and other language analytic systems contribute to the development of critical intelligence and situational awareness.  Technologies for translation of informal genres (online discussion groups, messaging, and telephone conversation) of voice and text, as well as capabilities to automatically collate, filter, synthesize, summarize, and present relevant information in near real-time will enhance situational awareness."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Broad Operational Language Translation (BOLT)"
                                    },
                                    "Description": {
                                        "val": "The Broad Operational Language Translation (BOLT) program is enabling communication in informal and dialectal genres.  Historically, foreign language translation technology was geared toward formal content, like broadcast media and newswire, but did not address informal or dialectal genres.  BOLT is developing new approaches to automated language translation, human-machine multimodal dialogue, and language generation and applying these to informal genre such as online discussion groups, messaging, and telephone conversation.  BOLT will leverage the strengths of statistical and rule-based approaches to form hybrid machine translation techniques that are more robust to linguistic dialectal variation; develop new techniques for modeling word relationships, functions, and context; and utilize syntactic and semantic patterns to fill in the linguistic gaps inherent in conversational language and to accelerate statistical learning.  While Chinese and dialectal Arabic are the two languages addressed directly in BOLT, techniques developed for these two languages will have wide applicability to other languages and dialects.  BOLT will enable warfighters and military\/government personnel to readily communicate with coalition partners and local populations and will enhance intelligence through better exploitation of all language sources."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "40.206"
                                            },
                                            "Text": {
                                                "val": "-  Developed new and improved algorithms for translating two informal genres of Arabic and Chinese text, online discussion groups and messaging, and created annotated corpora for training and testing the algorithms.\n-  Developed methods for Egyptian dialectal Arabic that are applicable to all Egyptian Arabic informal genres and used these to develop databases, tools, and algorithms to translate Tunisian dialectal Arabic.\n-  Developed algorithms for automatically assessing the degree of confidence in both the automatic speech recognition and machine translation hypotheses in a human-human dialogue system and specialized these to Arabic-English dialogue.\n-  Developed enhanced automatic Arabic speech recognition techniques capable of handling garbled and ambiguous speech and words outside the vocabulary of the machine and integrated these into a robust bi-directional Arabic-English dialogue system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "45.113"
                                            },
                                            "Text": {
                                                "val": "-  Develop improved algorithms for translating two informal genres of Arabic and Chinese text, online discussion groups and messaging, to enable comprehension of colloquialisms and idiomatic speech and add a third genre, telephone conversation.\n-  Use methods developed for Egyptian and Tunisian dialectal Arabic to create databases, tools, and algorithms for additional Arabic dialects.\n-  Enhance bi-directional Arabic-English dialogue systems by incorporating topic modeling and exploiting cross-utterance context recognition.\n-  Develop dialogue management techniques such as computer-moderated turn-taking to avoid divergence as an approach for improving the performance of bi-directional Arabic-English dialogue systems.\n-  Complete the annotated corpora of Arabic and Chinese informal genre data by adding new dialects and enhance their utility by incorporating additional annotations.\n-  Generalize Arabic dialectal databases, tools, and algorithms to make it straightforward to add Arabic dialects.\n-  Work with transition partners to identify insertion opportunities and transition algorithms for translating informal genres of Arabic and Chinese."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Deep Exploration and Filtering of Text (DEFT)"
                                    },
                                    "Description": {
                                        "val": "The Deep Exploration and Filtering of Text (DEFT) program will enable automated extraction, processing, and inference of information from text in operationally relevant application domains.  A key DEFT emphasis is to determine the implied and hidden meaning in text through probabilistic inference, anomaly detection, and disfluency analysis.  To accomplish this, DEFT will develop and apply formal representations for basic facts, spatial, temporal, and associative relationships, causal and process knowledge, textually entailed information, and derived relationships and correlated actions\/events.  DEFT inputs may be in English or in a foreign language and sources may be completely free-text or semi-structured reports, messages, documents, or databases.  DEFT will extract knowledge at scale for open source intelligence and threat analysis.  Planned transition partners include the intelligence community and operational commands."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.946"
                                            },
                                            "Text": {
                                                "val": "-  Developed initial methods and algorithms to derive meaning from context for words that may have implicit or hidden meanings and to extract and disambiguate events in a document or set of documents.\n-  Implemented preliminary algorithms that use domain knowledge to infer implicit information from multiple facts and statements,  answer questions, and generate hypotheses in domains of military interest.\n-  Developed training data sets and queries for science and technology, human-behavioral-social-cultural, and asymmetric threat domains and performed evaluation experiments.\n-  Designed new workflows in collaboration with end-users to enhance operational efficiency and effectiveness."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "25.369"
                                            },
                                            "Text": {
                                                "val": "-  Develop methods and algorithms for reasoning about both explicitly and implicitly expressed opinions and beliefs, for extracting causal knowledge, and for finding hidden meaning based on anomalous usages and disfluencies in a document or set of documents.\n-  Conduct performance evaluations on data sets related to event representation, anomaly detection, and inference.\n-  Expand capabilities to additional application problems and domains in collaboration with end-users.\n-  Demonstrate feasibility of deep extraction and filtering for selected end-user applications and transition initial sets of algorithms to end-users for enhanced workflows."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "28.333"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "28.333"
                                            },
                                            "Text": {
                                                "val": "-  Develop technology for extracting belief, sentiment, and intent; for representing geo-spatial features and temporal events; and for inference, summarization, and alerting from a set of documents.\n-  Integrate multiple complementary algorithms into a comprehensive and consistent functional suite to support end-user workflows and problems.\n-  Transition algorithm suites and conduct effectiveness assessments at end-user sites."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Foreign Language Rapid Response (FLRR)"
                                    },
                                    "Description": {
                                        "val": "The Foreign Language Rapid Response (FLRR) program will develop the capability to rapidly construct human language technologies for foreign languages.  Historically, exploiting foreign language materials required protracted effort and as a result systems exist only for languages in widespread use and in high demand.  The military operates globally and frequently encounters less common low-resource languages for which no automated human language technology capability exists.  FLRR technologies will identify the commonalities between a newly-encountered low-resource language and high-resource languages and will identify language universals to rapidly re-purpose existing language technologies to the low-resource language.  This will enable the rapid creation of automated language technology systems for cross-language intelligence and strategic communications."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.000"
                                            },
                                            "Text": {
                                                "val": "-  Identify the universal properties of language to serve as the basis for an extensible family of human language technologies.\n-  Develop techniques for quantifying the linguistic similarity of language usage in diverse documents and media.\n-  Develop semantic techniques for identifying the common topics, themes, and sentiment in a collection of snippets in diverse foreign languages.\n-  Create a baseline toolkit to rapidly develop initial document triage capability for a new low-resource language document collection.\n- Develop techniques for learning language from conversation about the things and people in the immediate environment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Robust Automatic Translation of Speech (RATS)"
                                    },
                                    "Description": {
                                        "val": "The Robust Automatic Transcription of Speech (RATS) program addressed conditions in which speech signals are degraded by distortion, reverberation, and\/or competing conversation.  Robust speech processing technologies enable soldiers to hear or read clear English versions of what is being said in their vicinity, despite a noisy or reverberant environment.  RATS technology isolated and delivered pertinent information to the warfighter by detecting periods of speech activity and discarding silent portions, determining the language spoken, identifying the speaker, and recognizing key words in challenging environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.998"
                                            },
                                            "Text": {
                                                "val": "-  Developed and implemented effective processing techniques for noisy environments, including speech activity detection, language identification, speaker identification, and keyword spotting.\n-  Evaluated performance showing substantial progress on noisy and degraded speech signals from the program-generated data corpus.\n-  Conducted tests of training systems on field-collected data and tested systems in realistic environments.\n-  Established a relationship with Offutt AFB to obtain real data and perform testing on site at the user location."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multilingual Automatic Document Classification, Analysis and Translation (MADCAT)"
                                    },
                                    "Description": {
                                        "val": "The Multilingual Automatic Document Classification, Analysis and Translation (MADCAT) program developed and integrated technology to enable exploitation of foreign language, hand-written documents.  This technology is crucial to the warfighter, as documents including notebooks, letters, ledgers, annotated maps, newspapers, newsletters, leaflets, pictures of graffiti, and document images captured in the field may contain extremely important time-sensitive information.  The MADCAT program addressed this need by producing devices to convert such captured documents from Arabic into readable English in the field.  MADCAT substantially improved applicable technologies, in particular document analysis and optical character recognition\/optical handwriting recognition.  MADCAT integrated these improved technologies with translation technology and created prototypes for field trials."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.500"
                                            },
                                            "Text": {
                                                "val": "-  Transitioned tightly integrated technology prototypes to military and intelligence operations centers.\n-  Trained and tested techniques on field-collected data.\n-  Improved MADCAT technologies transcribing and translating field-collected handwritten, machine-printed, and mixed handwritten and machine-printed documents."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "IT-05"
                    },
                    "ProjectTitle": {
                        "val": "CYBER TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "33.745"
                        },
                        "CurrentYear": {
                            "val": "67.849"
                        },
                        "BudgetYearOne": {
                            "val": "67.349"
                        },
                        "BudgetYearOneBase": {
                            "val": "67.349"
                        },
                        "BudgetYearTwo": {
                            "val": "35.014"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Cyber Technology project develops technology to increase the security of military information systems and the effectiveness of cyber operations.  Over the past decade the DoD has embraced net-centric warfare by integrating people, platforms, weapons, sensors, and decision aids.  Adversaries seek to limit this force multiplier through cyber attacks intended to degrade, disrupt, or deny military computing, communications, and networking systems.  Technologies developed under the Cyber Technology project will ensure DoD net-centric capabilities survive adversary cyber attacks and will enable new cyber-warfighting capabilities.  Promising technologies will transition to system-level projects."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Plan X"
                                    },
                                    "Description": {
                                        "val": "The Plan X program will develop technologies to enable comprehensive awareness and understanding of the cyber battlespace as required for visualizing, planning, and executing military cyber warfare operations.  This includes intelligence preparation of the cyber battlespace, indications and warning of adversary cyber actions, detection of cyber-attack onset, cyber-attacker identification, and cyber battle damage assessment.  Plan X will create new graphical interfaces that enable intuitive visualization of events on hosts and networks to aid in the planning and execution of cyber warfare.  Plan X will extend operationally meaningful measures to project quantitatively the collateral damage of executed cyber warfare missions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.796"
                                            },
                                            "Text": {
                                                "val": "-  Mapped network topologies consisting of thousands of nodes derived from millions of traceroute outputs.\n-  Generated and validated cyber mission plans at operationally relevant scales and speeds.\n-  Created a cyber domain specific language with binding to existing operational tools and cyber warfare mission planning interface.\n-  Built initial range infrastructure supporting hundreds of nodes in a dynamic topology."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "37.919"
                                            },
                                            "Text": {
                                                "val": "-  Release Plan X 1.0, including product launch and developer workshop.\n-  Coordinate development with operators from Air Force, Navy, Marine Corps, and Army cyber components and U.S. Cyber Command.\n-  Develop commander, planner, and operator views for the user interface.\n-  Create automated network simulation technology to model the cyber battlespace, generate cyber warfare mission plans, and script cyber warfare missions using domain specific languages."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "41.619"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "41.619"
                                            },
                                            "Text": {
                                                "val": "-  Create runtime environment and platforms capable of automatically deploying cyber warfare mission scripts.\n-  Release Plan X 2.0, including product launch and developer workshop.\n-  Demonstrate cyber battle damage assessment.\n-  Demonstrate capabilities by developing complex cyber training missions and employ system in a large-scale exercise (e.g., Cyber Flag)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Crowd Sourced Formal Verification (CSFV)"
                                    },
                                    "Description": {
                                        "val": "The Crowd-Sourced Formal Verification (CSFV) program will create technologies that enable crowd-sourced approaches to securing software systems through formal verification.  Formal software verification is a rigorous method for proving that software has specified properties, but formal verification does not currently scale to the size of software found in modern weapon systems.  CSFV will enable non-specialists to participate productively in the formal verification process by transforming formal verification problems into user-driven simulations that are intuitively understandable."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.949"
                                            },
                                            "Text": {
                                                "val": "-  Developed approaches for mapping high-level formal software verification problems into user-driven simulations.\n-  Developed techniques for inferring specification and coding errors from the solutions to these simulations and for automatically generating the appropriate annotations to aid formal verification.\n-  Developed web-based infrastructure to support large scale formal software verification workflows.\n-  Developed and tested the concept on a moderately-sized computer program consisting of thousands of lines of source code."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.680"
                                            },
                                            "Text": {
                                                "val": "-  Develop five web-based interactive computer simulations based on mapped high-level software specifications and codes.\n-  Launch and maintain public web site to attract the widest possible base for crowd-sourcing formal verifications.\n-  Apply simulations to large Java and C computer programs consisting of hundreds of thousands of lines of source code.\n-  Map solutions as code annotations back into formal verification tools and assess the effectiveness of these solutions by verifying the absence of errors on the MITRE Common Weakness Enumeration\/SANS Institute Top 25 lists.\n-  Refine initial simulations and develop new simulations for greater verification effectiveness."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.898"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.898"
                                            },
                                            "Text": {
                                                "val": "-  Refine simulations to make them accessible to a large set of non-specialists.\n-  Augment simulations to handle very large Java and C computer programs consisting of millions of lines of source code.\n-  Enhance public web site to include these new simulations.\n-  Assess effectiveness of the new simulations on the large-sized code targets."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cyber Grand Challenge (CGC)*"
                                    },
                                    "Description": {
                                        "val": "*Formerly Cyber Warfare Control System (CWCS)\n\nThe Cyber Grand Challenge (CGC) program will create automated defenses that can identify and respond to cyber attacks more rapidly than human operators.  CGC technology will monitor defended software and networks during operations, reason about flawed software, formulate effective defenses, and deploy defenses automatically.  Technologies to be developed and integrated may include anomaly detection, Monte Carlo input generation, case-based reasoning, heuristics, game theory, and stochastic optimization.  The CGC capability is needed because highly-scripted, distributed cyber attacks exhibit speed, complexity, and scale that exceed the capability of human cyber defenders to respond in a timely manner.  DARPA will incentivize competition through a Grand Challenge in which CGC technologies compete head-to-head."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.250"
                                            },
                                            "Text": {
                                                "val": "-  Develop instrumented competition framework for automated cyber defense.\n-  Initiate development of automated cyber defenders to identify flaws and formulate defenses.\n-  Conduct competitive assessments to identify the most promising technology solutions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.832"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.832"
                                            },
                                            "Text": {
                                                "val": "-  Extend development of automated cyber defenders to allow real time in situ network defense decision making.\n-  Develop a cyber research corpus using techniques from game theory, other quantitative disciplines, and emergent behavior.\n-  Conduct mid-term evaluation of cyber technologies through competitive challenges."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                }
            ]
        }
    }
}