{
    "id": "8b46a96a793316fa9944db6ffea930019c30c35f",
    "meta": {
        "filename": "dod-2015_RDTE_2015_NAVY_BA7_RDTE_JustificationBook_Navy_PB_2015.zzz_unzipped_RDTE_JustificationBook_Navy_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0204229N"
        },
        "ProgramElementTitle": {
            "val": "Tomahawk Mssn Planning Ctr"
        },
        "R1LineNumber": {
            "val": "181"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "3092.979"
            },
            "PriorYear": {
                "val": "10.154"
            },
            "CurrentYear": {
                "val": "12.407"
            },
            "BudgetYearOne": {
                "val": "32.385"
            },
            "BudgetYearOneBase": {
                "val": "32.385"
            },
            "BudgetYearTwo": {
                "val": "37.187"
            },
            "BudgetYearThree": {
                "val": "114.702"
            },
            "BudgetYearFour": {
                "val": "156.889"
            },
            "BudgetYearFive": {
                "val": "165.991"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Funds support development of the Tomahawk Weapon System (TWS) encompassing Tomahawk Land-Attack Missile (TLAM) upgrades, Tactical Tomahawk Weapons Controls System (TTWCS), Tomahawk Command and Control System (TC2S) upgrades and other missile system improvements. The TWS provides a Tomahawk cruise missile attack capability against fixed and mobile targets. The TLAM can be fitted with either Conventional unitary warhead (TLAM\/C) or submunition Dispenser (TLAM\/D). Tomahawk is capable of being deployed from both submarines and surface ships. Launched from mobile, sea-based platforms, the land attack variant significantly increases the total capability of joint forces. This Program Element also includes funding for the NGLAW Analysis of Alternatives (AoA) and resultant follow-on development of a long range, survivable strike capability. \n\nThis program is funded under Operational Systems Development because it includes development efforts to upgrade systems that have been fielded or have received approval for Full Rate Production (FRP) and anticipate funding in the current or subsequent fiscal year."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "11.265"
                },
                "CurrentYear": {
                    "val": "12.407"
                },
                "BudgetYearOne": {
                    "val": "16.858"
                },
                "BudgetYearOneBase": {
                    "val": "16.858"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "10.154"
                },
                "CurrentYear": {
                    "val": "12.407"
                },
                "BudgetYearOne": {
                    "val": "32.385"
                },
                "BudgetYearOneBase": {
                    "val": "32.385"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.111"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "15.527"
                },
                "BudgetYearOneBase": {
                    "val": "15.527"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.174"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "17.500"
                                },
                                "BudgetYearOneBase": {
                                    "val": "17.500"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.001"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-1.973"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.973"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.938"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical:  FY15 increase in funding will be used to continue Anti-Access\/Area Denial (A2AD) Navigation Improvements and initiate A2AD communications upgrades into Block IV weapons systems. A2AD communications Preliminary Design Review, Critical Design Review and Operational Test Readiness Review were added to the schedule as a result.\n\nFunding was also added to Project Unit 3378, Next Generation Land Attack Weapon, for the Analysis of Alternatives (AoA) and resultant follow-on development of a long range, survivable strike capability.\n\nSchedule:  Changes to the R-4 schedule include updating all Image Navigation specific language and replacing it with Anti-Access\/Area Denial(A2AD). The A2AD Preliminary Design Review and Critical Design Review dates have each slipped by 1 QTR as a result of restructuring program scope to existing Tomahawk segments to plan and execute GPS denied missions. As a result of changes to the program's Hardware Development acquisition strategy, Tactical Tomahawk Full Rate Production was removed. \n\nA2AD Engineering Change Proposal (ECP) and A2AD Navigation Fleet Release have slipped due to contractor performance on preceding Small Business Innovation Research (SBIR) contracts. The contractor was expected to be at a Technology Readiness Level (TRL) 6\/7 by the end of delivery order 3 (Jun 2013), and have only achieved TRL 5\/6.  Subsequently, an additional delivery order was added to that Basic Ordering Agreement which is no longer being pursued.\n\nChanges within the R-4 schedule profile to the TTWCS schedule include the deletion of the v5.4.1 future operational capability milestone as v5.4.1 has been deferred and v5.4.0.2 has replaced it in 3rd quarter 2016 as the program of record, as approved by PEO (U&W) on January 24, 2013. Per this decision, v5.4.0.2 milestones replace v5.4.1 milestones. This includes v5.4.0.2 Operational Test Readiness Review (OTRR) replacing v5.4.1 test readiness review in 4th quarter 2015, Fleet release will occur after v5.4.0.2 OTRR in 2nd quarter 2016.\n\nChanges within the R-4 schedule profile to TC2S include changing TC2S 4.3 FOC from 3QFY12 to 4QFY15 as a result of changes in ship availabilities and budget reductions due to FY13 sequestration. The 5.0.1 FOC was delayed from 2QFY15 to 4QFY17 due to schedule delays with the fielding of TC2S 4.3."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0545"
                    },
                    "ProjectTitle": {
                        "val": "TOMAHAWK"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "3092.979"
                        },
                        "PriorYear": {
                            "val": "10.154"
                        },
                        "CurrentYear": {
                            "val": "12.407"
                        },
                        "BudgetYearOne": {
                            "val": "27.385"
                        },
                        "BudgetYearOneBase": {
                            "val": "27.385"
                        },
                        "BudgetYearTwo": {
                            "val": "27.187"
                        },
                        "BudgetYearThree": {
                            "val": "44.702"
                        },
                        "BudgetYearFour": {
                            "val": "31.889"
                        },
                        "BudgetYearFive": {
                            "val": "15.991"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Tomahawk Weapon System (TWS) provides a Tomahawk cruise missile attack capability against fixed and mobile targets. This program ensures that the TWS exploits state-of-the-art technology to preserve the efficiency of this proven weapon system, and includes all missile development, mission planning system development, and submarine and surface ship weapons control system development.\n\nThe Tactical Tomahawk All-Up-Round (AUR) Block IV missile is a comprehensive spiral baseline upgrade to the TWS that provides the tactical commander a quick reaction response capability as well as improved flexibility, increased accuracy and higher lethality.  A five-year multi-year (FY04-FY08) production contract was awarded in August 2004 for the production of up to 2200 Block IV Tomahawk missiles.  The essential upgrades of the Block IV missile are: improved guidance, navigation, control and mission computer two-way Satellite Communications (SATCOM), and a lower production cost as compared to the Block III missile.  Block IV provides a Ultra High Frequency SATCOM data link to enable the missile to receive in-flight mission modification messages, to transfer health and status messages and to broadcast Battle Damage Indication messages.  Block IV also includes a high anti-jam Global Postitioning System (GPS) receiver, navigation improvements and associated antenna systems.  The Tomahawk program also includes developments to evolve the TWS to be able to plan and execute missions requiring navigation in an Anti-Access\/Area Denied environment.\n \nUnder the umbrella of the Theater Mission Planning Center (TMPC), the TC2S is the mission planning segment of the TWS that provides systems for the precision targeting, route planning, mission distribution, and strike management of Tomahawk cruise missile missions from sites located ashore and afloat.  TMPC optimizes all aspects of the Tomahawk missile mission to successfully engage a target and has evolved into five scalable configurations at 179 sites: Cruise Missile Support Activities (CMSAs) (3), Tomahawk Strike Mission Planning Cells (TSMPCs) (3 - C5F, C6F, C7F), Carrier Strike Groups (CSGs) (10 CVN's\/5 CTF's), Firing Units (FRUs)(84 Surface\/56 Submarines), Command & Control Nodes (C2 Nodes)(6), labs (6), and training classrooms (6).  Systems fielded at the CMSAs and TSMPCs provide mission planning and employment support information for TLAM\/C, including the distribution of mission data and command information essential to TLAM employment via the mission distribution system and associated communications infrastructure.  Development of Tactical Tomahawk capabilities in TMPC\/TC2S includes software development, integration, test, and delivery, including support for training development, installation planning, and simulation\/model development required by Commander, Operational Test and Evaluation Force.  This project also includes development related to national and tactical imagery architectures, as well as software development to decrease mission planning time and increase the quality and accuracy of each mission for Block III and IV TLAM.\n\nThe TTWCS provides launch capability for surface and submarine platforms.  Development of the TTWCS provides a common architecture to launch the TACTOM Block IV and all variants in inventory.  Development of upgrades to the TTWCS is required to meet the Department of Defense Information Technology Standards Registry, to meet FORCEnet compliance and be Internet Protocol Version 6 ready in order to remain interoperable within the Joint Service Architecture and to retain weapons system viability and usability for our Sailors.  These efforts provide battle-group tactical flexibility and responsiveness while maximizing TWS wartime capability."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Tactical Tomahawk All-Up-Round (AUR)"
                                    },
                                    "Description": {
                                        "val": "Continuation of the cooperatively funded United States Navy\/United Kingdom Joint Multi-Effects Warhead System (JMEWS) \/ Joint Capability Technology Demonstration (JCTD). Include significant research and analysis of the worldwide target set capability gaps to include Hard and Buried Targets and Prompt Global Strike targets, for which JMEWS is a potential solution. In addition, NAWCAD also provides engine power data\/analysis in order to determine reserve power available to power potential upgrades to the Tomahawk AUR, such as JMEWS. Continue fleet experimentation and requirements coordination as well as Concept of Operations (CONOPS)\/ Concept of Employment development. Commence and continue Anti-Access\/Area Denial (A2AD) navigation and communication integration into Block IV weapons system."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.722"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Began acquisition milestone documentation for the JMEWS transition.  Requirements, CONOPS, and software development for image navigation technology. Non-recurring engineering, systems and software development, integration and testing of capability upgrades to address emergent threats, Urgent Operational Needs Statement (UONS) and ORD target set gap."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.509"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Commence A2AD navigation and communication integration into Block IV weapons system.  FY 2014 efforts include requirements development and documentation; CONOPS development; software development; mission planning updates; and integration efforts.  Continuation of JMEWS transition, integration, and demonstration efforts.  Assessing and testing communication architecture and technologies to overcome more challenging communication environments.  Target assessments, engine performance analysis, campaign planning and mission analysis for potential Tactical Tomahawk upgrades or new applicable weapons.  Non-recurring engineering, systems and software development, integration and testing of capability upgrades to address emergent threats, UONS, Fleet Gaps, and the Tomahawk ORD."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.967"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.967"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue A2AD navigation and communications transition and engineering change proposals to include software development, systems engineering, system testing, and transition documentation. Continuation of JMEWS transition, integration, and demonstration efforts. Target assessments, engine performance analysis, campaign planning and mission analysis for potential Tactical Tomahawk upgrades or new applicable weapons.  Non-recurring engineering, systems and software development, integration and testing of capability upgrades to address emergent threats, UONS, Fleet Gaps, and the Tomahawk ORD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tomahawk Command and Control Systems (TC2S)"
                                    },
                                    "Description": {
                                        "val": "Development and incorporation of new capabilities in TC2S necessary for the employment of Tactical Tomahawk.  Imagery upgrades to TC2S.  Continue test & evaluation support for TC2S."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.432"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued Tomahawk Land Attack Missile (TLAM) navigation and accuracy and weapons delivery Circular Error Probable (CEP) studies and assessments necessary to ensure the TWS is properly employed; continued evaluation of TC2S design process to ensure Tactical Tomahawk missile performance characteristics are adequately modeled in TC2S.  Continued evaluation of imagery formats resulting from National Geospatial Intelligence Agency (NGA) mandated architectural changes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.898"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue TLAM navigation and accuracy and weapons delivery CEP studies and assessments necessary to ensure the TWS is properly employed; continue evaluation of TC2S design process to ensure Tactical Tomahawk missile performance characteristics are adequately modeled in TC2S.  Continue evaluation of imagery formats resulting from NGA mandated architectural changes.  Initial evaluation of Anti-Access\/Area Denial (A2AD) navigation and communications integration and mission planning timeline upgrades.  Develop requirements and design for A2AD navigation and communications integration and mission planning timeline upgrades."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.418"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.418"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue TLAM navigation and accuracy and weapons delivery CEP studies and assessments necessary to ensure the TWS is properly employed; continue evaluation of TC2S design process to ensure Tactical Tomahawk missile performance characteristics are adequately modeled in TC2S.  Continue evaluation of imagery formats resulting from NGA mandated architectural changes. Continue the development of navigation software improvements capability and software code completion associated with A2AD navigation and communications integration and mission planning timeline upgrades.  The majority of the development will occur in FY15."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "WPN\/2101"
                                    },
                                    "Title": {
                                        "val": "Tomahawk"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "293.582"
                                        },
                                        "CurrentYear": {
                                            "val": "312.456"
                                        },
                                        "BudgetYearOne": {
                                            "val": "194.258"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "194.258"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "95.859"
                                        },
                                        "BudgetYearThree": {
                                            "val": "10.237"
                                        },
                                        "BudgetYearFour": {
                                            "val": "6.203"
                                        },
                                        "BudgetYearFive": {
                                            "val": "5.648"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "OPN\/5253"
                                    },
                                    "Title": {
                                        "val": "Tomahawk Support Equip"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "62.651"
                                        },
                                        "CurrentYear": {
                                            "val": "63.559"
                                        },
                                        "BudgetYearOne": {
                                            "val": "61.462"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "61.462"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "63.016"
                                        },
                                        "BudgetYearThree": {
                                            "val": "62.978"
                                        },
                                        "BudgetYearFour": {
                                            "val": "65.115"
                                        },
                                        "BudgetYearFive": {
                                            "val": "65.734"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "OPN\/9020"
                                    },
                                    "Title": {
                                        "val": "Initial and Vendor Direct Spares"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.023"
                                        },
                                        "CurrentYear": {
                                            "val": "0.158"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.240"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.240"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.172"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.160"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.219"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.164"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Tactical Tomahawk (TACTOM) Weapon System achieved IOC in May 2004. The acquisition strategy involves maintaining production through FY14 and entrance into recertification starting in FY19. Recertification of TACTOM missiles starting in FY19 provides modernization opportunities to improve weapon system performance. TC2S and TTWCS are in sustainment requiring periodic hardware and software updates to maintain compliance with IA standards and maintain system relevance against emerging threats. Sustainment of TC2S and TTWCS segments will rely on a blend of industry and government expertise through the remaining life of the program.\n\nResearch & Development technology demonstration capabilities (Multiple-Effects Warhead, Anti Surface Warfare) will be potentially introduced after successful qualification and testing."
                        },
                        "PerformanceMetrics": {
                            "val": "The Navy seeks to improve the Tomahawk cruise missile attack capability against land targets through research and development done predominantly through defense contractors and government field activities.       \n\nExamples in the area of the All-Up-Round include development of candidate warheads and sensors that will enhance weapon ability to cover all assigned target types, provide a quick reaction response capability for the weapon system, and improved guidance, navigation, control, mission computer two-way satellite communications, and a high anti-jam GPS receiver all in line with state of the art technology.  \n\nIn the area of the weapons control system, research and development is performed to ensure viability and usability of the system into the future, providing necessary upgrades to meet the Department of Defense Information Technology standards registry to comply with FORCEnet requirements and be Internet Protocol Version 6 ready to remain interoperable within Joint Service Architecture, in order to provide battle-group tactical flexibility and responsiveness needed to enable full wartime capability.  \n\nIn the area of the TC2S, continue research and development in order to provide scalable configurations to deploy where and as needed to provide necessary command and control, development necessary to function with national and tactical imagery architectures, decrease mission planning time, and increase the quality and accuracy of each mission for the TWS."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0204229N_0545_FILE1.PNG"
                                }
                            }
                        ]
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3378"
                    },
                    "ProjectTitle": {
                        "val": "Next Generation Land Attack Weapon (NGLAW)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "5.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.000"
                        },
                        "BudgetYearTwo": {
                            "val": "10.000"
                        },
                        "BudgetYearThree": {
                            "val": "70.000"
                        },
                        "BudgetYearFour": {
                            "val": "125.000"
                        },
                        "BudgetYearFive": {
                            "val": "150.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Funding is provided for a Next Generation Land Attack Weapon (NGLAW), a weapons system that is long range, survivable and can be launched from multiple surface and submarine platforms.  NGLAW will incorporate evaluated existing and emergent technologies to support an improved strike capability with an Initial Operational Capability (IOC) no later than 2024.\n\nThis effort will enter the Analysis of Alternatives (AoA) phase of the acquisition cycle in FY15.  Upon completion, the Department of the Navy will assess the results of the AoA and make a determination on a preferred material approach, the phase of the acquisition cycle the program will enter, and when the NGLAW weapon will achieve IOC."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Next Generation Land Attack Weapon"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct a thorough AoA assessing existing weapons systems, emergent technologies, and industry Internal Research and Development activities\/proposals; develop potential Program of Record costs, schedules, and risks, as they apply to each.  Conduct threat assessments based on current and future scenarios and environments to inform performance requirements and relevant technology which will be matured to provide potential NGLAW solution."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "WPN\/2101"
                                    },
                                    "Title": {
                                        "val": "Tomahawk"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "293.582"
                                        },
                                        "CurrentYear": {
                                            "val": "312.456"
                                        },
                                        "BudgetYearOne": {
                                            "val": "194.258"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "194.258"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "95.859"
                                        },
                                        "BudgetYearThree": {
                                            "val": "10.237"
                                        },
                                        "BudgetYearFour": {
                                            "val": "6.203"
                                        },
                                        "BudgetYearFive": {
                                            "val": "5.648"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "OPN\/5253"
                                    },
                                    "Title": {
                                        "val": "Tomahawk Support Equipment"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "62.651"
                                        },
                                        "CurrentYear": {
                                            "val": "63.559"
                                        },
                                        "BudgetYearOne": {
                                            "val": "61.462"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "61.462"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "63.016"
                                        },
                                        "BudgetYearThree": {
                                            "val": "62.978"
                                        },
                                        "BudgetYearFour": {
                                            "val": "65.115"
                                        },
                                        "BudgetYearFive": {
                                            "val": "65.734"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "OPN\/9020"
                                    },
                                    "Title": {
                                        "val": "Initial and Vendor Direct Spares"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.023"
                                        },
                                        "CurrentYear": {
                                            "val": "0.158"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.240"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.240"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.172"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.160"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.219"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.164"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Initiate AoA in FY15 with expected Milestone A by the end of FY16."
                        },
                        "PerformanceMetrics": {
                            "val": "Obtain Milestone A decision for NGLAW in FY16."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0204229N_3378_FILE1.PNG"
                                }
                            }
                        ]
                    }
                }
            ]
        }
    }
}