{
    "id": "8b93866efe601214bdf93d7fd7b522ddc5118af7",
    "meta": {
        "filename": "dod-2015_RDTE_2015_CDBP_RDTE_JustificationBook_Chemical_and_Biological_Defense_Program_PB_2015.zzz_unzipped_RDTE_JustificationBook_Chemical_and_Biological_Defense_Program_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Chemical and Biological Defense Program",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602384BP"
        },
        "ProgramElementTitle": {
            "val": "CHEMICAL\/BIOLOGICAL DEFENSE (APPLIED RESEARCH)"
        },
        "R1LineNumber": {
            "val": "16"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Chemical and Biological Defense Program"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "202.700"
            },
            "CurrentYear": {
                "val": "197.065"
            },
            "BudgetYearOne": {
                "val": "226.317"
            },
            "BudgetYearOneBase": {
                "val": "226.317"
            },
            "BudgetYearTwo": {
                "val": "215.133"
            },
            "BudgetYearThree": {
                "val": "209.007"
            },
            "BudgetYearFour": {
                "val": "214.062"
            },
            "BudgetYearFive": {
                "val": "208.711"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) sustains a robust defense program and core science and technology capabilities, which both reduces the danger of a Chemical, Biological, or Radiological (CBR) attack and enables U.S. forces to survive, and continue operations in a CBR environment.  \n\nIn the physical sciences area, Project CB2, focuses on continuing improvements in CB defense materiel, including contamination avoidance, decontamination, and protection technologies, as well as biological weapon\/agent surveillance.  \n\nThe medical program, Project TM2, focuses on the development of antidotes, drug treatments, disease surveillance and point-of-need diagnostic devices, patient decontamination and medical technologies management.  The program also provides for the Medical Countermeasures Initiative (MCMI), which was established to provide the capability for the advancement of regulatory science and flexible manufacturing of biological MCM to address CBR threats, including novel and previously unrecognized, naturally-occurring emerging infectious diseases.  \n\nFor Non-Traditional Agents (NTAs), Project NT2 consolidates all NTA efforts (both medical and non-medical) including pretreatments, therapeutics, detection, threat agent science, modeling, and protection and hazard mitigation.  \n\nEfforts under this PE will transition to or will provide risk reduction for Advanced Technology Development (PE: 0603384BP), Advanced Component Development and Prototypes (PE: 0603884BP) and System Development and Demonstration (PE: 0604384BP)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "223.269"
                },
                "CurrentYear": {
                    "val": "227.065"
                },
                "BudgetYearOne": {
                    "val": "231.152"
                },
                "BudgetYearOneBase": {
                    "val": "231.152"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "202.700"
                },
                "CurrentYear": {
                    "val": "197.065"
                },
                "BudgetYearOne": {
                    "val": "226.317"
                },
                "BudgetYearOneBase": {
                    "val": "226.317"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-20.569"
                },
                "CurrentYear": {
                    "val": "-30.000"
                },
                "BudgetYearOne": {
                    "val": "-4.835"
                },
                "BudgetYearOneBase": {
                    "val": "-4.835"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.294"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "-16.456"
                    },
                    "CurrentYear": {
                        "val": "-30.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.848"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.971"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-4.835"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-4.835"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funding: FY13: Reductions of $16.5M impacted the ability to advance potential solutions for sensing technologies, diagnostics, medical countermeasures, and toxin efforts.  \n\nFY14: Reductions of $30.0M delay key physical and medical program applied research efforts in threat agent sciences, detection, algorithm development, protection, medical countermeasures, diagnostics, and hazard mitigation technology development.  \n\nFY15: Reductions of $4.8M slow applied research efforts for medical countermeasures, diagnostic, and modeling efforts.\n\nSchedule: N\/A\n\nTechnical: N\/A"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "CB2"
                    },
                    "ProjectTitle": {
                        "val": "CHEMICAL BIOLOGICAL DEFENSE (APPLIED RESEARCH)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "44.384"
                        },
                        "CurrentYear": {
                            "val": "44.903"
                        },
                        "BudgetYearOne": {
                            "val": "54.061"
                        },
                        "BudgetYearOneBase": {
                            "val": "54.061"
                        },
                        "BudgetYearTwo": {
                            "val": "52.579"
                        },
                        "BudgetYearThree": {
                            "val": "54.705"
                        },
                        "BudgetYearFour": {
                            "val": "53.910"
                        },
                        "BudgetYearFive": {
                            "val": "52.563"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Project CB2 provides physical science applied research to develop future, multi-disciplinary, multi-functional capabilities in life sciences, physical sciences, environmental sciences, mathematics, cognitive sciences, and engineering.  Efforts in this project support the seamless integration of state-of-the-art-technologies into a collection of systems across the spectrum of capabilities required to support chemical and biological defense missions.  Capability areas in this project include: detection; Information systems technology; protection\/hazard mitigation; and threat agent science.  Detection focuses on developing technologies for standoff and point detection and identification of chemical and biological agents.  Information systems technology focuses on advanced hazard prediction, operational effects and risk assessment, and systems performance modeling.  Protection and hazard mitigation focuses on providing technologies that protect and reduce the chemical\/biological threat or hazard to the Warfighter, weapons platforms, and structures.  Threat agent science is devoted to characterizing threat agents and the hazards they present in terms of agent fate in the environment, toxicology, and pathogenicity.  This project focuses on horizontal integration of CB defensive technologies in support of the Joint Services."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) Biosurveillance"
                                    },
                                    "Description": {
                                        "val": "Integrate existing disparate military and civilian datasets, investigate methodologies to appropriately integrate open source data into advanced warning systems, and leverage and enhance advanced epidemiological models and algorithms for disease prediction, impact and biological threat assessment.  Contribute to the development of global, near real-time, disease monitoring and surveillance systems that address secondary infection, fuse medical syndromic, environmental, and clinical data, and feed into agent-based epidemiological modeling, medical resource estimation and decision support tools.  Focus on agent-based epidemiological modeling and fusion of disease surveillance data."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.867"
                                            },
                                            "Text": {
                                                "val": "Continue efforts in FY13 from Diagnostics and Disease Surveillance (previously under Project TM2).  Complete effort on biosurveillance data stream evaluation and analysis to identify most useful biosurveillance data streams for prediction and early warning and leverage this research for Biosurveillance (BSV) Ecosystem effort.  Complete effort to devise a structured, outside continental U.S. (OCONUS) expansion roadmap for agent-based epidemiological models and continue to increase OCONUS analytic capability through targeted areas.  Leverage this research for BSV Ecosystem effort.  Advance research into data integration platforms through the BSV Ecosystem effort.  Develop approaches for unique and emerging data collection, aggregation and provision of human, vector and animal\/zoonotic health surveillance data.  Develop algorithms, verification, and validation for these data feeds to synthesize and interrogate multiple sources of data to provide high confidence in the prediction, early warning and forecasting (inclusive of mitigation strategies) of infectious disease outbreaks.  Leverage Biosurveillance and point of need diagnostic efforts to support in-context, rapid detection, identification and response capabilities on the global scale through integrated access via the BSV Ecosystem."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.740"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.740"
                                            },
                                            "Text": {
                                                "val": "Complete efforts using social media to infer individual and collective health behavior for digital threat surveillance, epidemic planning and response.  Complete effort to develop a flexible set of data driven models that dynamically assesses the socio-economic response to the spread of disease and, in turn, the effect of that response on disease spread.  Complete efforts to refine technology to enable device to cloud communications in order to fully leverage biosurveillance and point of need diagnostic efforts.  Continue the development of the BSV Ecosystem to include analyst collaboration tools, advanced analytics, and analyst workbench."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "2) Detection"
                                    },
                                    "Description": {
                                        "val": "Emphasis on the detection and identification of chemical and biological threats.  Objectives include the development of nanoscale detector for sensing of chemical and biological agents, design for prototype whole pathogen genome sequencing system."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.926"
                                            },
                                            "Text": {
                                                "val": "Completed concept development of nano-scale biological agent identification and sensing technologies.  Completed feasibility studies of nanoscale detection systems.  Continued integration studies for Next Generation Chemical Detector (NGCD) based on Microelectromechnical System (MEMS) components for gas chromatography (GC) and mass spectrometry (MS).  Completed development of breadboard prototype for complete sequencing entire pathogen genomes with automated sample preparation which also applies to biosurveillance.  Continued algorithm development to increase range capabilities, reduce false positives, and provide decision capabilities for large data sets."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.286"
                                            },
                                            "Text": {
                                                "val": "Continue integration studies for NGCD based on MEMS components for GC and MS.  Continue algorithm development to increase range capabilities, reduce false positives, and provide decision capabilities for large data sets."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.025"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.025"
                                            },
                                            "Text": {
                                                "val": "Continue integration studies for NGCD based on MEMS components for GC and MS.  Continue algorithm development to increase range capabilities, reduce false positives, and provide decision capabilities for large data sets."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "3) Warning and Reporting"
                                    },
                                    "Description": {
                                        "val": "Emphasis on developing science and technologies for collaborative information management, fusion of disparate information from multiple sources, environmental databases and modeling, fusion of syndromic\/diseases surveillance data, and synthetic environments for model performance evaluation and acquisition decisions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.256"
                                            },
                                            "Text": {
                                                "val": "Initiate study on animal and human effects from time-varying toxic industrial chemical concentration exposures.  Initiate development of a generalized Virtual Testing and Evaluation test bed for evaluating\/stressing source characterization and hazard refinement techniques, under a wide range of operational conditions.  Initiate interior building transport and dispersion modeling effort to improve modeling of indoor-to-outdoor dispersion and to enhance the indoor modeling capabilities of advanced development programs.  Continue study on integration of biosurveillance data with disease spread models to enable early warning and reporting capabilities, performing R&D to improve performance of novel data assimilation algorithm used to integrate global biosurveillance data."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "4) Hazard Prediction"
                                    },
                                    "Description": {
                                        "val": "Improve battlespace awareness by accurately predicting hazardous material releases, atmospheric transport and dispersion, and resulting human effects.  Develop capability for predicting the source term of releases of chemical, biological, and industrial materials."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.908"
                                            },
                                            "Text": {
                                                "val": "Completed development of a waterborne transport tool investigating transport methods for biological agents and other materials.  Initiated development of waterborne inverse transport module based on feasibility study results.  In FY14, the capability for virtual test and evaluation being developed in the Warning & Reporting area will now be consolidated within this Hazard Prediction area."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.005"
                                            },
                                            "Text": {
                                                "val": "Continue development of waterborne inverse transport modeling capability at a slower pace in conjunction with the verification and validation effort for waterborne transport models.  Continue interior building transport and dispersion modeling effort to improve modeling of outdoor dispersion from indoor release and modeling of indoor dispersion in multiple buildings from an outdoor release, simulating wide-area effects of a release in an urban environment.  Initiate verification and validation of interior building transport and dispersion models.  Continue development of a generalized capability for virtual test and evaluation for evaluating\/stressing source characterization and hazard refinement techniques.  Develop and conduct verification and validation on modules emulating a variety of sensors and solid sorbent tubes.  Initiate final work on advancing the urban modeling capability and optimizing the urban sub-system for interfacing transport models of varying fidelity and speed."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.216"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.216"
                                            },
                                            "Text": {
                                                "val": "Continue development of next-generation waterborne transport models in conjunction with related validation and verification efforts.  Continue interior building transport and dispersion modeling effort to improve modeling of outdoor dispersion from indoor release and modeling of indoor dispersion in multiple buildings from an outdoor release, simulating wide-area effects of a release in an urban environment.  Complete initial verification and validation of interior building transport and dispersion models.  Continue development of a generalized capability for virtual test and evaluation for evaluating\/stressing source characterization and hazard refinement techniques.  Focus on bridging the gap between meso- and micro-scale turbulence simulations.  Continue advancing the urban modeling capability and optimizing the urban sub-system for interfacing transport models of varying fidelity and speed."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "5) Data Analysis"
                                    },
                                    "Description": {
                                        "val": "Develop CBRN data sharing capabilities and simulation tools."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.415"
                                            },
                                            "Text": {
                                                "val": "Continued to develop the Chemical and Biological Agent Effects Manual Number 1 (CB-1), an authoritative source capturing analytical methods for evaluating the effects of CB agents on equipment, personnel, and operations.  Initiated development of chapters on meteorological and geographic data, battle space management, and reconnaissance.  Concluded development of initial versions of systems performance models in collective protection, individual protection, contamination avoidance and decontamination.  Initiated system performance model integration and advanced development for program-wide exploitation (moved to Operational Effects in FY14)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.442"
                                            },
                                            "Text": {
                                                "val": "Continue to develop additional chapters of the Chemical and Biological Agent Effects Manual Number 1 (CB-1), an authoritative source capturing analytical methods for evaluating the effects of CB agents on equipment, personnel, and operations.  Initiate new chapters related to consequence assessment and site characteristics.  Complete study on animal and human effects from time-varying toxic industrial chemical concentration exposures."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.989"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.989"
                                            },
                                            "Text": {
                                                "val": "Complete initial chapter development and continue to develop additional chapters of the Chemical and Biological Agent Effects Manual Number 1 (CB-1), an authoritative source capturing analytical methods for evaluating the effects of CB agents on equipment, personnel, and operations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "6) Operational Effects & Planning"
                                    },
                                    "Description": {
                                        "val": "Develop decision support tools and information management capabilities for planning and real-time analysis to determine and assess operational effects, risks, and impacts of CBRN incidents on decision making.  Focus areas include consequence management, population modeling, and human knowledge management."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.295"
                                            },
                                            "Text": {
                                                "val": "Continued studies on social\/cultural norms for application in agent-based models.  Continued study of social reaction to disease and disease mitigation strategies to support biosurveillance.  Continued development of human cognitive models that incorporate the effects of chemical and biological agent interaction with other battle stressors to facilitate operational decision-making.  Initiated special population analysis to model emerging disease and the effects of targeted countermeasures.  Continued operational effects research and analysis efforts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.819"
                                            },
                                            "Text": {
                                                "val": "Continue operational effects research and analysis efforts to provide the CBDP with objective, quantitative analysis in support of science and technology initiatives, material developments, operational guidance, and requirements setting.  Continue system performance model integration and advanced development for program-wide exploitation (moved from Data Analysis in FY14).  Initiate operational effects risk management framework development to inform service-specific analyses and decision-makers.  Initial development will be at a reduced level."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.181"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.181"
                                            },
                                            "Text": {
                                                "val": "Continue system performance model integration and advanced development for program-wide exploitation for collective and individual protection and contamination avoidance.  Continue operational effects risk management framework development to inform service-specific analyses and decision-makers.  The Decision Support Tool increase in funding is to address Joint Operations Effects requirements and CBDP directed risk-based planning and decision making."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "7) Filtration"
                                    },
                                    "Description": {
                                        "val": "Development and integration of novel filtration media into a lightweight, low-profile, and low-burden individual protective filter, which has enhanced performance against a broader range of challenges that includes toxic industrial chemicals (TICs)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.791"
                                            },
                                            "Text": {
                                                "val": "Continued development of next generation filtration technology.  Continued focus on low resistance\/low profile novel filter media with augmented performance against TICs and chemical agents.  Continued to replace legacy filter media with novel media that offers broad spectrum protection.  Continued with technology areas to include: metal organic frameworks, novel adsorbents and reactive hybrids."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.596"
                                            },
                                            "Text": {
                                                "val": "Continue development of next generation filtration technology.  Continue focus on low resistance\/low profile novel filter media with augmented performance against TICs and chemical agents.  Continue to replace legacy filter media with novel media that offers broad spectrum protection.  Continue with technology areas to include: metal organic frameworks, novel adsorbents and reactive hybrids and transition these technologies to the Joint Service General Purpose Mask (JSGPM) and Joint Service Aircrew Mask (JSAM) programs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.943"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.943"
                                            },
                                            "Text": {
                                                "val": "Transition a synthetic nano-structured material focused on toxic industrial chemical removal, including ammonia."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "8) Respirator"
                                    },
                                    "Description": {
                                        "val": "Development and analysis of design alternatives for chemical and biological air-purifying respirators to provide enhanced protection with lower physiological burden and improved interface with mission equipment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.237"
                                            },
                                            "Text": {
                                                "val": "Continued development of next generation low burden respirator technology.  Developed and integrated novel seal, anti-fogging, and dual cavity technologies.  Developed and verified methods for a Respiratory Battlefield Evaluation System (RBEs)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.533"
                                            },
                                            "Text": {
                                                "val": "Continue development of next generation low burden respirator technology.  Develop and integrate novel seal, anti-fogging, and dual cavity technologies.  Develop and verify methods for RBEs.  Develop a scalable respirator technology to quickly configure to different protective capabilities from air purifying respirator (APR) to self-contained breathing apparatus (SCBA)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.150"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.150"
                                            },
                                            "Text": {
                                                "val": "Restructure program to focus on special purpose tactical applications for high hazard areas.  Explore configurations that rapidly scale from air purification respirators to closed circuit self-contained briefing apparatus."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "9) Lightweight Integrated Fabric"
                                    },
                                    "Description": {
                                        "val": "Development of lightweight chemical and biological protective textiles that can be used as an integrated combat duty uniform."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.806"
                                            },
                                            "Text": {
                                                "val": "Completed initial development work, fabrication, and testing of prototype integrated fabrics to determine protection, mechanical properties, and comfort characteristics (such as heat and water vapor transfer properties).  Continued use of computational methods to assess and refine future prototypes.  Continued improved thermal modeling simulations.  Continued to develop new low burden fabrics and ensemble designs to support the Uniform Integrated Protection Ensemble (UIPE) programs.  Continued with development areas that include: evaluation of superoleophobic materials, refinement of \"man in simulant test\" sensors, continuation of aerosol system testing, advanced adsorbent nanofiber\/textile production technology, and smart materials."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.538"
                                            },
                                            "Text": {
                                                "val": "Continue to develop new low burden fabrics and ensemble designs to support the UIPE programs with a focus on whole system assessments.  Continue with development areas that include: evaluation of superoleophobic materials, refinement of \"man in simulant test\" sensors, continuation of aerosol system testing, advanced adsorbent nanofiber\/textile production technology, and smart materials.  Continue exploring multifunctional material design and synthesis to identify dynamic materials that integrate functionality and durability to improve CB protection by increasing protection factors and reducing physical burden.  Continue exploring integration of functionality that may provide adaptive materials and capabilities for CB defense countermeasures that sense, transduce, respond and mitigate threats."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.450"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.450"
                                            },
                                            "Text": {
                                                "val": "Transition new low burden fabrics and ensemble designs to the UIPE programs.  Complete development areas that include: evaluation of materials with high resistance to organic compounds, refinement of \"man in simulant test\" sensors, aerosol system testing, advanced adsorbent nanofiber\/textile production technology, and smart materials.  Transition materials that integrate functionality and durability to improve CB protection by increasing protection factors and reducing physical burden.  Conduct a demonstration of new fabric technologies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "10) Personnel Decontamination"
                                    },
                                    "Description": {
                                        "val": "Develop new technologies to alleviate the risk associated with contaminated human remains and personal effects (materials) exposed to and contaminated by chemical agents by neutralizing and\/or physically removing the residual chemical agents."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.478"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.478"
                                            },
                                            "Text": {
                                                "val": "Initiate Personnel Decontamination hazard mitigation projects to decontaminate individual human remains and manage personal effects following exposure to CWAs\/NTAs\/TICS\/TIMs.  Determine the fate and residual hazard of chemical, biological, and radiological warfare agents (CBRs) on contaminated human remains and personal effects; develop technological options to remove\/neutralize CBR hazards from individual human remains and personal effects."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "11) Decontamination"
                                    },
                                    "Description": {
                                        "val": "Development and analysis of non-traditional decontamination technologies and approaches which gain significantly improved effectiveness by complementary application."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.106"
                                            },
                                            "Text": {
                                                "val": "Continued the development of new formulations adjusted for agent, material substrate, and environment; combined with optimized application systems and initiated additional efforts based on the results of the dial-a-decon analysis of alternatives.  Continued coatings efforts to examine durable and temporary coatings that pursue reactive and barrier options and initiated efforts based on the results of the coatings analysis of alternatives.  Continued development of delivery and application methods on decontamination efficacy on complex surfaces.  Continued to develop decontamination assurance sprays for biological agents and other agents of interest.  Continued development of enzymes for sensitive equipment\/platform decon.  Initiated radiological\/nuclear decontamination\/hazard mitigation effort."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.124"
                                            },
                                            "Text": {
                                                "val": "Continue the development of new formulations adjusted for agent, material substrate, and environment; combine with optimized application systems and initiate additional efforts based on the results of the dial-a-decon analysis of alternatives.  Continue coatings efforts to examine durable and temporary coatings that pursue reactive and barrier options and initiate efforts based on the results of the coatings analysis of alternatives.  Continue development of delivery and application methods on decontamination efficacy on complex surfaces.  Continue to develop decontamination assurance sprays for biological agents and other agents of interest.  Continue development of enzymes for sensitive equipment\/platform decontamination.  Investigate technologies to decontaminate spores over a wide area, approaches include looking at germinants paired lytic enzymes, directed energy, and predatory nematodes.  Demonstrate the ability of technologies to decontaminate spores in complex, dirty environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.407"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.407"
                                            },
                                            "Text": {
                                                "val": "Focus efforts on the Dial-a-Decon and Enzyme Decon projects.  Investigate non-aqueous formulations and responsive coatings.  Continue the radiological\/nuclear decontamination\/hazard mitigation effort."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "12) Threat Agent Sciences"
                                    },
                                    "Description": {
                                        "val": "Supports defensive countermeasure development against current and new threats by delivering the scientific understanding and relevant estimates of the hazards posed to humans by exposure to chemical or biological agents.  Toxicological and\/or infectious-dose information and environmental response supports development and\/or enhancing both operational risk and exposure guidelines; limits for detection and protection; goals for decontamination; and medical countermeasures."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.644"
                                            },
                                            "Text": {
                                                "val": "Developed a systems approach toward toxicological understanding of physiological injury by threat agents.  Determined infectious dose of biological agents of interest and potential emergent threats from reservoir hosts or other technological breakthroughs such as Do-it-Yourself (DIY) biology.  DIY biology is a growing movement in which individuals or sometimes small informal organizations, change the genetics of life forms using small resources and often with little or no formal training, oversight by professionals, or regulation by governments.  Continued investigations that describe fundamental mechanisms that contribute to BWA persistence and transport.  Defined particle properties and predict aerosolization behavior to inform hazard assessment.  Studied emerging technological breakthroughs such as DIY biology that may impact novel threat emergence.  Studied agent modulation in natural or laboratory environments to inform forensic examination of threats."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.693"
                                            },
                                            "Text": {
                                                "val": "Continue investigations that describe fundamental mechanisms that contribute to BWA persistence and transport in the environment.  Discontinue effort to define particle properties and predict aerosolization behavior to inform hazard assessment.  Study biological modulation in natural or laboratory environments through genetic drift to inform forensic examination of threats."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.482"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.482"
                                            },
                                            "Text": {
                                                "val": "Continue to define particle properties and predict aerosolization behavior to inform hazard assessment.  Move towards methods for rapid prediction of agent-substrate interactions\/including correlation of CB agent physical properties.  Develop models for absorption, distribution, metabolism, and excretion and toxicology (ADME (T)) for understanding operationally relevant exposure effects.  Continue assessing the impact of environmental factors on threat agent activity (persistence, transport, degradation, etc)."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "CB3"
                                    },
                                    "Title": {
                                        "val": "CHEMICAL BIOLOGICAL DEFENSE (ATD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "23.247"
                                        },
                                        "CurrentYear": {
                                            "val": "15.401"
                                        },
                                        "BudgetYearOne": {
                                            "val": "17.722"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "17.722"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "16.123"
                                        },
                                        "BudgetYearThree": {
                                            "val": "16.968"
                                        },
                                        "BudgetYearFour": {
                                            "val": "16.250"
                                        },
                                        "BudgetYearFive": {
                                            "val": "15.844"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "NT2"
                    },
                    "ProjectTitle": {
                        "val": "TECHBASE NON-TRADITIONAL AGENTS DEFENSE (APPLIED RESEARCH)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "52.299"
                        },
                        "CurrentYear": {
                            "val": "66.372"
                        },
                        "BudgetYearOne": {
                            "val": "71.534"
                        },
                        "BudgetYearOneBase": {
                            "val": "71.534"
                        },
                        "BudgetYearTwo": {
                            "val": "68.054"
                        },
                        "BudgetYearThree": {
                            "val": "71.463"
                        },
                        "BudgetYearFour": {
                            "val": "74.817"
                        },
                        "BudgetYearFive": {
                            "val": "72.947"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Project NT2 provides early applied research to enhance and develop defensive capabilities against Non-Traditional Agents (NTAs).  This project focuses on expanding scientific knowledge required to develop defensive capabilities and to demonstrate fast and agile scientific responses to enhance or develop capabilities that address emerging threats.  Efforts in this project support an integrated approach to counter emerging threats through innovative science and technology (S&T) solutions for detection, protection, decontamination, information systems and modeling and simulation, and medical countermeasures.  This project is a comprehensive and focused effort for developing NTA defense capabilities, coordinated with specific interagency partners for doctrine, equipment, and training for the Warfighter and civilian population for defense against NTAs."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) Chemical Diagnostics - Medical"
                                    },
                                    "Description": {
                                        "val": "Focuses on developing state-of-the-art laboratory\/fieldable methods to detect exposure to non-traditional agents in clinical samples.  Identifies biomolecular targets that can be leveraged as analytical methodologies, as well as, laboratory and animal studies characterizing time-course and longevity of a particular analyte\/biomarker.  Non-NTA Chem Diagnostics support the analytics for traditional agent diagnostics and hand-held diagnostic technologies that might be applied to NTA diagnostics."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.380"
                                            },
                                            "Text": {
                                                "val": "Began work to identify biomarkers to create an enhanced capability to pre-symptomatically diagnose NTA exposure.  Refined method development for identification and validation of NTAs in clinical samples for additional compounds of interest."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.044"
                                            },
                                            "Text": {
                                                "val": "Continue to identify biomarkers to create an enhanced capability to pre-symptomatically diagnose NTA exposure.  Continue method development for identification and validation of NTAs in clinical samples for additional compounds of interest."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.425"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.425"
                                            },
                                            "Text": {
                                                "val": "Continue method development for identification and validation of NTAs in clinical samples for additional compounds of interest."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "2) Chemical Pretreatments - Medical"
                                    },
                                    "Description": {
                                        "val": "Develops pretreatments that provide protection against non-traditional agents.  Enzymes should have the ability to rapidly bind and detoxify nerve agents, and have broad binding specificity and high catalytic efficiency for the destruction of agents."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.068"
                                            },
                                            "Text": {
                                                "val": "Studied efficacy of catalytic bioscavengers for NTA exposure."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.992"
                                            },
                                            "Text": {
                                                "val": "Continue studies to develop new catalytic bioscavengers for NTA exposure.  Pursue development of small molecule pretreatments against NTA exposure."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.093"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.093"
                                            },
                                            "Text": {
                                                "val": "Reduce scope of studies to develop catalytic bioscavenger for NTA exposure.  Retire all other efforts\/approaches."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "3) Chemical Therapeutics - Medical"
                                    },
                                    "Description": {
                                        "val": "Investigates common mechanisms of agent injury.  Determines the toxic effects of agents by probable routes of field exposure, as well as standard experimental routes.  Physiological parameters and pathological assessment will be used to establish the general mode and mechanism(s) of toxicity.  Develops, assesses, evaluates, and validates therapeutics for treatment resulting from exposure to Non-Traditional Agents (NTA)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.742"
                                            },
                                            "Text": {
                                                "val": "Initiate investigation of other compounds of interest including mechanism of action and toxicity, and initiated search for effective countermeasures."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.102"
                                            },
                                            "Text": {
                                                "val": "Continue investigation of advanced and emerging threats including mechanism of action and toxicity, and continue search for effective countermeasures.  Develop centrally active novel therapeutic compounds that cross the blood brain barrier (reduced scope of effort).  Limited screening of currently licensed Food and Drug Administration (FDA) approved countermeasures to determine potential efficacy against other classes of NTAs.  Pursue absorption, distribution, metabolism and excretion studies to further elucidate agent effects."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.092"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.092"
                                            },
                                            "Text": {
                                                "val": "Continue developing centrally acting novel therapeutic compounds that cross the blood brain barrier.  Screen currently licensed Food and Drug Administration (FDA) approved countermeasures to determine potential efficacy against other classes of NTAs.  Initiate research projects at the ADME Research Center of Excellence, with Tier 0, 1 and 2 assay potential at DoD Laboratories as a core program capability and use to improve agent effects understanding and facilitate countermeasure development."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "4) Detection"
                                    },
                                    "Description": {
                                        "val": "Primary focus is to assess the potential of multiple technologies to meet the needs to detect the presence of NTAs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.970"
                                            },
                                            "Text": {
                                                "val": "Continued developing feasibility evaluation of plant sentinel concept.  Continued development from technology concepts and models to meet the needs to detect contamination on surfaces in pre- and post-decontamination application.  Continued integration studies for chemical aerosol detection into the Next Generation Chemical Detector (NGCD)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.207"
                                            },
                                            "Text": {
                                                "val": "Complete and demonstrate feasibility development of plant sentinel concept.  Continue development from technology concepts and models to meet the needs to detect contamination on surfaces in pre and post decontamination application.  Continue integration studies for chemical aerosol detection into the NGCD."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.453"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.453"
                                            },
                                            "Text": {
                                                "val": "Continue development from technology concepts and models to meet the needs to detect contamination on surfaces in pre and post decontamination application.  Complete integration studies for chemical aerosol detection into the NGCD MS B."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "5) Modeling & Simulation"
                                    },
                                    "Description": {
                                        "val": "Provide modeling of NTA materials for hazard prediction.  Develop NTA source term algorithms for predicting CBRN hazards from intentionally functioning weapons, counter-proliferation scenarios (bomb on target), and missile intercept.  Investigate NTA agent fate for secondary effects, environmental\/atmospheric chemistry, atmospheric and waterborne transport and dispersion, human effects, model Validation and Verification (V&V), scaled testing, casualty estimation, and supporting data management."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.260"
                                            },
                                            "Text": {
                                                "val": "Continued with actual experimentation involving small-scale testing for NTA simulants for use in creating and verifying NTA modeling source terms, for defense against CBRN hazards.  Continued to develop NTA source term models."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.398"
                                            },
                                            "Text": {
                                                "val": "Complete experimentation phase of small scale testing for NTA simulants for use in creating and verifying NTA modeling source terms, for defense against CBRN hazards.  Continue to develop new NTA source term scenario models and flexible scenario NTA scenario models."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.172"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.172"
                                            },
                                            "Text": {
                                                "val": "Continue analysis of data resulting from experimentation phase of small-scale testing for NTA simulants for use in creating and verifying NTA source terms, for defense against CBRN hazards.  Continue to develop new NTA source term models and flexible NTA scenario models."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "6) Air Purification"
                                    },
                                    "Description": {
                                        "val": "Study and assessment of filter technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.086"
                                            },
                                            "Text": {
                                                "val": "Continued development and testing of novel materials to improve performance against NTAs.  Replaced legacy filter media with novel media that offers broad spectrum NTA protection.  Continued with technology areas that include: crystalline nano-porous framework materials, novel adsorbents, catalytic, nano-fibrous, composite materials and reactive hybrids.  Transitioned these technologies to the Joint Service General Purpose Mask (JSGPM) and Joint Service Aircrew Mask (JSAM) programs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.878"
                                            },
                                            "Text": {
                                                "val": "Continue development and testing of novel materials to improve performance against NTAs.  Replace legacy filter media with novel media that offers broad spectrum NTA protection.  Continue with technology areas that include: crystalline nano-porous framework materials, novel adsorbents, catalytic, nano-fibrous, composite materials and reactive hybrids.  Transition these technologies to the JSGPM and JSAM programs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.423"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.423"
                                            },
                                            "Text": {
                                                "val": "Assess performance of novel adsorbents and develop specific functionalities of absorbents on NTAs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "7) Respirator"
                                    },
                                    "Description": {
                                        "val": "Development and analysis of design alternatives for chemical and biological air purifying respirators to provide enhanced protection against NTAs with lower physical burden and improved interface with mission equipment."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.123"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.123"
                                            },
                                            "Text": {
                                                "val": "Continue the development and integration of novel seal, anti-fogging, and dual cavity technologies to protect against NTAs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "8) Percutaneous Protection"
                                    },
                                    "Description": {
                                        "val": "Study and assessment of percutaneous protective technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.794"
                                            },
                                            "Text": {
                                                "val": "Continued development of low burden technologies to improve overall protective clothing performance against NTAs leading toward verification, demonstration and transition."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.028"
                                            },
                                            "Text": {
                                                "val": "Continue development of low burden technologies to improve overall protective clothing performance against NTAs leading toward verification, demonstration and transition.  Develop treatments that allow fabrics to protect and reduce the penetration of NTAs and increase the useful life of protective garments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.521"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.521"
                                            },
                                            "Text": {
                                                "val": "Assess and optimize technologies to improve whole system performance against NTAs.  The whole system performance includes the integration of the percutaneous protection with the respiratory protection, as well as effectiveness of the closures between the components of protective equipment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "9) Decontamination"
                                    },
                                    "Description": {
                                        "val": "Study and assessment of decontamination technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.095"
                                            },
                                            "Text": {
                                                "val": "Continued development of decontamination technologies against NTAs.  Continued to develop decontamination technologies and formulations that are optimized against NTAs.  Continued to develop, demonstrate, and transition enzyme technology for low-impact decon of NTAs.  Continued to integrate with the Decontamination Family-of-Systems effort."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.517"
                                            },
                                            "Text": {
                                                "val": "Continue development of decontamination technologies against NTAs.  Continue to develop decontamination technologies and formulations that are optimized against NTAs.  Continue to develop, demonstrate, and transition enzyme technology for low-impact decon of NTAs.  Continue to integrate with the Decontamination Family-of-Systems effort."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.348"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.348"
                                            },
                                            "Text": {
                                                "val": "Continue to assess performance and unique aspects of full spectrum of NTAs and develop technologies to optimize performance against NTAs.  This includes the investigation and analysis of additional categories of emerging threats."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "10) Threat Agent Sciences"
                                    },
                                    "Description": {
                                        "val": "Provide enabling science and technology on threat agents to prepare for surprise which informs development and testing of NTA defense technology such as detection, decontamination, protection, hazard assessment, and more.  This preliminary assessment of new threats provides the basis for all countermeasure development and assessment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "21.904"
                                            },
                                            "Text": {
                                                "val": "Expanded assessment of novel threats into new classes of agents providing operationally relevant exposure limits using an integrated systems toxicology approach.  Defined critical physico-chemical properties and characterize\/predicted agent reactivity and interaction with environmental substrates.  Provided supportable data to enable countermeasure development and testing as well as inform concept of operations policy, doctrine and procedure."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "22.206"
                                            },
                                            "Text": {
                                                "val": "Continue assessment of priority classes of novel threat agents providing operationally relevant exposure limits using an integrated systems toxicology approach with a delay in some data deliveries.  Define critical physic-chemical properties and characterize\/predict agent reactivity and interaction with environmental substrates.  Provide supportable knowledge, enabling countermeasure development and testing and informing concept of operations policy, doctrine and procedure.  Move towards in-silico efforts to characterize threat agents with a reduced scope of effort."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "21.884"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "21.884"
                                            },
                                            "Text": {
                                                "val": "Continue to characterize the synthesis and physico-chemical properties of priority NTAs (informed by intelligence assessments and program requirements.) Continue preparing toxicity estimates for next priority NTAs. Refine and deliver human toxicity estimates for next priority NTAs.  Provide supportable data to enable countermeasure development and testing as well as inform concept of operations (CONOPs), policy, doctrine and procedure. Continue to develop silico platforms for predicting human ADME and toxicity for threat agents."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "NT3"
                                    },
                                    "Title": {
                                        "val": "TECHBASE NON-TRADITIONAL AGENTS DEFENSE (ATD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "30.784"
                                        },
                                        "CurrentYear": {
                                            "val": "21.702"
                                        },
                                        "BudgetYearOne": {
                                            "val": "21.574"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "21.574"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "23.037"
                                        },
                                        "BudgetYearThree": {
                                            "val": "23.387"
                                        },
                                        "BudgetYearFour": {
                                            "val": "21.889"
                                        },
                                        "BudgetYearFive": {
                                            "val": "21.343"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TM2"
                    },
                    "ProjectTitle": {
                        "val": "TECHBASE MED DEFENSE (APPLIED RESEARCH)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "106.017"
                        },
                        "CurrentYear": {
                            "val": "85.790"
                        },
                        "BudgetYearOne": {
                            "val": "100.722"
                        },
                        "BudgetYearOneBase": {
                            "val": "100.722"
                        },
                        "BudgetYearTwo": {
                            "val": "94.500"
                        },
                        "BudgetYearThree": {
                            "val": "82.839"
                        },
                        "BudgetYearFour": {
                            "val": "85.335"
                        },
                        "BudgetYearFive": {
                            "val": "83.201"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Project TM2 provides for applied research for innovative technology approaches to advance medical systems designed to rapidly identify, diagnose, prevent, and treat disease due to exposure to all three of radiological, chemical and biological threat agents.  Categories for this project include core science efforts in Medical Chemical, Medical Biological, Diagnostics, and the Medical Countermeasures Initiative (MCMI).  Against radiological threats, this project provides investment for the development of pretreatments (prophylaxis) and post-irradiation therapeutics against radiological\/nuclear exposure.  Against chemical and biological agents, this project funds applied research for the investigation of new medical countermeasures to include prophylaxes, pretreatments, antidotes, skin decontaminants, and therapeutic drugs against identified and emerging biological and chemical warfare agents.  Medical Science and Technology (S&T) efforts in this Budget Activity refine promising medical initiatives identified in Budget Activity 1, resulting in the development of countermeasures to protect against and treat the effects of exposure to chemical and biological (CB) agents.  Diagnostic research focuses on providing high quality data closer to the point-of-need comprising devise innovation, panels of biomarkers driven by bioinformatics, and epidemiological modeling tools.  \n\nThe Medical Countermeasures Initiative (MCMI) was established to coordinate inter-related advanced development and flexible manufacturing capabilities, providing a dedicated, cost-effective, reliable, and sustainable MCM process that meets the Warfighter and national security needs.  MCMI efforts within science and technology (S&T) are concentrated in advancing two areas: 1) regulatory science and 2) flexible manufacturing technologies and processes for MCMs.  Efforts conducted in these areas are enablers supporting the DoD Medical Countermeasures Advanced Development and Manufacturing (MCM-ADM) capability.\n\nIn FY13, all Project TB2 research was re-aligned into Project TM2 - Techbase Medical Defense."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) Techbase Med Defense - Diagnostics"
                                    },
                                    "Description": {
                                        "val": "Biosurveillance\/Disease Surveillance: Integrate existing disparate military and civilian datasets, investigate methodologies to appropriately integrate open source data into advanced warning systems, and leverage and enhance advanced epidemiological models and algorithms for disease prediction, impact and biological threat assessment.  Contribute to the development of global, near real-time, disease monitoring and surveillance systems that address secondary infection, fuse medical syndromic, environmental, and clinical data, and feed into agent-based epidemiological modeling, medical resource estimation and decision support tools.  Focus on agent-based epidemiological modeling and fusion of disease surveillance data.  The Chem Bio Defense Program partners with civil agencies and DoD agencies to provide near real-time information and provide USG-wide situational awareness, yielding analytical and predictive capabilities for DoD decision makers including Combatant Commanders."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.575"
                                            },
                                            "Text": {
                                                "val": "Continued efforts on biosurveillance data stream evaluation and analysis to identify most useful biosurveillance data streams for prediction and early warning.  Continued effort to devise structured outside contiguous U.S. (OCONUS) expansion roadmap for agent-based epidemiological models and increase OCONUS analytic capability through targeted areas.  Continued research into data integration platforms and expand biosurveillance portfolio to support in-context, rapid detection, identification and response capabilities on the global scale."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.032"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.032"
                                            },
                                            "Text": {
                                                "val": "Complete efforts using social media to infer individual and collective health behavior for digital threat surveillance, epidemic planning and response.  Complete effort to develop a flexible set of data driven models that dynamically assesses the socio-economic response to the spread of disease and, in turn, the effect of that response on disease spread.  Complete efforts to refine technology to enable device to cloud communications in order to fully leverage biosurveillance and point of need diagnostic efforts.  Continue the development of the BSV Ecosystem to include analyst collaboration tools, advanced analytics, and analyst workbench."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "2) Chemical Diagnostics"
                                    },
                                    "Description": {
                                        "val": "Focuses on developing state-of-the-art laboratory\/fieldable methods that detect exposure to chemical warfare agents (CWA) (e.g., nerve agents and vesicants) or radiological agents in clinical samples.  Identifies biomolecular targets that can be leveraged as analytical methodologies, as well as, laboratory and animal studies characterizing time-course and longevity of a particular analyte\/biomarker."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.975"
                                            },
                                            "Text": {
                                                "val": "Developed assays for enhancing the ability to identify exposure (sublethal) to emerging chemical agent threats using newly-identified biomolecular targets."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.577"
                                            },
                                            "Text": {
                                                "val": "Continue to develop assays for enhancing the ability to identify sublethal exposure to emerging chemical agent threats using newly-identified biomolecular targets.  Complete effort on biosurveillance data stream evaluation and analysis to identify most useful biosurveillance data streams for prediction and early warning and leverage this research for BSV Ecosystem effort.  Complete effort to devise a structured, outside continental U.S. (OCONUS) expansion roadmap for agent-based epidemiological models and continue to increase OCONUS analytic capability through targeted areas.  Leverage this research for BSV Ecosystem effort.  Advance research into data integration platforms through the BSV Ecosystem effort.  Develop approaches for unique and emerging data collection, aggregation and provision of human, vector and animal\/zoonotic health surveillance data.  Develop algorithms, verification, and validation for these data feeds to synthesize and interrogate multiple sources of data to provide high confidence in the prediction, early warning and forecasting (inclusive of mitigation strategies) of infectious disease outbreaks.  Leverage biosurveillance and point of need diagnostic efforts to support in-context, rapid detection, identification and response capabilities on the global scale through integrated access via the BSV Ecosystem."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.845"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.845"
                                            },
                                            "Text": {
                                                "val": "Continue development of assays for enhancing the ability to identify sublethal exposure to emerging chemical agent threats using newly-identified biomolecular targets.  Complete efforts using social media to infer individual and collective health behavior for digital threat surveillance, epidemic planning and response.  Complete effort to develop a flexible set of data driven models that dynamically assesses the socio-economic response to the spread of disease and, in turn, the effect of that response on disease spread.  Complete efforts to refine technology to enable device to cloud communications in order to fully leverage biosurveillance and point of need diagnostic efforts.  Continue the development of the BSV Ecosystem to include analyst collaboration tools, advanced analytics, and analyst workbench."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "3) Diagnostic Assays"
                                    },
                                    "Description": {
                                        "val": "Development and verification of rapid, sensitive, and specific tests for the identification of Biological Warfare Agents (BWAs) and their expressed pathogens and toxins in clinical specimens from Warfighters for the diagnosis of exposure\/infection.  Discovery of host biomarkers generated in response to exposure to biological threat agents, whether known or emerging."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.757"
                                            },
                                            "Text": {
                                                "val": "Optimized processes and platform technologies employed in laboratory characterization of host and pathogen biomarker signatures of exposure and disease processes.  Matured pipeline of genomics, proteomics, systems biology, and bioinformatics tools and methods to simultaneously support companion diagnostic tests, the development of medical countermeasures, and the analytic processes required to identify known, emerging, and re-emerging pathogens."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.401"
                                            },
                                            "Text": {
                                                "val": "Continue to optimize processes and platform technologies employed in laboratory characterization of host and pathogen biomarker signatures of exposure and disease processes.  Continue to mature pipeline of genomics, proteomics, systems biology, and bioinformatics tools and methods to simultaneously support diagnostic tests, the development of MCMs and the analytic processes required to identify known, emerging, and re-emerging pathogens.  Develop nanomaterial structure designs to enable companion diagnostics."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.987"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.987"
                                            },
                                            "Text": {
                                                "val": "Continue to optimize processes and platform technologies employed in laboratory characterization of host and pathogen biomarker signatures of exposure and disease processes.  Continue to develop nanomaterial structure designs to enable companion diagnostics.  Continue testing a method for transport of biothreat agents in clinical and environmental samples from field to laboratory."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "4) Diagnostic Technologies"
                                    },
                                    "Description": {
                                        "val": "Development of next generation diagnostic technologies including portable diagnostic platforms, highly parallel and informative testing formats, and nanotechnology applications.  Development of novel assay formats and hardware solutions to enable point of need diagnostic capabilities, allowing for rapid guidance of medical decisions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.017"
                                            },
                                            "Text": {
                                                "val": "Discovered and verified panel of pre-symptomatic differential diagnostic biomarkers of exposure to virulent bacterial and viral bio- and emerging threat class and agents.  Developed portable diagnostic devices capable of use by minimally trained personnel, aiding in rapid diagnostics at the point of need."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "5) Next Generation Diagnostics"
                                    },
                                    "Description": {
                                        "val": "Diagnostic device development to include systems able to harness next generation technologies to revolutionize clinical diagnostics in care facilities and in hospital laboratories.  This investment will incorporate capabilities such as next generation sequencing and advanced biomolecular methods to harness both host and pathogen biomarkers in a threat agnostic approach that will serve all echelons of military medical care."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.568"
                                            },
                                            "Text": {
                                                "val": "Developed and matured point of need diagnostic platform technologies with orthogonal capabilities.  Implemented design control phased development and acceptance criteria to identify a minimum of two Next Generation Diagnostic Systems, Increment 2, candidate device platforms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.348"
                                            },
                                            "Text": {
                                                "val": "Continue to develop and mature point of need diagnostic platform technologies with orthogonal capabilities.  Develop a multiplexed point of care diagnostic platform for detection of biothreat agent exposure."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.956"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.956"
                                            },
                                            "Text": {
                                                "val": "Expand multiplexed point of need diagnostic platform technologies into syndromic-based panels.  Begin transition of candidate diagnostic technologies to Next Generation Diagnostic Systems, Increment 2.  Develop and evaluate candidate host biomarker diagnostic targets in analytical test environments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "6) Medical Countermeasures Initiative"
                                    },
                                    "Description": {
                                        "val": "Integrate the regulatory science and manufacturing technologies and processes developed into the DoD Medical Countermeasures Advanced Development and Manufacturing (MCM-ADM) as enablers of the advanced development and flexible manufacturing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.877"
                                            },
                                            "Text": {
                                                "val": "Investigated ex vivo platforms for MCM evaluation: organ constructs of liver, kidney, and lung with the goal of enhancing the product development process.  Constructed next generation high yield protein expression platforms for biotechnology-based MCMs.  Integrated the development of high capacity downstream technologies and process analytic technologies to enhance rapid manufacturing process development and control xcapability with the goal of accelerating the manufacturing of biotechnology-based Medical Countermeasures (MCMs)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.998"
                                            },
                                            "Text": {
                                                "val": "Continue to investigate organotypic platforms for MCM evaluation: (ex-vivo heart, liver, kidney, alveolar lung sacs, and blood-brain barrier) with the goal of accelerating and enhancing the FDA-regulated medicinal product development process.  Construct next generation high yield protein expression platforms for biotechnology-based MCMs.  Complete development of high capacity downstream technologies and process analytic technologies to enhance rapid manufacturing process development and control with the goal of accelerating the manufacturing of biotechnology-based MCMs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.999"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.999"
                                            },
                                            "Text": {
                                                "val": "Continue one project to investigate organotypic platforms for MCM evaluation: (ex-vivo heart, liver, kidney, lung, or blood-brain barrier) with the goal of accelerating and enhancing the FDA-regulated medicinal product development process.  Construct one next generation high-yield protein-expression platforms for biotechnology-based MCMs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "7) Bacterial\/Toxins Vaccines"
                                    },
                                    "Description": {
                                        "val": "Generate novel or improved vaccines against bacterial and toxin biothreat agents, and demonstrate preliminary efficacy in small animal models.  Identify correlates of protective immunity in animal models."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.063"
                                            },
                                            "Text": {
                                                "val": "Refined appropriate animal models for aerosolized Burkholderia mallei and pseudomallei as well as Type A Francisella tularensis with regulatory guidance.  Evaluated multiple novel subunit Burkholderia vaccine candidates in small animal models with and without adjuvants.  Defined predictive value of correlates of immunity, elicited by Burkholderia species vaccine candidates.  Evaluated the tolerability of novel adjuvants using the Anthrax vaccine for proof of concept, but which may potentially have applicability to other vaccine candidates.  Additionally, research continued to produce vaccine candidates designed to protect against emerging or genetically engineered Anthrax strains.  Tested multiple novel subunit vaccine candidates for protection against aerosolized Type A Francisella tularensis infection in appropriate small and large animal models."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.897"
                                            },
                                            "Text": {
                                                "val": "Continue refining appropriate animal models for aerosolized Burkholderia mallei and pseudomallei as well as Type A Francisella tularensis with regulatory guidance.  Continue preparing and evaluating multiple novel subunit and nanoparticle Burkholderia vaccine candidates in small or large animal models with and without adjuvants.  Continue defining predictive value of correlates of immunity, elicited by Burkholderia species vaccine candidates.  Continue evaluating the tolerability of novel adjuvants using the Anthrax vaccine for proof of concept, but which may potentially have applicability to other vaccine candidates.  Additionally, research will continue to produce vaccine candidates designed to protect against emerging or genetically engineered Anthrax strains.  Prepare and test multiple novel subunit and nanoparticle vaccine candidates for protection against aerosolized Type A Francisella tularensis infection in appropriate small and large animal models.\n10"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.000"
                                            },
                                            "Text": {
                                                "val": "Continue the most promising in-progress animal model development projects to be refined with regulatory guidance, including animal models for aerosolized Burkholderia mallei, pseudomallei and Type A Francisella tularensis.  Novel subunit Burkholderia vaccine candidates in small or large animal models will be evaluated with and without adjuvants.  A selection of correlates of immunity elicited by Burkholderia species infection may be evaluated for predictive value.  The most promising vaccine candidates designed to protect against genetically engineered Anthrax strains will be tested for safety and efficacy in non-human primates due to the expense.  Test up to two novel subunit vaccine candidates for protection against aerosolized Type A Francisella tularensis infection in appropriate small animal models."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "8) Vaccine Platforms and Research Tools"
                                    },
                                    "Description": {
                                        "val": "Design novel multi-agent vaccine platforms capable of expressing multiple antigens, investigate the ability of non-specific stimulators of immunity to enhance the effectiveness of newly generated vaccines, characterize alternative vaccine delivery (needle-free) methods and novel vaccine stabilization methodologies, and conduct studies to further advance an in vitro model of the immune system that can predict the human immune response to biodefense vaccines under development."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.098"
                                            },
                                            "Text": {
                                                "val": "Utilized relevant animal models for the evaluation of the immune response to novel multi-antigen platforms.  Further refined the capabilities of the surrogate human immune system, Modular Immune In vitro Construct (MIMIC), which provides an in vitro assessment of the human immune response.  Initiated studies designed to lend regulatory credence to functional assays on the MIMIC to evaluate immunity induced by multiple mature vaccine candidates.  Increased efforts to develop methodologies, which remove the need for cold storage and transport for vaccines and render them stable in variable and extreme temperatures."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.618"
                                            },
                                            "Text": {
                                                "val": "Utilize relevant animal models for the evaluation of the immune response to novel multi-antigen platforms.  Further refine the capabilities of the surrogate human immune system, MIMIC, which provides an in vitro assessment of the human immune response.  Continue studies designed to lend regulatory credence to functional assays on the MIMIC to evaluate cross-reactivity of different Filovirus and Alphavirus strains.  Increase efforts to develop methodologies which remove the need for cold storage and transport for vaccines and render them stable in variable and extreme temperatures."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.000"
                                            },
                                            "Text": {
                                                "val": "Use relevant small animal models for the evaluation of the immune response to novel multi-antigen platforms.  Further refine, using 1-2 small studies, the capabilities of the surrogate human immune system, MIMIC, which provides an in vitro assessment of the human immune response."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "9) Viral Therapeutics"
                                    },
                                    "Description": {
                                        "val": "Identify, optimize and evaluate lead candidate therapeutics for efficacy against viral pathogens."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.150"
                                            },
                                            "Text": {
                                                "val": "Evaluated FDA approved drug combinations against Arenavirus, Bunyavirus, and Flavivirus infection.  Conducted structure-based drug discovery for Alphaviruses.  Identified and evaluated novel broad-spectrum host and pathogen directed small molecule therapeutics for emerging infectious diseases."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.178"
                                            },
                                            "Text": {
                                                "val": "Conduct structure-based drug discovery for Alphaviruses.  Develop antibody-based therapeutics for Filovirus infections.  Identify and evaluate novel broad-spectrum host and pathogen directed small molecule therapeutics for emerging infectious diseases (i.e. Alphavirus, Filovirus, Flavivirus, Arenavirus, Bunyavirus)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.000"
                                            },
                                            "Text": {
                                                "val": "Evaluate FDA-approved drugs for potential repurposing as effective antivirals.  Evaluate novel antibody-based therapeutics for Filovirus infections.  Identify and evaluate novel pathogen-directed therapeutics for Alphaviruses."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "10) Bacterial Therapeutics"
                                    },
                                    "Description": {
                                        "val": "Identify, optimize and evaluate lead therapeutic candidates effective against designated bacterial threat agents."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.891"
                                            },
                                            "Text": {
                                                "val": "Maintained FDA approved drug screening programs for Burkholderia, Francisella tularensis and determined in vitro susceptibilities.  Continued evaluation of novel compounds against bacterial biological warfare agents.  Developed lead series of MurB compounds targeting cell wall biosynthesis.  Determined synergy between MurB antibacterial agents and conventional antibiotics against B.  anthracis and Y.  pestis.  Evaluated the electron transport chain, multi drug efflux systems, and purine (a naturally occurring organic compound) pathways as a target for broad-spectrum antibacterial development."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.401"
                                            },
                                            "Text": {
                                                "val": "Maintain FDA approved drug screening program for Burkholderia,Francisella tularensis and determine in vitro susceptibilities.  Continue evaluation of novel compounds against bacterial biological warfare agents.  Evaluate bioactive peptides for the ability to stimulate host protective pathways.  Identify and design new small molecule inhibitors bacterial folate biosynthesis.  Evaluate multidrug efflux systems as a target for broad-spectrum antibacterial development."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.112"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.112"
                                            },
                                            "Text": {
                                                "val": "Maintain FDA approved drug screening programs for Burkholderia, Francisella tularensis and determine in vitro susceptibilities.  Refocus program on later stage optimization and testing of novel inhibitors of bacterial biological warfare agents, reducing efforts in discovery and addressing a limited number of priority pathogens."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "11) Toxin Therapeutics"
                                    },
                                    "Description": {
                                        "val": "Identify, optimize and evaluate therapeutic candidates that are effective against biological toxin agents."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.395"
                                            },
                                            "Text": {
                                                "val": "Characterized host proteins that interact with Botulinum Neuro-Toxin (BoNT) and identified small molecule inhibitors preventing host-toxin interactions.  Validated differential expression of host genes involved in neuron response to BoNT intoxication.  Identified and developed therapies that target host proteins involved in BoNT persistence in the neuron.  Continued co-crystallization studies of BoNT-inhibitor complexes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.493"
                                            },
                                            "Text": {
                                                "val": "Continue to characterize host proteins that interact with BoNT and identify small molecule inhibitors preventing host-toxin interactions.  Continue to validate differential expression of host genes involved in neuron response to BoNT intoxication.  Continue to identify and develop therapies that target host proteins involved in BoNT persistence in the neuron.  Continue co-crystallization studies of BoNT-inhibitor complexes."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "Continue to characterize BoNT small molecule inhibitors in vitro.  Continue co-crystallization studies of BoNT-inhibitor complexes."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "12) Multiagent Medical Countermeasures"
                                    },
                                    "Description": {
                                        "val": "Continues efforts previously funded under the Transformational Medical Technologies Initiative.  It supports existing and new efforts in the discovery phase of drug development.  Applied research efforts also include the investigation of existing drugs to explore their efficacy against BW agents.  This involves the initiation of experiments to identify markers, correlates of protection, assays, and endpoints for further non-clinical and clinical studies and development of a scalable and reproducible manufacturing process amenable to Food and Drug Administration (FDA) Good Manufacturing Practices (GMP).  In FY14, research under this thrust area will be transitioned into the Bacterial and Viral Therapeutics program under BA2 Techbase Med Defense - Bio CM (TM2)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.923"
                                            },
                                            "Text": {
                                                "val": "Continued to support new MCM discovery efforts to refresh the Hemorrhagic Fever Virus (HFV) and Intracellular Bacterial Pathogen (IBP) product pipelines.  Continued to identify and initiate the development of intervention strategies targeting host response to biological pathogens, inclusive of enhancing the immune system and treating symptoms to reduce the severity of disease."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "13) Pretreatments, Nerve Agents"
                                    },
                                    "Description": {
                                        "val": "Develops pretreatments that provide protection against all organophosphorous nerve agents.  Enzymes should have the ability to rapidly bind and detoxify nerve agents, and have broad binding specificity and high enzymatic efficiency for the destruction of agents."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.196"
                                            },
                                            "Text": {
                                                "val": "Initiated search for catalytic bioscavenger of V agents.  Assessed feasibility and begin initial studies to develop a broad spectrum cocktail of V and G agent catalytic bioscavengers."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.941"
                                            },
                                            "Text": {
                                                "val": "Continue search for catalytic bioscavenger of V agents.  Continue studies to develop a broad spectrum cocktail of V and G agent catalytic bioscavengers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.318"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.318"
                                            },
                                            "Text": {
                                                "val": "Continue efforts to develop effective bioscavenger (stoichiometric and catalytic).  Develop a broad spectrum cocktail of catalytic bioscavengers effective against multiple agents."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "14) Cutaneous\/Ocular Therapeutics"
                                    },
                                    "Description": {
                                        "val": "Focuses on therapeutic strategies to effectively minimize injuries to dermal (i.e., skin) and ocular tissues resulting from exposure to chemical warfare agents (CWAs).  Involves the development of effective practical field and clinic management strategies and physical and pharmacological interventions to treat the injury processes.  This work is designed to develop potential candidates that will ultimately be submitted for FDA licensure or new indications for previously licensed products for use in the treatment of chemical warfare casualties."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.270"
                                            },
                                            "Text": {
                                                "val": "Continued to utilize molecular biology approaches to elucidate drug targets and gain further mechanistic understanding of delayed ocular injury due to sulfur mustard exposure."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "15) Chemical Therapeutics"
                                    },
                                    "Description": {
                                        "val": "Focuses on therapeutic strategies to effectively minimize neurologic injuries resulting from exposure to CWAs.  This effort involves the development of neuroprotectants, anticonvulsants, and improved neurotransmitter restorers.  This work is designed to develop potential candidates that will ultimately be submitted for FDA licensure or new indications for previously licensed products for use in the treatment of chemical warfare casualties."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.661"
                                            },
                                            "Text": {
                                                "val": "Continued investigating potential for broad spectrum\/centrally active reactivator.  Continued search for Neuroprotectant effective up to 4 hours after seizure initiation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.938"
                                            },
                                            "Text": {
                                                "val": "Continue investigating potential for broad spectrum\/centrally active cholinesterase reactivator.  Continue studies to facilitate therapeutics crossing the blood brain barrier.  Explore molecular, nanomaterial based drug delivery platforms."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.473"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.473"
                                            },
                                            "Text": {
                                                "val": "Reduce scope of development of technology to facilitate delivery of therapeutic regimen to the central nervous system (crossing the blood brain barrier).  Explore molecular, nanomaterial based drug delivery platforms.  Continue investigating potential for broad spectrum\/centrally acting cholinesterase reactivator."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "16) Radiation Countermeasures"
                                    },
                                    "Description": {
                                        "val": "Develop medical countermeasures to protect the Warfighter against acute radiological\/nuclear exposure, to include developing both pretreatments (prophylaxis) and post-irradiation therapeutics against radiological\/nuclear exposure.  DoD is the only governmental agency currently developing medical prophylaxis to protect Warfighters and\/or other responders in the event of a radiological incident."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.601"
                                            },
                                            "Text": {
                                                "val": "Continued evaluation of novel biomarkers useful for biodosimetry and identification of potential therapeutic approaches."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "TM3"
                                    },
                                    "Title": {
                                        "val": "TECHBASE MED DEFENSE (ATD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "160.195"
                                        },
                                        "CurrentYear": {
                                            "val": "101.827"
                                        },
                                        "BudgetYearOne": {
                                            "val": "87.610"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "87.610"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "90.079"
                                        },
                                        "BudgetYearThree": {
                                            "val": "100.916"
                                        },
                                        "BudgetYearFour": {
                                            "val": "101.559"
                                        },
                                        "BudgetYearFive": {
                                            "val": "99.018"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MB4"
                                    },
                                    "Title": {
                                        "val": "MEDICAL BIOLOGICAL DEFENSE (ACD&P)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "111.415"
                                        },
                                        "CurrentYear": {
                                            "val": "122.328"
                                        },
                                        "BudgetYearOne": {
                                            "val": "102.080"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "102.080"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "101.019"
                                        },
                                        "BudgetYearThree": {
                                            "val": "60.981"
                                        },
                                        "BudgetYearFour": {
                                            "val": "32.683"
                                        },
                                        "BudgetYearFive": {
                                            "val": "48.277"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MC4"
                                    },
                                    "Title": {
                                        "val": "MEDICAL CHEMICAL DEFENSE (ACD&P)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "2.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "3.750"
                                        },
                                        "BudgetYearFour": {
                                            "val": "10.692"
                                        },
                                        "BudgetYearFive": {
                                            "val": "25.089"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MB5"
                                    },
                                    "Title": {
                                        "val": "MEDICAL BIOLOGICAL DEFENSE (EMD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "173.505"
                                        },
                                        "CurrentYear": {
                                            "val": "246.436"
                                        },
                                        "BudgetYearOne": {
                                            "val": "169.497"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "169.497"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "138.224"
                                        },
                                        "BudgetYearThree": {
                                            "val": "154.851"
                                        },
                                        "BudgetYearFour": {
                                            "val": "179.989"
                                        },
                                        "BudgetYearFive": {
                                            "val": "168.644"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MC5"
                                    },
                                    "Title": {
                                        "val": "MEDICAL CHEMICAL DEFENSE (EMD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "17.396"
                                        },
                                        "CurrentYear": {
                                            "val": "55.087"
                                        },
                                        "BudgetYearOne": {
                                            "val": "58.529"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "58.529"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "65.966"
                                        },
                                        "BudgetYearThree": {
                                            "val": "40.880"
                                        },
                                        "BudgetYearFour": {
                                            "val": "33.205"
                                        },
                                        "BudgetYearFive": {
                                            "val": "1.550"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MB7"
                                    },
                                    "Title": {
                                        "val": "MEDICAL BIOLOGICAL DEFENSE (OP SYS DEV)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.490"
                                        },
                                        "CurrentYear": {
                                            "val": "0.499"
                                        },
                                        "BudgetYearOne": {
                                            "val": "13.414"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "13.414"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "14.551"
                                        },
                                        "BudgetYearThree": {
                                            "val": "9.816"
                                        },
                                        "BudgetYearFour": {
                                            "val": "7.277"
                                        },
                                        "BudgetYearFive": {
                                            "val": "16.496"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}