{
    "id": "8b9c5efcc71c170e0ad6f280c407bc76ab331ce1",
    "meta": {
        "filename": "dod-2015_RDTE_2015_NAVY_BA6_RDTE_JustificationBook_Navy_PB_2015.zzz_unzipped_RDTE_JustificationBook_Navy_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604258N"
        },
        "ProgramElementTitle": {
            "val": "Target Systems Development"
        },
        "R1LineNumber": {
            "val": "148"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "53.171"
            },
            "CurrentYear": {
                "val": "71.872"
            },
            "BudgetYearOne": {
                "val": "79.718"
            },
            "BudgetYearOneBase": {
                "val": "79.718"
            },
            "BudgetYearTwo": {
                "val": "30.789"
            },
            "BudgetYearThree": {
                "val": "12.383"
            },
            "BudgetYearFour": {
                "val": "12.740"
            },
            "BudgetYearFive": {
                "val": "13.006"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element funds the development and procurement of aerial targets, sea surface targets, control systems, and associated Target Augmentation and Auxiliary Systems (TA\/TS) needed to represent real world threat systems.  These capabilities are key enablers to the successful execution of the developmental and operational test and evaluation of naval combat weapons systems and to the satisfaction of advanced fleet training requirements. \n\nThis program is funded under Research, Development, Test, and Evaluation Management Support because it supports efforts directed toward sustaining or modernizing installations or operations required for general research, development, test and evaluation."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "59.221"
                },
                "CurrentYear": {
                    "val": "71.872"
                },
                "BudgetYearOne": {
                    "val": "29.126"
                },
                "BudgetYearOneBase": {
                    "val": "29.126"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "53.171"
                },
                "CurrentYear": {
                    "val": "71.872"
                },
                "BudgetYearOne": {
                    "val": "79.718"
                },
                "BudgetYearOneBase": {
                    "val": "79.718"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-6.050"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "50.592"
                },
                "BudgetYearOneBase": {
                    "val": "50.592"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.120"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "60.400"
                                },
                                "BudgetYearOneBase": {
                                    "val": "60.400"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-9.808"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-9.808"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-4.930"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "In FY13, SBIR\/STTR transfer of $1.12 million and Congressional reductions of $4.930 million were applied to Project Unit (PU) 0610. $10.1 million was also realigned from PU 0610, Air Superiority Target (AST)\/QF-16 to PU 0609, Multi-Stage Supersonic Target (MSST) program. The AST\/QF-16 program requirements changed as no AST\/QF-16 assets were procured and funding was required for the Engineering & Manufacturing Development (EMD) contract only. $0.47 million was also realigned from PU 0610, Full Scale Aerial Target (FSAT) program\/QF4 to PU 0609, MSST program. The FSAT\/QF-4 program requirements changed due to changes in operational and maintenance requirements. \n\nThe Multi Stage Supersonic Target (MSST) (designated the GQM-173A) program increased in design\/development costs, requiring additional funding in FY 2013 to align to the Contractor's Estimate to Complete and prevent delays in the initial production schedule. The GQM-173A encountered test failures and as a result Milestone (MS) C is now planned for FY 2016. In FY 2013, $10.1 million was realigned from PU 0610\/AST program to PU 0609\/MSST program and in FY 2015 $48.48 million was realigned from WPN (BLI 2280) to continue EMD in order to complete required testing. \n \nThe Subsonic Aerial Target (SSAT) (designated the BQM-177A) program requires additional funding in FY2015 due to schedule delays and technical issues in the areas of guidance and control, software development, and 6 Degrees of Freedom modeling. $8.52 million was reprogrammed from FY15 WPN (BLI 2280) to mitigate this shortfall.\n\nThe Supersonic Sea Skimming Target (SSST) (designated the GQM-163A) program was funded $2.65 million in FY15 for design\/development to improve the GQM-163A Quad Launch capability.  This budget item includes an increased capability to develop a system capable of firing 4 targets vice the 2 currently in the mission portfolio.  The $2.65 million includes design and development costs, launch control equipment, launcher(s) and incorporates the Joint Advanced Missile Instrumentation which allows for the launch of 4 targets.\n\nIn FY15, the AST\/QF-16 and FSAT\/QF-4 programs were eliminated as a result of Department of Navy adjustments."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0609"
                    },
                    "ProjectTitle": {
                        "val": "Aerial Target System Dev"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "46.317"
                        },
                        "CurrentYear": {
                            "val": "53.020"
                        },
                        "BudgetYearOne": {
                            "val": "69.296"
                        },
                        "BudgetYearOneBase": {
                            "val": "69.296"
                        },
                        "BudgetYearTwo": {
                            "val": "24.660"
                        },
                        "BudgetYearThree": {
                            "val": "9.548"
                        },
                        "BudgetYearFour": {
                            "val": "10.124"
                        },
                        "BudgetYearFive": {
                            "val": "10.352"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Aerial target systems, Target Control (TC), and associated TA\/AS are developed to support test & evaluation and advanced fleet training for Joint Strike and Littoral Warfare Systems required to defend fleet surface and air units in a hostile environment. In addition to hardware, software and operational concept development, studies will be performed by an University Affiliated Research Center (UARC) to specify and verify needed target performance for future target development. For the design and validation of targets under development, the UARC will provide engineering studies in areas such as structures, controls, guidance, and propulsion.  For those hardware and software items presently under development by commercial vendors, the UARC will provide oversight and validation of vendor design and development approach.\nAs to specific harware development, this project includes:\n- Subsonic Targets: BQM-177A development primarily represents subsonic anti-ship cruise missile threats in direct support of the Test & Evaluation of major combat weapons systems programs and of fleet training.  \n- Supersonic Targets: GQM-163A, GQM-173A, and supersonic high-diver capability development.  The family of supersonic target capabilities represents supersonic anti-ship cruise missile threats in direct support of Developmental Test and Evaluation (DT&E), Operational Test and Evaluation (OT&E) and Live Fire Test and Evaluation of major combat weapons systems programs in development.\n- TC and TA\/AS development: TC provides command and control of targets to enable the execution of threat-representative mission profiles.  TA\/AS enables each target to be uniquely configured for specific mission profiles. TA\/AS-configured targets are used for radar acquisition test, electronic countermeasures (jamming) evaluation, infrared measurement and testing, radar cross section evaluation, decoy-effectiveness testing, maneuver analysis, electronic warfare evaluation, warhead-effectiveness testing and evaluation of fleet tactics.  TA\/AS scoring capabilities include both surface and airborne scalar and vector scoring systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Supersonic Targets"
                                    },
                                    "Description": {
                                        "val": "The GQM-173A target emulates a two-stage anti-ship cruise missile. The GQM-173A will have a subsonic bus stage vehicle which will tumble and fall into the sea, and a supersonic sprint stage vehicle which continues flight to impact. The fielded system will provide threat representation in support of DT&E and OT&E and will identify deficiencies in shipboard air defense systems. Funding will also continue for GQM-163A upgrades\/evolutionary development to keep pace with evolving threat characteristics. Efforts include continuing to develop performance envelope characteristics to include flight termination performance and quad launch capability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "26.328"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conducted a technical re-baseline of the target to correct Phase I deficiencies found during the first EDM flight.  Conducted trade designs, technical review boards, wind tunnel, captive carry and ground testing.  Conducted technical interchange meetings, Program Management Reviews (PMR) and Schedule Risk Assessment (SRA)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "33.058"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue wind tunnel testing, captive carry and ground testing.  Conduct rocket motor qualification, hazard classification and insensitive munitions testing.  Conduct Integrated Baseline Review, PMRs and SRAs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "52.248"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "52.248"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue ground testing, perform separation flight tests, and begin validation of the models and simulations.  Conduct PMRs, SRA and technical design meetings. Commence and complete quad launch effort which will provide the required improvements in the current infrastructure of the launch capability to accommodate the increased number of targets, two to four."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Subsonic Targets"
                                    },
                                    "Description": {
                                        "val": "The BQM-177A represents subsonic anti-ship cruise missile threat in direct support of the T&E of major combat weapons systems programs and fleet training. It is the follow-on to the BQM-74 and BQM-34 targets, featuring longer range, lower cruise altitudes and greater maneuverability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.939"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conducted developmental ground testing including Radar Cross Section, Moment of Inertia and Mass Properties.  Conducted software functional qualification tests and commenced Rocket Assisted Take Off (RATO) and structures qualification.  Conducted Software Preliminary Design Review (PDR) and deep dive technical assessments in the areas of structures, guidance and control, and modeling and simulation.  Conducted system level PDR and Weapon Systems Explosive Safety Review Board (WSESRB)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.644"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct developmental ground testing and software functional qualification tests.  Continue RATO and structures qualification.  Conduct developmental flight tests, Critical Design Review (CDR) and WSESRB.  Conduct PMRs and SRAs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.984"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.984"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct CDR and final WSESRB. Conduct PMRs and SRAs. Complete RATO and structures qualification, developmental flight tests and system verification and product readiness reviews."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Target Control (TC) and Target Augmentation and Auxiliary Systems (TA\/AS)"
                                    },
                                    "Description": {
                                        "val": "Continue to support TC and TA\/AS capable of supporting T&E and fleet training activities.  TC involves the improved command and control systems capable of controlling multiple targets simultaneously while delivering adequate fidelity of T&E telemetry data. Augmentation and Auxiliary systems must be capable of augmenting targets in support of radar acquisition test, electronic countermeasures (jamming) evaluation, infrared measurement\/test, radar cross section evaluation, decoy effectiveness, maneuver analysis, electronic warfare, warhead effectiveness and evaluation of fleet tactics, readiness and training."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.050"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued development, prototype and integration of threat electronic attack & active emitter simulators.  Gathered and exploited threat intelligence."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.318"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue development, prototype and integration of threat electronic attack & active emitter simulators.  Gather and exploit threat intelligence."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.064"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.064"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue development, prototype and integration of threat electronic attack & active emitter simulators.  Gather and exploit threat intelligence."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "WPN 22800"
                                    },
                                    "Title": {
                                        "val": "Aerial Targets"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "42.621"
                                        },
                                        "CurrentYear": {
                                            "val": "39.460"
                                        },
                                        "BudgetYearOne": {
                                            "val": "48.046"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "48.046"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "62.109"
                                        },
                                        "BudgetYearThree": {
                                            "val": "84.390"
                                        },
                                        "BudgetYearFour": {
                                            "val": "97.507"
                                        },
                                        "BudgetYearFive": {
                                            "val": "94.052"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "WPN 612020"
                                    },
                                    "Title": {
                                        "val": "Initial Spares"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.770"
                                        },
                                        "CurrentYear": {
                                            "val": "1.858"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "1.672"
                                        },
                                        "BudgetYearThree": {
                                            "val": "1.281"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.940"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.960"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "EFFORT         PERFORMANCE REQUIREMENT               OBJECTIVE                       THRESHOLD                  TEST RESULT\n\n BQM-177           Maximum Speed at Low Altitude                  0.95 M @ 6.6 ft @              0.90 M @10.0 ft @           TBD\n EMD                   [Mach (M) at feet (ft) above wave                 Sea State 5                             Sea State 3\n program              crest at WMO Sea State conditions]\n                   \n GQM-173A       Speed of separated sprint                               Mach 2.2 to Mach 3.5           Threshold=Objective             TBD\n EMD                   vehicle\n\n TC-TA\/AS          High Frequency Band Microwave Threat Simulation Systems-                         100 Watts output             HIgh Fidelity Threat Electronic Attack & Active Emitter Simulators       Threshold=Objective             TBD\n  Target Threat                   Second Source                                              power\n  Simulation Program"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "0610"
                    },
                    "ProjectTitle": {
                        "val": "Wpn Sys T&E Trng Dev\/Proc"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "5.583"
                        },
                        "CurrentYear": {
                            "val": "14.464"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.818"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.048"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "20.913"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project provides for the development and procurement of aerial targets and associated systems used exclusively for test and evaluation of naval weapons systems which closely represent current and projected threats to fleet units in the joint strike and the littoral warfare environments. These representations must include characteristics related to size, performance envelope, and electromagnetic and infrared signatures. As threats change, changes must be made to keep the targets threat representative in response to changes in the test requirements of the developers of naval weapons systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Air Superiority Target (AST)"
                                    },
                                    "Description": {
                                        "val": "The AST is being developed as the follow-on to the current Full Scale Aerial Target (FSAT) and is an Air Force managed program.  The QF-16 is a converted F-16 aircraft and provides a supersonic, high altitude, remote-controlled aerial target.  This target will have full command and control capability through normal flight maneuvers. The AST target presentations will support aircraft and weapons systems testing and development, including that of the Joint Strike Fighter (JSF), AIM-9X Sidewinder missile, Advanced Medium Range Air-to-Air Missile (AMRAAM), and Standard Missile 6 (SM-6)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.233"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conducted EMD and awarded Milestone C."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.391"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Commence procurement of AST assets with RDT&E,N funding.  Conduct depreservation and conversion of two more QF-16 aircraft retrieved from Davis Monthan AFB storage."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "QF-4 FSAT"
                                    },
                                    "Description": {
                                        "val": "The FSAT is a supersonic, high altitude, remote-controlled aerial target.  This target has full command and control capability through normal flight maneuvers.  The program will include engineering and logistics support for the FSAT, including aviation depot level repairables and procurement of kit material. The QF-4 target presentations support aircraft and weapons systems testing and development, including that of the JSF, AIM-9X Sidewinder missile, AMRAAM and Standard Missile 6."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.350"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Maintained and operated the fielded inventory earmarked for the Navy.  FSAT annual cost varies with the number of target sorties\/presentations required and the number of targets remaining on the ramp requiring service."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.073"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain and operate the fielded inventory earmarked for the Navy."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "EFFORT          PERFORMANCE REQUIREMENT                OBJECTIVE                 THRESHOLD             TEST RESULT\n\nQF-4                Flight Termination Sys.- Reliable                 Achieve requirement        Threshold=objective       Satisfactory\nFull                  & effective auto & manual failsafe\nScale                 fast destruct, orbit destruct, &\nTarget               destruct receiver capability\n\nAST - Air           Capable of carrying, operating                   Achieve requirement           Threshold=objective        TBD\nSuperiority         and monitoring required\nTarget                payloads\n(QF-16)"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "0612"
                    },
                    "ProjectTitle": {
                        "val": "Surface Targets Development"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "1.271"
                        },
                        "CurrentYear": {
                            "val": "1.366"
                        },
                        "BudgetYearOne": {
                            "val": "1.262"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.262"
                        },
                        "BudgetYearTwo": {
                            "val": "1.235"
                        },
                        "BudgetYearThree": {
                            "val": "1.302"
                        },
                        "BudgetYearFour": {
                            "val": "1.278"
                        },
                        "BudgetYearFive": {
                            "val": "1.307"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops seaborne targets and their related target augmentation systems in support of air-to-surface and surface-to-surface weapons test and evaluation and fleet training."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Surface Targets Development"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.271"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Monitored developments in command and control. Portable Command and Control Unit (PCCU) software baseline update and testing. Reviewed capabilities of inventory with regard to threat, weapons test schedules and fleet training requirements. Re-baselined Radar Cross Sections (RCS) for various powered and towed targets with augmentation. Developed packages to tailor RCS. Developed signature management techniques to address evolving threats. Integrated PCCU into System for Naval Target Control (SNTC)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.366"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue development of short burst data communication by satellite with PCCU aboard seaborne platforms. Evaluate transmission latency and applicability with over the horizon counter-swarm strategies. Support software development and continued testing of the transition to single hardware platform for joint hosting of PCCU and SNTC. Develop PCCU ground station enhancements allowing for control of greater than 15 independent remote targets. Review existing capabilities of seaborne Program of Record (POR) platform inventory with regard to threats, weapons test schedules and evolving fleet training requirements. Evaluate fleet counter-swarm efforts to date and evaluate adequacy of existing POR targets for fleet support. Evaluate high-speed targets with regard to Anti-Surface Warfare (ASuW) weapons test requirements and recommend a path forward. Refine Hummanequin Graphical User Interface (GUI) on PCCU display to ease utility. Improve scoring algorithms for real-time feedback for small caliber weapons. Work with Multiple Integrated Laser Engagement System (MILES) systems developers to incorporate larger shipboard weapon systems with MILES technology. Develop updated Technical Data Package (TDP) for replacement Mobile Ship Target (MST) based upon lessons learned and emerging ship-sized target requirements. Provide cost analysis of new missile capable patrol boat simulator. Initiate development of upgraded polyethylene hull components for towed targets with goal of reduced unit cost and enhanced survivability.\nRefine design and fabrication of passive Radio Frequency (RF) reflectors across varied aperture lengths to reduce unit cost and ease fabrication. Develop large polyethylene towed target (>50') for ASuW alternatives to high value powered targets."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.262"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.262"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Research potential target modifications and operational changes to reduce Explosive Ordnance Disposal (EOD) involvement during exercises involving high explosive (HE) or tracer rounds. Research inboard JP-5 engine version of High Speed Maneuverable Surface Target (HSMST) to increase engine service life when JP-5 fuel is required. Research electronic steering remote control interface for powered seaborne targets. Support software development and continued testing of the transition to single hardware platform for joint hosting of PCCU and SNTC. Test PCCU ground station enhancements allowing for control of greater than 15 independent remote targets. Review existing capabilities of POR seaborne targets inventory with regard to threats, weapons test schedules and evolving fleet training requirements. Evaluate fleet counter-swarm efforts to date and evaluate adequacy of existing POR targets for fleet support. Continue working with MILES systems developers to incorporate larger shipboard weapon systems with MILES technology. Work with MILES systems developers to increase realism and utility of MILES for training against surface threats. Continue refining design and fabrication of passive RF reflectors across varied aperture lengths to reduce unit cost and ease fabrication. Research additional lower cost manufacturing and fielding methods for POR targets."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPN\/5455"
                                    },
                                    "Title": {
                                        "val": "ASW Range SE"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "39.708"
                                        },
                                        "CurrentYear": {
                                            "val": "22.990"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "14.682"
                                        },
                                        "BudgetYearThree": {
                                            "val": "13.559"
                                        },
                                        "BudgetYearFour": {
                                            "val": "11.144"
                                        },
                                        "BudgetYearFive": {
                                            "val": "11.379"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "135.601"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Review capability of inventory with respect to threat, weapons test schedules and fleet training requirements.  OBJECTIVE:  Available inventory of seaborne targets to meet fleet requirements."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2159"
                    },
                    "ProjectTitle": {
                        "val": "ASW TARGET"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "3.022"
                        },
                        "BudgetYearOne": {
                            "val": "9.160"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.160"
                        },
                        "BudgetYearTwo": {
                            "val": "4.076"
                        },
                        "BudgetYearThree": {
                            "val": "1.533"
                        },
                        "BudgetYearFour": {
                            "val": "1.290"
                        },
                        "BudgetYearFive": {
                            "val": "1.347"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "A new cost effective Advanced Expendable Mobile ASW Training Target (new nomenclature MK1 Mod 0 Parrotfish Expendable Target) is required to acoustically and dynamically emulate threat submarines for fleet qualification and proficiency training on and off undersea ranges.  Acoustically a new system is required to provide a higher fidelity active sonar system and torpedo sonar system with expanded frequency coverage than current systems to be compatible with sonar and torpedo systems being fielded on the P-8, SH-60R, and AN-SQQ-89 capable surface ships and the MK54 Mod 0 and MK48 Mod 7 Torpedoes. Dynamically the target needs to emulate both low and high speed ends of threat submarines performance envelope to provide needed training realism."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "ASW Target Development"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.022"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Support acquisition documentation development and specification development to be supported by risk reduction engineering analysis in areas of transducers, high energy batteries and air launch related technologies. Further engage fleet commands\/users to develop and refine detailed system performance requirements, industry engagement, and draft request for proposal release."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.160"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.160"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to support acquisition documentation development and specification development to be supported by risk reduction engineering analysis in areas of transducers, high energy batteries and air launch technologies. Support technical and cost evaluation of contractor proposals for new Advanced Expendable Mobile ASW Training Target. Award development contract for new Advanced Expendable ASW Training Target in second quarter of FY15. Support contractor initial baseline review. Support initial engineering and software development of prototype hardware. Support initial engineering efforts associated with new test equipment to test the new Advanced Expendable Mobile ASW Taining Target."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "3141"
                                    },
                                    "Title": {
                                        "val": "ASW Targets"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "9.443"
                                        },
                                        "CurrentYear": {
                                            "val": "7.135"
                                        },
                                        "BudgetYearOne": {
                                            "val": "2.515"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "2.515"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "6.956"
                                        },
                                        "BudgetYearThree": {
                                            "val": "9.912"
                                        },
                                        "BudgetYearFour": {
                                            "val": "10.930"
                                        },
                                        "BudgetYearFive": {
                                            "val": "11.142"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "89.836"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable"
                        },
                        "PerformanceMetrics": {
                            "val": "- Frequent IPT meetings with contract and government technical program personnel.\n- Rigorous acoustic, environmental and in-water dynamic test program.\n- Specification with threshold and objectives requirements.\n- Issue initial RFI to industry.\n- Draft RFP released for industry review"
                        }
                    }
                }
            ]
        }
    }
}