{
    "id": "8fcaed5039682626aa4ff97aa2da86fedd8e3c66",
    "meta": {
        "filename": "dod-2015_RDTE_2015_ARMY_BA7_RDTE_JustificationBook_Army_PB_2015.zzz_unzipped_RDTE_JustificationBook_Army_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0203758A"
        },
        "ProgramElementTitle": {
            "val": "Digitization"
        },
        "R1LineNumber": {
            "val": "169"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "34.225"
            },
            "CurrentYear": {
                "val": "6.183"
            },
            "BudgetYearOne": {
                "val": "10.912"
            },
            "BudgetYearOneBase": {
                "val": "10.912"
            },
            "BudgetYearTwo": {
                "val": "15.035"
            },
            "BudgetYearThree": {
                "val": "13.517"
            },
            "BudgetYearFour": {
                "val": "13.351"
            },
            "BudgetYearFive": {
                "val": "13.463"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Horizontal Battlefield Digitization is a strategy that allows warfighters, from the individual soldier and platform to echelons above corps, to share critical situation awareness (SA) and command and control (C2) information. It conducts analysis and evaluation of new information technologies, concepts, and applications of integrated management activities to meet the dynamic Army acquisition technology requirements. The strategy applies digital information technologies to acquire, exchange, and employ data throughout the operational environment, and provides a clear and accurate common operational picture for leaders at all levels. This timely sharing of information significantly improves the ability of commanders and leaders to quickly make decisions, synchronize forces and fires, and increase the operational tempo.  Digitization is a means of realizing a fully integrated C2\/SA capability to the platoon level, including interoperability links with joint and multi-national ground forces. The major efforts included in the program element are: 1) Integration and synchronization of the Army's interoperability efforts, coordination of interoperability efforts between joint and multi-national forces, and the synchronization of combat material and training efforts to develop Army information technologies. 2) Systems engineering and integration of hardware and software interfaces between and across the warfighting functions and across multiple Program Executive Offices, providing System of Systems (SOS) capabilities that satisfy warfighter requirements and enable the execution of mission operations by providing one Common Operational Picture (COP)\/Common Tactical Picture (CTP). 3) Support fielding of integrated systems to Active and Reserve Components (USARNG and USAR) in accordance with Army Force Generation (ARFORGEN). 4) Support of the the Army Equipping Enterprise System (AE2S) integration of the Force Development Investment Information System (FDIIS), Army Flow Model (AFM), and the Continuing Early Validation (CEaVa) programs into a single integrated system. This supports the Army's Equipment Modernization Strategy, Army Force Generation (ARFORGEN) and consolidates capabilities to gain efficiencies. IAW the National Defense Authorization Act 804 and support of OSD's reports to Congress, the Army is poised to implement the \"Agile Business Process\" that will result in an iterative and incremental approach to software development and hardware\/software capability integration.  This process will improve effectiveness in the identification, assessment and acquisition of capability solutions for the Army."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "35.180"
                },
                "CurrentYear": {
                    "val": "6.186"
                },
                "BudgetYearOne": {
                    "val": "11.388"
                },
                "BudgetYearOneBase": {
                    "val": "11.388"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "34.225"
                },
                "CurrentYear": {
                    "val": "6.183"
                },
                "BudgetYearOne": {
                    "val": "10.912"
                },
                "BudgetYearOneBase": {
                    "val": "10.912"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.955"
                },
                "CurrentYear": {
                    "val": "-0.003"
                },
                "BudgetYearOne": {
                    "val": "-0.476"
                },
                "BudgetYearOneBase": {
                    "val": "-0.476"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.289"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.289"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments 1"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.955"
                                },
                                "CurrentYear": {
                                    "val": "-0.003"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.187"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.187"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "374"
                    },
                    "ProjectTitle": {
                        "val": "HOR Battlefld Digitizn"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "9.074"
                        },
                        "CurrentYear": {
                            "val": "6.183"
                        },
                        "BudgetYearOne": {
                            "val": "5.996"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.996"
                        },
                        "BudgetYearTwo": {
                            "val": "5.186"
                        },
                        "BudgetYearThree": {
                            "val": "3.657"
                        },
                        "BudgetYearFour": {
                            "val": "3.484"
                        },
                        "BudgetYearFive": {
                            "val": "3.583"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Horizontal Battlefield Digitization is a strategy that allows warfighters, from the individual soldier and platform to echelons above corps, to share critical situation awareness (SA) and command and control (C2) information. It conducts analysis and evaluation of new information technologies, concepts, and applications of integrated management activities to meet the dynamic Army acquisition technology requirements. The strategy applies digital information technologies to acquire exchange and employ data throughout the operational environment, and provides a clear and accurate common operational picture for leaders at all levels. This timely sharing of information significantly improves the ability of commanders and leaders to quickly make decisions, synchronize forces and fires, and increase the operational tempo.  Digitization is a means of realizing a fully integrated C2\/SA capability to the platoon level, including interoperability links with joint and multi-national ground forces. The major efforts included in the program element are: 1) Integration and synchronization of the Army's interoperability efforts, coordination of interoperability efforts between joint and multi-national forces, and the synchronization of combat material and training efforts to develop Army information technologies. 2) Systems engineering and integration of hardware and software interfaces between and across the warfighting functions and across multiple Program Executive Offices, providing System of Systems (SOS) integration capabilities that satisfy warfighter requirements and enable the execution of mission operations by providing one Common Operational Picture (COP)\/Common Tactical Picture (CTP). 3) Support fielding of integrated systems to Active and Reserve Components (USARNG and USAR) in accordance with Army Force Generation (ARFORGEN). 4) Support the Army Equipping Enterprise System (AE2S) integration of the Force Development Investment Information System (FDIIS), Army Flow Model (AFM) and the Continuous Early Validation (CEaVa) programs into a single integrated system. This supports the Army's Equipment Modernization Strategy, Army Force Generation (ARFORGEN) and consolidates capabilities to gain efficiencies. IAW the National Defense Authorization Act 804 and support of OSD's report to Congress, the Army is poised to implement the \"Agile Business Process\" that will result in an iterative and incremental approach to software development and hardware\/software capability integration.  This process will improve effectiveness in the identification, assessment and acquisition of capability solutions for the Army."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Interoperability Assessment"
                                    },
                                    "Description": {
                                        "val": "Funds are to be used for the following efforts"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.007"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct technical interoperability assessments, perform interoperability\/integration analyses, analyze networked weapon system and  Situational Awareness (SA), Command and Control (C2), Command, Control, Communications, Computers, Intelligence, Surveillance, and Reconnaissance (C4ISR) systems compatibility, and assess technical and operational test plans, activities, and results."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.091"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct technical interoperability assessments, perform interoperability\/integration analyses, analyze networked weapon system and  Situational Awareness (SA), Command and Control (C2) systems compatibility and assess technical and operational test plans, activities, and results."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.076"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.076"
                                            },
                                            "Text": {
                                                "val": "Conduct technical interoperability assessments, perform interoperability\/integration analyses, analyze networked weapon system and  Situational Awareness (SA), Command and Control (C2) systems compatibility and assess technical and operational test plans, activities, and results."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SA\/C2"
                                    },
                                    "Description": {
                                        "val": "Funds are to be used for the following efforts"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.007"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Integrate and synchronize interoperability across SA\/C2\/C4ISR programs in support of acquisition synchronization, testing, training, and fielding System of Systems capabilities to the Army Force.  Continue application across current and future force."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.091"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Integrate and synchronize interoperability across SA\/C2 programs in support of acquisition synchronization, testing, training, and fielding System of Systems capabilities to the Army Force.  Continue application across current and future force."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.961"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.961"
                                            },
                                            "Text": {
                                                "val": "Integrate and synchronize interoperability across SA\/C2 programs in support of acquisition synchronization, testing, training, and fielding System of Systems capabilities to the Army Force.  Continue application across current and future force."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ditization Technical Integration"
                                    },
                                    "Description": {
                                        "val": "Support digitization technical integration with Active and Reserve Components both CONUS and OCONUS."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.025"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Support digitization technical integration with Active and Reserve Components both CONUS and OCONUS."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.071"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Support digitization technical integration with Active and Reserve Components both CONUS and OCONUS."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.103"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.103"
                                            },
                                            "Text": {
                                                "val": "Support digitization technical integration with Active and Reserve Components both CONUS and OCONUS."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "AE2S Software"
                                    },
                                    "Description": {
                                        "val": "Procures AE2S software integration and enhancements for the single program language, single platform system that incorporates FDIIS, CEaVa, COP and AFM."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Procures AE2S software integration and enhancements for the single program language, single platform system that incorporates FDIIS, CEaVa, COP and AFM."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.806"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "AE2S software integration and enhancements for the single program language, single platform system that incorporates FDIIS, COP and AFM."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.938"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.938"
                                            },
                                            "Text": {
                                                "val": "AE2S software integration and enhancements for the single program language, single platform system that incorporates FDIIS, COP and AFM."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint & Coalition Interoperability"
                                    },
                                    "Description": {
                                        "val": "Support Joint and Coalition interoperability programs to improve integration and interoperability in accordance with Army Software Blocking Policy, Joint Planning Guidance, Coalition Specifications, Joint Capabilities Integration and Development System (JCIDS) requirements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.255"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Support Joint and Coalition interoperability programs to improve integration and interoperability in accordance with Army Software Blocking Policy, Joint Planning Guidance, Coalition Specifications, Joint Capabilities Integration and Development System (JCIDS) requirements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.944"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Support Joint and Coalition interoperability programs to improve integration and interoperability in accordance with Army Software Blocking Policy, Joint Planning Guidance, Coalition Specifications, Joint Capabilities Integration and Development System (JCIDS) requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.826"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.826"
                                            },
                                            "Text": {
                                                "val": "Support Joint and Coalition interoperability programs to improve integration and interoperability in accordance with Army Software Blocking Policy, Joint Planning Guidance, Coalition Specifications, Joint Capabilities Integration and Development System (JCIDS) requirements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Academic Research"
                                    },
                                    "Description": {
                                        "val": "Apply university academic and research resources to the integration of Army complex modeling, simulation, and training in support of modernized forces."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.570"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Apply university academic and research resources to the integration of Army complex modeling, simulation, and training in support of modernized forces."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.506"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Apply university academic and research resources to the integration of Army complex modeling, simulation, and training in support of modernized forces."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.522"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.522"
                                            },
                                            "Text": {
                                                "val": "Apply university academic and research resources to the integration of Army complex modeling, simulation, and training in support of modernized forces."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cross-platform development"
                                    },
                                    "Description": {
                                        "val": "Manage cross-platform software and hardware development, testing, training, and fielding to ensure the coordinated interoperability for each Army Force unit rotation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.210"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Manage cross-platform software and hardware development, testing, training, and fielding to ensure the coordinated interoperability for each Army Force unit rotation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.674"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Manage cross-platform software and hardware development, testing, training, and fielding to ensure the coordinated interoperability for each Army Force unit rotation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.570"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.570"
                                            },
                                            "Text": {
                                                "val": "Manage cross-platform software and hardware development, testing, training, and fielding to ensure the coordinated interoperability for each Army Force unit rotation."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "Not Applicable for this item"
                        },
                        "AcquisitionStrategy": {
                            "val": "To validate\/demonstrate concepts and requirements, near term efforts are focused on developing a seamless battlefield software architecture and digitized hardware systems to include:  evaluation of the horizontal battlefield digitization resources for systems, acquisition, integration, and testing of digital capability across multiple command and control, communications, sensors, and weapons platforms.  The result will be an integrated, synchronized capability designed to meet the near-term requirements of the Stryker Brigade Combat Teams and the Army Future Force.  Also supports the Army's role in joint and multi-national digitization programs, battle command efforts and Joint Battlefield Situational Awareness."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "TBD"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "7.771"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "9.074"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "6.183"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.996"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "5.996"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "EC8"
                    },
                    "ProjectTitle": {
                        "val": "Emerging Technologies from NIEs"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "25.151"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "4.916"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.916"
                        },
                        "BudgetYearTwo": {
                            "val": "9.849"
                        },
                        "BudgetYearThree": {
                            "val": "9.860"
                        },
                        "BudgetYearFour": {
                            "val": "9.867"
                        },
                        "BudgetYearFive": {
                            "val": "9.880"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "69.523"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "As a result of the language that was incorporated into the Senate Report 112-196 that accompanied the Department of Defense Appropriations Bill 2013, House Report 5856, this Project was established specifically for the transition of promising technologies from NIES to the field, particularly those developed by nontraditional vendors.   Program control will be exercised by review of individual projects and approval by Army Gatekeepers, much like the Network Integration Evaluation (NIE) Program (PE 0604798A)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Emerging Technologies from NIEs"
                                    },
                                    "Description": {
                                        "val": "To mature, test, integrate and evaluate traditional and nontraditional small business and industry's technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "25.151"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "These fund were used to mature, test, and integrate small business and industry technologies that were demonstrated and evaluated during various NIE Events.  This includes improvements of technologies from previous NIEs that will be evaluated and baselined future NIEs for fielding in a Capability Set (CS).  The technologies that will benefit from these funds for further development are dependent upon the Gatekeeper's approval.  These funds supported such technologies as; Common Operating Picture (Ringtail), Network Operations Tools (PacStar Software), Single Consolidated Mobile Mast (Blue Sky Mast), Improved Operational Energy (Battteries), Vehicle Tactical Routers, Voice Interoperable Software Client, and others."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.916"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.916"
                                            },
                                            "Text": {
                                                "val": "These funds will be used to mature, test, and integrate small business and industry technologies that are demonstrated and evaluated during various NIE Events.  This includes improvements of technologies from previous NIEs that will be then evaluated and baselined at a NIE for fielding in a Capability Set (CS).  The technologies that will benefit from these funds for further development are dependent upon the Gatekeeper's approval.  These funds will affect technologies from NIE 15.1, (2 QTR FY15), NIE 15.2 (4QTR FY15) and\/or NIE 16.1 (2QTR FY16)."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Technologies will be selected dependent upon the Gatekeeper's approval."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Emerging Technologies from NIEs"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Locations"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "25.151"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "4.916"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "4.916"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-06"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "30.067"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "NIE 15.1 Planning - Execution"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NIE 15.2 Planning - Execution"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NIE 16.1 Planning - Execution"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}