{
    "id": "90a0927f88bce626f27a1d78af55e4befe9c7381",
    "meta": {
        "filename": "dod-2015_RDTE_2015_DARPA_RDTE_JustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2015.zzz_unzipped_RDTE_JustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602702E"
        },
        "ProgramElementTitle": {
            "val": "TACTICAL TECHNOLOGY"
        },
        "R1LineNumber": {
            "val": "20"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "209.578"
            },
            "CurrentYear": {
                "val": "218.209"
            },
            "BudgetYearOne": {
                "val": "305.484"
            },
            "BudgetYearOneBase": {
                "val": "305.484"
            },
            "BudgetYearTwo": {
                "val": "340.564"
            },
            "BudgetYearThree": {
                "val": "339.388"
            },
            "BudgetYearFour": {
                "val": "344.594"
            },
            "BudgetYearFive": {
                "val": "356.710"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element is budgeted in the Applied Research Budget Activity because it supports the advancement of concepts and technologies to enhance the next generation of tactical systems.  The Tactical Technology program element funds a number of projects in the areas of Naval Warfare, Advanced Land Systems, Advanced Tactical Technology, Aeronautics Technology and Network Centric Enabling Technology.\n\nThe Naval Warfare Technology project develops advanced technologies for application to a broad range of naval requirements.  Enabling and novel technologies include concepts for expanding the envelope of operational naval capabilities such as drag reduction, ship stability, hypersonic missiles, logistically friendly distributed lighting systems, ship self-defense techniques, novel underwater propulsion modalities, vessels for estuary and riverine operations, high speed underwater vessels, improved techniques for underwater object detection and discrimination, long endurance unmanned surface vehicles, and high bandwidth communications.\n\nThe Advanced Land Systems project is developing technologies for enhancing U.S. military effectiveness and survivability in operations ranging from traditional threats to military operations against irregular forces that can employ disruptive or catastrophic capabilities, or disrupt stabilization operations.  The emphasis is on developing affordable technologies that will enhance the military's effectiveness while decreasing the exposure of U.S. or allied forces to enemy fire.  This project will also explore novel design technologies for the manufacture of ground vehicles and new tools for systems assessments of emerging DARPA technologies.\n\nThe Advanced Tactical Technology project focuses on broad technology areas including: a) compact, efficient, frequency-agile, diode-pumped, solid-state lasers for infrared countermeasures, laser radar, holographic laser sensors, communications, and high-power laser applications; and b) new tactical systems for enhanced air vehicle survivability, precision optics, electronic warfare, and advanced air breathing weapons. \n\nAeronautics Technology efforts will address high payoff opportunities that dramatically reduce costs associated with advanced aeronautical systems and\/or provide revolutionary new system capabilities for satisfying current and projected military mission requirements.  This includes advanced technology studies of revolutionary propulsion and vehicle concepts, sophisticated fabrication methods, and examination of novel materials for aeronautic system applications.\n\nThe Network Centric Enabling Technology project develops network-centric mission applications that integrate information arising from: 1) sensors and signal\/image processors; 2) collection platforms and weapon systems; 3) intelligence networks; and 4) open and other external sources.  Technical challenges include the need to process huge volumes of diverse, incomplete, and uncertain data streams in tactically-relevant timeframes.  Processing here includes a number of critical steps including conditioning of unstructured data, content analysis, behavioral modeling, pattern-of-life characterization, economic activity analysis, social network analysis, anomaly detection, and visualization.  Operational benefits include deeper understanding of the evolving operational environment tailored to the needs of commanders at every echelon.  Promising technologies are evaluated in the laboratory and demonstrated in the field to facilitate transition."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "233.209"
                },
                "CurrentYear": {
                    "val": "225.977"
                },
                "BudgetYearOne": {
                    "val": "236.874"
                },
                "BudgetYearOneBase": {
                    "val": "236.874"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "209.578"
                },
                "CurrentYear": {
                    "val": "218.209"
                },
                "BudgetYearOne": {
                    "val": "305.484"
                },
                "BudgetYearOneBase": {
                    "val": "305.484"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-23.631"
                },
                "CurrentYear": {
                    "val": "-7.768"
                },
                "BudgetYearOne": {
                    "val": "68.610"
                },
                "BudgetYearOneBase": {
                    "val": "68.610"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.301"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "-19.883"
                    },
                    "CurrentYear": {
                        "val": "-10.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "2.232"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "2.554"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-6.001"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "68.610"
                                },
                                "BudgetYearOneBase": {
                                    "val": "68.610"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2013:  Decrease reflects Congressional reductions for Sections 3001 & 3004 and directed reductions, sequestration adjustments, and the SBIR\/STTR transfer offset by reprogrammings. \nFY 2014:  Decrease reflects a program cancellation offset by a program increase. \nFY 2015:  Increase reflects additional emphasis placed on Network Defense, Big Data, Land System Technologies, and Aeronautics programs."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "TT-03"
                    },
                    "ProjectTitle": {
                        "val": "NAVAL WARFARE TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "46.342"
                        },
                        "CurrentYear": {
                            "val": "32.744"
                        },
                        "BudgetYearOne": {
                            "val": "33.829"
                        },
                        "BudgetYearOneBase": {
                            "val": "33.829"
                        },
                        "BudgetYearTwo": {
                            "val": "50.732"
                        },
                        "BudgetYearThree": {
                            "val": "60.839"
                        },
                        "BudgetYearFour": {
                            "val": "59.975"
                        },
                        "BudgetYearFive": {
                            "val": "54.522"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Naval Warfare Technology project develops advanced technologies for application to a broad range of naval requirements.  Enabling and novel technologies include concepts for expanding the envelope of operational naval capabilities such as drag reduction, ship stability, hypersonic missiles, logistically friendly distributed lighting systems, ship self-defense techniques, novel underwater propulsion modalities, vessels for estuary and riverine operations, high speed underwater vessels, improved techniques for underwater object detection and discrimination, long endurance unmanned surface vehicles, and high bandwidth communications."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Anti-Submarine Warfare (ASW) Continuous Trail Unmanned Vessel (ACTUV)"
                                    },
                                    "Description": {
                                        "val": "The Anti-Submarine Warfare (ASW) Continuous Trail Unmanned Vessel (ACTUV) program has three primary goals: (1) to build and demonstrate an experimental unmanned vessel with beyond state-of-the-art platform performance based on clean sheet design for unmanned operation, (2) demonstrate the technical viability of operating autonomous unmanned craft at theater or global ranges, from forward operating bases, under a sparse remote supervisory control model, and (3) leverage unique ACTUV characteristics to transition a game changing ASW capability to the Navy.  By establishing the premise that a human is never intended to step on board at any point in the operational cycle, ACTUV concepts can take advantage of an unexplored design space that eliminates or modifies conventional manned ship design constraints in order to achieve disproportionate speed, endurance, and payload fraction.  The resulting unmanned naval vessels must possess sufficient situational awareness and autonomous behavior capability to operate in full compliance with the rules of the road and maritime law to support safe navigation for operational deployments spanning thousands of miles and months of time.  When coupled with innovative sensor technologies, the ACTUV system provides a low cost unmanned system with a fundamentally different operational risk calculus that enables game changing capability to detect and track even the quietest diesel electric submarine threats.  Key technical areas include unmanned naval vessel design methodologies, ship system reliability, high fidelity sensor fusion to provide an accurate world model for autonomous operation, novel application of sensors for ASW tracking, and holistic system integration due to unique optimization opportunities of the ACTUV system."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "37.400"
                                            },
                                            "Text": {
                                                "val": "-  Completed ACTUV detailed design and conducted critical design review.\n-  Performed demonstrations of ACTUV critical enabling technologies.\n-  Conducted integrated system demonstration on ACTUV surrogate hardware-in-the-loop system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.831"
                                            },
                                            "Text": {
                                                "val": "-  Complete ACTUV sensor testing on surrogate platform.\n-  Initiate ACTUV prototype vessel construction.\n-  Integrate software and hardware into the ACTUV platform."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.865"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.865"
                                            },
                                            "Text": {
                                                "val": "-  Complete construction of prototype vessel.\n-  Conduct at-sea testing to validate performance of vessel, sensor systems, and autonomy."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Upward Falling Payloads (UFP)"
                                    },
                                    "Description": {
                                        "val": "The Upward Falling Payloads (UFP) program will develop forward-deployed unmanned distributed systems that can provide non-lethal effects or situational awareness over large maritime areas.  Building upon and complimenting concepts for maritime situational awareness and ISR developed under the DASH program, budgeted in Project PE 0603766E\/NET-02, the UFP approach centers on pre-deploying deep-ocean nodes years in advance in forward operating areas which can be commanded from standoff to launch to the surface.  Advances in miniaturized sensors and processors, the explosive growth in the variety of small unmanned systems, and the advances in autonomy and networking all point toward highly-capable, yet affordable, distributed systems.  Currently, large numbers of distributed unmanned systems are not utilized in far-forward areas due to logistics and distance, the need for delivery platforms, and the associated latency for insertion.  The UFP program will remove this barrier to accelerate large-scale unmanned distributed applications and missions.  The presumption is that a wider range of technology options and system solutions will emerge when the barriers to deployment are removed."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.913"
                                            },
                                            "Text": {
                                                "val": "-  Conduct system trade studies addressing a range of UFP applications leading to conceptual designs.\n-  Conduct analysis to characterize long-range deep sea communications.\n-  Develop conceptual designs for deep sea containment and launch."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.964"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.964"
                                            },
                                            "Text": {
                                                "val": "-  Develop a payload capable of achieving its effect or sensing range required to scale for the program's coverage area.\n-  Develop a riser to hold the payload at pressure, and launching it to the surface from an intermediate ocean depth.\n-  Demonstrate an integrated riser and payload using surrogate communications to initiate deployment to the surface.\n-  Initiate development of communications subsystems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Arctic Operations"
                                    },
                                    "Description": {
                                        "val": "The Arctic Operations initiative is focused on developing technology to assure U.S. capability to achieve situational awareness in the Arctic.  Due to retreating Arctic ice in the coming decades there is an expectation for increased shipping traffic during the summer months, and increased interest in exploiting natural resources along the Arctic continental shelf.  This growth in activity will increase the strategic significance of the region, and will drive the need to ensure stability through effective regional monitoring.  The extreme environmental conditions of the Arctic may challenge the effectiveness of conventional technology to provide such monitoring.  As such, this program seeks to exploit unique physical attributes and emergent environmental trends in the Arctic to create surprising new capabilities, and will develop technologies for persistent and affordable sensing and communication both above and below the ice to ensure responsive operations and domain awareness."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.942"
                                            },
                                            "Text": {
                                                "val": "-  Initiated system studies and subsystem technology assessments for novel under-ice and near-ice surveillance.\n-  Conducted technology assessments and performed technology demonstrations in climactic laboratories.\n-  Conducted Arctic data collections analyses.\n-  Completed initial Arctic surveillance system studies.\n-  Developed canonical datasets including environmental data collections to support future design studies and technology efforts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "-  Recover data collection systems and commence data analysis.\n-  Participate in Navy Ice Experiment (ICEX).\n-  Complete data collection analysis."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tactically Expandable Maritime Platform (TEMP)"
                                    },
                                    "Description": {
                                        "val": "The Tactically Expandable Maritime Platform (TEMP) program sought to develop and demonstrate macroscopic integrated systems built up from International Organization for Standardization (ISO) modular technologies that could be operated from unmodified commercial container ships and deliver credible naval capability for high priority missions.  TEMP developed enabling modular technologies and evaluated the feasible range of naval missions that could be serviced from this highly flexible and cost effective unconventional force structure model.  TEMP also evaluated a Humanitarian Assistance and Disaster Relief (HA\/DR) mission, engineering a modular first responder capability to allow rapid force closure capability following a disaster event."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "-  Conducted TEMP Modular Sea Depot ballast testing and prototype operational demonstration.\n-  Conducted incremental risk reduction testing of TEMP critical enabling technologies, including modularized air delivery vehicle and modularized sea delivery vehicle."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TT-04"
                    },
                    "ProjectTitle": {
                        "val": "ADVANCED LAND SYSTEMS TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "30.883"
                        },
                        "CurrentYear": {
                            "val": "57.792"
                        },
                        "BudgetYearOne": {
                            "val": "70.855"
                        },
                        "BudgetYearOneBase": {
                            "val": "70.855"
                        },
                        "BudgetYearTwo": {
                            "val": "69.355"
                        },
                        "BudgetYearThree": {
                            "val": "48.855"
                        },
                        "BudgetYearFour": {
                            "val": "60.355"
                        },
                        "BudgetYearFive": {
                            "val": "65.185"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project is developing technologies for enhancing U.S. military effectiveness and survivability in operations ranging from traditional threats to military operations against irregular forces that can employ disruptive or catastrophic capabilities, or disrupt stabilization operations.  The emphasis is on developing affordable technologies that will enhance the military's effectiveness while decreasing the exposure of U.S. or allied forces to enemy fire.  This project will also explore novel design technologies for the manufacture of ground vehicles and new tools for systems assessments of emerging DARPA technologies."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Fast, Adaptable, Next Generation Ground Combat Vehicle (FANG)"
                                    },
                                    "Description": {
                                        "val": "The goals of the Fast, Adaptable, Next-Generation Ground Combat Vehicle (FANG) program are to employ a novel, model-based design and verification capability, a highly-adaptable foundry-style manufacturing capability, and collaborative design methods to demonstrate 5X-10X compression in the timeline necessary to build an infantry fighting vehicle.  The program seeks to create an open-source development infrastructure for the aggregation of designer inputs applicable to complex electromechanical systems as well as software, and to exercise this infrastructure with a series of design events, leading to the building of designs in a foundry-style, rapidly configurable manufacturing facility."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.919"
                                            },
                                            "Text": {
                                                "val": "-  Performed experimental subsystem designs using the vehicle design environment as well as the iFAB Foundry.\n-  Promulgated component model libraries, foundry capabilities, and objective design criteria for the first FANG Challenge covering an Infantry Fighting Vehicle (IFV) drivetrain and mobility subsystem.\n-  Maintained and developed incremental upgrades to the collaborative vehicle design environment.\n-  Conducted the first FANG Challenge, a competitive, collaborative design contest for the drivetrain and mobility subsystem of a heavy, amphibious IFV."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.000"
                                            },
                                            "Text": {
                                                "val": "-  Conduct developmental testing and evaluation of the drivetrain and mobility subsystem built by the iFAB Foundry.\n-  Prepare notional design requirements for an IFV chassis and integrated survivability subsystem.\n-  Conduct AVM tool suite validation testing, a rigorous test of META and iFAB capabilities executed by relevant industry teams and focused on the chassis and survivability subsystem of a heavy, amphibious IFV.\n-  Transition component model standards, tool integration standards, and VehicleFORGE software tool suite and associated technology to the Digital Manufacturing and Design Innovation Institute (DMDII) through the use of co-funded research and formal technology transition activities for industry use."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ground Experimental Vehicle (GXV)"
                                    },
                                    "Description": {
                                        "val": "The goal of the Ground Experimental Vehicle (GXV) program, leveraging architectures from the META program (funded in PE 0602303E, Project IT-02), is to achieve significant improvements in military ground vehicle performance, fundamentally enabled through achievement of crew\/vehicle survivability through means alternative to the traditional mass-based armor solutions.  This will be accomplished through development of core ground combat and tactical vehicle technologies related to platform mobility, survivability through agility, improved signature management, semi-automated crew functions, and improved overall platform\/unit tactical utility.  The GXV program will develop technologies at the subsystem to integrated platform level, along with performance demonstrated through fully capable concept vehicles.  A key program thread is pursuing platform technologies that allow extreme reductions in integrated system volume, weight, and crew while conserving crew survivability, improving deployability, and increasing force effectiveness.  The GXV program will support a systems engineering-based GXV architecture that enhances technology development at the component and subsystem level.  Modeling and simulation for technical analysis and evaluation, as well as operational assessments, will be included in the GXV effort."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "-  Initiate development in GXV technology areas.\n-  Develop technical requirements and operational strategies for vehicles with Service user communities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete definition of initial systems architectures.\n-  Conduct preliminary design review of technology development efforts.\n-  Finalize overall concept platform requirements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Robotics Challenge"
                                    },
                                    "Description": {
                                        "val": "The Robotics Challenge program will directly meet Department of Defense strategic needs by developing robotic technology for disaster response operations.  This technology will improve the performance of robots that operate in the rough terrain and austere conditions characteristic of disasters, and use vehicles and tools commonly available in populated areas.  This technology will work in ways easily understood by subject matter experts untrained in the operation of robots and be governed by intuitive controls that require little training.  The program will also meet the global need for resilience against natural disasters and industrial accidents, and increase the resilience of infrastructure against acts of terrorism.  Anticipated Service users include the Army, Marines, and Special Forces."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.964"
                                            },
                                            "Text": {
                                                "val": "-  Designed robot systems and developed algorithms for locomotion and controls.\n-  Conducted the Virtual Robotics Challenge.\n-  Defined the DARPA Robotics Challenge Trials event performance and test criteria."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.560"
                                            },
                                            "Text": {
                                                "val": "-  Build robot systems.\n-  Develop algorithms for perception, manipulation, and operator interface.\n-  Conduct the DARPA Robotics Challenge Trials.\n-  Define the DARPA Robotics Challenge Finals event performance and test criteria."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.855"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.855"
                                            },
                                            "Text": {
                                                "val": "-  Conduct the DARPA Robotics Challenge Finals.\n-  Perform analysis and report findings to document advancements achieved as a result of the challenge."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Infantry Squad Systems (IS2)"
                                    },
                                    "Description": {
                                        "val": "The U.S. military achieves overmatch against its adversaries via vehicles in all regimes - land, sea and air; however, this level of overmatch is not enjoyed at the squad to individual dismounted warfighter level.  The goal of the IS2 program is to leverage advances in real-time situational awareness and mission command; organic three-dimensional dismount mobility; extended range tracking, targeting, and response; and unmanned mobility and perception in order to create a squad with substantial combat overmatch.  The concept of overmatch at the squad level includes increased human stand-off, a smaller force density, and adaptive sensing to allow for responses at multiple scales.  IS2 will explore advanced wearable force protection, advanced organic squad level direct and indirect trajectory precision weaponry.  The end result of the IS2 program is an individual dismount unit outfitted with sensors, weaponry, and supporting technology to achieve one-on-one overmatch as well as the overall integration of unmanned assets alongside the dismounts to create a new Hybrid Squad unit."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.000"
                                            },
                                            "Text": {
                                                "val": "-  Perform CONOPS and systems architecture trade studies in the areas of unmanned user interfaces, controls, engineering and perception as well as sensors, weaponry and support technology for soldier sensing, targeting and response.\n-  Develop a simulation environment to allow for an overarching iterative design process.\n-  Implement a testbed that leverages breakthroughs from existing program efforts to allow assessments of new technologies.\n-  Initiate technology development efforts in the areas of situational awareness, command & control and squad effects.\n-  Exercise developed technology via the IS2 testbed and simulation environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.000"
                                            },
                                            "Text": {
                                                "val": "-  Refine technology development efforts, focusing on enhanced sensor capabilities, full immersion soldier display units, and content distribution.\n-  Leverage IS2 testbed and simulation environments to iteratively refine developed technology and architecture scheme.\n-  Initiate a full system integration effort utilizing most promising technologies from the IS2 testbed and simulation evaluations with the goal of live experimentation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Medium Caliber Precision Weapons (MCPW)"
                                    },
                                    "Description": {
                                        "val": "The Medium Caliber Precision Weapons (MCPW) program will validate the premise that high precision extended range (1-10 km) direct fire medium caliber cannons can enable smaller combat fighting vehicles and advanced shipboard flexible engagement cannons for ground and naval applications.  Lethal direct fire overmatch requires larger cannons and larger vehicles to overcome threat armor systems.  MCPW will provide a very precise medium caliber capability to neutralize threat combat vehicles with precision vs. penetration.  MCPW will enable smaller very capable combat vehicles, changing the ground vehicle requirement for larger vehicles to support larger cannons.  The technologies will also support shipboard precision engagement against \"go fast boats\" and other maneuvering lower tier naval threats."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.232"
                                            },
                                            "Text": {
                                                "val": "-  Conduct systems architecture trades and cost studies.\n-  Initiate design studies of candidate weapons systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.000"
                                            },
                                            "Text": {
                                                "val": "-  Initiate technology development efforts focusing on guidance, packaging and delivery method.\n-  Initiate test cycle to refine system metrics tied to reliability and precision.\n-  Engage involvement from potential transition partners early in process to ensure feedback is integrated into system design.\n-  Begin examining candidate platforms for out-year live-fire tests."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Robotics Fast Track"
                                    },
                                    "Description": {
                                        "val": "To be dominant in robotics of the future, the DoD will need to embrace programs designed to create disruptive advances in robotics capabilities that are measured in months rather than years, and whose individual costs may largely be measured in thousands of dollars rather than millions.  The Robotics Fast Track program seeks to revolutionize robotics technologies by promoting non-traditional technical opportunities.  The program will create low-cost, high-utility robotic component solutions by engaging a novel performer community in research efforts that result in prototype systems and proofs of concept in months, at a fraction of the cost of traditional design processes.  The Robotics Fast Track program will engage numerous robotics related efforts across the spectrum of robotics professionals and enthusiasts, extending the existing performer base to include non-standard, cutting edge organizations and individuals throughout the robotics community.  The program will demonstrate the ability for robotics projects to be performed at an asymmetric advantage in time, cost, and contribution of the efforts in comparison to more traditional applied research areas.  This will apply to both performance of individual efforts and to the contracting required to engage performers in said efforts."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.000"
                                            },
                                            "Text": {
                                                "val": "-  Begin outreach with nontraditional performer community.\n-  Baseline fundamental robotic system and subsystem needs.\n-  Begin execution of multiple performance developments\n-  Initial release of robotics fast track catalog."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TT-06"
                    },
                    "ProjectTitle": {
                        "val": "ADVANCED TACTICAL TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "19.336"
                        },
                        "CurrentYear": {
                            "val": "16.045"
                        },
                        "BudgetYearOne": {
                            "val": "23.329"
                        },
                        "BudgetYearOneBase": {
                            "val": "23.329"
                        },
                        "BudgetYearTwo": {
                            "val": "36.773"
                        },
                        "BudgetYearThree": {
                            "val": "52.542"
                        },
                        "BudgetYearFour": {
                            "val": "53.603"
                        },
                        "BudgetYearFive": {
                            "val": "64.443"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project focuses on broad technology areas including: a) compact, efficient, frequency-agile, diode-pumped, solid-state lasers for infrared countermeasures, laser radar, holographic laser sensors, communications, and high-power laser applications; and b) new tactical systems for enhanced air vehicle survivability, precision optics, electronic warfare, and advanced air breathing weapons."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Endurance"
                                    },
                                    "Description": {
                                        "val": "The Endurance program will develop technology for pod-mounted lasers to protect a variety of airborne platforms from emerging and legacy electro-optical\/infrared (EO\/IR) guided surface-to-air missiles.  The focus of the Endurance effort under TT-06 will be on miniaturizing component technologies, developing high-precision target tracking, identification, and lightweight agile beam control to support target engagement.  The program will also focus on the phenomenology of laser-target interactions and associated threat vulnerabilities.  This program is leveraging technology developed in the Excalibur program and conducting applied research in support of the 6.3 funded Endurance program budgeted in PE 0603739E, Project MT-15."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.336"
                                            },
                                            "Text": {
                                                "val": "-  Developed preliminary designs for an objective brassboard system.\n-  Completed critical designs of subsystems: size, weight and required power of brassboard laser weapon system estimated.\n-  Built detailed sub-system models and identified risk elements, determined parameters for system success under operational stressors."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.545"
                                            },
                                            "Text": {
                                                "val": "-  Identify the physical interactions impacting testing and their expected effect on the capture of testing metrics.\n-  Continue design for the objective brassboard system within form, fit, function, and operational parameters of an objective flight-prototype.\n-  Develop plans for laser effects testing including the identification of suitable test articles."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.129"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.129"
                                            },
                                            "Text": {
                                                "val": "-  Complete design of the objective brassboard within form, fit, function, and operational parameters of an objective flight prototype."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "International Space Station SPHERES Integrated Research Experiments (InSPIRE)"
                                    },
                                    "Description": {
                                        "val": "The International Space Station SPHERES Integrated Research Experiments (InSPIRE) program will utilize the DARPA-sponsored Synchronized Position, Hold, Engage, and Reorient Experimental Satellites (SPHERES) platform, which has flown onboard the International Space Station (ISS) since May 2006, to perform a series of multi-body formation flight experiments that necessitate a medium-duration zero-gravity environment.  InSPIRE will enhance the ability to rapidly mature and insert new technologies into national security space assets.  The InSPIRE program expands on the capabilities matured through SPHERES by developing, building and launching new hardware and software elements that expand the baseline capabilities.  These capabilities enable use of SPHERES as a testbed for more complex experimentation, providing affordable opportunities to test new space technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "-  Conducted second Zero Robotics competition.\n-  Launched electromagnetic formation flight hardware to the ISS and began testing.\n-  Upgraded online SPHERES simulation to incorporate addition of vision-based navigation hardware.\n-  Designed and prototyped docking port for SPHERES."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.500"
                                            },
                                            "Text": {
                                                "val": "-  Build and launch docking ports for SPHERES to enhance rendezvous and docking test capabilities.\n-  Build and launch structures for SPHERES that expand upon its ability to integrate with additional hardware.\n-  Conduct testing of tele-operations capabilities on the SPHERES devices on ISS, from the ground.\n-  Develop and execute additional rendezvous and proximity operations experiments using SPHERES inside ISS."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.200"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.200"
                                            },
                                            "Text": {
                                                "val": "-  Conduct on-orbit testing of new SPHERES docking ports and structures."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "LUSTER (Laser Ultraviolet Sources for Tactical Efficient Raman)"
                                    },
                                    "Description": {
                                        "val": "The Laser UV Sources for Tactical Efficient Raman (LUSTER) program is developing a compact semiconductor laser that emits in the deep UV (i.e. wavelength <250 nanometers) and is capable of an output power of 1 Watt with high efficiency and spectral purity suitable for a wide array of spectroscopy applications. Such an achievement will represent a significant advance over the state of the art, as existing lasers in this wavelength range are bulky, highly inefficient, and expensive, as there are no available semiconductor lasers that can emit in the UV range <250nm. LUSTER will leverage lessons learned in growing high quality light emitting material from the Compact Mid-Ultraviolet Technology (CMUVT) program. The compact size of semiconductor lasers along with the LUSTER performance goals will enable many applications including but not limited to standoff Raman spectroscopy which is of interest for DoD applications such as chemical agent sensing."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.000"
                                            },
                                            "Text": {
                                                "val": "-  Evaluate the design and growth of laser epitaxial material, focusing on low-defect growth, optimal electrical and optical confinement and methods for high efficiency and power operation.\n-  Evaluate development of laser pumping technologies, such as the use of compact electron-beam sources.\n-  Evaluate methods for using non-linear crystals to efficiently convert longer wavelength lasers in the 500 nanometer range down to the 250 nanometer range."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TT-07"
                    },
                    "ProjectTitle": {
                        "val": "AERONAUTICS TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "40.509"
                        },
                        "CurrentYear": {
                            "val": "31.026"
                        },
                        "BudgetYearOne": {
                            "val": "61.126"
                        },
                        "BudgetYearOneBase": {
                            "val": "61.126"
                        },
                        "BudgetYearTwo": {
                            "val": "54.371"
                        },
                        "BudgetYearThree": {
                            "val": "61.942"
                        },
                        "BudgetYearFour": {
                            "val": "56.361"
                        },
                        "BudgetYearFive": {
                            "val": "63.245"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Aeronautics Technology efforts will address high payoff opportunities that dramatically reduce costs associated with advanced aeronautical systems and\/or provide revolutionary new system capabilities for satisfying current and projected military mission requirements.  This includes advanced technology studies of revolutionary propulsion and vehicle concepts, sophisticated fabrication methods, and examination of novel materials for aeronautic system applications."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Vertical Take-Off and Landing (VTOL) Technology Demonstrator"
                                    },
                                    "Description": {
                                        "val": "The Vertical Take-Off and Landing (VTOL) Technology Demonstrator program will demonstrate revolutionary improvements in (heavier than air) VTOL air vehicle capabilities and efficiencies through the development of subsystem and component technologies, aircraft configurations and system integration.  The program will build and flight test a manned or unmanned 10,000 - 12,000 lb aircraft capable of sustained speeds in excess of 300 kt, demonstrate system level hover efficiency within 25% of the ideal, and a lift-to-drag ratio no less than ten.  Additionally, the demonstrator will be designed to have a useful load of no less than 40% of the gross weight.  A strong emphasis will be placed on the development of elegant, multi-functional subsystem technologies that demonstrate net improvements in aircraft efficiencies to enable new and vastly improved operational capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.908"
                                            },
                                            "Text": {
                                                "val": "-  Performed complex simulations to baseline expected aircraft performance, validated system concepts and established development plans for underlying technologies.\n-  Defined and initiated design iterations, propulsion system requirements, trade studies, and technology evaluation approaches.\n-  Defined flight test objectives, test approach and test verification and validation requirements and approach.\n-  Defined software and hardware integration approach and baseline controls necessary for successful air vehicle concept."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "21.026"
                                            },
                                            "Text": {
                                                "val": "-  Define key technologies and verify performance capabilities.\n-  Understand and evaluate technical and programmatic risk elements, define mitigation plans and analyses of alternatives.\n-  Complete conceptual design of configurations and all subsystems.\n-  Initiate preliminary design of configuration and all subsystems.\n-  Hold system definition reviews to evaluate subsystem integration into air vehicle design and technology development paths to meet program objectives.\n-  Perform simulations to establish expected system level performance and validate the system concept and underlying enabling technologies.\n-  Define software and hardware integration approach and baseline controls necessary for successful air vehicle concept.\n-  Perform trade studies to refine configuration and subsystem designs.\n-  Evaluate performance capabilities, and conduct objective aircraft operational analyses.\n-  Refine and consolidate flight test and validation approaches, flight test missions, and test range requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "36.126"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "36.126"
                                            },
                                            "Text": {
                                                "val": "-  Perform subscale wind tunnel and laboratory testing for aerodynamic data base and flight controls development.\n-  Refine power generation and distribution\/integration concepts.\n-  Perform propulsion and power system scaled model bench testing.\n-  Design and develop subscale flight models for configuration viability and control law validation.\t\n-  Validate computational performance predictions against empirical data.\n-  Refine full scale engine integration design.\n-  Continue preliminary design refinements leading toward detailed design of the demonstrator aircraft and associated subsystems.\n-  Create detailed system integration plans.\n-  Prepare detailed airworthiness and flight test preparation requirements in support of flight test schedule.\n-  Complete preliminary design of all subsystems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Aeronautics Technologies"
                                    },
                                    "Description": {
                                        "val": "The Advanced Aeronautics Technologies program will examine and evaluate aeronautical technologies and concepts through applied research.  These may include feasibility studies of novel or emergent materials, devices and tactics for both fixed and rotary wing air vehicle applications, as well as manufacturing and implementation approaches.  The areas of interest range from propulsion to control techniques to solutions for aeronautic mission requirements.  The result of these studies may lead to the design, development and improvement of prototypes."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Continued to perform evaluation studies of emergent technologies.\n-  Conducted performance trade analyses for a tactical strike weapon concept.\n-  Conducted testing of enabling technology components."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "-  Perform testing of enabling technology components.\n-  Initiate conceptual system designs.\n-  Develop technology maturation plan and risk reduction strategy."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "-  Initiate new studies of novel technologies.\n-  Conduct risk reduction tests of candidate technologies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Petrel"
                                    },
                                    "Description": {
                                        "val": "The Petrel program will investigate and develop advanced capabilities for the rapid transport of large quantities of cargo and equipment, such as in support of the deployment of a heavy brigade combat team, from CONUS to the battlefield, reducing the deployment timeline for mechanized land forces and critical supplies anywhere in the world to under 7 days at a price point comparable or slightly in excess of conventional sealift.  Petrel will fill the niche between conventional airlift and sealift through development of a new transportation mode capable of high speed operation across the surface\/air interface over water as well as terrain.  Technical approaches for rapid transport across the ocean and movement from the ship to the tactical battlefield will consider traditional and non-traditional aerodynamic and hydrodynamic concepts as well as innovative uses of existing technologies.  Primary technical goals for Petrel are to reduce or eliminate intermodal delays and to achieve a transport efficiency better than $0.1\/ton-mi."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "-  Conduct studies to refine the operational trade space, define limits of current technology, and inform new technical approaches.\n-  Initiate concept designs focusing on transport efficiency, speed, and producibility."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "-  Investigate component technologies with potential to enable specific concepts, including advanced propulsion and materials.\n-  Explore innovative approaches for significantly increasing lift to drag ratio.\n-  Evaluate approaches to rapidly deliver cargo and equipment directly from offshore to the battlefield without infrastructure."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aircrew Labor In-cockpit Automation System (ALIAS)*"
                                    },
                                    "Description": {
                                        "val": "*Formerly Adaptive Integrated Reliability\n\nThe Aircrew Labor In-cockpit Automation System (ALIAS) program, previously funded in PE 0602303E, Project IT-02, will design, develop, and demonstrate a kit enabling affordable, rapid automation of selected aircrew functions across a broad range of aircraft.  ALIAS intends to enable reduction of aircrew workload and\/or the number of onboard aircrew, to improve performance.  The program will develop hardware and software to automate select aircrew functions and will employ novel, low impact approaches to interfacing with existing aircraft monitoring and control systems.  The program will also develop tractable approaches to rapidly capture crew-station specific skills and aircraft unique behaviors.  To accomplish this, ALIAS will leverage recent advances in perception, manipulation, machine learning, reusable software architectures, autonomous systems architecture, and verification and validation.  ALIAS will culminate in a demonstration of the ability to rapidly adapt a single system to two aircraft and execute simple missions.  This reliability enhancement capability will enable new operational concepts for reuse of existing air assets and allow a reduction in the number of aircrew required."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Execute a ground-based proof of concept study refining an approach to crew station interfacing.\n-  Initiate development of core crew station technologies.\n-  Initiate development of adaptable learning approaches."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.000"
                                            },
                                            "Text": {
                                                "val": "-  Design and commence prototyping of an initial ground-based ALIAS system.\n-  Initiate simulator-based demonstration of complete automation system including training and adaptation of system to multiple crew member roles.\n-  Initiate planning for flight demonstration of system adaptation and mission execution."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Swarm Challenge"
                                    },
                                    "Description": {
                                        "val": "The goal of the Swarm Challenge is to develop autonomous swarming algorithms for Unmanned Vehicle (UxVs) to augment ground troops performing missions in a complex environment, without creating a significant cognitive burden.  The program will evaluate the effectiveness of swarming for UxVs supporting ground operations, air operations, maritime operations, undersea operations, or search and rescue operations.  Challenges include the ability for the UxV to collaborate to rapidly survey an area leveraging other UxVs to solve problems related to, for example, perception, decision making, or obstacle clearing.  The challenge emphasizes minimum operator training and supervision so that the operator can continue to perform his\/her normal duties while using UxVs as force multipliers."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Perform trade studies for system approach, functional and cognitive decomposition. \n-  Select architecture for software, communication, computation, perception, and simulation environment. \n-  Procure hardware and modify to enable demonstration of autonomy algorithms. \n-  Develop autonomous algorithms and associated software. \n-  Initiate first round of evaluation in simulated environment and then in physical environment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mission Adaptive Rotor (MAR)"
                                    },
                                    "Description": {
                                        "val": "The Mission Adaptive Rotor (MAR) program sought to develop and demonstrate the capability to achieve dramatic improvements in rotor performance, survivability, and availability through the use of technologies that enable adaptation of the rotor throughout military missions and\/or mission segments and applications of advanced manufacturing technologies to reduce part counts and improve dynamic behavior.  The MAR program designed, tested, and matured active rotor technologies, facilitating the development of advanced technologies for application to future vertical take-off and landing (VTOL) class platforms capable of high cruise speed and efficient hover."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.641"
                                            },
                                            "Text": {
                                                "val": "-  Completed fabrication design of retreating side blowing concepts for full-scale rotor blades to improve high speed flight capabilities and maneuver margins, initially applicable to utility class helicopters, but relevant to all edgewise flight rotorcraft.\n-  Completed design of high solidity, co-rotating proprotor for tilt rotor applications to enable improved high altitude flight and reduced power consumption.\n-  Conducted analyses, simulations and subscale wind tunnel and ground-based testing of key rotor technologies to meet MAR objectives.\n-  Designed, simulated and performed micro scale ground tests of robotic landing gear for rotorcraft to enable uneven terrain and enhanced ship based operations.\n-  Performed analysis and simulations of advanced VTOL configurations including fan-in-wing for sizing studies and military utility analysis.\n-  Performed analyses and wind tunnel testing of a fan-in-wing concept to understand the flow field and possibilities of using the fan as an aerodynamic fairing.\n-  Completed proprotor hover test and data analysis.\n-  Completed robotic landing gear technology suite and scaled demonstration on flight test model rotorcraft."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aerial Reconfigurable Embedded System (ARES)*"
                                    },
                                    "Description": {
                                        "val": "*Formerly Transformer (TX) Vehicle\n\nCurrent and future land and ship-to-shore operations will require rapid and distributed employment of U.S. forces on the battlefield.  The Aerial Reconfigurable Embedded System (ARES) program will develop a vertical take-off and landing (VTOL), modular unmanned air vehicle that can carry a 3,000 lb useful load at a range of 250 nautical miles on a single tank of fuel.  ARES will enable distributed operations and access to compact, high altitude landing zones to reduce warfighter exposure to hostile threats and bypass ground obstructions.  ARES modular capability allows for different mission modules to be quickly deployed at the company level.  This enables the flexible employment of the following capabilities: cargo resupply, casualty evacuation, reconnaissance, weapons platforms, and other types of operations.  The enabling technologies of interest include adaptive wing structures, ducted fan propulsion system, lightweight materials, and advanced flight controls for stable transition from vertical to horizontal flight.  Additionally, the program will explore new adaptable landing gear concepts to enable operations from irregular landing zones and moving launch\/recovery platforms.  ARES vehicles could be dispatched for downed airman recovery, for evacuating injured personnel from difficult-to-access locations, or to resupply isolated small units.  ARES is well suited for enhanced company operations concepts which would provide the warfighter\/team increased situational awareness for operations in an urban environment.  Beginning in FY14, this program will be funded from PE 0603286E, Project AIR-01."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.960"
                                            },
                                            "Text": {
                                                "val": "-  Finalized analysis, trade studies, and prototype vehicle element designs to meet the program measures of performance.\n-  Conducted powered wind tunnel testing to increase the fidelity of flight control system development and verified vehicle performance simulations, showing feasibility and function of the design.\n-  Conducted key component tests demonstrating feasibility and function.\n-  Conducted component hardware-in-the-loop testing to ensure successful integration of prototype vehicle subsystems.\n-  Prepared draft test plans for ground and flight test demonstration."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TT-13"
                    },
                    "ProjectTitle": {
                        "val": "NETWORK CENTRIC ENABLING TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "72.508"
                        },
                        "CurrentYear": {
                            "val": "80.602"
                        },
                        "BudgetYearOne": {
                            "val": "116.345"
                        },
                        "BudgetYearOneBase": {
                            "val": "116.345"
                        },
                        "BudgetYearTwo": {
                            "val": "129.333"
                        },
                        "BudgetYearThree": {
                            "val": "115.210"
                        },
                        "BudgetYearFour": {
                            "val": "114.300"
                        },
                        "BudgetYearFive": {
                            "val": "109.315"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Network Centric Enabling Technology project develops network-centric mission applications that integrate information arising from: 1) sensors and signal\/image processors; 2) collection platforms and weapon systems; 3) intelligence networks; and 4) open and other external sources.  Technical challenges include the need to process huge volumes of diverse, incomplete, and uncertain data streams in tactically-relevant timeframes.  Processing here includes a number of critical steps including conditioning of unstructured data, content analysis, behavioral modeling, pattern-of-life characterization, economic activity analysis, social network analysis, anomaly detection, and visualization.  Operational benefits include deeper understanding of the evolving operational environment tailored to the needs of commanders at every echelon.  Promising technologies are evaluated in the laboratory and demonstrated in the field to facilitate transition."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "XDATA"
                                    },
                                    "Description": {
                                        "val": "The XDATA program seeks to develop computational techniques and software tools for analyzing large volumes of data, both semi-structured (e.g., tabular, relational, categorical, metadata, spreadsheets) and unstructured (e.g., text documents, message traffic).  Central challenges to be addressed include a) developing scalable algorithms for processing imperfect data in distributed data stores, and b) creating effective human-computer interaction tools for facilitating rapidly customizable visual reasoning for diverse missions.  The program will develop open source software toolkits that enable flexible software development supporting users processing large volumes of data in timelines commensurate with mission workflows of targeted defense applications.  An XDATA framework will support minimization of design-to-deployment time of new analytic and visualization technologies on diverse distributed computing platforms, and also accommodate changing problem spaces and collaborative environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.275"
                                            },
                                            "Text": {
                                                "val": "-  Explored scalable methods for processing vast amounts of incomplete and imperfect data.\n-  Developed a baseline of open source analytics and visualization technologies for large data processing.\n-  Initiated development of a framework for workflow characterization and rapid composition of large data processing systems with advanced analytics and visualization for diverse missions and platforms.\n-  Demonstrated proof-of-concept system on sample open source data.\n-  Engaged DoD and other government stakeholders for feedback on proof-of-concept prototypes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "25.800"
                                            },
                                            "Text": {
                                                "val": "-  Develop a framework for processing data from diverse sources with advanced analytics and visualization for diverse missions and platforms.\n-  Develop and demonstrate analytic tools for temporal and pattern analysis on petabyte scale.\n-  Initiate methods for uncertainty representation, processing, propagation, and visualization.\n-  Develop methods for dimensionality reduction for faster approximate processing with characterized accuracy.\n-  Develop adaptive visualization methods for large data for varying users and contexts.\n-  Develop an integrated framework for rapidly implementing analytics on a given computational platform with the ability to systematically trade off processing time and accuracy.\n-  Demonstrate end-to-end systems in transactional problem domains from multiple defense mission areas."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "38.817"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "38.817"
                                            },
                                            "Text": {
                                                "val": "-  Develop methods for interactive, iterative, and distributed analysis of diverse data at exabyte scale.\n-  Optimize analytic methods and software for implementation on heterogeneous platforms and operating environments.\n-  Optimize visualization technology to rapidly adapt to a new mission and context.\n-  Demonstrate the initial implementation of a rich library of software tools for rapid use in mission and user specific contexts.\n-  Demonstrate end-to-end systems on data and problems of end users from DoD (Army, SOCOM, Air Force, and Navy), intelligence, and law enforcement communities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Visual Media Reasoning (VMR)"
                                    },
                                    "Description": {
                                        "val": "The Visual Media Reasoning (VMR) program will create technologies to automate the analysis of enemy-recorded photos and videos and identify, within minutes, key information related to the content.  This will include the identification of individuals within the image (who), the enumeration of the objects within the image and their attributes (what), and the image's geospatial location and time frame (where and when).  Large data stores of enemy photos and video are available but cannot be easily leveraged by a warfighter or analyst attempting to understand a specific new image in a timely fashion.  The VMR program will enable users to gain insights rapidly through application of highly parallelized image analysis techniques that can process the imagery in massive distributed image stores.  VMR technology will serve as a force-multiplier by rapidly and automatically extracting tactically relevant information and alerting the analyst to scenes that warrant the analyst's expert attention."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.482"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated a cloud-based reasoning engine which fuses the outputs of over 35 disparate computer vision algorithms to improve the quality of image query results.\n-  Refined the user interface as well as the accuracy and performance of the system based on warfighter\/analyst user group input.\n-  Developed an image database indexing scheme that enables the fast, efficient search of a dataset of approximately one million images.\n-  Delivered a VMR experimental prototype that allows users to query by example and returns clusters of similar images for evaluation by the FBI."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.000"
                                            },
                                            "Text": {
                                                "val": "-  Optimize the core reasoning engine to make reliable inferences across the Who, What, Where and When domains to produce more accurate answers to warfighter and intelligence analyst queries.\n-  Refine query by example to achieve levels of accuracy, precision, and reliability that satisfy potential transition partner needs.\n-  Extend indexing to video clips.\n-  Enhance detection of the geo-physical content of images: water, desert, urban, interior, etc.\n-  Implement preprocessing of poor-quality images (e.g., motion blur, contrast, intensity) to improve query results.\n-  Deliver an experimental prototype for evaluation by the National Media Exploitation Center (NMEC) as a potential transition partner."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.304"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.304"
                                            },
                                            "Text": {
                                                "val": "-  Configure the reasoning engine so the user can customize selected reasoning assumptions, such as typical vehicle size, to enhance query results for specific applications.\n-  Include mechanisms for technical users to add new computer vision algorithms to the system.\n-  Provide a quantified level of performance to show the advantage of multi-algorithm reasoning versus a single-algorithm approach.\n-  Deliver robust full-featured prototypes to NMEC and the FBI as transition products.\n-  Make selected enabling components of the system available to the public research community."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Network Defense"
                                    },
                                    "Description": {
                                        "val": "The Network Defense program will develop technologies to detect network attacks using network summary data. U.S. computer networks are continually under attack, and these attacks are typically handled by individual organizations as they occur.  Analyzing network summary data across a wide array of networks will make it possible to identify trends and patterns visible only when the data is viewed as a whole and to detect recurring threats, patterns of activity, and persistent vulnerabilities.  Network Defense will develop novel algorithms and analysis tools that enable a big picture approach for identifying illicit behavior in networks.  This analysis and subsequent feedback to system administrators, security engineers, and decision makers will enhance information security in both the government and commercial sectors.  The Network Defense program expands on research originally programmed under the Nexus 7 program in this Project."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop analytics that detect structured network attacks within a single network.\n-  Develop tailored algorithms to detect recurring threats on a single network.\n-  Create a corpus of realistic benign and threat network data for test and evaluation of candidate techniques."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "28.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "28.000"
                                            },
                                            "Text": {
                                                "val": "-  Enhance network analytics to detect structured attacks across multiple networks.\n-  Create general purpose algorithms for detecting novel classes of attacks across multiple networks.\n-  Develop methods for identifying persistent vulnerabilities within a network and across multiple networks.\n-  Evaluate and optimize techniques on realistic network data."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Distributed Battle Management*"
                                    },
                                    "Description": {
                                        "val": "*Formerly Manned-Unmanned Collaborative Autonomy\n\nThe Distributed Battle Management program will develop mission-driven architectures, protocols, and algorithms for battle management in the contested environment.  The military is turning to networked weapons and sensors on-board a heterogeneous mix of multi-purpose manned and unmanned systems.  In contested environments, it is a challenge for command and control (C2) networks to communicate with subordinate platforms due to extensive adversarial cyber and electronic warfare operations, anti-satellite attacks, and the need for emissions control in the face of a formidable integrated air defense system.  The Distributed Battle Management program will seek to develop a distributed command architecture with decentralized control of mission-focused asset teams.  The architecture will enable rapid reaction to ephemeral engagement opportunities and maintain a reliable C2 structure, despite limited communications and platform attrition in continuously evolving threat environments.  The program will incorporate highly automated decision making capability while maintaining vital human-on-the-loop operator approval."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop architecture and concept of operations (CONOPS) for teams of manned and unmanned platforms coordinating to accomplish a mission in a denied environment.\n-  Develop a simulation environment in parallel with technology development.\n-  Develop detailed requirements and initiate system engineering for a mission-focused team-level distributed battle management system intended to operate in the denied environment.\n-  Explore and evaluate alternative architectures and cooperative control algorithms for team-level autonomy in a denied environment, as well as approaches for interacting with a human operator, and options for inserting software in operational platforms."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.024"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.024"
                                            },
                                            "Text": {
                                                "val": "-  Develop detailed system architecture for the distributed battle management system.\n-  Develop workflow and CONOPS for the human operator to interact with the battle management system.\n-  Develop and prototype the protocols and algorithms for distributed battle management in a denied environment.\n-  Stand-up modeling and simulation capability for test and performance evaluation and begin testing of prototype architecture and algorithms."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Quantitative Global Analytics"
                                    },
                                    "Description": {
                                        "val": "The Quantitative Global Analytics program will develop and integrate big data analysis technologies to enable commanders to detect dangerous trends and anticipate global events.  In recent years we have seen how resource scarcity for necessities such as water and food can displace populations, destabilize nation-states, and precipitate global instability.  Such ethnic, political, societal, economic, and environmental stresses can often be observed in advance through open source economic and financial indicators, as expressed in market activities.  Market prices and volatility, which can be influenced by factors affecting production, transshipment, and\/or delivery, may also provide signals in advance of disruptive events.  Theoretically these signals can be a source of actionable information, but in practice it is difficult to generate useful intelligence due to the confounding effects of spurious signals and random noise.  The Quantitative Global Analytics program will combine quantitative analysis of global and regional economic and financial data with natural language processing, social network analysis, computational social science, and climate studies to filter out such confounding effects to produce real-time intelligence from a wide variety of international open source data.  The technologies developed in the Quantitative Global Analytics program will enhance situational awareness and generate indications and warning for new classes of cyber-social-economic-environmental threats."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop spatial stochastic models for cyber-social-economic-environmental data.\n-  Incorporate computational social science, economic, and climate models in quantitative intelligence schemes based on market and financial data, social network data, and open source media.\n-  Develop global and regional data sets for testing quantitative intelligence schemes for measuring trends\/predicting events having a military or security dimension."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Memex"
                                    },
                                    "Description": {
                                        "val": "The Memex program will develop the next generation of search technologies to revolutionize the discovery, organization, and presentation of domain-specific content.  Current search technologies have limitations in search query format, retrieved content organization, and infrastructure support and the iterative search process they enable is time-consuming and inefficient, typically finding only a fraction of the available information.  Memex will create a new domain-specific search paradigm to discover relevant content and organize it in ways that are more immediately useful to specific missions and tasks.  In addition, Memex domain-specific search engines will extend the reach of current search capabilities to the deep web and non-traditional content.  Memex technologies will enable the military, government, and commercial enterprises to find and organize mission-critical information on the Internet and in large intelligence repositories.  Anticipated mission areas include counter-terrorism, counter-drug, anti-money-laundering, and anti-human-trafficking, with transition partners from DoD and other U.S. government activities.  The Memex program expands on research originally programmed under the Nexus 7 program in this project."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "-  Conceptualize and design new search architectures to support domain-specific search in high priority mission areas."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.200"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.200"
                                            },
                                            "Text": {
                                                "val": "-  Develop domain-specific search engines to automatically discover, access, retrieve\/extract, parse, process, analyze, and manage web content in specified domains.\n-  Implement the capability to index deep web and non-traditional structured and unstructured content that is dynamically-generated, unlinked, and in unconventional formats.\n-  Develop information extraction techniques to categorize and classify discovered content based on mission\/user task requirements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Nexus 7"
                                    },
                                    "Description": {
                                        "val": "The Nexus 7 program applies forecasting, data extraction, and analysis methodologies to develop tools, techniques, and frameworks for the automated interpretation, quantitative analysis, and visualization of social networks.  Social network theory has emerged in recent years as a promising approach for understanding groups of individuals connected through a variety of shared interests and collaborative activities.  For the military, social networks provide a promising model for understanding terrorist cells, insurgent groups, and other stateless actors whose connectedness is established not on the basis of shared geography but rather through the correlation of their participation in coordinated activities such as planning meetings, training\/mission rehearsal sessions, sharing of materiel\/funds transfers, etc.  Nexus 7 supports emerging military missions using both traditional and non-traditional data sources for those areas of the world and mission sets with limited conventional Intelligence, Surveillance and Reconnaissance.  Examples of additional data sources include foreign news, media, and social network data.  These non-traditional sources will be integrated with a wide variety of military structured and unstructured data.  Nexus 7 will develop quantitative techniques and tools for processing and analyzing these large data sources as a means for understanding relationships between hostile, neutral, and friendly foreign organizations with the United States."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "26.975"
                                            },
                                            "Text": {
                                                "val": "-  Provided additional quick-response reach-back analytic capability to forward command echelons.\n-  Extended algorithms, tools, and methodologies addressing new datasets and new formats applicable to other national security interests and provided analytical tool suites to users as requested.\n-  Developed techniques for processing timely, relevant information from traditional and non-traditional data streams that may be incomplete and\/or inaccurate.\n-  Transitioned enhanced algorithms, software, and analytical tool suites throughout DoD including the Army Tactical Cloud Integration Laboratory (TCIL) and SOCOM.\n-  Recognized for providing a framework that provided unique and valuable insights against key strategic and operational questions in DARPA's receipt of the Joint Meritorious Unit Award for establishment of the DARPA Forward Cell."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.802"
                                            },
                                            "Text": {
                                                "val": "-  Develop quantitative techniques and tools for processing, analyzing, and visualizing increasingly large volumes of cyber-social data.\n-  Create and deploy analytics for emerging DoD mission areas to Combatant Commands and other U.S. Government agencies.\n-  Complete drawdown of forward deployed analytical cell in Afghanistan.\n-  Transition suite of algorithms, software, and tools throughout DoD including DCGS-Army."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Extreme Accuracy Tasked Ordnance (EXACTO)"
                                    },
                                    "Description": {
                                        "val": "The Extreme Accuracy Tasked Ordnance (EXACTO) program demonstrated the ability to engage targets at extremely long ranges, regardless of target motion or crosswinds, with previously unachievable accuracy.  The EXACTO system is comprised of an advanced targeting optic, the first ever guided, power-generating, small caliber bullet, innovative guidance and control (G&C) software, and a conventional sniper rifle.  The EXACTO 50-caliber bullet and brass-board optical sighting technology greatly extends the day and night ranges over current state-of-the-art sniper systems allowing sniper teams to engage tactically important moving targets including accelerating vehicle-borne targets, in high crosswind conditions.  EXACTO enhances survivability by allowing greater shooter standoff range and reduced target engagement timelines.  The technologies developed within the EXACTO program could also enable development of larger caliber guided lethality solutions, and enhanced Naval ship self-protection."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated in-flight maneuvers during live-fire testing.\n-  Updated functionality of targeting optic.\n-  Improved reliability of bullet aerodynamic performance.\n-  Demonstrated accurate tracking and aimpoint maintenance on moving targets.\n-  Improved system reliability and repeatability via live-fire testing.\n-  Updated bullet hardware and G&C software to enable accurate bullet control."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mind's Eye"
                                    },
                                    "Description": {
                                        "val": "The Mind's Eye program developed a machine-based capability to learn generative representations of action among actors and objects in a scene, directly from visual inputs, and then to reason over those learned representations.  Mind's Eye created the perceptual and cognitive underpinnings for reasoning about the action in scenes, enabling the generation of a narrative description of the action taking place in the visual field.  The technologies developed under Mind's Eye have applicability in automated ground-based surveillance systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.776"
                                            },
                                            "Text": {
                                                "val": "-  Developed selected visual intelligence capabilities for human activity detection and integrated these into two prototype smart camera systems.\n-  Developed visual analytics algorithms that detected different aspects of human activity and made the algorithms available for use by the wider computer vision community, including other government agencies, private industry, and academic researchers."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                }
            ]
        }
    }
}