{
    "id": "92b3e10d72ff0b16e539d255db2a79516073b4e8",
    "meta": {
        "filename": "dod-2015_RDTE_2015_AIRFORCE_V3B_RDTE_JustificationBook_Air_Force_PB_2015.zzz_unzipped_RDTE_JustificationBook_Air_Force_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0305206F"
        },
        "ProgramElementTitle": {
            "val": "Airborne Reconnaissance Systems"
        },
        "R1LineNumber": {
            "val": "212"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "88.199"
            },
            "CurrentYear": {
                "val": "47.155"
            },
            "BudgetYearOne": {
                "val": "28.113"
            },
            "BudgetYearOneBase": {
                "val": "28.113"
            },
            "BudgetYearTwo": {
                "val": "31.408"
            },
            "BudgetYearThree": {
                "val": "48.311"
            },
            "BudgetYearFour": {
                "val": "49.255"
            },
            "BudgetYearFive": {
                "val": "50.191"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Airborne Reconnaissance Systems program coordinates the development of advanced airborne reconnaissance system technologies (sensors, data links, targeting networks and products, and quick reaction capabilities) in support of multiple airborne reconnaissance platforms, both manned and unmanned.  Its objective is to develop, demonstrate, and rapidly transition advanced, interoperable, multi-platform solutions to reduce the find, fix, target, and track kill chain timeline.  In addition, it provides for modeling\/simulation, training and systems engineering.  This program also coordinates the development of common collection, processing, and dissemination solutions for near-real time Intelligence, Surveillance, and Reconnaissance (ISR). \n\nFunds in any project can also cover activities to include studies and analysis to support both current program planning and execution and future program planning.\n\nThis program is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "96.735"
                },
                "CurrentYear": {
                    "val": "37.828"
                },
                "BudgetYearOne": {
                    "val": "55.591"
                },
                "BudgetYearOneBase": {
                    "val": "55.591"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "88.199"
                },
                "CurrentYear": {
                    "val": "47.155"
                },
                "BudgetYearOne": {
                    "val": "28.113"
                },
                "BudgetYearOneBase": {
                    "val": "28.113"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-8.536"
                },
                "CurrentYear": {
                    "val": "9.327"
                },
                "BudgetYearOne": {
                    "val": "-27.478"
                },
                "BudgetYearOneBase": {
                    "val": "-27.478"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.128"
                    },
                    "CurrentYear": {
                        "val": "-0.673"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "10.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-8.408"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-27.478"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-27.478"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY13 Reduction in Other Adjustments was due to Sequestration. \n\nFY14 changes are due to Congressional Add and a general Congressional reduction.\n\nFY15 reductions due to higher Air Force priorities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "674818"
                    },
                    "ProjectTitle": {
                        "val": "Imaging and Targeting Support"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "26.410"
                        },
                        "CurrentYear": {
                            "val": "3.335"
                        },
                        "BudgetYearOne": {
                            "val": "20.633"
                        },
                        "BudgetYearOneBase": {
                            "val": "20.633"
                        },
                        "BudgetYearTwo": {
                            "val": "23.895"
                        },
                        "BudgetYearThree": {
                            "val": "13.609"
                        },
                        "BudgetYearFour": {
                            "val": "13.875"
                        },
                        "BudgetYearFive": {
                            "val": "14.140"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The purpose of the Imaging and Targeting Support (I&TS) program is to develop and demonstrate next-generation, persistent, wide area surveillance, aircraft avoidance, and common imagery reconnaissance sensor capabilities (radar and electro-optical systems), including sensor data processing, for multiple airborne platforms, as well as sensor products to aid in rapid targeting (geolocation models, sensor-based exploitation tools, sensor networking capabilities).  \n\nDevelopmental efforts pursued are improved sensor capabilities (such as hyperspectral imagery (HSI), measurement and signature intelligence (MASINT), polarimetric imaging, ground moving target indication, foliage penetration, and additional radar, electro-optical, and other modalities), increased geolocation accuracy, increased dismount detection capability, advanced sensor data correlation, automated target detection, network centric warfare, and other Intelligence, Surveillance, and Reconnaissance (ISR) and associated Tasking Processing Exploitation and Dissemination (TPED) capabilities, to reduce both target search and kill chain timelines, as well as supporting traditional intelligence activities. This project will also increase interoperability among developed systems by developing common standards and tools. \n\nThe funds in this project, less OCO and Congressional adds, are distributed in priority order for the goal of building a comprehensive Geospatial Intelligence (GEOINT) capability for the USAF. On an annual basis, developmental technologies are reviewed against warfighter capabilities and requirements based on strategic roadmaps.  Projects advancing the technological maturity of promising sensors and processing capabilities are reviewed and prioritized into a recommended list for senior executive direction to implement in the coming year.  \n\nTraditional focus areas include, but are not limited to: development and demonstration of common radar and electro-optical sensors (Synthetic Aperture Radar (SAR), Low Frequency SAR, and antenna, Electo-Optical (EO), Infrared (IR), HSI, Low Light, Laser Radar (LADAR), Light Detection And Ranging (LIDAR) and their operational modes (High Resolution Imagery, Moving Target Indication, Dismount Detection, Persistent Surveillance, Wide Area Motion Imagery, Spectral Identification) for multiple airborne platforms, including medium and high altitude platforms; development and demonstration of advanced tactical sensor and associated TPED processing algorithms and tools (automatic registration, automatic and assisted target detection, network centric warfare).  Development of integrated multi-sensor capabilities to detect and identify obscured targets (OT); development and implementation of imagery standards (Common Ground\/Dismount Moving Target Indicator (GMTI\/DMTI), National Imagery Transmission Format (NITF); and monitoring and enhancement of Imagery Intelligence (IMINT) product quality (radar and EO\/IR imagery, GMTI data, and spectral information) and timeliness throughout the image chain (from sensor to user).  These efforts focus on reducing the find, fix and track elements of the time critical targeting kill-chain timeline while improving operator and decision-maker efficiency and effectiveness.     \n\nActivities also include studies and analysis to support both current program planning and execution and future program planning.  Includes total government and contractor costs for this project."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Imaging & Targeting Support (I&TS)"
                                    },
                                    "Description": {
                                        "val": "Develop\/demonstrate and advance technical maturity of promising sensors and processing capabilities (ex: radar improvement, next-generation hyperspectral imaging (HSI), laser radar\/light detection and ranging (LADAR\/LIDAR), and data mitigation technologies)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.213"
                                            },
                                            "Text": {
                                                "val": "Continued development of advanced HSI focal plane array material, sensors, and detection algorithms, multiband electro optical\/infrared (EO\/IR) sensors, other geospatial intelligence(GEOINT) sensor modalities, high volume on-board data storage, hypertemporal EO technologies.  Updated the sensor library, and completed the High Altitude Long Range GEOINT Capabilities (HALRGC) and light detection and ranging (LIDAR) analyses and final reports.  Developed and modernized advanced synthetic aperture radar (SAR) sensors, both for demonstration in the combatant command (COCOM) area of responsibility and for future high-altitude applications. Matured common module spectrometer (HSI) technology.  Completed DB-110 demonstration. Completed development of Intelligence, Surveillance, and Reconnaissance (ISR) Testbed."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.335"
                                            },
                                            "Text": {
                                                "val": "Continue development of advanced HSI and radar sensors, and detection algorithms, multiband, multispectral EO\/IR sensors, other GEOINT sensor modalities, high volume on-board data storage, near real time on-board processing, hypertemporal EO, and advanced SAR\/LADAR technology.  Continue SAR and HSI sensor developments in support of high-altitude platforms.  Complete sensor library."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.633"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.633"
                                            },
                                            "Text": {
                                                "val": "Will develop\/demonstrate advanced HSI focal plane array material, sensors, and detection algorithms, multiband EO\/IR sensors, other GEOINT sensor modalities, and high volume on-board data storage.  Will enhance capabilities of airborne LIDAR. Will develop and modernize advanced SAR sensors, both for demonstration in the combatant command (COCOM) area of responsibility and for future high-altitude applications, Anti-Access Area Denial, and foliage penetration."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Wide Area Motion Imagery (WAMI)"
                                    },
                                    "Description": {
                                        "val": "This effort matures the development of various wide area airborne critical technology elements in support of Combatant Command requirements for end-to-end persistent surveillance. This includes the development of airborne sensor suites, processing, data links, and associated ground support elements for near real-time surveillance of city-sized areas. Includes total government and contractor costs for this project."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.661"
                                            },
                                            "Text": {
                                                "val": "Continued development of network communications and information dissemination.  Integrated next generation airborne processing with wide area sensors.  Continued studies, development, and testing of single and multi-INT wide area sensors.  Continued to operate and support a PSL for advanced persistent ISR technologies.  Includes total government and contractor costs for this project."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Synthetic Aperture Radar System (ASARS) 2B\/2C"
                                    },
                                    "Description": {
                                        "val": "Update Advanced Synthetic Aperture Radar System (ASARS) due to Diminishing Manufacturing Sources (DMS) issues and user identified capability gaps.  Includes total government and contractor costs for this project."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.536"
                                            },
                                            "Text": {
                                                "val": "Accomplish requirements analysis and preliminary design.  Includes total government and contractor costs for this project."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "RDTE:BA07: PE 0305202F"
                                    },
                                    "Title": {
                                        "val": "Dragon U-2 (JMIP)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "21.670"
                                        },
                                        "CurrentYear": {
                                            "val": "13.700"
                                        },
                                        "BudgetYearOne": {
                                            "val": "5.511"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "5.511"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "A portion of the funding within the U-2 RDTE line will be used to advance ASARS refurbishment and modernization and Common Module Spectrometer (HSI) technology maturation."
                        },
                        "AcquisitionStrategy": {
                            "val": "Acquisition strategy is to maximize commercial and national development efforts and investment through multiple contracting methods, including the use of Engineering Change Proposals (ECP) to modify existing contracts and new contracts that were awarded both competitively or on a sole source basis."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0305206F_BPAC_674818_0.jpg"
                                }
                            }
                        ]
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "675092"
                    },
                    "ProjectTitle": {
                        "val": "JTC\/SIL MUSE"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.159"
                        },
                        "CurrentYear": {
                            "val": "2.472"
                        },
                        "BudgetYearOne": {
                            "val": "3.934"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.934"
                        },
                        "BudgetYearTwo": {
                            "val": "3.998"
                        },
                        "BudgetYearThree": {
                            "val": "3.411"
                        },
                        "BudgetYearFour": {
                            "val": "3.478"
                        },
                        "BudgetYearFive": {
                            "val": "3.543"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Joint Technology Center\/Systems Integration Laboratory (JTC\/SIL) is a center of technical excellence to support Unmanned Aircraft Systems (UAS) programs within the services.  The mission includes Service-specific and Joint Command, Control, Communications, Computers and Intelligence, Surveillance, and Reconnaissance (C4ISR) programs throughout DoD. The JTC\/SIL provides a Government testbed for interoperability, rapid prototyping, technology insertion and transition, systems engineering, modeling\/simulation, training and C4ISR optimization. The cornerstone of JTC\/SIL's diverse tool set is the Multiple Unified Simulation Environment (MUSE), which is the DoD simulation\/training system of choice for many UAS and ISR systems. The MUSE is also known as the Air Force Synthetic Environment for Reconnaissance and Surveillance (AFSERS) in its Air Force application.  The MUSE\/AFSERS simulates Air Vehicles, Sensors, Datalinks, Takeoff and Landing Systems, and to some degree, surrogate UAS ground stations, when actual UAS ground stations are unavailable. \n\nThe Services and combatant commanders have a requirement for the capability to train with a system that provides a real-time simulation environment containing multiple intelligence systems that can be integrated with larger force-on-force simulations. The MUSE creates a realistic operational environment which supports the ability to assess military utility, architecture and concept of employment development, and Tactics, Techniques, and Procedures (TTP) refinement, conduct emerging concepts experimentation, and optimize C4ISR within warfighting exercises and experiments. It is the preferred simulation system used by the combatant commanders and Joint Services to support command and battle staff C4ISR training.\n\nThe MUSE\/AFSERS also creates a realistic operational environment that supports: an embedded training capability for multiple Program Managers; tools to minimize acquisition and life cycle cost and schedule impacts; ability to conduct emerging concepts experimentation, future systems exploration, systems integration, and technology insertion; applications for Joint and Service-specific warfighting exercises; and C4ISR optimization.\n\nMUSE\/AFSERS is currently in use within all Services and most unified commands simulating Predator, Reaper, Global Hawk, Gray Eagle, Hunter, and Shadow, national and commercial satellite collectors, P-3, JSTARS, and the U-2. During warfighting exercises, the JTC\/SIL integrates imagery simulations with associated C4ISR systems to support execution of critical imagery processes. For those assets normally not available for training, the JTC\/SIL provides surrogate systems and interfaces. Distributed training environments, virtually linking participants from various locations worldwide, are routinely supported within the MUSE architecture. The MUSE\/AFSERS is also used as a mission rehearsal tool for current, on-going military combat operations.\n\nThe JTC\/SIL supports the OSD UAS Task Force staff and the Standards and Interoperability Integrated Product Team, as well as the joint team working the Ground Segment Interface (GSI).  The JTC\/SIL is the primary custodian of this interface and in that role performs various supporting tasks including development of tools for helping the definition and execution of open architecture for joint service ground control systems, developing and maintaining standardization agreement (STANAG) 45 joint interoperability tasks to be defined on an annual basis.  \n\nActivities also include studies and analysis supporting current and future program planning and project execution."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Air Force Synthetic Environment for Reconnaissance and Surveillance (AFSERS) Development"
                                    },
                                    "Description": {
                                        "val": "DoD's simulation\/training system of choice for ISR systems, sensors, and platforms. Includes AFSERS, Common Ground Station Interface, and infrastructure support."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.159"
                                            },
                                            "Text": {
                                                "val": "Continued AFSERS development for MQ-9, including improvements to simulations of existing and emerging platforms and sensors as well as improvements in integrating AFSERS into other networks."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.172"
                                            },
                                            "Text": {
                                                "val": "Continue AFSERS development for MQ-9, and provide improvements to both simulate existing and emerging platforms and sensors and better integrate AFSERS into other networks."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.934"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.934"
                                            },
                                            "Text": {
                                                "val": "Will enhance the Multiple Unified Simulation Environment (MUSE) mission planning training software to facilitate ease of use, concurrency and interoperability with current mission planning application capabilities. Will enhance MUSE Service Oriented Architecture to support Cloud computing for US Air Force military exercises, to include Distributed Mission Operations Network (DMON) certification. Will further enhance MUSE interoperability with Air Force federations such as Air, Space, and Cyberspace Constructive Environment (ASCCE); joint,live, virtual, constructive (JLVC) training, and specific federate interfaces with the Air Force intelligence-operations simulation.  Will develop new ISR sensor simulation training capabilities to reflect Service Remotely Piloted Aircraft (RPA) emerging assets such as multi-sensor platforms. Will continue to develop and port applicable training software to be hosted on portable devices."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "OSD Interoperability Support"
                                    },
                                    "Description": {
                                        "val": "Joint Technology Center (JTC)\/Systems Integration Laboratory (SIL) support to OSD interoperability requirements. Air Force portion of joint funding requirement."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "Continued Air Force support to OSD interoperability efforts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.300"
                                            },
                                            "Text": {
                                                "val": "Continue Air Force support to OSD interoperability efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "Will continue Air Force support to OSD interoperability efforts, including support and configuration management of architecture products."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "RDTE: BA07: PE 0305204A"
                                    },
                                    "Title": {
                                        "val": "Tactical Unmanned Aerial Vehicles"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "4.321"
                                        },
                                        "CurrentYear": {
                                            "val": "3.283"
                                        },
                                        "BudgetYearOne": {
                                            "val": "4.695"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "4.695"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "4.516"
                                        },
                                        "BudgetYearThree": {
                                            "val": "4.141"
                                        },
                                        "BudgetYearFour": {
                                            "val": "4.760"
                                        },
                                        "BudgetYearFive": {
                                            "val": "4.867"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTE: BA07: PE 0603261N"
                                    },
                                    "Title": {
                                        "val": "Tactical Airborne Reconnaissance"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "2.000"
                                        },
                                        "CurrentYear": {
                                            "val": "2.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "2.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "2.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "This is an enterprise services effort."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0305206F_BPAC_675092_0.jpg"
                                }
                            }
                        ]
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "675291"
                    },
                    "ProjectTitle": {
                        "val": "Gorgon Stare"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "14.916"
                        },
                        "CurrentYear": {
                            "val": "10.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Gorgon Stare Quick Reaction Capability (QRC) supports the Combatant Commander (COCOM) urgent operational need for wide area airborne surveillance capability and is managed in the Air Force through the BIG SAFARI Systems Program Office (645th Aeronautical Systems Group), Intelligence, Surveillance, and Reconnaissance and Special Operations Forces (ISR&SOF) Directorate, Air Force Life Cycle Management Center (AFLCMC), Air Force Materiel Command.  Development of the Gorgon Stare QRC system provides a podded wide area airborne sensor suite integrated on dedicated MQ-9 Reaper Remotely Piloted Aircraft (RPA) to provide a city-sized surveillance capability for the COCOMs.  The Joint Requirements Oversight Council Memorandum (JROCM 106-08, dated 27 May 2008) approved the Air Force concept for a program plan to address Service requirements for broad area airborne sensors capability on existing manned and unmanned aircraft system platforms.  This plan evolved into the current incremental delivery of ten pod sets of Gorgon Stare QRC carried on MQ-9 Reaper RPAs.  The acquisition strategy for this Air Force QRC podded sensor suite solution includes delivery of incremental capability upgrades, with development of each capability upgrade expanding the capabilities of the previous increment.  Provisions to consider integrating pre-planned product improvements (P3I) and\/or multi-INT enhanced capabilities to address evolving and emerging technology advancements are within the scope of the acquisition strategy.\n\nP3I efforts being conducted with FY14 Congressional Add funding includes merging capabilities such as Signals Intelligence (SIGINT) and Near Vertical Direction Finding (NVDF) with Wide Area Motion Imagery (WAMI).  Funds spent on NVDF will provide a ramp for follow-on actions.\n\nActivities also include studies and anlysis to support both current program planning and execution as well as future program planning."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Multi-Int Integration"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "10.000"
                                        },
                                        "Text": {
                                            "val": "Begin integration of a fielded near vertical direction finding (NVDF) capability into an existing Gorgon Stare Wide Area Motion Imagery (WAMI)- equipped MQ-9."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Gorgon Stare 2, Pre-planned Product Improvement"
                                    },
                                    "Description": {
                                        "val": "Gorgon Stare QRC development including Airborne System, C2, Tactical Dissemination, and Fixed Site processing elements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.916"
                                            },
                                            "Text": {
                                                "val": "Continued pre-planned product improvement (P3I) and multi-INT research and development to airborne system, C2, tactical dissemination, and fixed site processing elements.  Development will lead to a retrofit capability that could be integrated to improve older pod capabilities.  Completed development and began fielding of Increment 2 pods."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "APAF: BP11: Line Item # PRDTB3"
                                    },
                                    "Title": {
                                        "val": "MQ-9 UAS Payloads"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "84.470"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF: BP16"
                                    },
                                    "Title": {
                                        "val": "MQ-9 Initial Spares"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "12.725"
                                        },
                                        "CurrentYear": {
                                            "val": "8.256"
                                        },
                                        "BudgetYearOne": {
                                            "val": "6.790"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "6.790"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "6.098"
                                        },
                                        "BudgetYearThree": {
                                            "val": "3.248"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "In response to a COCOM urgent operational need, the wide area airborne surveillance requirement will be delivered via the Gorgon Stare QRC effort and executed by the 645 AESG (BIG SAFARI SPO) using an incremental acquisition strategy to mitigate risk, find affordable end-to-end architecture solutions and field requested multi-INT capabilities quickly.  Gorgon Stare QRC addresses Service requirements for broad area surveillance using existing, dedicated MQ-9 Reaper RPA.  The BIG SAFARI SPO, as tasked by the Air Force Service Acquisition Executive (SAE) and Program Executive Officer for Intelligence, Surveillance and Reconnaissance and Special Operations Forces (PEO\/ISR & SOF), will continue development efforts to rapidly respond to COCOM urgent operational needs."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0305206F_BPAC_675291_0.jpg"
                                }
                            }
                        ]
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "675292"
                    },
                    "ProjectTitle": {
                        "val": "Hyperspectral Sensors"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.593"
                        },
                        "CurrentYear": {
                            "val": "1.156"
                        },
                        "BudgetYearOne": {
                            "val": "3.546"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.546"
                        },
                        "BudgetYearTwo": {
                            "val": "3.515"
                        },
                        "BudgetYearThree": {
                            "val": "2.774"
                        },
                        "BudgetYearFour": {
                            "val": "2.828"
                        },
                        "BudgetYearFive": {
                            "val": "2.881"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Hyperspectral Sensors project develops Hyperspectral Imagery (HSI) sensors and capabilities for MQ-1 Remotely Piloted Aircraft (RPA) and other manned or unmanned aircraft.  Within this project, the Airborne Cueing & Exploitation System-Hyperspectral (ACES HY) program helps to fulfill a portion of the sponsoring combatant command and Central Command's current HSI requirements. The ACES HY program developed sensors for the MQ-1B Predator Block 15 and included development of the required training, maintenance and fielding plans to support a working architecture. \n\nActivities within this project also include studies and analysis supporting current and future program planning and tech development for advanced HSI sensors and capabilities, including high altitude HSI sensor developments per the HSI strategic roadmap."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Airborne Cueing & Exploitation System - Hyperspectral (ACES HY)"
                                    },
                                    "Description": {
                                        "val": "Develop capability enhancements and perform technical refresh on the ACES HY sensor system. Provide support data to accompany sensors and modifications. Tech development supporting sensor improvements and possible integration on other platforms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.593"
                                            },
                                            "Text": {
                                                "val": "Enhanced real-time target detection and identification capability through algorithm development and processing optimizations.  Completed MQ-9 Hyperspectral Imagery (HSI) study.  Implemented National Imagery Transmission Format compliance in data streams.  Prepared for integration of OSD funded processor upgrade."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.156"
                                            },
                                            "Text": {
                                                "val": "Continues ACES HY upgrades.  Developing HSI solutions for alternate platforms, including high-altitude platforms.  Continue developing organizational level diagnostic support equipment.  Continue integration & qualification of OSD funded processor upgrade."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.546"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.546"
                                            },
                                            "Text": {
                                                "val": "Will continue ACES HY upgrades. Will develop HSI solutions for alternate platforms, including medium altitude platforms. Will continue developing organizational level diagnostic support equipment. Will continue integration & qualification of OSD funded processor upgrade."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "APAF: BA05: Line Item # PRDT01"
                                    },
                                    "Title": {
                                        "val": "MQ-1 Mods"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "19.910"
                                        },
                                        "CurrentYear": {
                                            "val": "5.047"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "A portion of the Predator modification funding listed above is used to support ACES HY integration."
                        },
                        "AcquisitionStrategy": {
                            "val": "Partner with industry to procure improved, baseline deployable, supportable hyperspectral imaging (HSI) sensor systems.  The systems should support the joint warfighter and ensure evolutional upgrade capability.  Complete production sensor deliveries using the Advanced Technology Support Program process developed by Office of the Secretary of Defense (OSD)'s Defense MicroElectronics Activity (DMEA) at McClellan AFB, CA.  All future contracts will be awarded by Air Force Life Cycle Management Center.  The contractors should provide a disciplined design process that is the lowest risk solution (cost, schedule, and performance) and ensures logistics support with initial test spares and associated source data to support training and technical order (TO) development.  \n\nACES HY: The MQ-1 developers will be included for sensor technology efforts as they mature and for planning possible future integration on other platforms.  ACES HY utilizes a competitively selected, cost plus fixed fee prime contract to Raytheon (Mc Kinney, TX) for system production and a sole source Basic Ordering Agreement with Raytheon (McKinney, TX) for system modificaions. \n\nAcquisition strategy for high-altitude HSI remains TBD."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0305206F_BPAC_675292_0.jpg"
                                }
                            }
                        ]
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "675382"
                    },
                    "ProjectTitle": {
                        "val": "Wide Area Motion Imagery (WAMI)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "28.517"
                        },
                        "BudgetYearFour": {
                            "val": "29.074"
                        },
                        "BudgetYearFive": {
                            "val": "29.627"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops Wide Area Motion Imagery (WAMI) capabilities paired with Near Vertical Direction Finding (NVDF) capabilities in support of Combatant Command (COCOM) requirements for end-to-end persistent surveillance to provide airborne sensor suites, data links, and associated ground support elements for city-sized and similar WAMI surveillance capabilities on manned and unmanned aircraft.  \n\nThis project was aligned to respond to COCOM's greater need for wide area surveillance.  Quick reaction capability (QRC) has been delivered in the near term while allowing time for DoD to incorporate lessons learned from previously initiated QRC activities into this WAMI project.  Continued development of critical wide area surveillance technologies will support existing QRCs supporting various aircraft size, weight, and power configurations, sensor performance attributes, Processing, Exploitation, and Dissemination (PED) architectures, and operational missions.  Pre-program planning activities will continue to support formal Air Combat Command (ACC) Program of Record (PoR) activities.  \n\nActivities also include studies, analysis, and technology development, maturation, and demonstration to support current and future program planning and execution.  Includes total government and contractor costs for this project."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Wide Area Motion Imagery (WAMI)"
                                    },
                                    "Description": {
                                        "val": "WAMI efforts to include wide area surveillance sensors technology development, maturation, and capability demonstrations for manned and unmanned aircraft system platforms. Includes total government and contractor costs for this project."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "WAMI efforts described under Project 674818, Imaging & Targeting Support, PE 0305206F. Includes total government and contractor costs for this project."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "None"
                                    },
                                    "Title": {
                                        "val": "N\/A"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Competitive; specific strategy TBD."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0305206F_BPAC_675382_0.jpg"
                                }
                            }
                        ]
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "676031"
                    },
                    "ProjectTitle": {
                        "val": "Dismount Detection RADAR"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "41.121"
                        },
                        "CurrentYear": {
                            "val": "30.192"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "71.313"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Dismount Detection Radar (DDR) project designs, develops, integrates, tests, fields, and sustains Ground Moving Target Indicator\/Dismount Moving Target Indicator (GMTI\/DMTI) and Synthetic Aperture Radar (SAR) capability for improved dismount and moving target detection, identification, tracking, and classification. DDR is advancing Open Systems Architecture (OSA) in the area of sensors and mission systems.  DDR includes associated Tasking Processing Exploitation and Dissemination (TPED) capabilities, and will be applicable to other combatant command (COCOM) GMTI requirements.  DDR is designed to address COCOM and Central Command's dismount detection requirements. The DDR program also studies, develops, tests, and implements new concepts, hardware and software capabilities that can be leveraged by the OSA design in the radar and associated TPED for GMTI, and various technical analysis\/studies to support future advanced radar development. \n\nActivities also include studies, analysis, and technology development, maturation, and demonstration to support current and future program planning and execution."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Dismount Detection RADAR (DDR)"
                                    },
                                    "Description": {
                                        "val": "Design, develop, integrate, test, field, and sustain a persistent GMTI\/DMTI capability in theater for employment on medium altitude air vehicles and various technical studies\/analysis to support future advanced radar development."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "41.121"
                                            },
                                            "Text": {
                                                "val": "Continued development of the radar system; developed air and ground hardware and software to support and Open System Architecture (OSA) design and to prepare for sensor integration onto the platform. Continued the development and integration of advanced third party modes to confirm the OSA of radar systems through a software spiral upgrade (i.e. maritime modes, etc.) and associated TPED."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "30.192"
                                            },
                                            "Text": {
                                                "val": "Complete sensor testing, integration of radar system on surrogate platform. Complete flight testing to support radar performance and architecture validation. Complete development of third-party software mode.  Continue various technical studies\/analysis to support future advanced radar development. Store radar pods at government facility until future flight tests are required."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "NA"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "None"
                                    },
                                    "Title": {
                                        "val": "N\/A"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The acquisition strategy for Dismount Detection Radar (DDR) included a competitive source selection that began in 1QFY12 and was awarded in February 2012.  After a ~100 day protest, the Government Accountability Office (GAO) denied all protest allegations allowing the Prime Contractor, Raytheon, to begin the design and development of the radar system in June 2012.  The radar design included an OSA approach, which will be demonstrated when MIT\/LL develops and integrates an advanced mode into the radar system.  Program will conduct demonstration activities through 4QFY14."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0305206F_BPAC_676031_0.jpg"
                                }
                            }
                        ]
                    }
                }
            ]
        }
    }
}