{
    "id": "9706639a92fe35230c26e68997dfcfcfc7aabf6c",
    "meta": {
        "filename": "dod-2015_RDTE_2015_OSD_RDTE_JustificationBook_Office_of_Secretary_Of_Defense_PB_2015.zzz_unzipped_RDTE_JustificationBook_Office_of_Secretary_Of_Defense_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605130D8Z"
        },
        "ProgramElementTitle": {
            "val": "Foreign Comparative Testing"
        },
        "R1LineNumber": {
            "val": "144"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "18.616"
            },
            "PriorYear": {
                "val": "15.352"
            },
            "CurrentYear": {
                "val": "12.125"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "Rapid Fielding (RF) and Comparative Test is being recast with a focus on operational and developmental prototypes derived from evaluation of foreign equipment and products that will provide the U.S. Armed Services and Special Operations Command (SOCOM) capabilities to counter emerging threats.  The Foreign Comparative Testing (FCT) program will increase its focus on finding and leveraging foreign technology solutions that affordably extend the life of existing military platforms\/capabilities.  FCT’s broad reach across our allies and friendly foreign countries will enable finding and developing innovative, cost effective, and potentially interoperable solutions for the DoD, Multi-Service and Combatant Command (COCOM) priority requirements.\n\nIn FY 2015, Foreign Comparative Testing funding in Program Element 0605130D8Z is being transferred to PE 0603133D8Z to emphasize operational and developmental prototypes and Budget Activity alignment."
        },
        "ProgramElementMissionDescription": {
            "val": "The Foreign Comparative Testing (FCT) program supports the warfighter by leveraging technologies and equipment from allied nations and coalition partners to satisfy U.S. defense requirements, thereby accelerating the U.S. acquisition process and lowering development costs.  The FCTs enhance interoperability, facilitate international collaboration, expand opportunities for prototyping to increase competition in innovation and enable more efficient and affordable transition of technologies into acquisition programs of record.  Authorized by Title 10, U.S. Code, Section 2350a (g), the FCT program is managed by the Office of Secretary of Defense (Deputy Assistant Secretary of Defense (DASD) Rapid Fielding), Comparative Technology Office (CTO).  The FCT projects are sponsored by the Services and SOCOM.  Evaluation processes for project selection include a detailed review to confirm the proposed item addresses valid requirements, a thorough market survey, and development of a viable acquisition strategy."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "18.174"
                },
                "CurrentYear": {
                    "val": "12.134"
                },
                "BudgetYearOne": {
                    "val": "21.285"
                },
                "BudgetYearOneBase": {
                    "val": "21.285"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "15.352"
                },
                "CurrentYear": {
                    "val": "12.125"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.822"
                },
                "CurrentYear": {
                    "val": "-0.009"
                },
                "BudgetYearOne": {
                    "val": "-21.285"
                },
                "BudgetYearOneBase": {
                    "val": "-21.285"
                }
            },
            "AdjustmentDetails": {
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "-1.842"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "-0.024"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.700"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.249"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.007"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Realignment of funding to PE 0603133D8Z"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-21.285"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-21.285"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC Adjustments"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "-0.009"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2015:  Funding in Program Element 0605130D8Z is realigned to PE 0603133D8Z to reflect DoD priorities and Budget Activity alignment."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P130"
                    },
                    "ProjectTitle": {
                        "val": "Foreign Comparative Testing"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "18.616"
                        },
                        "PriorYear": {
                            "val": "15.352"
                        },
                        "CurrentYear": {
                            "val": "12.125"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Foreign Comparative Testing (FCT) program supports the warfighter by leveraging advanced technologies and equipment from allied nations and coalition partners to satisfy U.S. defense requirements, thereby accelerating the U.S. acquisition process and lowering development costs.  The FCTs enhance interoperability, facilitate international collaboration, expand opportunities for prototyping and enable more efficient and affordable transition of technologies into acquisition programs of record.  Authorized by Title 10, U.S. Code, Section 2350a(g), the FCT program is managed by the Office of Secretary of Defense (OSD), Deputy Assistant Secretary of Defense (DASD) Rapid Fielding (RF), Comparative Technology Office (CTO).  The FCT projects are sponsored by the Services and U.S. Special Operations Command (USSOCOM) each year.  Evaluation processes for project selection include a detailed review to confirm the proposed item addresses valid requirements, a thorough market survey, and development of a viable acquisition strategy.  \n\nSince the program's inception in 1980, OSD has initiated 671 projects; 619 projects have been completed to date.  Of the 324 evaluations that met the sponsors' requirements, 252 led to procurements worth approximately $11.000 billion in FY 2013 constant year dollars.  With an OSD investment of about $1.170 billion, the FCT Program realized an estimated research, deve lopment, test, and evaluation (RDT&E) cost avoidance of $7.800 billion in FY 2013 constant year dollars.\n\nThe FCT program is a catalyst for teaming and other business relationships between foreign and U.S. industries.  Many successful FCT projects result in the licensed production of the qualified foreign item in the U.S. Other nations recognize the long-term value of such practices for competing in the U.S. defense market and the resultant strengthening of the \"two-way street\" in Defense procurement.  The result often means the creation of jobs and contributions to local economies throughout the United States.  To date, companies across 33 states benefited from FCT projects."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Armor Processing (Army)"
                                    },
                                    "Description": {
                                        "val": "The Army is looking to evaluate personal body armor, small arm protective inserts (SAPI), fabricated by new isostatic and high pressure processing technique.  This prototype process has had very promising results and has the potential to reduce the weight and improve the ballistic performance of personal body armor at a lower cost.  The current SAPI plates are made by conventional processing techniques which use low pressure autoclave to bond ceramic tiles and high performance fiber composites together.  The fiber composite materials are processed separately using hot press prior to the final bonding process.  This production method cannot provide uniform high pressure throughout the entire processing and therefore, the ballistic performance of current SAPI plates is not optimized.  The proposed technology has demonstrated the capability to provide absolute uniform and high pressure for the entire process and also to combine fiber composite consolidation and plate integration into a one-step process.  This technology will maximize the bonding strength between fiber composite layers and between composite and the ceramic which will significantly improve the ballistic performance of SAPI plates.  Uniform and high pressure processing technology will also dramatically reduce the performance variation which will provide more trade space for weight reduction.  The technology developed provides a new manufacturing technique that is unique and unavailable from domestic sources."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.150"
                                            },
                                            "Text": {
                                                "val": "Flat panel polyethylene test coupons have been manufactured using varying pressure and temperature processing cycles and are being mechanically tested (bend testing) to measure elastic stiffness.  The testing will identify physical differences between laminates consolidated via XTclave™ and traditional axial pressing.  Samples were also imaged and mechanically tested for comparison."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.880"
                                            },
                                            "Text": {
                                                "val": "Perform modeling and simulation, subcomponent test article production, subcomponent testing, data evaluation and report, armor prototype production, prototype testing and evaluation, write final test report and close out report."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Clandestine Tactical Audio\/Video and Sensor Devices (United States Special Operations Command (USSOCOM))"
                                    },
                                    "Description": {
                                        "val": "The Clandestine Tactical Audio\/Video and Sensor Devices will test, evaluate and qualify ultra-modern, first-of-a-kind, concealable systems that are instrumental in identifying potential adversarial activities, then tracking those activities, and providing response teams with near-real-time actionable intelligence information.  This project will qualify new systems that will replace legacy and compromised technology while also avoiding RDT&E, manufacturing, production, and Operations and Support costs worth $10.750 million."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Analyzed vendor data, contracted for test articles, and began testing preparations at the U.S. Army Intelligence Electronic Test Directorate, Fort Huachuca New Mexico.  Conducted technical and safety testing to include verification and acceptance of systems.  Completed independent operational test and evaluations, operational user assessments, and submitted final test reports."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Dual Purpose 25mm (millimeter) Ammunition for the Joint Strike Fighter (Navy)"
                                    },
                                    "Description": {
                                        "val": "Dual Purpose 25mm Ammunition for the Joint Strike Fighter will test the performance, reliability and safety of pre-production Norwegian Armor Piercing Explosive (APEX) 25mm rounds for US Navy, Marine Corps and Air Force aircraft application.  The APEX projectile is a dual-use round for aircraft gun systems, which is reported to have greater penetration with a delay detonation and provides dual purpose lethality."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.200"
                                            },
                                            "Text": {
                                                "val": "Briefed item qualification plan which received approval from the Weapons Systems Explosive Safety Review Board (WSESRB) in 3Q – 4Q FY 2013.  Obtained drawings of final configuration, and drafted gun qualification test plan in 4Q FY 2013."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.815"
                                            },
                                            "Text": {
                                                "val": "Finalize gun (GAU-22\/A Missionized Gun System) “Delta” qualification plan in 1Q FY 2014.  Present Final Type Qualification results to WSESRB during 2Q FY 2014.  Procure and receive gun qualification test assets in 1Q FY 2014.  Obtain foreign data\/test reports from qualification tests in 1Q – 2Q FY 2014.  Execute gun qualification plan during 3Q – 4Q FY 2014.  Complete analysis and qualification test report in 4Q FY 2014."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rapid DNA Profiler (United States Special Operations Command (USSOCOM))"
                                    },
                                    "Description": {
                                        "val": "Evaluate a new system that provides actionable intelligence by positively matching recently discovered evidence with a person of interest, using DNA samples, with results in seventy-five minutes.  This new system will quickly confirm connections between detained persons of interest and gathered evidence within seventy-five minutes while also avoiding RDT&E, manufacturing, production, and Operations and Support costs worth $25.560 million."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Analyzed vendor data, received test articles, and conducted technical and safety testing to include verification and acceptance of the systems.  Completed operational assessment of systems with representative users, and submitted final test reports."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Secondary Propulsion Thrusters (Navy)"
                                    },
                                    "Description": {
                                        "val": "Test and qualify pump-jet propulsion technology for the first-time use as Secondary Propulsion Thrusters as a submarine Secondary Propulsion System (SPS).  These pump-jet Secondary Propulsion Thrusters have the potential to improve ship control, operational performance and greatly reduce Total Ownership Cost.  The new SPS will provide variable speed control and directional thrust to allow the ship’s driver to maneuver the submarine in waters where currents are very volatile and during mooring and underway evolutions.  The primary outputs and efficiencies produced by this project are 1) improved control of the submarine; 2) an RDT&E cost avoidance of $532.000 million; and 3) an Operations and Support cost avoidance of $181.000 million.  Following successful at-sea operational testing, the technology will be considered for insertion into the Virginia Class Block V baseline.  The same pump jet technology will also be considered on the Ohio Replacement design."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.300"
                                            },
                                            "Text": {
                                                "val": "Provided engineering and management support for the jet pump procurement throughout 3Q-4Q FY 2013."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.050"
                                            },
                                            "Text": {
                                                "val": "Perform factory testing on jet pump in 2Q FY 2014.  Finalize land-based test plan, procedures, and receive test articles during 3Q FY 2014.  Integrate test article system and start land-based testing in 4Q FY 2014."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Seismic Detection System (Navy)"
                                    },
                                    "Description": {
                                        "val": "This project will test and evaluate a state-of-the-art Russian sensor system that can detect the presence of human activity (walking, digging) associated with improvised explosive device (IED) emplacement, perimeter\/border intrusion of unauthorized individuals and provide alerts when that activity occurs within a user defined geographical boundary."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.090"
                                            },
                                            "Text": {
                                                "val": "Initiated test planning documentation, and received first delivery of test articles in 4Q FY 2013."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.550"
                                            },
                                            "Text": {
                                                "val": "Complete testing of first delivery of test articles in 1Q FY 2014.  Complete testing of second delivery of test articles in 3Q FY 2014.  Submit final Test Report, and complete and Close-Out report in 4Q FY 2014."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Stabilized Small Arms Mount (Navy)"
                                    },
                                    "Description": {
                                        "val": "Tests an innovative, highly reliable, two-man portable Stabilized Small Arms Mount (SSAM) suitable for the harsh maritime and operational environments in which the warfighters of small-to-medium size craft operates.  The gyro stabilized system should be able to consistently and accurately deliver first hit capability of small arms fire to intended targets without increasing any of the craft's signatures.  The system will replace crew-served weapon stations, allowing the operator to move in off the weather deck.  The primary outputs and efficiencies produced by this project are 1) increased weapon capability, reliability, and warfighter safety; 2) avoidance of RDT&E costs worth $4.200 million; and 3) avoidance of Operations and Support costs worth $49.400 million."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Conducted technical evaluation and contract modifications throughout 1Q-2Q FY 2013.  Received and began testing initial systems in 3Q FY 2013.  Developed contract and evaluated improved day camera and laser range finder throughout 3Q-4Q FY 2013."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Test and evaluate delivered items during 1Q-2Q FY 2014.  Identify other possible improvements which could increase system capabilities in 1Q FY 2014.  Finalize the technical data package and contract for follow-on systems in 2Q FY 2014.  Obtain Weapon System Explosives Safety Review Board concurrence and conduct initial install on first craft in 3Q FY 2014. Prepare and submit final close-out report in 4Q FY 2014."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Web Based Weather Portal (Air Force)"
                                    },
                                    "Description": {
                                        "val": "The Web Based Weather Portal tests and qualifies ‘Visual Weather’ software to provide commercial-off-the-shelf capability to ingest, decode, and display weather observations and forecast products.  The portal will expand its use to distribute Air Force Weather processing needs across the enterprise in a net centric mode providing efficiencies, expanded capabilities and cost savings over current approaches.  In particular, it can be used for meteorological data processing and visualization, contain interactive forecasting tools, enhance forecast production and workflow management, and develop adherence to the Open Geospatial Consortium's (OGC) standards for Web Mapping Services (WMS), Web Coverage Services, and Web Feature Services (WFS).  In addition, Visual Weather is compatible with the Joint Meteorological and Oceanographic (METOC) Broker Language (JMBL), which is Air Force Weather’s current Web service approach to the exchange of information between meteorological and oceanographic data providers and user applications.  The use of Visual Weather reduces the time the weather forecaster spends on product generation and allows more time for quality control of the resultant weather product.  The distribution of data across the Air Force Weather Enterprise will also provide a level of Continuity of Operations that currently does not exist if connection to the Air Force Weather Agency is lost."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Finalized project planning and solicited and contracted for the software test licenses.  Procured and delivered the Visual Weather software and test equipment, conducted Web Based Weather Portal analysis, and finalized test and evaluation planning."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.058"
                                            },
                                            "Text": {
                                                "val": "Conduct initial technical testing and prepare technical test report.  Conduct operational\/user assessment test and evaluation and prepare the operational\/user test reports.  Focus testing on the performance in the operational environment.  Prepare the decision packet and complete the final test report."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "40mm Counter Defilade Grenade and Fire Control System (Army)"
                                    },
                                    "Description": {
                                        "val": "Tests and qualifies a new prototype 40mm round capable of providing an enhanced lethality solution for defeating personnel targets in defilade.  This ammunition achieves this objective by air-bursting the 40mm munitions over the target thereby increasing the probability of incapacitation.  Currently, U.S military does not have this capability in 40mm Low-Velocity (LV) Grenades.  The current U.S. inventory of 40mm LV Grenade ammunition has been in use for at least the past 50 years without any improvements in functionality, capability or lethality.  This ammunition must be compatible with the M203 or M320 40mm Low velocity rifle mounted or stand-alone Grenade launcher."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.150"
                                            },
                                            "Text": {
                                                "val": "Defined acquisition strategy, and sought out a non-standard ammunition group to assist with the specialized purchasing required for the Blanket Purchase Agreements (BPA) with foreign companies.  Completed BPA procurement package, released contemplation letters, and awarded contract.  Structured and developed procurement contract, and defined milestones."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.842"
                                            },
                                            "Text": {
                                                "val": "Procure test articles, conduct engineering analysis\/study, analyze vendor data, conduct technical testing, perform operator\/user assessment test, write test reports, prepare decision packet and close out report."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rapid Airfield Damage Assessment System (RADAS) (Air Force)"
                                    },
                                    "Description": {
                                        "val": "Test and evaluate a Foreign Object Damage (FOD) Detection System for suitability as a component of the Rapid Airfield Damage Assessment System (RADAS).  This system will locate, measure, and classify airfield damage within thirty minutes after an attack to achieve critical repair times to launch or recover aircraft sorties as identified in the Airfield Damage Repair (ADR) Modernization Program.  This system utilizes continuous scanning tower-mounted, low-light television sensors to provide 24\/7, all weather, FOD detection, with the ability to auto-notify multiple agencies simultaneously (to include to mobile devices).  The system will be evaluated for its performance against the ADR measurement and classification requirements as well as the ability to integrate with Geospatial Expeditionary Planning Tool (GeoExPT), ground robotic vehicles, and components of the Multiple Unidentified Explosive Ordnance (UXO) Removal System (MURS).  RADAS supports the ADR modernization program which has an identified and validated requirement for an automated damage assessment system."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.500"
                                            },
                                            "Text": {
                                                "val": "Procure test articles in 3Q FY 2014 for the technical evaluation phase.  Install and integrate the test articles at Silver Flag Contingency Training Site, Tyndall Air Force Base, Florida.  Develop and obtain approvals for both technical and war-fighter evaluation test plans in 4Q FY 2014."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Minor Resource Projects"
                                    },
                                    "Description": {
                                        "val": "Enhanced Sniper Detection and Locating (SOCOM), Moving Target Indication System (Navy), Thin Line Towed Array Handler System Technology Insertion (Navy), Multi-Diver Heating and Cooling System for Wet Submersibles ,Air Portable Hot Mix Asphalt Plant (Air Force), Mine Resistant Combat Boot (Army), Multifunctional Information Distribution System (MIDS) Joint Tactical Radio System (JTRS) Radio Frequency Amplifier (RFA) (Navy),  Energy Absorbing Material for Improved Blunt Impact\/Blunt Trauma Protection (D3) (Army), Lightweight M3A1 Recoilless Rifle (Army), Computer Network Defense (CND) Advanced Persistent Threat (APT) Detection (Navy), H-1 Crash-resistant, Ballistic-tolerant, Fuel Cell Qualification (Navy), Mobile Gunnery Live Fire Monitoring System (MGLFMS) (Navy), Electronic Underwater Navigation (United States Special Operations Command (USSOCOM)), and Enhanced Optical and Transceiver Capability (United States Special Operations Command (USSOCOM))."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.462"
                                            },
                                            "Text": {
                                                "val": "The following projects finalized testing, received test articles, and completed reporting and transition plans: Enhanced Sniper Detection and Locating, Moving Target Indication System, Thin Line Towed Array Handler System Technology Insertion, and Multi-Diver Heating and Cooling System for Wet Submersibles."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.930"
                                            },
                                            "Text": {
                                                "val": "The following projects will continue to test, receive test articles, and complete reporting and transition plans: Air Portable Hot Mix Asphalt Plant, Mine Resistant Combat Boot, Multifunctional Information Distribution System (MIDS) Joint Tactical Radio System (JTRS) Radio Frequency Amplifier (RFA), Energy Absorbing Material for Improved Blunt Impact\/Blunt Trauma Protection (D3), Lightweight M3A1 Recoilless Rifle, Computer Network Defense (CND) Advanced Persistent Threat (APT) Detection (Navy), H-1 Crash-resistant, Ballistic-tolerant, Fuel Cell Qualification, Mobile Gunnery Live Fire Monitoring System (MGLFMS), Electronic Underwater Navigation, and Enhanced Optical and Transceiver Capability."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Since the program's inception in 1980, Office of Secretary of Defense has invested about $1.170 billion in FY 2013 constant year dollars to initiate 671 projects; 619 projects have been completed to date.  Of the 324 evaluations that met the sponsors' requirements, 252 led to procurements worth over $11.000 billion.  In FY 2013, FCT had a transition rate of 84 percent for completed projects, exceeding the objective of 40 percent for demonstration programs."
                        }
                    }
                }
            ]
        }
    }
}