{
    "id": "99adc84f2857a05226bc9418b5dcd5fa61963620",
    "meta": {
        "filename": "dod-2015_RDTE_2015_ARMY_BA3_RDTE_JustificationBook_Army_PB_2015.zzz_unzipped_RDTE_JustificationBook_Army_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603125A"
        },
        "ProgramElementTitle": {
            "val": "Combating Terrorism - Technology Development"
        },
        "R1LineNumber": {
            "val": "41"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "9.199"
            },
            "CurrentYear": {
                "val": "15.046"
            },
            "BudgetYearOne": {
                "val": "24.270"
            },
            "BudgetYearOneBase": {
                "val": "24.270"
            },
            "BudgetYearTwo": {
                "val": "27.722"
            },
            "BudgetYearThree": {
                "val": "27.894"
            },
            "BudgetYearFour": {
                "val": "25.094"
            },
            "BudgetYearFive": {
                "val": "25.383"
            }
        },
        "ProgramElementNote": {
            "val": "FY15 increases for Technology Systems Adaptive Red Teaming, Ground Platform Subsystem Demonstrations, and Ground Vehicle Power and Energy research."
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element demonstrates technologies with high payoff potential to address current technology shortfalls or future capability gaps.  Efforts include: hybrid electric power technologies to reduce use of fossil fuel generators; technology development to provide significant gains in ground vehicle energy efficiency; rapidly deployable force protection technologies to enable troops at small, remote bases or integrated within local communities to detect, assess and defend against a range of enemy threats; and technology system red-teaming to stress and assess emerging systems earlier in the life-cycle, and provide a more holistic understanding of employment risks in operationally-representative environments and against potential threats.\n\nThis Program Element supports the Command, Control, Communications and Intelligence (C3I), Ground and Innovation Enablers Portfolios.\n\nWork in this project is complementary to and is fully coordinated with PE 0602105A (Materials Technology), PE 0602270A (Electronic Warfare Technology), PE 0602303A (Missile Technology), PE 0602618A (Ballistics Technology), PE 0602705A (Electronics and Electronic Devices), PE 0602784A (Military Engineering Technology), 0603005A (Combat Vehicle and Automotive Advanced Technology), PE 0603270A (Electronic Warfare Technology), PE 0603710A (Night Vision Advanced Technology), and PE 0603734A (Military Engineering Advanced Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this Program Element is performed by the Army Research, Development, and Engineering Command (RDECOM) and the Army Engineer Research and Development Center (ERDC)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "9.716"
                },
                "CurrentYear": {
                    "val": "15.054"
                },
                "BudgetYearOne": {
                    "val": "10.136"
                },
                "BudgetYearOneBase": {
                    "val": "10.136"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "9.199"
                },
                "CurrentYear": {
                    "val": "15.046"
                },
                "BudgetYearOne": {
                    "val": "24.270"
                },
                "BudgetYearOneBase": {
                    "val": "24.270"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.517"
                },
                "CurrentYear": {
                    "val": "-0.008"
                },
                "BudgetYearOne": {
                    "val": "14.134"
                },
                "BudgetYearOneBase": {
                    "val": "14.134"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.013"
                    },
                    "CurrentYear": {
                        "val": "-0.008"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.282"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "14.134"
                                },
                                "BudgetYearOneBase": {
                                    "val": "14.134"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Sequestration"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.222"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "DF5"
                    },
                    "ProjectTitle": {
                        "val": "Agile Integration & Demonstration"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "9.199"
                        },
                        "CurrentYear": {
                            "val": "15.046"
                        },
                        "BudgetYearOne": {
                            "val": "24.270"
                        },
                        "BudgetYearOneBase": {
                            "val": "24.270"
                        },
                        "BudgetYearTwo": {
                            "val": "27.722"
                        },
                        "BudgetYearThree": {
                            "val": "27.894"
                        },
                        "BudgetYearFour": {
                            "val": "25.094"
                        },
                        "BudgetYearFive": {
                            "val": "25.383"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project demonstrates technologies with high payoff potential to address current technology shortfalls or future capability gaps.  Efforts include: hybrid electric power technologies to reduce use of fossil fuel generators; initiatives to improve the transition of power and energy technologies into commercial and military marketplaces; technology development to provide significant gains in ground vehicle energy efficiency; rapidly deployable force protection technologies to enable troops at small, remote bases or integrated within local communities to detect, assess and defend against a range of enemy threats; and technology system red-teaming to stress and assess emerging systems earlier in the life-cycle, and provide a more holistic understanding of employment risks in operationally-representative environments and against potential threats.\n\nThis project supports the Command, Control, Communications and Intelligence (C3I), Ground and Innovation Enablers Portfolios.\n\nWork in this project is complementary to and is fully coordinated with PE 0602105A (Materials Technology), PE 0602270A (Electronic Warfare Technology), PE 0602303A (Missile Technology), PE 0602618A (Ballistics Technology), PE 0602705A (Electronics and Electronic Devices), PE 0602784A (Military Engineering Technology), 0603005A (Combat Vehicle and Automotive Advanced Technology), PE 0603270A (Electronic Warfare Technology), PE 0603710A (Night Vision Advanced Technology), and PE 0603734A (Military Engineering Advanced Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Army Research, Development, and Engineering Command (RDECOM) and the Army Engineer Research and Development Center (ERDC)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Hybrid Intelligent Power (HI Power)"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates intelligent power management hardware and software to reduce the use of fossil fuel in tactical generators while increasing energy security. The intelligent power management technologies are plug-and-play to enable faster power grid setup times and to eliminate human error as well as to reduce soldier planning burden."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.648"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Validated performance of autonomous hybrid power grid architectures and advanced control hardware and software; fabricated and demonstrated a universal generator and Environmental Control Unit (ECU) modification (MOD) kit to enable automatic start\/stop controls; fabricated microgrid power management hardware representative Brigade tactical operations center and integrated for user assessments; completed a draft performance specification."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.997"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to define and demonstrate standards and protocols for tactical microgrids; develop a universal device controller able to monitor and manage power sources and loads; continue to advance technologies that enable the use of renewable power sources and energy storage systems for storing any excess grid power; demonstrate a grid power manager that can utilize all power assets on the battlefield to insure optimum power utilization based on mission requirements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rapidly Deployable Force Protection Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort improves design, development and employment of force protection technologies that are rapidly deployable to support troops operating in forward areas.  These technologies must be readily transportable; require minimal set up, take down, and operational effort; and easily adaptable across a variety of missions, environments, and threats. This effort is coordinated with PE 0602784A,  PE 0602786A, and PE 0603734A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.551"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Designed and conducted a series of live experiments in representative operational environments, bringing together soldiers, special operators, and technology and capability developers to stress and improve force protection systems for small bases in austere environments.  Assessed and integrated over 40 technology systems into scenarios at Camp Roberts, CA, Fort AP Hill, VA, Camp Blanding, FL, and Playas, NM.; systems included small radars, facial recognition sensors, unmanned aerial vehicles with small sensor payloads, entry control point screening and containment, perimeter security, hostile fire detection sensors, tactical assault kit, and integrated sensor architecture (ISA), among others.  Introduced SOUTHCOM scenarios into experiments, adding to CENTCOM and AFRICOM scenarios; introduced challenge events to identify potential technology and employment vulnerabilities during denial of service attacks\/conditions.  Designed and executed black swan and \"moneyball\" table top experiments in conjunction with live exercises to examine deep futures concepts.  Created initial adaptability dimensions for Warfighter Technology Tradespace Methodology (WTTM) to more explicitly assess the impact of systems design and integration on warfighters' ability to innovate locally as situations unfold; implemented WTTM for new, live scenarios reflecting distributed operations, introducing added stressors to expose vulnerabilities.  Assessed, stressed, and affected improvements on force protection systems being deployed with units\/teams, as well as those less mature and under development, including Android Tactical Assault Kit, Integrated Raw Sensor Data to Information, Simple Warning and Instant Forecasting Tool, and shot detection devices."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.053"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Analyze emerging threats that expeditionary units operating at remote bases or integrated with local communities may face in the future; select high-priority threats and develop a set of experiments using live, virtual, and mixed scenarios to stress deployable force protection developing technologies and identify vulnerabilities; incorporate Soldiers from a variety of military occupations and specialties as part of experiments and demonstrations; integrate assessments of technology-enabled capabilities for logistics basing and other force protection basing developments; expand the deployable force protection warfighter technology tradespace methodology and portfolio analysis; provide feedback for systems improvement and needed research areas."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.060"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.060"
                                            },
                                            "Text": {
                                                "val": "Will increase focus on active defense measures for small expeditionary units based on critical threats associated with one or two high-priority operational environments; will develop and integrate critical measures of success into the Warfighter technology tradespace methodology to include assessing systems' means to adapt, as well as new measures specific to one or two select new theaters; will expand quantitative protocols for field-based experiments; will implement narrative-based modeling and assessment tool for Warfighter feedback on technologies to expose and eliminate barriers affecting technology acceptance and use; will conduct a series of experiments using live and virtual scenarios and coordinated demonstrations to identify, expose, and mitigate system vulnerabilities; will leverage ongoing activities with units such as Special Operations Teams where possible to conduct in-country assessments and garner feedback on performance of high-priority systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Technology Systems Adaptive Red Teaming"
                                    },
                                    "Description": {
                                        "val": "This effort seeks to challenge conventional approaches to technology and systems development and insertion, and increase the awareness of risks and opportunities earlier in the lifecycle in order to improve system design, development and employment.  It builds on the concepts and methodology developed under the Deployable Force Protection Adaptive Red Teaming effort and applies them to other high-priority areas for the Army.  It designs and conducts a series of live, virtual and mixed scenarios and demonstrations to evaluate the most promising technologies.  It stresses and assesses developing technology systems for both individual and system-of-system performance across a representation of operational environments, realistic scenarios and emerging threats.  Activities include: identifying, integrating and examining system performance at live demonstration venues with experienced operators; emulating emerging threats and alternative futures to challenge assumptions regarding scenarios and system employment; and identifying and informing of potential vulnerabilities in systems and systems-of-systems, including but not limited to, performance degradation in congested\/contested environments, interoperability, and adaptability.  This effort is coordinated with program element 0602618A, 0602270A and 0603270A."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.996"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Select developing technology systems for demonstration and evaluation; analyze emerging threats and select high-priority threats for use in system experimentation; develop a set of experiments to stress performance and identify potential vulnerabilities when employed; incorporate Soldiers from a variety of Military Occupation Specialties to acquire user feedback; apply and expand the Warfighter technology tradespace methodology and analysis; and provide feedback to inform technology development, systems integration, training, logistics and employment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.134"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.134"
                                            },
                                            "Text": {
                                                "val": "Will utilize stakeholder analysis, operational scenarios and findings from technology vulnerability assessments to identify three to four high-priority developmental systems that support Army acquisition programs within areas such as intelligence, surveillance, and reconnaissance (ISR), electronic warfare, and\/or communications.  Will conduct in-depth, phased assessments that incorporate near-peer threats and live experiments with Warfighters to stress the systems under different scenarios and uncover vulnerabilities pertaining to systems integration, interoperability, adaptability and technology employment.  Will recommend means to harden systems against vulnerabilities and reduce risks arising from operational and logistics contexts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ground Platform Subsystem Demonstrations"
                                    },
                                    "Description": {
                                        "val": "This effort contributes to the Army's ground platform risk reduction efforts which seek to address technical and integration challenges in the areas of mobility, survivability, vehicle architecture and systems integration.  Specifically, this effort focuses on maturing and demonstrating vehicle power management, generation and distribution technologies to increase ground vehicle energy efficiencies and ensure ground platforms have enough power to enable future capabilities such as electromagnetic armor, active protections systems, IED detect and defeat technologies, advanced situational awareness and future network integration technologies. This effort is coordinated with PE 0603005A."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "Will conduct analysis of vehicle architecture and power systems. Will evaluate Government and contractor developed platform architectures and conduct trades studies, analysis and interface testing to ensure common power architecture designs meet known future vehicle power requirements.  Will update VICTORY architecture standards to drive next generation combat platform data and electrical architectures to enable affordable future upgrade capability for the combat fleet.  Will investigate advanced capability in platform power management and electrical power generation and distribution while reducing parasitic thermal burdens on the vehicle system."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ground Vehicle Power and Energy"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates advanced technologies that enable military ground vehicles to become significantly more energy efficient.  It collaborates with the U.S. Department of Energy to demonstrate technologies in: advanced combustion engines and transmissions; lightweight structures and materials; energy recovery and thermal management; alternative fuels and lubricants; hybrid propulsion systems; batteries and energy storage; and analytical tools (e.g., modeling and simulation). This effort is coordinated with program element 0602601A."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.076"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.076"
                                            },
                                            "Text": {
                                                "val": "Will support the Advanced Vehicle Power Technology Alliance (AVPTA) to mature advanced modeling tools to understand the behavior of batteries at the component, cell and module\/pack levels and aid future efforts to develop new energy storage systems; conduct reliability studies utilizing military form factor advanced chemistry batteries to drive military standards into the commercial sectors, with the intent to reduce the Army cost of advanced batteries; investigate advanced lightweight materials and demonstrate advanced manufacturing techniques to reduce platform structural weight and drive down associated costs; and leverage significant investments in commercial trucking industry to demonstrate fuel efficient and active safety technologies for Army tactical vehicles."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}