{
    "id": "9ae5f365c40dd771dc6b4767e32552024cf7a098",
    "meta": {
        "filename": "dod-2015_RDTE_2015_DARPA_RDTE_JustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2015.zzz_unzipped_RDTE_JustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603739E"
        },
        "ProgramElementTitle": {
            "val": "ADVANCED ELECTRONICS TECHNOLOGIES"
        },
        "R1LineNumber": {
            "val": "59"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "92.291"
            },
            "CurrentYear": {
                "val": "107.080"
            },
            "BudgetYearOne": {
                "val": "92.246"
            },
            "BudgetYearOneBase": {
                "val": "92.246"
            },
            "BudgetYearTwo": {
                "val": "83.198"
            },
            "BudgetYearThree": {
                "val": "97.496"
            },
            "BudgetYearFour": {
                "val": "107.594"
            },
            "BudgetYearFive": {
                "val": "114.417"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Advanced Electronics Technologies program element is budgeted in the Advanced Technology Development Budget Activity because it seeks to design and demonstrate state-of-the-art manufacturing and processing technologies for the production of various electronics and microelectronic devices, sensor systems, actuators and gear drives that have military applications and potential commercial utility.  Introduction of advanced product design capability and flexible, scalable manufacturing techniques will enable the commercial sector to rapidly and cost-effectively satisfy military requirements.\n\nThe MicroElectroMechanical Systems (MEMS) and Integrated Microsystems Technology project is a broad, cross-disciplinary initiative to merge computation and power generation with sensing and actuation to realize a new technology for both perceiving and controlling weapons systems and battlefield environments.  MEMS applies the advantages of miniaturization, multiple components and integrated microelectronics to the design and construction of integrated electromechanical and electro-chemical-mechanical systems to address issues ranging from the scaling of devices and physical forces to new organization and control strategies for distributed, high-density arrays of sensor and actuator elements.  The project will also address thermal management, navigation and positioning technology challenges.\n\nThe goal of the Mixed Technology Integration project is to leverage advanced microelectronics manufacturing infrastructure and DARPA component technologies developed in other projects to produce mixed-technology microsystems.  These 'wristwatch size', low-cost, lightweight and low power microsystems will improve the battlefield awareness and security of the warfighter and the operational performance of military platforms.  The chip assembly and packaging processes currently in use produce a high cost, high power, large volume and lower performance system.  This program is focused on the monolithic integration of mixed technologies to form batch-fabricated, mixed technology microsystems 'on-a-single-chip' or an integrated and interconnected 'stack-of-chips'.  The ability to integrate mixed technologies onto a single substrate will increase performance and reliability, while driving down size, weight, volume and cost."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "111.008"
                },
                "CurrentYear": {
                    "val": "117.080"
                },
                "BudgetYearOne": {
                    "val": "159.229"
                },
                "BudgetYearOneBase": {
                    "val": "159.229"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "92.291"
                },
                "CurrentYear": {
                    "val": "107.080"
                },
                "BudgetYearOne": {
                    "val": "92.246"
                },
                "BudgetYearOneBase": {
                    "val": "92.246"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-18.717"
                },
                "CurrentYear": {
                    "val": "-10.000"
                },
                "BudgetYearOne": {
                    "val": "-66.983"
                },
                "BudgetYearOneBase": {
                    "val": "-66.983"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.147"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "-7.477"
                    },
                    "CurrentYear": {
                        "val": "-10.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-8.181"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.912"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-66.983"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-66.983"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2013:  Decrease reflects Congressional reductions for Sections 3001 & 3004, sequestration adjustments, reprogrammings, and the SBIR\/STTR transfer. \nFY 2014:  Decrease reflects a reduction for prior year carryover. \nFY 2015:  Decrease reflects programs in thermal imaging coming to an end, micro position, navigation and timing scaling back and elimination of maskless nano-writer follow-on."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "MT-12"
                    },
                    "ProjectTitle": {
                        "val": "MEMS AND INTEGRATED MICROSYSTEMS TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "36.797"
                        },
                        "CurrentYear": {
                            "val": "32.336"
                        },
                        "BudgetYearOne": {
                            "val": "12.386"
                        },
                        "BudgetYearOneBase": {
                            "val": "12.386"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The MicroElectroMechanical Systems (MEMS) and Integrated Microsystems Technology program is a broad, cross-disciplinary initiative to merge computation and power generation with sensing and actuation to realize a new technology for both perceiving and controlling weapons systems and battlefield environments.  Using fabrication processes and materials similar to those used to make microelectronic devices, MEMS applies the advantages of miniaturization, multiple components and integrated microelectronics to the design and construction of integrated electromechanical and electro-chemical-mechanical systems.  The MEMS program addresses issues ranging from the scaling of devices and physical forces to new organization and control strategies for distributed, high-density arrays of sensor and actuator elements.  These issues include microscale power and actuation systems as well as microscale components that survive harsh environments.  Thermal management technologies will develop heat resistant thermal layers to provide efficient operation for cooling electronic devices.  The current focus in micro technologies is to improve navigation, position and timing capabilities for uncompromised navigation and positioning in today's dynamic military field of operations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Micro-Technology for Positioning, Navigation, and Timing (Micro PN&T)"
                                    },
                                    "Description": {
                                        "val": "The Micro-Technology for Positioning, Navigation, and Timing (Micro-PN&T) program is developing low size, weight, power, and cost (SWaP+C) inertial sensors and timing sources. This suite of sensors, when integrated into an inertial measurement unit (IMU), will enable self-contained navigation and timing in the absence of signals from the Global Positioning System (GPS), due to environmental interference or adversary action such as GPS jamming.  The Micro-PNT program is developing miniature high performance gyroscopes, accelerometers, and clocks, based on both solid state and atomic technologies.  Advanced micro-fabrication techniques under development will enable the fabrication of a single package containing all the necessary devices in a volume the size of a sugar cube.  The small SWaP+C of these technologies will enable ubiquitous guidance and navigation on all platforms, including guided munitions, unmanned aerial vehicles (UAVs), and individual soldiers.\n\nThe successful realization of Micro-PN&T requires the development of new microfabrication processes and novel material systems for fundamentally different sensing modalities, understanding of the error sources at the micro-scale, and development of micro-scale systems for sensors based on atomic physics techniques.  Innovative 3-D microfabrication techniques under development will allow co-fabrication of dissimilar devices on a single chip, such that clocks, gyroscopes, accelerometers, and calibration stages can be integrated into a small, low power architecture. The program is developing miniature atomic clocks, based on laser-cooled neutral atoms and trapped ions as well as inertial sensors based on atomic interferometry and nuclear magnetic resonance. Applied research for this program is funded within PE 0602716E, Project ELT-01."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "35.492"
                                            },
                                            "Text": {
                                                "val": "-  Developed monolithic microfabrication process to co-integrate clock, accelerometers and gyroscopes into 10mm^3.\n-  Demonstrated functionality of a co-fabricated 10 mm^3 IMU.\n-  Developed an automated test station to provide extended testing for a Nuclear Magnetic Resonance (NMR) gyroscope.\n-  Developed 3D micro shell resonators with integrated electrodes for drive and sense.\n-  Modeled the internal and external sources of error, scale-factor, and bias drift of inertial devices for successful on-chip calibration.\n-  Demonstrated small ion clocks with fractional frequency stability of 5e-14 after one month of operation.\n-  Demonstrated NMR gyro operation up to 2,500deg\/s rotation with turn-key operation.\n-  Demonstrated efficacy of zero velocity updating and ultrasonic ranging for calibration of an IMU in dismount applications, achieving accuracy of position tracking to 4m after 2 hours of navigation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "27.725"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate and evaluate performance of miniature atomic physics-based inertial sensors.\n-  Fabricate low loss spherical shell resonators, with quality factor (Q) over 1 Million, for gyroscope applications.\n-  Evaluate performance of a complete 6-degree of freedom IMU with a volume of < 10 mm^3.\n-  Demonstrate gyroscope self-calibration with long-term scale factor and bias of <10 ppm of full range."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.386"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.386"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate hybrid IMU, including integration of atomic physics based and solid state based sensors in a compact system with startup time less than one minute.\n-  Demonstrate gyroscope self-calibration with long-term scale factor and bias of <1 ppm of full range.\n-  Demonstrate portable high-performance atomic frequency standard."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Blast Exposure Accelerated Sensor Transfer (BEAST)"
                                    },
                                    "Description": {
                                        "val": "The Blast Exposure Accelerated Sensor Transfer (BEAST) program is a follow-on program to the Blast Gauge program.  Blast-related injuries have emerged as the signature wounds of recent conflicts.  To better understand the level of blast exposure received by warfighters, which is critical for developing and providing better treatment, low-cost personal sensors to record such critical signatures as blast overpressure had to be developed.  DARPA rapidly developed and fielded the Blast Gauge to better understand the combat exposures responsible for these injuries by properly capturing relevant data at the time of injury.  The gauges have been effective at capturing such events during operations in Afghanistan, achieving a number of milestones from the first recording during an IED attack to the first use of sensor data in medical evaluation of a service member with Traumatic Brain Injury (TBI).  Unexpectedly, gauge recordings have shown that potentially hazardous exposures may also occur in noncombat situations.  Typically these happen during training using weapon systems.  As the Blast Gauge is being deployed, military services require additional tools to begin properly using the device.  The Blast Exposure Accelerated Sensor Transfer (BEAST) program is a 1-year effort to provide additional tools for users and complete transition to military service sustainment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.305"
                                            },
                                            "Text": {
                                                "val": "-  Outfitted all task force members of the Combined-Joint-Special-Operations-Task-Force-Afghanistan with Blast Gauges.\n-  Conducted laboratory evaluation and end-user-assessments demonstrating that the Blast Gauges work as designed.\n-  Provided Blast Gauge technical support to Marines in Afghanistan.\n-  Discovered that training exercises present a risk of blast exposure.\n-  Measured and provided data on training exposures to all U.S. military services. \n-  Established mathematical and operational techniques to provide a detailed recreation of blast events from sensor measurements and operational data.\n-  Supported independent evaluations of Blast Gauge technology by the Army and Marines that concluded Blast Gauges work effectively and offer a dependable platform for identifying injury."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.611"
                                            },
                                            "Text": {
                                                "val": "-  Support medical studies using Blast Gauges as part of studies into the root causes of Traumatic Brain Injury.\n-  Provide end user training and support in the battlespace and CONUS.\n-  Complete a database to store and organize Blast Gauge recordings, sustainment, and transition and develop a web-based front-end to the database.\n-  Develop tools to analyze and visualize data uploaded to the database.\n-  Validate and refine the re-creation process.  Controlled blast testing will be done with the data used to reconstruct the event.  \n-  Expand the event reconstruction capability."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MT-15"
                    },
                    "ProjectTitle": {
                        "val": "MIXED TECHNOLOGY INTEGRATION"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "55.494"
                        },
                        "CurrentYear": {
                            "val": "74.744"
                        },
                        "BudgetYearOne": {
                            "val": "79.860"
                        },
                        "BudgetYearOneBase": {
                            "val": "79.860"
                        },
                        "BudgetYearTwo": {
                            "val": "83.198"
                        },
                        "BudgetYearThree": {
                            "val": "97.496"
                        },
                        "BudgetYearFour": {
                            "val": "107.594"
                        },
                        "BudgetYearFive": {
                            "val": "114.417"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The goal of the Mixed Technology Integration project is to leverage advanced microelectronics manufacturing infrastructure and DARPA component technologies developed in other projects to produce mixed-technology microsystems.  These 'wristwatch size', low-cost, lightweight and low power microsystems will improve the battlefield awareness, security of the warfighter and the operational performance of military platforms.  At the present time, systems are fabricated by assembling a number of mixed-technology components: microelectromechanical systems (MEMS), microphotonics, microfluidics and millimeterwave\/microwave.  Each technology usually requires a different level of integration, occupies a separate silicon chip and requires off-chip wiring, and requires fastening and packaging to form a module.  The chip assembly and packaging processes produce a high cost, high power, large volume and lower performance system.  This program is focused on the monolithic integration of mixed technologies to form batch-fabricated, mixed technology microsystems 'on-a-single-chip' or an integrated and interconnected 'stack-of-chips'.\n\nThe field of microelectronics incorporates micrometer\/nanometer scale integration and is the most highly integrated, low-cost and high-impact technology to date.  Microelectronics technology has produced the microcomputer-chip that enabled or supported the revolutions in computers, networking and communication.  This program extends the microelectronics paradigm to include the integration of heterogeneous or mixed technologies.  This new paradigm will create a new class of 'matchbook-size', highly integrated device and microsystem architectures.  Examples of component-microsystems include low-power, small-volume, lightweight, microsensors, microrobots and microcommunication systems that will improve and expand the performance of the warfighter, military platforms, munitions and Unmanned Air Vehicles (UAVs).\n\nThe program includes the integration of mixed materials on generic substrates including glass, polymers and silicon.  The program is design and process intensive, using 'standard' processes and developing new semiconductor-like processes and technologies that support the integration of mixed-technologies at the micrometer\/nanometer scale.  The program includes the development of micrometer\/nanometer scale isolation, contacts, interconnects and 'multiple-chip-scale' packaging for electronic, mechanical, fluidic, photonic and rf\/mmwave\/microwave technologies.  For example, a mixed-technology microsystem using integrated microfluidics, MEMS, microphotonics, microelectronics and microwave components could provide a highly integrated, portable analytical instrument to monitor the battlefield environment, the physical condition of a warfighter, the identity of warfighters (friend or foe) or the combat readiness of equipment.  The ability to integrate mixed technologies onto a single substrate will drive down the size, weight, volume, and cost of weapon systems while increasing their performance and reliability."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Endurance"
                                    },
                                    "Description": {
                                        "val": "The Endurance program will develop technology for pod-mounted lasers to protect a variety of airborne platforms from emerging and legacy electro-optical IR guided surface-to-air missiles.  The focus of the Endurance effort will be to develop and test ancillary subsystems, such as a command subsystem, a threat missile warning subsystem, a mechanical support framework, subsystem interfaces, and the design, integration, and testing of a form\/fit\/function brass-board laser countermeasure.  This program is an early application of technology developed in the Excalibur program and will transition via industry.  Applied research for this program is budgeted in PE 0602702E, project TT-06."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.588"
                                            },
                                            "Text": {
                                                "val": "-  Completed risk analysis of subsystems and their integration:  Identified low, medium, and high risk subsystems.\n-  Produced System Requirements Documents (SRDs) and Interface Control Documents (ICDs)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "22.800"
                                            },
                                            "Text": {
                                                "val": "-  Acquire threat devices and\/or surrogates in preparation for live fire testing.\n-  Complete the critical design of ancillary subsystems (power supply, thermal management, processing and control, mechanical support framework).\n-  Complete the preliminary design for subsystem integration including optical and electrical interconnections and their layouts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "36.747"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "36.747"
                                            },
                                            "Text": {
                                                "val": "-  Complete the critical design for subsystem integration.\n-  Integrate, assemble and bench-test the brassboard system.\n-  Test the brassboard laser weapon system at an outdoor test range against a representative set of dynamic-threat targets."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Diverse & Accessible Heterogeneous Integration (DAHI)"
                                    },
                                    "Description": {
                                        "val": "Prior DARPA efforts have demonstrated the ability to monolithically integrate different semiconductor types to achieve near-ideal \"mix-and-match\" capability for DoD circuit designers.  Specifically, one such program was the Compound Semiconductor Materials On Silicon (COSMOS) program, in which transistors of Indium Phosphide (InP) could be freely mixed with silicon complementary metal-oxide semiconductor (CMOS) circuits to obtain the benefits of both technologies (very high speed and very high circuit complexity\/density, respectively).  The Diverse & Accessible Heterogeneous Integration (DAHI) effort will take this capability to the next level, ultimately offering the seamless co-integration of a variety of semiconductor devices (for example, Gallium Nitride (GaN), Indium Phosphide, Gallium Arsenide, Antimonide Based Compound Semiconductors), microelectromechanical (MEMS) sensors and actuators, photonic devices (e.g., lasers, photo-detectors) and thermal management structures.  This capability will revolutionize our ability to build true \"systems on a chip\" (SoC) and allow dramatic size, weight and volume reductions for a wide array of system applications.   \n\nThis program has basic research efforts funded in PE 0601101E , Project ES-01 and applied research efforts funded in PE 0602716E, Project ELT-01  The Advanced Technology Development part of this program will leverage these complementary efforts  to focus on the establishment of an accessible, manufacturable technology for device-level heterogeneous integration of a wide array of materials and devices (including, for example, multiple electronics and MEMS technologies) with complex silicon-enabled (e.g. CMOS) architectures on a common silicon substrate platform.  This part of the program is expected to culminate in accessible foundry processes of DAHI technology and demonstrations of advanced microsystems with innovative architectures and designs that leverage heterogeneous integration.  By the end of the program, this effort seeks to establish a technologically mature, sustainable DAHI foundry service to be made available (with appropriate computer-aided design support) to a wide variety of DoD laboratory, Federally Funded Research and Development Center (FFRDC), academic and industrial designers."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.944"
                                            },
                                            "Text": {
                                                "val": "-  Develop a high-yield, high-reliability accessible manufacturing process flow which will be transitioned to a self-sustaining foundry activity providing heterogeneously integrated circuits with four materials\/device technologies (Silicon (Si) CMOS, Indium Phosphide (InP) Heterojunction Bipolar Transistor (HBTs), Gallium Nitride (GaN) High-electron-mobility transistor (HEMTs), and high-Q passive devices).\n-  Establish heterogeneous integration design\/simulation tool flows necessary to realize the full potential of heterogeneous microsystems integration.\n-  Demonstrate capability for supporting multi-project wafer runs using the heterogeneous foundry service under development.\n-  Accelerate development of circuit design techniques and methodologies that enable revolutionary heterogeneously integrated circuit architectures."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.300"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.300"
                                            },
                                            "Text": {
                                                "val": "-  Continue to develop a high-yield, high-reliability accessible manufacturing process flow which will be transitioned to a self-sustaining foundry activity providing heterogeneously integrated circuits with four materials\/device technologies (Si CMOS, InP HBTs, GaN HEMTs, and high-Q passive devices).\n-  Continue to demonstrate capability for supporting multi-project wafer runs using the heterogeneous foundry service under development."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FLASH - Scaling Fiber Arrays at Near Perfect Beam Quality"
                                    },
                                    "Description": {
                                        "val": "The goal of the FLASH program is to demonstrate array combinations of ultra-lightweight high power fiber lasers that project 100-kW-class beams with near perfect beam quality and very high electrical-to-optical efficiency capable of enabling a variety of high-energy laser weapons applications.  To accomplish these ends, FLASH will (1) greatly reduce the overall size and weight of high-power fiber lasers while increasing their robustness consistent with tactical and long-endurance aircraft integration, and (2) develop and demonstrate light-weight, high-power optical phased arrays and ultra-high bandwidth target-in-the-loop beam combination techniques for reducing necessary beam-projection profiles consistent with deployment in aircraft and near-perfect compensation for atmospheric turbulence.  The completed high-energy laser system will provide technology enabling engagement of air, space, and ground targets at mission relevant ranges."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate an array of approximately 1.2 kW fiber-lasers combined to produce >30 kW near-diffraction-limited output at >30% electrical-to-optical efficiency.\n-  Evaluate 21-element array system adaptive optical performance under various atmospheric and sea-surface conditions.\n-  Demonstrate target-in-the-loop phase-locking on stationary and moving extended targets at 1-8km tactical distances."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.313"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.313"
                                            },
                                            "Text": {
                                                "val": "-  Develop and test a coherently combinable, flight-worthy fiber laser with an output power, beam-quality, size and weight consistent with system integration on tactical aircraft.\n-  Finish a comprehensive system design review of the entire laser system including fiber lasers, thermal management, power systems, and beam steering."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Direct SAMpling Digital ReceivER (DISARMER)"
                                    },
                                    "Description": {
                                        "val": "The goal of the Direct SAMpling Digital ReceivER (DISARMER) program is to produce a hybrid photonic-electronic analog-to-digital converter (ADC) capable of directly sampling the entire X-band (8 -12 GHz).  Conventional electronic wideband receivers are limited in dynamic range by both the electronic mixer and the back-end digitizers.  By employing an ultra-stable optical clock, the DISARMER program will allow for mixer-less digitization and thereby improve the dynamic range 100x over the state of the art.  Such a wide bandwidth, high fidelity receiver will have applications in electronic warfare and signals intelligence systems with the potential to drastically reduce the cost, size and weight of these systems.\n\nThe DISARMER program will design, fabricate, and test a hybrid photonic-electronic ADC packaged in a standard form factor.  This involves the integration of electronic and photonic circuits, packaging of a mode-locked laser with ultralow jitter, and delivering a field programmable gate array with the necessary firmware to process the sampled data.  This program has applied research efforts funded in PE 0602716E, Project ELT-01."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "-  Define system architecture and flow-down metrics for individual components.\n-  Design a quantizer chip that will incorporate a hold\/reset switch for each photodetector, an electronic quantizer capable of 5 bits, and an encoder to convert the optical output of the photonic processor to a digital code.\n-  Design remote sampling head to incorporate electronic RF frontend, electro-optic modulator, and 4 GHz-wide filter."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "-  Fabricate and perform preliminary test of opto-electronic quantizer chip.\n-  Complete system engineering of field programmable gate array capable of continuous streaming of digital data.\n-  Demonstrate direct sampling of a 4 GHz-wide bandwidth signal at 7 effective bits of fidelity."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Direct On-Chip Digital Optical Synthesis (DODOS)"
                                    },
                                    "Description": {
                                        "val": "The development of techniques for precise frequency control of RF and microwave radiation in the 1940s revolutionized modern warfare.  Frequency control is the enabling technology for radar, satellite and terrestrial communications, and position-sensing and navigation technology, among many other core DoD capabilities.  To date, however, optical frequency synthesis has been limited to laboratory environments due to the large size, relative fragility, and high cost of optical comb-based synthesizers.  Recent developments on the DARPA Quantum Assisted Sensing and Readout (QuASAR) and in Ultrafast Laser Science and Engineering (PULSE) programs have demonstrated the possibility of generating self-referenced combs in microscale resonators.  Combined with technology and fabrication techniques developed in the Photonically Optimized Embedded Microprocessor (POEM) and Diverse & Accessible Heterogeneous Integration (DAHI) programs, it is now possible to develop a chip-scale integrated optical frequency synthesizer.  Ubiquitous low-cost robust optical frequency synthesis is expected to create a similar disruptive capability in optical technology as microwave frequency synthesis did in the 1940s, enabling high-bandwidth coherent optical communications, coherent synthesized-aperture LiDAR, portable high-accuracy atomic clocks, high-resolution standoff gas\/toxin detection, and intrusion detection, among other applications.\n\nThe Direct On-chip Digital Optical Synthesis (DODOS) program will create a microscale, high-accuracy optical frequency synthesizer, in a compact, robust package, suitable for deployment in a wide variety of mission-critical DoD applications."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.500"
                                            },
                                            "Text": {
                                                "val": "-  Develop DODOS system architecture.\n-  Optimize wavelength dispersion and low-threshold operation of micro-resonator based combs.\n-  Investigate promising early systems demonstrations employing DODOS technology."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Low Cost Thermal Imager - Manufacturing (LCTI-M)"
                                    },
                                    "Description": {
                                        "val": "The Low Cost Thermal Imager - Manufacturing (LCTI-M) effort builds upon previous manufacturing and imaging work and will develop a pocket-sized and smartphone-integrated, manufacturable, and practical thermal imager at a price point that allows it to be provided to large numbers of warfighters.  Availability of very low cost and small form-factor infrared (IR) cameras will facilitate new techniques and applications that could provide the decisive edge needed in modern battlefields.  These cameras will allow a soldier to have practical thermal imaging capability for locating warm objects (e.g., enemy combatants) in darkness.  The small size, weight and power (SWaP) thermal camera will be integrated with a handheld device such as a cell phone with network capability for tactical intelligence, surveillance and reconnaissance.  In order to achieve this goal, breakthroughs will be required in low-cost thermal imagers manufactured using wafer- scale integration, vacuum packaging, low-cost optics and low-power signal processing.  By the end of the program, the imager chips will be fully integrated with a low-cost processor and optics.  The camera will have wireless connectivity to integrate video display with cell phones or PDAs.  U.S. Army PEO Soldier Sensors and Lasers (SSL), PM Optics USMC, USSOCOM and industry will be the transition partners."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.000"
                                            },
                                            "Text": {
                                                "val": "-  Established interim small form-factor camera integration.\n-  Demonstrated and delivered interim 640x480, 17 micrometer (µm) pixel-pitch LCTI-M camera.\n-  Demonstrated 640x480 12 um pixel LCTI-M camera and imagery.\n-  Finalized design of low cost IR optics for LCTI-M.\n-  Demonstrated wafer-level optics with good uniformity across the wafer.\n-  Demonstrated an integrated smart phone and first prototype thermal camera.\n-  Initiated fabrication of 640x480- 10 µm-pitch microbolometers.\n-  Completed design of camera electronics."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete low-cost wafer-scale optics for LCTI-M camera.\n-  Demonstrate small-form-factor camera integration employing 3-D assembly techniques.\n-  Deliver interim prototypes for testing.\n-  Deliver final 640x480 LCTI-M cameras with test results and 1280X1024 camera engines."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Maskless Direct-Write Nanolithography for Defense Applications"
                                    },
                                    "Description": {
                                        "val": "The Maskless Direct-Write Nanolithography for Defense Applications program developed a maskless, direct-write lithography tool that addresses both DoD needs for affordable, high performance, Integrated Circuits (ICs) in small lots and the commercial market's need for highly customized, application-specific ICs.  In addition, this program has provided a cost effective manufacturing technology for low volume nanoelectromechanical system (NEMS) and nanophotonic devices within the DoD.  Transition will be achieved by installing maskless lithography tools into the Trusted Foundry and in commercial foundries, which will enable affordable incorporation of state-of-the-art semiconductor devices in new military systems, and allow for the cost-effective upgrade of legacy military systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.476"
                                            },
                                            "Text": {
                                                "val": "-  Designed and built a 4th generation electron-beam column capable of demonstrating 14 nm node lithography.\n-  Designed and built a compact electrode stack lens demonstrating 100 kilovolts standoff.\n-  Designed and built a permanent magnet lens demonstrating an axial field which gives 15 nm blur at a current of 2.5 microampere (µA) at the wafer plane.\n-  Demonstrated gray-scale patterning capability on wafers using multiple resist chemistries with a line resolution of 200 nm and a blur of 40 nm at a wafer current of 1.06 µA.\n-  Designed and fabricated a third generation pattern generator device and passed Complementary metal-oxide-semiconductors (CMOS) electrical test at full speed and at all \"corners.\""
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Excalibur"
                                    },
                                    "Description": {
                                        "val": "The Excalibur program developed high-power electronically-steerable optical arrays, with each array element powered by a fiber laser amplifier.  These fiber-laser arrays are sufficiently lightweight, compact, and electrically efficient to be fielded on a variety of platforms with minimal impact on the platform's original mission capabilities.  Each array element possesses an adaptive-optic capability to minimize beam divergence in the presence of atmospheric turbulence, together with wide-field-of-view beam steering for target tracking.  With each Excalibur array element powered by high power fiber laser amplifiers (at up to 3 kilowatts (kW) per amplifier), high power air-to-air and air-to-ground engagements have been enabled that were previously infeasible because of laser system size and weight.  In addition, this program developed kilowatt-class arrays of diode lasers which provided an alternate route to efficiently reaching mission-relevant power levels, and they tested the ultimate scalability of the optical phased array architecture.  Excalibur arrays are conformal to aircraft surfaces and scalable in size and power by adding additional elements to the array.  Excalibur provided the technology foundation for defense of next generation airborne platforms, including all aircraft flying at altitudes below 50,000 ft, against proliferated, deployed, and next-generation man-portable air-defense systems (MANPADS) and more capable air-to-air missiles converted for use as ground-to-air missiles.  Excalibur technology will enable these platforms to fly at lower altitude and conduct truly persistent, all-weather ground missions, such as reconnaissance despite low-lying cloud cover.  Further capabilities may include multichannel laser communications, target identification, tracking, designation, precision defeat with minimal collateral effects as well as other applications.\n\nThe Excalibur program also developed efficient high-power laser amplifier arrays based on coherent or spectral beam-combining.  The potential of these arrays to scale to tactical power levels (100 kilowatt class) was also investigated.  These laser amplifier arrays were designed to work in tandem with the core laser components developed under the Excalibur program in PE 0602702E, Project TT-06.  In addition a conceptual design and CONOPS development for a High Energy Laser Counter Measure (HELCM) system were developed to enable a near-term capability for low-altitude self-defense against MANPADS.  This technology will transition via industry, and will be incorporated into the Endurance program discussed earlier in this project (MT-15)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.035"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated 11.2 kW of combined optical output from 16 fiber lasers using hybrid beam combining.\n-  Demonstrated beam combining (coherent or spectral) of twenty-one 1-kW fiber laser amplifiers.\n-  Demonstrated coherent combining of a 19-element 2-D optical phased array with a combined power of 21 kW and tip\/tilt adaptive optics.\n-  Designed and built a mobile 21-element optical phased array with adaptive fiber-collimators."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Wide FOV Architectures for Image Reconstruction & Exploitation (AWARE)"
                                    },
                                    "Description": {
                                        "val": "The Advanced Wide FOV Architectures for Image Reconstruction & Exploitation (AWARE) program primarily addressed the passive imaging needs for multi-band, wide field-of-view (FOV) and high-resolution imaging for ground and near-ground platforms.  The AWARE program sought to solve the technological barriers to wide FOV, high resolution and multi-band camera architectures by focusing on four major tasks: high space-bandwidth product (SBP) camera architecture; small-pitch pixel focal plane array architecture; broadband focal plane array architecture; and multi-band focal plane array architecture.\n\nThe AWARE program has advanced integration of technologies that enable wide field of view and high resolution and multi-band cameras, including the technologies demonstrated in the related AWARE program in PE 0602716E, Project ELT-01.  AWARE aggregated the following programs: Lambda Scale, Broadband, Multi-Band and Wide Field of View.  The integration of the technologies will enable next-generation focal plane arrays (FPAs) and cameras.  Such focal plane arrays can also be used to fabricate very high pixel-count cameras for persistent surveillance applications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.395"
                                            },
                                            "Text": {
                                                "val": "-  Optimized broadband detector array fabrication and assembly processes to maximize FPA operability.  Hybridized 1024x1024, 18 µm-pixel-pitch detector arrays to readout integrated circuits.\n-  Finalized camera integration and demonstrated broadband (0.5 to 5 µm) performance with 1024x1024, 18 µm-pixel-pitch FPA.\n-  Fabricated and demonstrated 1280x720, 5 µm-pixel-pitch Long-Wave IR (LWIR) and Mid-Wave IR (MWIR) FPAs for imaging in cluttered and in brownout conditions.\n-  Conducted initial field tests for MWIR rifle scope.\n-  Delivered a camera with a 2Kx2K sensor to be used for evaluations under brownout landing conditions.\n-  Completed the development of an algorithm for imaging through brown-out, and integration into an Field-Programmable Gate Array (FPGA)."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                }
            ]
        }
    }
}