{
    "id": "9fc00cf20bdabb9691393ab4e2cf889d6de1c3d6",
    "meta": {
        "filename": "dod-2015_RDTE_2015_OSD_RDTE_JustificationBook_Office_of_Secretary_Of_Defense_PB_2015.zzz_unzipped_RDTE_JustificationBook_Office_of_Secretary_Of_Defense_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604055D8Z"
        },
        "ProgramElementTitle": {
            "val": "Operational Energy Capability Improvement"
        },
        "R1LineNumber": {
            "val": "72"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "23.909"
            },
            "PriorYear": {
                "val": "27.966"
            },
            "CurrentYear": {
                "val": "47.001"
            },
            "BudgetYearOne": {
                "val": "31.800"
            },
            "BudgetYearOneBase": {
                "val": "31.800"
            },
            "BudgetYearTwo": {
                "val": "37.584"
            },
            "BudgetYearThree": {
                "val": "38.870"
            },
            "BudgetYearFour": {
                "val": "38.870"
            },
            "BudgetYearFive": {
                "val": "41.771"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The basic mission of this program element is to fund innovation that will improve the Department’s operational effectiveness via targeted operational energy science and technology investments. It contains two projects.\n\nP455, the Operational Energy Capability Improvement Fund (OECIF), incentivizes science and technology to promote long term change in the Department's capabilities to be better aligned with the Operational Energy Strategy. It generally fosters innovation to improve operational energy performance. This mission has two key aspects.  First, to develop and\/or demonstrate, and rapidly transition into, use operational energy technologies or practices that will improve the Department’s military capabilities and\/or reduce its costs. Second, to establish within the military Services sustainable, institutional capacity to continue to research, develop and adopt operational energy innovations. OECIF funds serve as “seed money” to consolidate or start promising operational energy programs, directions or changes to be sustained by the Services; accordingly, OECIF generally emphasizes supporting or establishing programs, rather than one-off projects.\n\nP456, the Hybrid Energy Storage Module, co-sponsored by ASD(R&E) and ASD(OEPP), develops advanced technology in energy storage to maximize performance and reliability, and enable future high power weapons and sensor systems on legacy and next generation vehicles, aircraft and ships. The goals of this program are to (1) demonstrate energy storage systems with high power and energy densities, scalable to all power levels, that reduce total logistics demand, increase platform ability to sustain operations during engagement, and (2) reduce maintenance. Once demonstration is complete, this technology will be sustained by the Services. This program is closely coordinated with the Advanced Management and Protection of Energy-storage Devices (AMPED) program of the Department of Energy’s Advanced Research Projects Agency – Energy (ARPA-E). AMPED technology will be used to potentially extend the operational performance benefits and safety for these applications beyond the hybrid storage module baseline design configurations."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "23.909"
                },
                "CurrentYear": {
                    "val": "52.001"
                },
                "BudgetYearOne": {
                    "val": "37.120"
                },
                "BudgetYearOneBase": {
                    "val": "37.120"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "27.966"
                },
                "CurrentYear": {
                    "val": "47.001"
                },
                "BudgetYearOne": {
                    "val": "31.800"
                },
                "BudgetYearOneBase": {
                    "val": "31.800"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "4.057"
                },
                "CurrentYear": {
                    "val": "-5.000"
                },
                "BudgetYearOne": {
                    "val": "-5.320"
                },
                "BudgetYearOneBase": {
                    "val": "-5.320"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FY 2014\/ 2015 Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "4.057"
                                },
                                "CurrentYear": {
                                    "val": "-5.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-5.320"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-5.320"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P455"
                    },
                    "ProjectTitle": {
                        "val": "Operational Energy Capability Improvement"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "20.659"
                        },
                        "PriorYear": {
                            "val": "27.966"
                        },
                        "CurrentYear": {
                            "val": "32.088"
                        },
                        "BudgetYearOne": {
                            "val": "31.800"
                        },
                        "BudgetYearOneBase": {
                            "val": "31.800"
                        },
                        "BudgetYearTwo": {
                            "val": "37.584"
                        },
                        "BudgetYearThree": {
                            "val": "38.870"
                        },
                        "BudgetYearFour": {
                            "val": "38.870"
                        },
                        "BudgetYearFive": {
                            "val": "41.771"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Operational Energy Capability Improvement Fund (OECIF)\n\nThe basic mission of the Operational Energy Capability Improvement Fund (OECIF) is to fund innovation that will improve the Department’s operational effectiveness via targeted science and technology investments. As Defense-Wide funding, it incentivizes science and technology to promote long term change in the Department's capabilities to be better aligned with the Department’s Operational Energy Strategy. Generally, it fosters innovation to improve operational energy performance. This mission has two key aspects. First, to develop and\/or demonstrate, and transition into use operational energy technologies or practices that will improve the Department’s military capabilities and reduce its costs. Second, to establish within the military Services sustainable, institutional capacity to continue to research, develop and adopt operational energy innovations. OECIF funds serve as “seed money” to consolidate or start promising operational energy programs, directions or changes to be sustained by the Services; accordingly, OECIF generally emphasizes supporting or establishing programs, rather than one-off projects."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Operational Energy Capability Improvement"
                                    },
                                    "Description": {
                                        "val": "The basic mission of the Operational Energy Capability Improvement Fund (OECIF) is to fund innovation that will improve the Department’s operational effectiveness via targeted science and technology investments.  As Defense-Wide funding, it incentivizes long term change in the science and technology portfolio of the Department to be better aligned with the Department’s Operational Energy Strategy.  Generally, it fosters innovation to improve operational energy performance.  This mission has two key aspects.  First, to develop and\/or demonstrate, and rapidly transition into the force, operational energy technologies or practices that will improve the Department’s military capabilities and reduce its costs.  Second, to establish within the military Services sustainable institutional capacities that will continue to research, develop and adopt operational energy innovations.  OECIF funds serve as “seed money” to consolidate or start promising operational energy programs or directions to be sustained by the Services; accordingly, it is the intention that OECIF emphasize supporting or establishing programs, rather than one-off projects."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "27.966"
                                            },
                                            "Text": {
                                                "val": "The expeditionary outpost energy load reduction and waste-to-energy programs begun in FY 2012 were continued and four operational energy consortia programs were started.\n\nThe Army\/ Navy cooling technology program awarded contracts for pursuing mid and long-term ECU technologies, and evaluated commercial cooling units and components for comparison. The Navy\/ARPA-E cooling technology program completed feasibility studies of two competing prototypes to efficiently remove humidity from the air before cooling.  It also began three other projects based on innovative cooling technologies. The Army\/Air Force soft shelters\/tent program completed design of selected shelter configurations; conducted field demos of shelter systems in Kuwait which showed a 50 percent energy savings; and worked on advanced component technologies to be used in future designs. The super energy efficient Containerized Living Unit (SuperCLU) program built a Phase 1 prototype SuperCLU and continued improving the design. They completed testing improved CLUs and the prototype SuperCLUs at 29 Palms, CA, and existing CLU ECUs and coatings in Camp Lemonnier, Africa. The PACOM\/DOE program that tests load reduction technologies in tropical environments participated in operations in Thailand and Philippines, gathering energy usage data. They also developed and promoted their I-Net technology assessment capability and completed 2-dozen technology assessments. The Waste-to-Energy program completed syngas-cleaning prototype fabrication which is now being tested.  The program also completed rotary kiln hardware assembly and fabrication of the first prototype Shredded Waste Gasifier.\n\nThe new programs, started in FY 2013, are broad, comprehensive efforts to improve DoD’s operational energy performance, particularly by involving non-traditional innovators and small businesses in meeting DoD’s operational energy challenges through mechanisms such as consortia. These four new programs focus on: developing DoD standards for tactical microgrids; tools and training for more efficient planning and control of the energy resources at expeditionary outposts; technologies and systems engineering techniques to better manage soldier and small unit power and reduce their battery burden; and reducing aircraft fuel consumption by reducing drag through engineered surfaces and materials."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "32.088"
                                            },
                                            "Text": {
                                                "val": ".The programs started in FY 2012 and FY 2013 will be continued, provided the individual programs are proceeding properly. The Army\/Navy cooling technology program will complete ECU system design; construct, test and demo a prototype for Technology Enabled Capability Demonstration (TeCD); continue research on integrated power and environmental control technologies. The Navy\/ARPA-E cooling technologies program will complete developments for a transition demo at TRL 6 in FY 2015. The Army\/Air Force soft shelter tent program will complete initial demonstrations and validate mathematical models and simulations. The Navy Containerized Living Unit program will complete testing both advanced and upgraded CLUs.  The PACOM\/DOE program will continue lab and field assessment of promising technologies, probably in Guam, and continue to seek fee for service partners for long term sustainment of the program, while nurturing relationships with existing partners. For the Waste-to-Energy program, detailed designs for new devices will be prepared and operational tests will be performed.\n\nRegarding the consortia programs begun in FY 2013: The Army led program in tactical microgrid standards will focus on identifying gaps in standards, policy, and practices that pose obstacles for system implementation. These gaps will be categorized into a development agenda for the project. The need for standards for small, medium, and large forward operating bases will be documented and the similarities and differences identified.  The Navy led program for energy efficient expeditionary outposts will begin verifying models and defining dashboard requirements. The Army led soldier\/small unit program will establish a consortium that will formulate a next-generation Soldier\/Small Combat Unit Power and Energy architecture for the future. The program will also develop a return on investment tool to enable traditional defense contractors, non-traditionals, and small businesses to evaluate the ROI for their innovative soldier power and energy concepts. The Air Force drag reduction program will form a consortium; issue RFPs, and award studies for drag reduction technologies. \n\nFY 2014 new starts will focus on filling operational energy technology gaps identified in a technology gap assessment effort completed by ASD(R&E) in FY 2012. For FY 2014, the planned focus is methods and tools, including modeling and simulation, to embed energy considerations throughout DoD's planning processes, before engineering particular systems or platforms. This will facilitate making operational energy a consideration during such processes as war-games, force planning, requirements development and acquisition planning. With better methods and tools for understanding the burdens and vulnerabilities imposed by operational energy needs and how those needs affect our military effectiveness, planners and decision makers will be able to make choices that are better informed by operational energy considerations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "31.800"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "31.800"
                                            },
                                            "Text": {
                                                "val": "In FY 2015, the programs for expeditionary outpost load reduction technologies will largely be reaching conclusion. The Navy\/ ARPA-E program for cooling technologies will complete testing and optimization of the Absorption Heat Pump, Genset Heat Recovery Adsorption Chiller, and Stirling Air Conditioner prototypes, and hold TRL 6 transition demonstrations. The PACOM\/DOE testbed plans to complete the transition to a fee-for-service model for long-term viability.\n\nRegarding the consortia programs: The Army-led program in tactical microgrid standards will prepare draft standards for tactical microgrids that will include (a) interconnection and islanding, (b) communication and controls, and (c) safety, protection and human factors. The Navy led program for planning and operating energy efficient expeditionary outposts will refine power models based on testing and feedback and will implement an alpha version of the dashboard for testing and feedback for extended development. The Army-led soldier\/small unit program will use the Architecture developed in FY 2014 to develop technologies to demonstrate electrical load reduction, improved energy supply, and power management and distribution techniques.  These will reduce the operational, fiscal, and human burdens imposed by batteries\/energy technologies. The Air Force drag reduction program will hold a second workshop to review progress and to choose awardees for a second round of research awards. Lab, wind tunnel, and flight testing of surfaces and coating technologies will occur throughout the year as needed. In addition, the FY2014 new starts will be ramping up.  These programs will be aimed at developing methods and tools, including modeling and simulation, to embed operattional energy considerations throughout DoD’s planning processes.\n\nGenerally, FY 2015 new starts will be focused on filling one or more of the operational energy technology gaps identified in a technology gap assessment  completed by ASD(R&E) or other significant gaps OEPP identifies in Service S&T funding.  Consistent with the mission of this funding , these programs will aim to fill some of the gaps by funding the startup of sustainable S&T programs within the Services. The five top priority gaps are: High Efficiency Energy Conversion and Harvesting; Energy Integrated Design and Simulation; High Efficiency Propulsion and Platform Design; Environmental Control Systems; Flexible and Adaptive Power Distribution."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "None"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P456"
                    },
                    "ProjectTitle": {
                        "val": "Hybrid Energy Storage Module (HESM)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "3.250"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "14.913"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "P456, the Hybrid Energy Storage Module (HESM), co-sponsored by ASD(R&E) and ASD(OEPP), develops advanced technology in energy storage to maximize performance and reliability, and enable future high power weapons and sensor systems on legacy and next generation vehicles, aircraft and ships. The goals of this program are to (1) demonstrate energy storage systems with high power and energy densities, scalable to all power levels, that reduce total logistics demand, increase platform ability to sustain operations during engagement, and (2) reduce maintenance. Once demonstration is complete, this technology will be sustained by the Services. This program is closely coordinated with the Advanced Management and Protection of Energy-storage Devices (AMPED) program of the Department of Energy’s Advanced Research Projects Agency – Energy (ARPA-E). AMPED technology will be used to potentially extend the operational performance benefits and safety for these applications beyond the hybrid storage module baseline design configurations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Hybrid Energy Storage Module (HESM)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "The hybrid energy storage module efforts begun in FY2012 were continued including hybrid energy storage research of application oriented model development, establishment of test-beds and device limitation characterization at the service laboratories for military specific applications, design architecture for plug-and-play capabilities, definition of safety metrics, and validation & verification of advanced complex controls. Further effort established system level metrics for HESM demonstrations and concept of operations in all demonstration areas. Efforts associated with Army and USMC battlefield generator and vehicle HESM demonstrator development were continued. Key new initiatives in FY 2013 were initiated for Air Force and Navy aircraft, and Navy ships HESM demonstrator development. Further energy storage technology demonstration effort associated with safe operation of energy storage impacting all three military application areas was initiated. The goal of this effort is to develop and demonstrate a safe energy storage structure which is capable of not only buffering against life-reducing high operating temperatures due to aggressive cycling operations but also preventing or limiting thermal runaway conditions. These efforts are executed by the Services."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.913"
                                            },
                                            "Text": {
                                                "val": "For FY 2014, the hybrid energy storage module (HESM) efforts established in FY 2012 and 2013 will be continued including Air Force and Navy aircraft, Navy ships HESM, and safe energy storage demonstrator development. Efforts including hybrid energy storage research of application oriented model development, establishment of test-beds and device limitation characterization at the service laboratories for military specific applications, design architecture for plug-and-play capabilities, definition of safety metrics, and validation & verification of advanced complex controls will be completed. The Army and USMC battlefield generator and vehicle HESM unit will be demonstrated and transitioned to the Services. Based on results of development and demonstration, define standards and assess the operational impact for varieties of energy storage devices and HESM modules for insertion into current and future military platforms.  \n\n\n."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "None"
                        }
                    }
                }
            ]
        }
    }
}