{
    "id": "a171b5938b93842946bbd4c4d50fdeadbda03646",
    "meta": {
        "filename": "dod-2015_RDTE_2015_AIRFORCE_V1_RDTE_JustificationBook_Air_Force_PB_2015.zzz_unzipped_RDTE_JustificationBook_Air_Force_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602605F"
        },
        "ProgramElementTitle": {
            "val": "Directed Energy Technology"
        },
        "R1LineNumber": {
            "val": "11"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "96.401"
            },
            "CurrentYear": {
                "val": "112.783"
            },
            "BudgetYearOne": {
                "val": "125.955"
            },
            "BudgetYearOneBase": {
                "val": "125.955"
            },
            "BudgetYearTwo": {
                "val": "117.559"
            },
            "BudgetYearThree": {
                "val": "120.495"
            },
            "BudgetYearFour": {
                "val": "119.591"
            },
            "BudgetYearFive": {
                "val": "121.091"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program covers research in directed energy (DE) technologies, primarily high energy lasers (HELs), including devices, optical beam control, and integration; ground-based optical space situational awareness (SSA); and high power electromagnetics (HPEM).  Laser research includes moderate to high power laser devices that are applicable to a wide range of applications, optical technologies to propagate lasers beams from a device, and integration of these technologies.  In SSA, this research uses the Starfire Optical Range and the Maui Space Surveillance System to develop and implement technologies to identify visual characteristics such as status and health of orbiting space objects.  In HPEM, this research examines technologies for applications such as counter-electronics and non-lethal weapons.  Research into other novel DE applications will be conducted.  DE vulnerability\/lethality assessments are conducted and protection technologies are developed.  Research into other advanced non-conventional\/innovative weapons will be conducted.  Tools are developed and used to compare solutions and to determine the most effective and efficient DE technologies to meet Air Force needs.  Efforts in this program have been coordinated through the Department of Defense (DoD) Science and Technology (S&T) Executive Committee process to harmonize efforts and eliminate duplication.  This program is in Budget Activity 2, Applied Research, since it develops and determines the technical feasibility and military utility of evolutionary and revolutionary technologies."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "106.196"
                },
                "CurrentYear": {
                    "val": "112.845"
                },
                "BudgetYearOne": {
                    "val": "128.153"
                },
                "BudgetYearOneBase": {
                    "val": "128.153"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "96.401"
                },
                "CurrentYear": {
                    "val": "112.783"
                },
                "BudgetYearOne": {
                    "val": "125.955"
                },
                "BudgetYearOneBase": {
                    "val": "125.955"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-9.795"
                },
                "CurrentYear": {
                    "val": "-0.062"
                },
                "BudgetYearOne": {
                    "val": "-2.198"
                },
                "BudgetYearOneBase": {
                    "val": "-2.198"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.205"
                    },
                    "CurrentYear": {
                        "val": "-0.062"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "-7.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "9.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.651"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-9.939"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-2.198"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.198"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Decrease in FY13 Congressional Directed Reductions due to delayed research supporting future electronic laser on a large aircraft.\nIncrease in FY13 Congress Add for enhanced efforts in space situational awareness\nDecrease in FY13 Other Adjustments was due to Sequestration.\nDecrease in FY15 Other Adjustments is due to higher DoD priorities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "624866"
                    },
                    "ProjectTitle": {
                        "val": "Lasers & Imaging Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "71.579"
                        },
                        "CurrentYear": {
                            "val": "79.760"
                        },
                        "BudgetYearOne": {
                            "val": "76.319"
                        },
                        "BudgetYearOneBase": {
                            "val": "76.319"
                        },
                        "BudgetYearTwo": {
                            "val": "78.018"
                        },
                        "BudgetYearThree": {
                            "val": "85.948"
                        },
                        "BudgetYearFour": {
                            "val": "84.887"
                        },
                        "BudgetYearFive": {
                            "val": "85.722"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project explores the technical feasibility of moderate to high power lasers, including beam control, for applications such as aircraft protection, force protection, and precision engagement.  This project investigates the effects of laser weapons on a wide range of systems and components as well as producing, modifying, validating and applying DE and non-DE concept development and assessment tools to determine which technology solutions to pursue.  Research supporting ground-based optical space situational awareness is conducted."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Space Situational Awareness"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "8.161"
                                        },
                                        "Text": {
                                            "val": "Conducted space situational awareness research."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "High Energy Laser Technologies and Directed Energy Assessments"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate high energy laser device technologies for Air Force applications.  Develop and demonstrate optical laser beam control technologies including atmospheric compensation and pointing and tracking.  Perform laser system level modeling and simulation validated by laser effects and vulnerability testing.  Develop tools and perform assessments which allow comparisons among DE concepts and tradeoffs between DE and non-DE solutions.  Integrate optical beam control technologies with laser device technologies and demonstrate the combined technologies.  Develop and use technologies to better understand the vulnerability of weapon systems to lasers."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "47.172"
                                            },
                                            "Text": {
                                                "val": "Developed new method of fabricating and producing quantum cascade lasers (mid-to long-wavelength infrared) to enable greater than five times improvement in brightness over commercially available sources.  Scaled pulsed optically-pumped semiconductor laser in the mid-infrared (eye-safer) wavelength to kilowatt-class peak power.  The flowing diode pumped alkali laser effort completed design work on a new laser head that will protect the device windows from rubidium contamination, enabling higher laser performance.  Reduced the linewidth of the monolithic fiber amplifier in the laboratory to five gigahertz with a power output of over 900 Watts with good beam quality.  This is approximately three times narrower than the linewidths of commercial amplifiers.  Demonstrated technologies to support pointing and tracking of targets for a ground based demonstration.  Evaluated and integrated horizontal propagation compensation concepts for field testing.  Conducted beam control research in support of a demonstration of a high power solid state laser with a beam control system on the ground.  Developed models incorporating aero-effects on HEL beams projected from the beam control system.  Conducted effects testing to establish requirements for aircraft self-protection laser system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "52.244"
                                            },
                                            "Text": {
                                                "val": "Continue to conduct research supporting a joint Air Force\/Defense Advanced Research Projects Agency (DARPA) ground demonstration of a high power solid state laser with a beam control system.  Prepare for future flight tests of beam control technologies.  Continue integration and begin testing of horizontal propagation compensation concepts.  Begin developing analysis tools including platform, optics, controls, atmospheric effects, and target predictions supporting future weapons analysis for an Integrated Weapons Environment for Analysis (IWEA) to analyze directed and kinetic energy weapons in a common environment to help plan weapons investments.  Conduct effects testing to establish system requirements and validate modeling efforts.  Design a narrow line width (sub-gigahertz) monolithic fiber amplifier with good beam quality.  Begin design of laser system for aircraft self-protection."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "51.192"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "51.192"
                                            },
                                            "Text": {
                                                "val": "Continue to conduct research supporting a joint Air Force\/DARPA ground demonstration of a high power solid state laser with a beam control system.  Begin integration of beam control technologies and monolithic fiber amplifier for ground to air field tests.  Use effects testing to establish system requirements and validate modeling efforts.  Evaluate subscale turret beam control technologies.  Update and use IWEA to analyze directed and kinetic energy weapons in a common environment to help plan weapons investments.  Use intelligence information to evaluate foreign HEL threats and provide weapon system and technology developers with tools and criteria to help protect US systems.  Continue design of laser system for aircraft self-protection."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Optical Space Situational Awareness and Satellite Vulnerability"
                                    },
                                    "Description": {
                                        "val": "Develop advanced, long-range, electro-optical technologies that support ground-based optical SSA.  Develop and use technologies to better understand the vulnerability of blue satellite systems to lasers.  Operated the Starfire Optical Range in support of internal and customer requirements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.246"
                                            },
                                            "Text": {
                                                "val": "Improved satellite characterization tools, developing algorithms to determine altitude and shape of satellites in geosynchronous orbit.  Developed initial capabilities for extending existing imaging techniques into 24-hour operations.  Demonstrated the ability to image space objects during extended daylight hours using the 3.6-meter telescope, enabling for the first time the observation of objects in orbit that cannot be viewed at night."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "27.516"
                                            },
                                            "Text": {
                                                "val": "Demonstrate capability to determine orientation of geosynchronous satellites.  Demonstrate use of laser guidestar to enable detection of objects the size of a basketball in close proximity to geosynchronous satellites.  Develop data analysis techniques to understand and keep track of potential threat objects in space.  Develop initial capabilities for extending existing techniques into 24-hour operations.  Develop technologies to quantify the vulnerability and protection needs of certain blue satellite components."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "25.127"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "25.127"
                                            },
                                            "Text": {
                                                "val": "Develop dynamic telescope control to keep track of potential threat objects in space.  Demonstrate data analysis techniques to understand characteristics of potential space threats and satellite anomalies.  Demonstrate capabilities for extending existing techniques into 24-hour operations. Evaluate concepts for persistent monitoring of space events and capability to image and search the local space around our high-value satellite assets, including low power testing for those in geosynchronous orbits."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "624867"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Weapons & Survivability Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "24.822"
                        },
                        "CurrentYear": {
                            "val": "33.023"
                        },
                        "BudgetYearOne": {
                            "val": "49.636"
                        },
                        "BudgetYearOneBase": {
                            "val": "49.636"
                        },
                        "BudgetYearTwo": {
                            "val": "39.541"
                        },
                        "BudgetYearThree": {
                            "val": "34.547"
                        },
                        "BudgetYearFour": {
                            "val": "34.704"
                        },
                        "BudgetYearFive": {
                            "val": "35.369"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project explores the use of HPEM and other unconventional\/innovative weapon concepts to support applications such as nonlethal counter-personnel and electronic warfare including disruption, degradation, and damage of electronic infrastructure.  This research includes weapon technology that can provide covert effects and\/or no collateral or human damage.  The project also investigates the effects of potential adversary HPEM weapons and how to mitigate those effects on US assets, as well as producing and applying DE and non-DE concept development and assessment tools to determine which technology solutions to pursue.  HPEM includes but is not limited to high power microwaves, plasmas, particle beams and millimeter waves."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "HPEM and Unconventional  Weapon Technologies"
                                    },
                                    "Description": {
                                        "val": "Investigate technologies for HPEM components.  Investigate HPEM and other unconventional weapon concepts using innovative technologies.  Investigate advanced technologies that support force protection tactical applications, including non-lethal counter-personnel applications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.715"
                                            },
                                            "Text": {
                                                "val": "Developed technologies to provide frequency agile, broadband sources.  Developed state-of-the-art components to shrink antennas, microwave components, and energy storage\/prime power technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.933"
                                            },
                                            "Text": {
                                                "val": "Develop state-of-the-art components to further shrink antennas, microwave sources, and energy storage\/prime power systems.  Investigate technologies to provide frequency agile, broadband sources.  Conduct assessments on the feasibility of particle beam weapons for counter-electronics."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "30.268"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "30.268"
                                            },
                                            "Text": {
                                                "val": "Begin ultra-short pulsed laser atmospheric propagation studies.  Conduct effects studies on electronics based on the assessments from FY14.  Develop compact 50 kilovolt solid state switch.  Develop designs for 100 megavolt test facility accelerator.  Increase development of technologies leading to more efficient, smaller, lighter, and more powerful HPEM systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HPEM Effects and Mitigation Research"
                                    },
                                    "Description": {
                                        "val": "Assess the effects\/lethality of HPEM technologies.  Develop and apply sophisticated models to enhance the development of HPEM and related technology.  Develop tools and perform assessments which allow comparisons among DE concepts and tradeoffs between DE and non-DE solutions.   Investigate technologies to counter the effects of HPEM."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.107"
                                            },
                                            "Text": {
                                                "val": "Investigated effects of high bandwidth technologies, exploring issues to exploit\/prevent cyber-attack.  Developed smart waveform technologies and techniques as well as predictive effects methodologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.090"
                                            },
                                            "Text": {
                                                "val": "Begin incorporating effects of high bandwidth and smart waveform technologies and techniques into numerical simulations.  Begin funding the Air Force portion of the High Power Microwave Software Applications Institute.  This is an Air Force\/DoD High Performance Computing Modernization Program for the development of advanced, user friendly, modeling and simulation capability for entire HPEM systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.368"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.368"
                                            },
                                            "Text": {
                                                "val": "Develop source for effects testing that operates in three microwave bands.  Complete integration of software into DE High Performance Computing Software Applications Institute, which allows modeling of DE sources and propagation that involves plasmas.  Assess potential improvements to US weapons systems from employing HPEM weapons technologies for platform protection and target prosecution.  Use intelligence information to evaluate foreign HPEM threats and provide weapon system and technology developers with tools and criteria to help protect US systems."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}