{
    "id": "a1e1bd2558bb8463d3f0dd85eb49a0cc1ee929e5",
    "meta": {
        "filename": "dod-2015_RDTE_2015_OSD_RDTE_JustificationBook_Office_of_Secretary_Of_Defense_PB_2015.zzz_unzipped_RDTE_JustificationBook_Office_of_Secretary_Of_Defense_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603851D8Z"
        },
        "ProgramElementTitle": {
            "val": "Environmental Security Technology Certification Program"
        },
        "R1LineNumber": {
            "val": "81"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "61.838"
            },
            "PriorYear": {
                "val": "67.998"
            },
            "CurrentYear": {
                "val": "66.453"
            },
            "BudgetYearOne": {
                "val": "51.462"
            },
            "BudgetYearOneBase": {
                "val": "51.462"
            },
            "BudgetYearTwo": {
                "val": "52.190"
            },
            "BudgetYearThree": {
                "val": "54.130"
            },
            "BudgetYearFour": {
                "val": "57.549"
            },
            "BudgetYearFive": {
                "val": "62.143"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "(U) ESTCP demonstrates and validates the most promising innovative environmental and energy technologies that target DoD's most urgent needs.   Technologies selected are projected to provide a return on the investment through cost savings and improved efficiencies. The program responds to: (1) Congressional concern over the slow pace of remediation of environmentally polluted sites on military installations, (2) Congressional direction to conduct demonstrations specifically focused on emerging new technologies, and (3) the need to improve defense readiness by reducing the drain on the Department's operation and maintenance dollars caused by environmental restoration, waste management, and the cost of energy. Preference for demonstrations is given to technologies that have successfully completed all necessary research and development objectives, and address the highest priority DoD requirements."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "75.941"
                },
                "CurrentYear": {
                    "val": "71.453"
                },
                "BudgetYearOne": {
                    "val": "60.414"
                },
                "BudgetYearOneBase": {
                    "val": "60.414"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "67.998"
                },
                "CurrentYear": {
                    "val": "66.453"
                },
                "BudgetYearOne": {
                    "val": "51.462"
                },
                "BudgetYearOneBase": {
                    "val": "51.462"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-7.943"
                },
                "CurrentYear": {
                    "val": "-5.000"
                },
                "BudgetYearOne": {
                    "val": "-8.952"
                },
                "BudgetYearOneBase": {
                    "val": "-8.952"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FY 13 Program Adjustment"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-7.943"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FY 14 Program Reduction"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "-5.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FY 15 Strategic Efficiency Reduction"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-8.952"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-8.952"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 13 and 14 program decreases are a result of General Congressional reductions.\nFY 2015 Funding decreased to match the department's mission priorities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P514"
                    },
                    "ProjectTitle": {
                        "val": "Environmental Security Technology Certification Program"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "61.838"
                        },
                        "PriorYear": {
                            "val": "67.998"
                        },
                        "CurrentYear": {
                            "val": "66.453"
                        },
                        "BudgetYearOne": {
                            "val": "51.462"
                        },
                        "BudgetYearOneBase": {
                            "val": "51.462"
                        },
                        "BudgetYearTwo": {
                            "val": "52.190"
                        },
                        "BudgetYearThree": {
                            "val": "54.130"
                        },
                        "BudgetYearFour": {
                            "val": "57.549"
                        },
                        "BudgetYearFive": {
                            "val": "62.143"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "(U) ESTCP demonstrates and validates the most promising innovative environmental and energy technologies that target DoD's most urgent needs.   Technologies selected are projected to provide a return on the investment through cost savings and improved efficiencies. The program responds to: (1) Congressional concern over the slow pace of remediation of environmentally polluted sites on military installations, (2) Congressional direction to conduct demonstrations specifically focused on emerging new technologies, and (3) the need to improve defense readiness by reducing the drain on the Department's operation and maintenance dollars caused by environmental restoration,waste management, and the cost of energy. Preference for demonstrations is given to technologies that have successfully completed all necessary research and development objectives, and address the highest priority DoD requirements."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Environmental Technology Demonstration\/Validation"
                                    },
                                    "Description": {
                                        "val": "Funds are programmed for investments in projects that address priority DoD environmental requirements. The focus of the program is on live site UXO discrimination demonstrations, addressing emerging and recalcitrant cleanup issues, range sustainment technologies, and reducing life cycle costs of DoD weapon systems by eliminating hazardous materials.  Accomplishments\/plans are described for each FY below."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "39.444"
                                            },
                                            "Text": {
                                                "val": "In FY 2013 projects were funded to address priority DoD environmental requirements. Focused new investment topics for FY 2013 included: 1) Remediation of Contaminated Groundwater; 2) In Situ Management of Contaminated Sediments; 3) Characterization, Control, and Treatment of Range Contamination; 4) Watershed Management Tools for DoD Installations; 4) Alternatives to Cadmium Plating in Manufacturing and Maintenance of Weapons Systems; and 5) Military Munitions Detection, Discrimination, and Remediation. Details are provided at www.serdp-estcp.org"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "34.453"
                                            },
                                            "Text": {
                                                "val": "Funds are planned for continued investment in projects that address priority DoD environmental requirements. Focused new investment topics for FY 2014 include: 1) Remediation of Contaminated Groundwater; 2) In Situ Management of Contaminated Sediments; 3) Airfield Natural Resources Managemen to Reduce Bird Air-Strike Hazard (BASH) Threats; 4) Wastewater Treatment at DoD Facilities; and 5) Military Munitions Detection, Discrimination, and Remediation. Funding in FY 2014 also supports live site UXO demonstrations. This effort will transition innovative technologies that can reduce DoD's military munitions response liabilities by approximately 75% with an expected cost savings of $10 billion. Details are provided at www.serdp-estcp.org."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "28.415"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "28.415"
                                            },
                                            "Text": {
                                                "val": "Funds are planned for continued investment in projects that address priority DoD environmental requirements.  New investment topics for FY 2015 include: 1) Remediation of Contaminated Groundwater; 2) In Situ Management of Contaminated Sediments; 3) Characterization, Control, and Treatment of Range Contamination; and 4) Military Munitions Detection, Discrimination, and Remediation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Energy Technology Demonstration\/Validation"
                                    },
                                    "Description": {
                                        "val": "Funds are programmed for investments in projects that respond to Congressional direction for the Department to increase energy efficiency, reduce installation energy intensity, increase the use of renewable energy, and improve energy security.  Emerging energy technologies offer DoD a cost effective opportunity to meet these requirements for reduced energy consumption and improved energy security on its installations while reducing energy and operational costs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "28.554"
                                            },
                                            "Text": {
                                                "val": "In FY 2013 funds were invested in energy projects that constitute the Installation Energy Test Bed Initiative. The test bed program is validating and testing the operational cost and performance of innovative energy technologies in a real-world integrated building environment so as to reduce risk, overcome the barriers to deployment, and facilitate wide-scale deployment.  The DoD test bed program exploits the Department's existing built infrastructure to test energy efficiency and renewable energy technologies in three areas: component technologies (i.e., HVAC, lighting, distributed energy generation); system approaches to building energy design, control, and management; and installation-level smart micro-grid technologies.  It is a distributed test bed designed to evaluate energy technologies under the varied climatic conditions and building types DoD manages. The test beds key elements are: 1) competitive selection of new technologies, 2) systematic and consistent evaluation to determine performance, operational readiness and life cycle costs, and 3) development of guidance and design information for future deployment across installations.  This process has been developed, piloted, and validated through previous Congressional funding. Information on existing demonstrations can be found at www.serdp-estcp.org."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "32.000"
                                            },
                                            "Text": {
                                                "val": "Funds are planned to continue investments in energy projects that constitute the Installation Energy Test Bed Initiative. The test bed program will validate and test the operational cost and performance of innovative energy technologies in a real-world integrated building environment so as to reduce risk, overcome the barriers to deployment, and facilitate wide-scale deployment.  The DoD test bed program exploits the Department's existing built infrastructure to test energy efficiency and renewable energy technologies. In Fy 2014 ESTCP solicited proposals in two areas: 1) Smart and Secure Military Installation Energy Management and 2) Advanced Building Energy Management and Control.  It is a distributed test bed designed to evaluate energy technologies under the varied climatic conditions and building types DoD manages. The test beds key elements are: 1) competitive selection of new technologies, 2) systematic and consistent evaluation to determine performance, operational readiness and life cycle costs, and 3) development of guidance and design information for future deployment across installations.  This process has been developed, piloted, and validated through previous Congressional funding. Information on existing demonstrations can be found at www.serdp-estcp.org."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "23.047"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "23.047"
                                            },
                                            "Text": {
                                                "val": "Funds are planned to continue investments in energy projects that constitute the Installation Energy Test Bed Initiative."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "ESTCP solicits proposals from all DoD organizations, other Federal Agencies, and the commercial sector.  Projects are selected based on an annual competitive process through reviews by multi-agency panels."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance in this program is monitored at two levels. At the lowest level, each individual project is measured against technical and financial milestones on a quarterly and annual basis.  At a program-wide level, progress is measured against DoD's environmental requirements and the demonstration and transition of technologies that address these requirements."
                        }
                    }
                }
            ]
        }
    }
}