{
    "id": "a310d94e6a1e1806328751b3b2f28f2be6f657c9",
    "meta": {
        "filename": "dod-2015_RDTE_2015_NAVY_BA5_RDTE_JustificationBook_Navy_PB_2015.zzz_unzipped_RDTE_JustificationBook_Navy_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0304231N"
        },
        "ProgramElementTitle": {
            "val": "Tactical Command System - MIP"
        },
        "R1LineNumber": {
            "val": "144"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "2.290"
            },
            "PriorYear": {
                "val": "1.072"
            },
            "CurrentYear": {
                "val": "2.140"
            },
            "BudgetYearOne": {
                "val": "1.011"
            },
            "BudgetYearOneBase": {
                "val": "1.011"
            },
            "BudgetYearTwo": {
                "val": "1.007"
            },
            "BudgetYearThree": {
                "val": "1.016"
            },
            "BudgetYearFour": {
                "val": "1.045"
            },
            "BudgetYearFive": {
                "val": "1.073"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Radiant Mercury (RM) is a secure information platform that provides an automated means to sanitize, downgrade, guard, and transliterate formatted data at various classifications, compartments and releasabilities. It enables Combatant Commanders as well as operational commanders, afloat and ashore to disseminate and receive critical operational and intelligence information with coalition and allied forces.\n\nMajor Focus Area for FY15: Commence RM Version 6.x development and begin the certification process."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "1.170"
                },
                "CurrentYear": {
                    "val": "2.140"
                },
                "BudgetYearOne": {
                    "val": "1.171"
                },
                "BudgetYearOneBase": {
                    "val": "1.171"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "1.072"
                },
                "CurrentYear": {
                    "val": "2.140"
                },
                "BudgetYearOne": {
                    "val": "1.011"
                },
                "BudgetYearOneBase": {
                    "val": "1.011"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.098"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.160"
                },
                "BudgetYearOneBase": {
                    "val": "-0.160"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.001"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.160"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.160"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.097"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Schedule: \n1. Certification Test & Evaluation (CT&E) of Radiant Mercury (RM) Version 5.1 shifted from 3QFY12 to 3QFY13 due to National Security Agency (NSA) schedule delays. \t\t\t\n2. Delivery of RM Version 5.1 shifted from 2QFY13 to 4QFY13 due to NSA schedule delays."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "2009"
                    },
                    "ProjectTitle": {
                        "val": "OSIS Evolutionary Development (OED)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "2.290"
                        },
                        "PriorYear": {
                            "val": "1.072"
                        },
                        "CurrentYear": {
                            "val": "2.140"
                        },
                        "BudgetYearOne": {
                            "val": "1.011"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.011"
                        },
                        "BudgetYearTwo": {
                            "val": "1.007"
                        },
                        "BudgetYearThree": {
                            "val": "1.016"
                        },
                        "BudgetYearFour": {
                            "val": "1.045"
                        },
                        "BudgetYearFive": {
                            "val": "1.073"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Trusted Information System (TIS) Radiant Mercury (RM) is a system that successfully provides accredited Cross Domain Solutions (CDS) to the Navy, the Department of Defense (DoD), and the Intelligence Community (IC).  TIS RM is a critical component of network-centric warfare, supporting joint operations and allied and coalition forces world-wide. The ability to pass sensitive and critical data across security domains and to our allied and coalition partners in a timely fashion can only be met by accredited CDS systems such as RM.  RM enables the Navy to operate in a multi-national environment.\n\nTIS RM provides automated, bi-directional sanitization, transliteration and guarding capability for formatted and unformatted data between security enclaves.  RM helps ensure critical intelligence is provided quickly to operational decision-makers. TIS RM provides the capability to disseminate information for operating forces worldwide, including the operating forces of key allies in the Pacific, Central and European Command regions. This capability to move all-source intelligence-derived track information into the realm of the operational community significantly improves the situational awareness of tactical operators and planners. Unformatted data is handled by the Information Review Process (IRP).  The system provides cross domain services to a wide variety of customers including Combatant Commanders, Air Force (Shared Early Warning program), Army (Blue Force Tracking Program), Missile Defense Agency (MDA), Navy Cyber Defense Operations Command (NCDOC), Naval Modular Automated Communication Systems (NAVMACS), Mobile User Objective Systems (MUOS), Navy (Global Command and Control System - Maritime\/J (GCCS-M\/J), Automatic Identification System (AIS), Maritime Operations Centers (MOC), Distributed Common Ground System-Navy (DCGS-N), Tactical Ranges (TR), and numerous other DoD and Intelligence agencies.\n             \nMajor Focus Area for FY15: Commence RM Version 6.x development and begin the certification process."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Radiant Mercury (RM)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.072"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed development of Radiant Mercury (RM) Version 5.1, representing a critical interim step in RM's ultimate migration to Security Enhanced (SE) Linux in Version 6.0 and continued certification and delivery of RM Version 5.1. Version 5.1 allows RM to use a new, non-proprietary Lightweight Directory Access Protocol (LDAP) server to provide multi-zone user authentication and removed a dependency on the current vendor who introduced a new licensing model which had the potential to significantly raise the cost of using their products. Commenced development definition of RM Version 6.0 to run on SE Linux, removing further dependency on proprietary vendor products."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.140"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete development of the RM Version 6.0 baseline to run on SE Linux which removes dependency on proprietary vendor products whose pricing models have had a negative impact on the program and customers. SE Linux will allow the developer to customize the Operating System (OS) for the RM application, increasing processing speed and improving security. Improve remote configuration management by replacing the current version of Windows with a Lightweight Text Interface for initial configuration control and a web-based interface to configure the system. Use Free and Open Source Software (FOSS) to manage the log, audit reduction, and mission assessment capabilities. Enhance Message Analysis Generator (MAG) Generic Interface Functionality (MGIF) in order to take advantage of software and capabilities developed elsewhere within the Navy, DoD, and the Intelligence Communities (IC).  Complete certification testing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.011"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.011"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Deliver RM Version 6.0. Commence RM Version 6.x development and begin the certification process which includes Factory Acceptance Testing (FAT), alpha testing, and government testing. FAT will include test procedure development to ensure all systems requirements are tested properly, dry-run testing to ensure the procedures are sufficient, and formal testing which will be witnessed by the government. Alpha testing is conducted by the Independent Verification and Validation (IV&V) team and is separate from the FAT. Upon successful FAT and alpha testing the software is provided to the National Security Agency (NSA) and Defense Intelligence Agency (DIA) government labs for the actual certification and testing event in FY16. In parallel to these testing activities, the software will also be provided to several RM customers who maintain their own labs. These customers will provide valuable feedback on the stability and utility of the new software."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPN\/2608"
                                    },
                                    "Title": {
                                        "val": "Trusted Information System (TIS)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.428"
                                        },
                                        "CurrentYear": {
                                            "val": "0.396"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.324"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.324"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.286"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.293"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.298"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.305"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Trusted Information Systems (TIS) Radiant Mercury (RM) provides automated, bi-directional sanitization, transliteration and guarding capability for formatted and unformatted data between security enclaves. RM helps ensure critical Indications and Warning intelligence is provided quickly to operational decision-makers. RM provides certified and accredited Cross Domain capabilities in the Pacific Command (PACOM), Europe Command (EUCOM) and Central Command (CENTCOM), Northern Command (NORTHCOM), Areas of Responsibility (AOR). RM is a fee-for-service program, it receives partial funding from the Navy to cover basic program management and infrastructure costs. The remaining funds needed to keep the program operating are generated from a fee-for-service model which charges customers a Life Cycle Surcharge (LCS) on all new task orders and an Annual User Fee (AUF) on all operational RM systems currently fielded."
                        },
                        "PerformanceMetrics": {
                            "val": "Radiant Mercury (RM) provides and develops certified, accredited Cross Domain Solutions (CDS) and transfer capabilities to DoD and Intelligence Community (IC), and provides the capability to disseminate and receive operational and intelligence information for 100% of authorized sites.  \n\nComplete 100% of certification, system and security testing of RM version (X) for release. Provide the capability to sanitize, downgrade, guard, and transliterate formatted data at various classifications, compartments and releasabilities to combatant and operational commanders, coalition and allied forces at over 420 sites world-wide."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0304231N_2009_FILE1.PNG"
                                }
                            }
                        ]
                    }
                }
            ]
        }
    }
}