{
    "id": "a81d1f68d64490e5e711a7472d2da315e2eaba75",
    "meta": {
        "filename": "dod-2015_RDTE_2015_AIRFORCE_V1_RDTE_JustificationBook_Air_Force_PB_2015.zzz_unzipped_RDTE_JustificationBook_Air_Force_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602102F"
        },
        "ProgramElementTitle": {
            "val": "Materials"
        },
        "R1LineNumber": {
            "val": "4"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "111.177"
            },
            "CurrentYear": {
                "val": "120.846"
            },
            "BudgetYearOne": {
                "val": "105.680"
            },
            "BudgetYearOneBase": {
                "val": "105.680"
            },
            "BudgetYearTwo": {
                "val": "126.589"
            },
            "BudgetYearThree": {
                "val": "127.043"
            },
            "BudgetYearFour": {
                "val": "133.440"
            },
            "BudgetYearFive": {
                "val": "130.897"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program develops advanced materials, processing, and inspection technologies to reduce life cycle costs and improve performance, sustainability, availability, affordability, supportability, reliability, and survivability of current and future Air Force systems and operations.  The program has three projects that develop: structural, propulsion, and sub-systems materials and processes technologies; electronic, optical, and survivability materials and processes technologies; and sustainment materials, processes technologies, and advanced non-destructive inspection methodologies.  Efforts in the program have been coordinated through the Department of Defense (DoD) Science and Technology (S&T) Executive Committee process to harmonize efforts and eliminate duplication. This program is in Budget Activity 2, Applied Research, since it develops and determines the technical feasibility and military utility of evolutionary and revolutionary materials technologies."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "114.166"
                },
                "CurrentYear": {
                    "val": "116.846"
                },
                "BudgetYearOne": {
                    "val": "116.504"
                },
                "BudgetYearOneBase": {
                    "val": "116.504"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "111.177"
                },
                "CurrentYear": {
                    "val": "120.846"
                },
                "BudgetYearOne": {
                    "val": "105.680"
                },
                "BudgetYearOneBase": {
                    "val": "105.680"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.989"
                },
                "CurrentYear": {
                    "val": "4.000"
                },
                "BudgetYearOne": {
                    "val": "-10.824"
                },
                "BudgetYearOneBase": {
                    "val": "-10.824"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.236"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "9.000"
                    },
                    "CurrentYear": {
                        "val": "4.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.454"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-10.299"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-10.824"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-10.824"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Increase in FY13 Congressional Adds for enhanced efforts in nanotechnology research.\n\nDecrease in FY13 Other Adjustments was due to Sequestration.\n\nIncrease in FY14 Congressional Adds for enhanced efforts in nanotechnology research.\n\nDecrease in FY15 is due to higher DoD priorities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "624347"
                    },
                    "ProjectTitle": {
                        "val": "Materials for Structures, Propulsion, and Subsystems"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "60.945"
                        },
                        "CurrentYear": {
                            "val": "64.381"
                        },
                        "BudgetYearOne": {
                            "val": "34.776"
                        },
                        "BudgetYearOneBase": {
                            "val": "34.776"
                        },
                        "BudgetYearTwo": {
                            "val": "47.697"
                        },
                        "BudgetYearThree": {
                            "val": "44.806"
                        },
                        "BudgetYearFour": {
                            "val": "45.524"
                        },
                        "BudgetYearFive": {
                            "val": "44.472"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops the materials and processing technology base for aircraft, spacecraft, launch systems, and missiles to improve affordability, maintainability, and performance of current and future Air Force systems. A family of affordable lightweight materials is being developed, including metals, polymers, ceramics, metallic and nonmetallic composites, and hybrid materials to provide upgraded capabilities for existing aircraft, missile, and propulsion systems to meet the future system requirements. The project develops high-temperature turbine engine materials that will enable engine designs to double the turbine engine thrust-to-weight ratio. Advanced high temperature protection materials are being developed that are affordable, lightweight, dimensionally stable, thermally conductive, and\/or ablation and erosion resistant to meet aerospace and missile requirements. Alternative or replacement materials are being developed to maintain the performance of aging operational systems. Materials for thermal management including coolants, adaptive thermally conductive materials, coatings, friction and wear-resistant materials, and other pervasive nonstructural materials technologies are being developed for directed energy, propulsion, and subsystems on aircraft, spacecraft, and missiles. The project concurrently develops advanced processing methods to enable adaptive processing of aerospace materials."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Nanotechnology Research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "8.235"
                                        },
                                        "Text": {
                                            "val": "Conducted Congressionally-directed effort."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "4.000"
                                        },
                                        "Text": {
                                            "val": "Conduct Congressionally-directed effort."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Ceramics and Composites"
                                    },
                                    "Description": {
                                        "val": "Develop ceramic, ceramic matrix composite, and hybrid materials technologies for performance and supportability improvement in propulsion systems and high temperature aerospace structures."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "26.613"
                                            },
                                            "Text": {
                                                "val": "Developed next generation high temperature organic and ceramic matrix composite material systems for AF weapon systems.  Initiated advanced processing methods and model development for advanced fibers, interface coatings, matrices, and environmental barrier coatings used in fabrication of composite materials.  Conducted experimental tests to assess material behavior and time-dependent degradation in relevant environments. Incorporated hybrid approaches (materials and processes) to develop optical and radio frequency communication system apertures. Initiated the development of advanced electromagnetic and laser protection technologies to structurally harden aerospace structures.  Initiated the transition of behavior and life prediction models of organic matrix composites."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "31.381"
                                            },
                                            "Text": {
                                                "val": "Continue development of next generation high temperature organic and ceramic matrix composite material systems for Air Force weapon systems.  Continue development of advanced processing methods and validate process models for organic matrix composites. Initiate process models for ceramic matrix composites. Conduct durability assessments of composite material behavior to gain understanding of time-dependent degradation.  Develop novel hybrid approaches for optical and radio frequency communication system aperture applications.  Develop advanced electromagnetic and laser protection technologies for structurally harden aerospace structures.  Continue the transition of behavior and life prediction models of organic matrix composites."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.500"
                                            },
                                            "Text": {
                                                "val": "Demonstrate new advanced processing methods, coating technologies, and behavioral life prediction for higher temperature capable organic and ceramic matrix composites. Validate severe environment durability of advanced composite systems via mechanical testing. Continue to advance the development of new ceramic and organic matrix composite materials and processes with higher temperature capability for propulsion systems and aerospace structures. Validate and demonstrate hybrid materials and processes for applications in combined optical and radio frequency  communication system apertures. Demonstrate and validate advanced electromagnetic and laser protection technologies for aerospace structures."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Metals"
                                    },
                                    "Description": {
                                        "val": "Develop lightweight and high temperature metallics, life prediction, and metals processing technologies for increased affordability, durability, and reliability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.843"
                                            },
                                            "Text": {
                                                "val": "Transitioned advanced blade and disk system into advanced turbine engine systems. Demonstrated advanced computation methods to support material development and characterization modeling. Demonstrated quantitative, predictive models for performance of metallic based thermal management systems. Analyzed relationships between microstructure, processing, functional properties, and performance of metallic, hybrid, nanoscale, and composite materials. Initiated development analysis techniques for understanding and mitigating residual stress in nickel-base superalloys."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.559"
                                            },
                                            "Text": {
                                                "val": "Continue to demonstrate advanced computation methods to support material development and characterization modeling. Continue to demonstrate quantitative, predictive models for performance of metallic based thermal management systems. Analyze relationships between microstructure, processing, functional properties, and performance of metallic, hybrid, nanoscale, and gradient metallic materials. Continue development of analysis of residual stress in nickel-base superalloys. Initiate development of integrated material\/manufacturing and component analysis for life management and development of structural materials innovative research.  Initiate development of next generation turbine engine disk."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.750"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.750"
                                            },
                                            "Text": {
                                                "val": "Validate repeatability of advanced computation methods to support material development and characterization modeling. Demonstrate quantitative, predictive models for performance of metallic based thermal management systems. Continue to analyze relationships between microstructure, processing, functional properties, and performance of metallic, hybrid, nanoscale, and gradient metallic materials. Demonstrate analysis techniques for understanding and mitigating residual stress in nickel-base superalloys. Continue development of integrated material\/manufacturing and component analysis for life management and development of structural materials innovative research.  Continue development of next generation turbine engine disk."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Thermal Protection Materials"
                                    },
                                    "Description": {
                                        "val": "Develop and evaluate lightweight, active, adaptive, multifunctional, high temperature, and durable material systems for extreme environments and hypersonic applications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.710"
                                            },
                                            "Text": {
                                                "val": "Developed advanced metallic, oxide, and ceramic materials for hypersonic weapon systems. Initiated novel materials and processing methods to fabricate thermal protection systems for expendable hypersonic applications such as control surfaces, leading edges, and acreage designs. Developed unique experimental techniques to assess mechanical properties and time-dependent behavior of advanced metallic and ceramic materials systems. Fabricated ultra-high temperature ceramics using field assisted sintering technology and evaluated resulting ceramics in hypersonic experimental propulsion rig. Developed computational models to assess environmental degradation of materials in a hypersonic environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.349"
                                            },
                                            "Text": {
                                                "val": "Continue to develop advanced metallic, oxide, and ceramic materials for hypersonic weapon systems. Initiate novel materials and processing methods to fabricate structurally integrated thermal protection systems for expendable hypersonic applications such as control surfaces, leading edges, and acreage designs.  Develop unique experimental techniques to assess mechanical properties and time-dependent behavior. Incorporate solutions for optical and radio frequency communication system aperture applications on hypersonic systems.  Continue validating performance of fabricated ultra-high temperature ceramics using field assisted sintering technology using a hypersonic experimental propulsion rig.  Develop and validate computational models to assess environmental degradation of materials in a hypersonic environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.526"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.526"
                                            },
                                            "Text": {
                                                "val": "Refine and improve upon the processing methods to fabricate structurally integrated thermal protection systems for expendable hypersonic applications.  Develop unique experimental techniques to assess mechanical properties and time-dependent behavior.  Validate material properties and performance meets design needs for control surfaces, leading edges and acreage.  Develop and validate computational models to assess environmental degradation of materials in a hypersonic environment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Nanomaterials and Metamaterials"
                                    },
                                    "Description": {
                                        "val": "Develop nanostructured materials and nanoscale architectures to address electromagnetic applications. Develop metamaterials for sensors, antennas, electronics, and optical elements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.544"
                                            },
                                            "Text": {
                                                "val": "Developed computation materials science techniques and models to characterize nanomaterials. Analyzed nanoscale materials to understand and characterize the transport of mass, momentum, and energy at the atomic level. Developed and demonstrated concepts for RF passive metamaterials-based components."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.092"
                                            },
                                            "Text": {
                                                "val": "Validate computation materials science techniques and models to characterize nanomaterials. Continue to demonstrate concepts for RF passive metamaterials-based components and develop metamaterials for multiple applications.  Initiate development of electromagnetic hardened conformal array."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Efforts transferred to project 624348 (Nanostructured and Biological Materials)."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "624348"
                    },
                    "ProjectTitle": {
                        "val": "Materials for Electronics, Optics, and Survivability"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "25.976"
                        },
                        "CurrentYear": {
                            "val": "30.302"
                        },
                        "BudgetYearOne": {
                            "val": "28.693"
                        },
                        "BudgetYearOneBase": {
                            "val": "28.693"
                        },
                        "BudgetYearTwo": {
                            "val": "34.900"
                        },
                        "BudgetYearThree": {
                            "val": "35.326"
                        },
                        "BudgetYearFour": {
                            "val": "35.864"
                        },
                        "BudgetYearFive": {
                            "val": "34.489"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops materials technologies for surveillance and situational awareness systems and subsystems for aircraft and missile applications, including sensor, microwave, and infrared (IR) detection and countermeasures devices used for targeting, electronic warfare, and active aircraft protection.  Materials for protection of aircrews, sensors, and aircraft from laser and high-power microwave directed energy threats are also developed.  Electronic and optical materials are being developed to enable surveillance and situational awareness with faster operating speeds, greater tunability, higher power output, improved thermal management (including higher operating temperatures), greater sensitivity, and extended dynamic range.  New materials are being developed to counter the most prominent laser threats and to respond to emerging and agile threat wavelengths without impairing mission effectiveness. The project develops nanostructured and biological materials for aircraft structures, munitions, air vehicle subsystems, and personnel. The project develops novel materials for electromagnetic interactions with matter for electromagnetic pulse, high power microwave, and lightning strike protection."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Infrared Detector Materials"
                                    },
                                    "Description": {
                                        "val": "Develop IR detector materials and processes technologies for performance, affordability, and operational capability of surveillance, tracking, targeting, and situational awareness systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.438"
                                            },
                                            "Text": {
                                                "val": "Transitioned optimized design of 2k x 2k IR detectors with integrated circuits, processing, and packaging for enhanced focal plane array yields. Continued to develop a super-lattice based material system for use in the detector elements of very-long wavelength IR detector focal plane arrays. Operated a mid-wave IR (MWIR) focal plane array at temperatures above 200 Kelvin to demonstrate overcoming the challenge of cryogenic cooling requirements. Transitioned mid-wavelength materials for high temperature, low-noise sensing for use on low power systems. Demonstrated models of materials optical\/infrared behavior for low observable (LO), intelligence, surveillance, and reconnaissance (ISR), and other applications. Initiated development of nanoscale materials for use in producing detectors. Developed inorganic quantum materials for aerospace applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.648"
                                            },
                                            "Text": {
                                                "val": "Develop materials for use in high resolution MWIR applications. Develop materials to support and provide persistent air ISR. Continue to demonstrate models of materials optical\/infrared behavior for LO, ISR, and other applications. Continue to develop nanoscale materials for use in producing detectors. Utilize computational materials science to improve performance prediction models. Continue to develop inorganic quantum materials for aerospace applications. Initiate development of short wave IR detector materials and hyperspectral long wave IR materials. Initiate development of radio frequency (RF)\/IR photonics for compact air vehicle applications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.443"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.443"
                                            },
                                            "Text": {
                                                "val": "Continue to develop materials for use in high resolution MWIR applications. Continue to develop materials to support and provide persistent air ISR. Validate and demonstrate models of materials optical\/IR behavior for LO, ISR, and other applications. Validate and demonstrate nanoscale materials for use in producing detectors. Continue to utilize computational materials science to improve performance prediction models. Validate and demonstrate inorganic quantum materials for aerospace applications. Continue development of short wave IR detector materials and hyperspectral long wave IR materials. Continue development of RF\/IR photonics for compact air vehicle applications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Directed Energy Hardened Materials"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate technologies to enhance the safety, survivability, and mission effectiveness of aircrews, sensors, viewing systems, and related assets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.750"
                                            },
                                            "Text": {
                                                "val": "Developed and demonstrated materials and technologies to protect against directed energy threats. Projects included optimized nonlinear optical limiter materials for damage protection, robust in-band optical limiter materials, enhanced photorefractive hybrid materials concepts, tunable\/switchable materials and concepts, and passive optical coating technology for advanced applications in airborne, space, and personnel systems. Developed materials for high energy laser interactions. Utilized computational materials science to enhance multi-scale modeling. Developed materials and processes for hardening and optical materials applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.175"
                                            },
                                            "Text": {
                                                "val": "Validate and demonstrate materials and technologies to protect against directed energy threats. Projects include optimized nonlinear optical limiter materials for damage protection, robust in-band optical limiter materials, enhanced photorefractive hybrid materials concepts, tunable\/switchable materials and concepts, and passive optical coating technology for advanced applications in airborne, space, and personnel systems. Continue to develop materials for high energy laser interactions. Utilize computational materials science to enhance multi-scale modeling. Continue to develop materials and processes for hardening and optical materials applications.  Initiate development of photonic enabled RF phased arrays and tunable inductors\/large area films."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.817"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.817"
                                            },
                                            "Text": {
                                                "val": "Demonstrate repeatability of materials and technologies to protect against directed energy threats. Projects include optimized nonlinear optical limiter materials for damage protection, robust in-band optical limiter materials, enhanced photorefractive hybrid materials concepts, tunable\/switchable materials and concepts, and passive optical coating technology for advanced applications in airborne, space, and personnel systems. Validate materials for high energy laser interactions. Utilize computational materials science to enhance multi-scale modeling. Demonstrate materials and processes for hardening and optical materials applications. Continued development of photonic enabled RF phased arrays and tunable inductors\/large area films."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Laser Source Materials"
                                    },
                                    "Description": {
                                        "val": "Develop materials to enable higher performance lasing media, new laser architectures, optical isolators, beam steering, and other high energy laser components for directed energy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.044"
                                            },
                                            "Text": {
                                                "val": "Developed and demonstrated reliable materials and processes to optimize components for compact, lightweight, high power microwave directed energy applications. Developed materials and processes for Polymeric Energy Conversion. Demonstrated materials for improved laser source components operating in the mid-infrared range. Developed materials with tailorable properties for beam steering in the newly accessible W band. Demonstrated materials processes for fabricating new laser beam scanning devices that utilize electro-optic polymers to enable high-speed beam steering. Developed and demonstrate materials that increase high energy laser efficiency and output. Utilized computational materials science to improve performance predictions and shorten design cycle time."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.825"
                                            },
                                            "Text": {
                                                "val": "Continue to develop and demonstrate reliable materials and processes to optimize components for compact, lightweight, directed energy applications. Continue to develop materials and processes for Polymeric Energy Conversion. Continue to demonstrate materials for improved laser source components operating in the mid-infrared range. Continue to develop materials with tailorable properties for beam steering in the newly accessible W band. Continue to demonstrate materials processes for fabricating new laser beam scanning devices that utilize electrooptic polymers to enable high-speed beam steering. Continue to develop and demonstrate materials that increase high energy laser efficiency and output. Utilize computational materials science to improve performance predictions and shorten design cycle time."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.184"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.184"
                                            },
                                            "Text": {
                                                "val": "Demonstrate materials with tailorable properties for beam steering in the newly accessible W band. Validate and demonstrate materials processes for fabricating new laser beam scanning devices that utilize electro-optic polymers to enable high-speed beam steering."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Nanostructured and Biological Materials"
                                    },
                                    "Description": {
                                        "val": "Develop enabling and foundational biotechnologies for guidance and control, rapid tagging, tracking, and identification of targets, and bio-integrated electronics and sensing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.744"
                                            },
                                            "Text": {
                                                "val": "Develop biological engineering methods for sensors and electro-optic devices for complex hybrid materials. Used pervasive computational materials science to model guided experiments and to enable rapid in-situ experimental data acquisition."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.654"
                                            },
                                            "Text": {
                                                "val": "Continue to develop and demonstrate biological engineering methods for sensors and electro-optic devices for complex hybrid materials. Use pervasive computational materials science to model guided experiments and to enable rapid in-situ experimental data acquisition. Continue to develop and demonstrate reliable materials and processes to optimize components for compact, lightweight, multifunctional devices for use in autonomy. Continue to develop materials and processes for writing and printing robust electronics on varied flexible & stretchable substrates, and the development of structurally resilient architectures and nanostructures with embedded  energy and\/or comm. Focused develop of integrated sensor platform, suitable for multiple sensor components.  Continue to develop and analyze nano-biomaterials for human performance sensing. Validate computation materials science techniques and models to characterize nanomaterials. Continue development and support of nano-bio manufacturing consortium."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.249"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.249"
                                            },
                                            "Text": {
                                                "val": "Validate and demonstrate biological engineering methods for sensors and electro-optic devices for complex hybrid materials. Continue to use pervasive computational materials science to model guided experiments and to enable rapid in-situ experimental data acquisition. Validate and demonstrate reliable materials and processes to optimize components for compact, lightweight, multi-functional devices for use in autonomy and human performance monitoring applications. Continue to develop materials and processes for writing and printing robust electronics on varied flexible & stretchable substrates, and the development of structurally resilient architectures and nanostructures with embedded energy and\/or comm. Focused develop of integrated sensor platform, suitable for multiple sensor components. Initiate materials and process or strain resilient electronics. Continue to develop and analyze nano-biomaterials for human performance sensing. Continue to validate computation materials science techniques and models to characterize nanomaterials. Continue development and support of nano-bio manufacturing consortium."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "624349"
                    },
                    "ProjectTitle": {
                        "val": "Materials Technology for Sustainment"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "24.256"
                        },
                        "CurrentYear": {
                            "val": "26.163"
                        },
                        "BudgetYearOne": {
                            "val": "42.211"
                        },
                        "BudgetYearOneBase": {
                            "val": "42.211"
                        },
                        "BudgetYearTwo": {
                            "val": "43.992"
                        },
                        "BudgetYearThree": {
                            "val": "46.911"
                        },
                        "BudgetYearFour": {
                            "val": "52.052"
                        },
                        "BudgetYearFive": {
                            "val": "51.936"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops materials and processing technologies to support operational Air Force mission areas by providing the ability to inspect the quality of delivered systems, transitioning more reliable and maintainable materials, establishing a capability to detect and characterize performance threatening defects, characterizing materials processes and properties necessary for materials transition, and providing quick reaction support and failure analysis to the operational commands and repair centers.  Repair techniques and nondestructive inspection\/evaluation (NDI\/E) methods are developed that are needed for metallic and non-metallic structures, coatings, corrosion control processes, and to support integration of composite structures for aerospace systems.  Various NDI\/E methods are essential to ensure optimum quality in the design and production of aircraft, propulsion, and missile systems.  These NDI\/E methods are also essential to monitor and detect the onset of any service-initiated damage and\/or deterioration due to aging of operational systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Sensing Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop sensing and life prediction technologies to identify damage and characterize the health of aging structures, propulsion systems, and low-observable (LO) materials and structures."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.256"
                                            },
                                            "Text": {
                                                "val": "Advanced eddy current models and techniques to detect, characterize and track damage of components for aerospace systems. Assessed methods to enhance the sensing of damage in multi-layered structures and at complex geometries representative of aircraft structures and engine components. Advanced sensing methodologies to detect and begin to characterize the material microstructure that affects the structural integrity of aerospace systems. Developed and improved more affordable life cycle management approaches and life extension capability for aerospace structure and turbine engines. Investigated approaches to characterize material properties of specialty coatings."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.109"
                                            },
                                            "Text": {
                                                "val": "Continue to improve and validate modeling capabilities required to enable materials and damage characterization via nondestructive evaluation methods.  Conduct and demonstrate enhanced sensing and characterization of damage in multi-layered structures to improve detectable limits and the probabilities of finding deeply imbedded or hidden damage in aerospace systems.  Continue developing advanced sensing technologies to detect and characterize changes in material structure, material properties, damage, and other factors that detrimentally affect aerospace systems. Continue to develop innovative inspection technologies to enable rapid assessment of LO material performance. Continue research to assess metals performance in aerospace systems for more affordable life management practices and life extension for aerospace structures and turbine engines."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.000"
                                            },
                                            "Text": {
                                                "val": "Continue to improve and validate nondestructive evaluation modeling capabilities and use these competences to drive improvements in capability to detect and characterize damage in realistic aerospace structures and engine components.  Begin to develop approaches to address the variability inherent in aerospace systems and materials and begin to quantify the impact of that variability on nondestructive inspection capability and reliability.  Validate and demonstrate advanced sensing technologies to detect and characterize changes in material properties, damage evolution, and other factors that detrimentally affect aerospace systems. Initiate development and validation of damage state awareness approaches and methodologies for use on aerospace structures and engine components.  Validate repeatability and functionality of innovative LO inspection methods to enable rapid assessment of LO material performance. Demonstrate assessment of enhanced metals performance in aerospace systems. Initiate development of advanced materials and processes to monitor and evaluate LO material state awareness."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Production and Repair Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop support capabilities, information, and processes to resolve problems with materials in the production and repair of systems components and structures."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "Evaluated advanced materials and processes technology to repair and extend the life of Air Force legacy systems. Investigated failure limits for emerging Air Force systems. Continue to validate and demonstrate test methods and techniques to understand effects of service environments, corrosion, residual stresses, and material processes on structural materials.  Transitioned advanced materials technologies and designs for improved maintainability and life cycle cost of conductive outer-moldline films, coatings, access panel treatments, and multifunctional systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.054"
                                            },
                                            "Text": {
                                                "val": "Validate and demonstrate advanced materials and processes technology to repair and extend the life of Air Force legacy systems. Continue to investigate failure limits for emerging Air Force systems. Continue to validate and demonstrate test methods and techniques to understand effects of service environments, corrosion, residual stresses, and material processes on structural materials. Continue to transition advanced materials technologies and designs for improved maintainability and life cycle cost of conductive outer-moldline films, coatings, access panel treatments, and multifunctional systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.500"
                                            },
                                            "Text": {
                                                "val": "Continue to validate and demonstrate advanced materials and processes technology to repair and extend the life of Air Force legacy systems. Validate and demonstrate understanding of failure limits for emerging Air Force systems. Develop improved lifecycle prediction test methods and techniques to understand effects of service environments, corrosion, residual stresses, and material processes on structural and functional materials. Assess advanced materials, processes and designs for improved repair and maintainability and life cycle cost of outer-moldline coatings, access panel treatments, and multifunctional systems. Initiate LO affordability technologies and processes to reduce maintenance costs of LO materials."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Failure Analysis Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop support capabilities, information, and processes to resolve materials problems and provide electronic and structural failure analysis of components."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.000"
                                            },
                                            "Text": {
                                                "val": "Performed quick response failure analyses and materials investigations. Provided advanced materials solutions to ensure critical warfighter system availability and safety of flight. Developed microelectromechanical system (MEMS) failure analysis capabilities. Validated advanced electrostatic discharge protection technologies and procedures for emerging avionics subsystems. Transitioned advanced test methods for analyzing electrical and structural failures of emerging materials. Validated test criteria and demonstrate advanced wiring materials technologies to replace aging wiring systems. Demonstrated new wiring technologies for emerging weapon systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "Continue to perform quick response failure analyses and materials investigations. Initiate investigation of improved analysis techniques to determine root cause materials failure\/degradation. Continue to provide advanced materials solutions to ensure critical warfighter system availability and safety of flight.  Develop advanced functional materials and MEMS failure analysis capabilities. Continue to validate advanced electrostatic discharge protection technologies and procedures for emerging avionics subsystems. Continue to transition advanced test methods for analyzing electrical and structural failures of emerging materials.  Continue to validate and demonstrate advanced wiring materials technologies to replace aging wiring systems. Validate and demonstrate new wiring technologies for emerging weapon systems. Initiate research to provide advanced materials to improve systems sustainment in field and Air Force Program Offices."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.711"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.711"
                                            },
                                            "Text": {
                                                "val": "Continue to perform quick response failure analyses and materials investigations. Continue to investigate improved analysis techniques to determine root cause materials failure\/degradation. Continue to provide advanced materials solutions to ensure critical warfighter system availability and safety of flight. Continue development of functional materials and MEMS failure analysis capabilities. Continue to validate advanced electrostatic discharge protection technologies and procedures for emerging avionics subsystems. Continue to transition advanced test methods for analyzing electrical and structural failures of emerging materials.  Initiate development on new, more durable materials and protection for high power wiring technologies for Air Force weapon systems.  Continue research to provide advanced materials to improve systems sustainment in field and Air Force Program Offices."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}