{
    "id": "a88d57e5303c9effb5e2c2205b448f6cff5fa956",
    "meta": {
        "filename": "dod-2015_RDTE_2015_AIRFORCE_V2_RDTE_JustificationBook_Air_Force_PB_2015.zzz_unzipped_RDTE_JustificationBook_Air_Force_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0604759F"
        },
        "ProgramElementTitle": {
            "val": "Major T&E Investment"
        },
        "R1LineNumber": {
            "val": "98"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "33.968"
            },
            "CurrentYear": {
                "val": "32.341"
            },
            "BudgetYearOne": {
                "val": "47.232"
            },
            "BudgetYearOneBase": {
                "val": "47.232"
            },
            "BudgetYearTwo": {
                "val": "68.755"
            },
            "BudgetYearThree": {
                "val": "67.374"
            },
            "BudgetYearFour": {
                "val": "68.690"
            },
            "BudgetYearFive": {
                "val": "69.998"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This PE provides planning, improvements, and modernization for test capabilities at three Air Force Test Center (AFTC) organizations: 96 Test Wing at Eglin AFB FL (to include 96 Test Group at Holloman AFB NM, and operating locations at Wright-Patterson AFB OH), Arnold Engineering Development Complex (AEDC) at Arnold AFB TN and the 412 Test Wing at Edwards AFB CA.  The purpose is to help test organizations improve and develop their test infrastructure and capabilities to keep pace with improvements in weapon system technologies.  \n\nThe improvement and modernization (I&M) requirements are defined through the AF Test Investment Planning & Programming (TIPP) Process.  All projects have been reviewed through the Tri-Service Reliance process (to communicate AF efforts to the other Services and avoid unwarranted duplication of effort) and are documented in the Technology Development Acquisition Program (TDAP) database.  Each project has its own planning, development, equipment acquisition, equipment installation, and checkout phases which often require significant differences in funding from one year to the next.  As such, the changes in category funding from year to year do not necessarily indicate program growth, but rather a planned phasing of improvement and modernization efforts.  The test capabilities at these locations enable testing through all phases of weapon system acquisition, from system concept exploration through component and full scale integrated weapon system testing to operational testing.  These test organizations are a part of the Major Range and Test Facility Base (MRTFB), operated and maintained by the Air Force for DoD test and evaluation.  These national test assets are available to others requiring their unique capabilities.\n\nThe 96TW, at Eglin AFB FL, conducts and supports developmental test and evaluation (DT&E) of non-nuclear air armaments; Command, Control, Communications, Computers, Intelligence, Surveillance, Reconnaissance (C4ISR) systems; target acquisition and weapon delivery systems; navigation systems; provides a climatic simulation capability; determines target\/test item spectral signatures; and provides Cyber testing capabilities as part of the Joint Information Operations (IO) Range.  The 96TG at Holloman AFB, NM provides independent test and evaluation of inertial, Global Positioning System (GPS) and integrated systems used for aircraft navigation and missile guidance systems including vulnerability to electronic interference; provides the liaison function for coordinating and scheduling all US Air Force test operations at White Sands Missile Range; provides subsonic through hypersonic ground testing of aircraft and missiles in a flight-representative environment under highly instrumented conditions; and executes flight test and test support for advanced avionics and weapons development of joint, international and commercial test programs.\n\nAEDC, at Arnold AFB TN, provides pre-flight and reliability ground environmental test support for DoD aeropropulsion, flight systems, and space and missile programs.  The center has 53 test facilities providing: aerodynamic testing of scale model aircraft, missiles, and space systems; testing of large and full-scale satellites, sensors, and space vehicles in a simulated space environment; altitude environmental testing for aircraft, missile, and spacecraft propulsion systems; and testing of large-scale models such as space boosters together with their propulsion systems.\n\nThe 412th Test Wing, at Edwards AFB CA, conducts and supports DT&E and Operational Test and Evaluation (OT&E) of aircraft and aircraft systems, aerospace research vehicles, unmanned aerial vehicles, cruise missiles, parachute delivery\/recovery\/systems, and cargo handling systems.\n\nI&M efforts within this PE are identified in four mission area categories:  Airframe\/Propulsion\/Avionics (APA); Armament\/Munitions (A\/M); Command, Control, Communications, Computers, Intelligence, Surveillance, Reconnaissance (C4ISR); and Space.  These categories describe general types of effort that will be conducted in this PE.  APA provides planning, improvements, and modernization needed for test capabilities to conduct and support DT&E and OT&E of aircraft and aircraft systems, aerospace research vehicles, unmanned aerial vehicles, cruise missiles, parachute delivery\/recovery systems, cargo handling systems, and turbine engines.  APA focuses on evaluation of the vehicle airframe, propulsion system, and avionics systems, as well as overall systems integration testing.  It encompasses both ground test facilities, on-board test aircraft systems, and open-air range infrastructure, including instrumentation and data processing.  A\/M provides planning, improvements and modernization to conduct DT&E of air-to-ground and air-to-air armaments and munitions, which include gun, chaff and flare systems as well as aerial decoy and target systems.  The A\/M category encompasses the full range of DT&E from digital modeling and simulation, to precision measurement testing, to hardware-in-the-loop and installed systems testing, to open-air range testing.  Elements of A\/M DT&E include environmental, warhead effectiveness, arena blast\/fragmentation, guidance navigation and control, aerodynamics, propulsion, electromagnetic interference and compatibility, mass properties, seeker and signature measurement, survivability, lethality, integration, reliability, net-centric and terminal effects testing.  A\/M also involves the design and development of systems needed to support A\/M DT&E including the design and development sleds, targets, range support systems and various instrumentation and measurement systems.  C4ISR provides planning, improvements and modernization to conduct DT&E of systems that support C2 functions which range from air campaign planning at the theater level to wing level C2 operations, to planning individual missions, to putting weapons on target using concepts such as machine to machine targeting.  C4ISR includes ground and flight performance testing of airborne C2 networks and tactical data links, air operation centers, mission planning systems, multi-level security systems, radio and communication systems, ISR systems, information assurance systems, and radar systems such as those used by JSTARS and air traffic control systems.  C4ISR conducts DT&E on a full range of systems covering the sensor (detection) to the shooter (weapon), including functional and environmental testing of these systems.  C4ISR includes DT&E for offensive and defensive Cyber capabilities.  Space provides planning, improvements, and modernization needed for test capabilities to perform developmental and operational testing for space and launch acquisition and sustainment programs.  Test capabilities include launch vehicle, satellite, missile, sensor, thermal protection system, signature, hardness, and interface testing.  The capabilities reside at Vandenberg, Kirtland, Arnold, Patrick, Schriever, Peterson, Holloman Air Force Bases and others.  Infrastructure includes launch sites, mobile control units, thermal vacuum chambers, sled track, arc heated wind tunnels, ballistic test ranges, signature collection, and the requisite personnel.  \n\nBudget Activity Justification:  This program is in Budget Activity 6, RDT&E Management Support, because this budget activity includes research, development, test and evaluation efforts and funds to sustain and\/or modernize the installations or operations required for general research, development, test and evaluation."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "42.236"
                },
                "CurrentYear": {
                    "val": "34.841"
                },
                "BudgetYearOne": {
                    "val": "47.821"
                },
                "BudgetYearOneBase": {
                    "val": "47.821"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "33.968"
                },
                "CurrentYear": {
                    "val": "32.341"
                },
                "BudgetYearOne": {
                    "val": "47.232"
                },
                "BudgetYearOneBase": {
                    "val": "47.232"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-8.268"
                },
                "CurrentYear": {
                    "val": "-2.500"
                },
                "BudgetYearOne": {
                    "val": "-0.589"
                },
                "BudgetYearOneBase": {
                    "val": "-0.589"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.056"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "-2.500"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-4.086"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.650"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-3.476"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.589"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.589"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY13:  $4.086M Reprogramming decrease due to O&M shortfall; $3.476M other adjustment decrease due to sequestration.\nFY14:  $2.5M Congressional Directed Reduction: Program decrease."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "664597"
                    },
                    "ProjectTitle": {
                        "val": "Air Force Test Investments"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "33.968"
                        },
                        "CurrentYear": {
                            "val": "32.341"
                        },
                        "BudgetYearOne": {
                            "val": "47.232"
                        },
                        "BudgetYearOneBase": {
                            "val": "47.232"
                        },
                        "BudgetYearTwo": {
                            "val": "68.755"
                        },
                        "BudgetYearThree": {
                            "val": "67.374"
                        },
                        "BudgetYearFour": {
                            "val": "68.690"
                        },
                        "BudgetYearFive": {
                            "val": "69.998"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This PE provides planning, improvements, and modernization for test capabilities at three Air Force Test Center (AFTC) organizations: 96 Test Wing at Eglin AFB FL (to include 96 Test Group at Holloman AFB NM, and operating locations at Wright-Patterson AFB OH), Arnold Engineering Development Complex (AEDC) at Arnold AFB TN and the 412 Test Wing at Edwards AFB CA.  The purpose is to help test organizations improve and develop their test infrastructure and capabilities to keep pace with improvements in weapon system technologies.  \n\nThe improvement and modernization (I&M) requirements are defined through the AF Test Investment Planning & Programming (TIPP) Process.  All projects have been reviewed through the Tri-Service Reliance process (to communicate AF efforts to the other Services and avoid unwarranted duplication of effort) and are documented in the Technology Development Acquisition Program (TDAP) database.  Each project has its own planning, development, equipment acquisition, equipment installation, and checkout phases which often require significant differences in funding from one year to the next.  As such, the changes in category funding from year to year do not necessarily indicate program growth, but rather a planned phasing of improvement and modernization efforts.  The test capabilities at these locations enable testing through all phases of weapon system acquisition, from system concept exploration through component and full scale integrated weapon system testing to operational testing.  These test organizations are a part of the Major Range and Test Facility Base (MRTFB), operated and maintained by the Air Force for DoD test and evaluation.  These national test assets are available to others requiring their unique capabilities.\n\nThe 96TW, at Eglin AFB FL, conducts and supports developmental test and evaluation (DT&E) of non-nuclear air armaments; Command, Control, Communications, Computers, Intelligence, Surveillance, Reconnaissance (C4ISR) systems; target acquisition and weapon delivery systems; navigation systems; provides a climatic simulation capability; determines target\/test item spectral signatures; and provides Cyber testing capabilities as part of the Joint Information Operations (IO) Range.  The 96TG at Holloman AFB, NM provides independent test and evaluation of inertial, Global Positioning System (GPS) and integrated systems used for aircraft navigation and missile guidance systems including vulnerability to electronic interference; provides the liaison function for coordinating and scheduling all US Air Force test operations at White Sands Missile Range; provides subsonic through hypersonic ground testing of aircraft and missiles in a flight-representative environment under highly instrumented conditions; and executes flight test and test support for advanced avionics and weapons development of joint, international and commercial test programs.\n\nAEDC, at Arnold AFB TN, provides pre-flight and reliability ground environmental test support for DoD aeropropulsion, flight systems, and space and missile programs.  The center has 53 test facilities providing: aerodynamic testing of scale model aircraft, missiles, and space systems; testing of large and full-scale satellites, sensors, and space vehicles in a simulated space environment; altitude environmental testing for aircraft, missile, and spacecraft propulsion systems; and testing of large-scale models such as space boosters together with their propulsion systems.\n\nThe 412th Test Wing, at Edwards AFB CA, conducts and supports DT&E and Operational Test and Evaluation (OT&E) of aircraft and aircraft systems, aerospace research vehicles, unmanned aerial vehicles, cruise missiles, parachute delivery\/recovery\/systems, and cargo handling systems.\n\nI&M efforts within this PE are identified in four mission area categories:  Airframe\/Propulsion\/Avionics (APA); Armament\/Munitions (A\/M); Command, Control, Communications, Computers, Intelligence, Surveillance, Reconnaissance (C4ISR); and Space.  These categories describe general types of effort that will be conducted in this PE.  APA provides planning, improvements, and modernization needed for test capabilities to conduct and support DT&E and OT&E of aircraft and aircraft systems, aerospace research vehicles, unmanned aerial vehicles, cruise missiles, parachute delivery\/recovery systems, cargo handling systems, and turbine engines.  APA focuses on evaluation of the vehicle airframe, propulsion system, and avionics systems, as well as overall systems integration testing.  It encompasses both ground test facilities, on-board test aircraft systems, and open-air range infrastructure, including instrumentation and data processing.  A\/M provides planning, improvements and modernization to conduct DT&E of air-to-ground and air-to-air armaments and munitions, which include gun, chaff and flare systems as well as aerial decoy and target systems.  The A\/M category encompasses the full range of DT&E from digital modeling and simulation, to precision measurement testing, to hardware-in-the-loop and installed systems testing, to open-air range testing.  Elements of A\/M DT&E include environmental, warhead effectiveness, arena blast\/fragmentation, guidance navigation and control, aerodynamics, propulsion, electromagnetic interference and compatibility, mass properties, seeker and signature measurement, survivability, lethality, integration, reliability, net-centric and terminal effects testing.  A\/M also involves the design and development of systems needed to support A\/M DT&E including the design and development sleds, targets, range support systems and various instrumentation and measurement systems.  C4ISR provides planning, improvements and modernization to conduct DT&E of systems that support C2 functions which range from air campaign planning at the theater level to wing level C2 operations, to planning individual missions, to putting weapons on target using concepts such as machine to machine targeting.  C4ISR includes ground and flight performance testing of airborne C2 networks and tactical data links, air operation centers, mission planning systems, multi-level security systems, radio and communication systems, ISR systems, information assurance systems, and radar systems such as those used by JSTARS and air traffic control systems.  C4ISR conducts DT&E on a full range of systems covering the sensor (detection) to the shooter (weapon), including functional and environmental testing of these systems.  C4ISR includes DT&E for offensive and defensive Cyber capabilities.  Space provides planning, improvements, and modernization needed for test capabilities to perform developmental and operational testing for space and launch acquisition and sustainment programs.  Test capabilities include launch vehicle, satellite, missile, sensor, thermal protection system, signature, hardness, and interface testing.  The capabilities reside at Vandenberg, Kirtland, Arnold, Patrick, Schriever, Peterson, Holloman Air Force Bases and others.  Infrastructure includes launch sites, mobile control units, thermal vacuum chambers, sled track, arc heated wind tunnels, ballistic test ranges, signature collection, and the requisite personnel.  \n\nBudget Activity Justification:  This program is in Budget Activity 6, RDT&E Management Support, because this budget activity includes research, development, test and evaluation efforts and funds to sustain and\/or modernize the installations or operations required for general research, development, test and evaluation."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Airframe\/Propulsion\/Avionics T&E I&M"
                                    },
                                    "Description": {
                                        "val": "Improvement and modernization of the AF capability to test and evaluate Airframe\/Propulsion\/Avionics (APA)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.830"
                                            },
                                            "Text": {
                                                "val": "The Advanced Range Systems Upgrade (ARSU) project completed critical infrastructure upgrades to the operational control center and switching networks, and continued development and integration of digital data management and distribution systems, interactive display and analysis software, and mission control room upgrades at the 412TW range to manage obsolescence.  The Joint Airborne Instrumentation Integration (JAII) effort completed hardware and data instrumentation system modifications to about 12 percent of AFMC's test fleet's instrumented airborne platforms.  The Telemetry (TM) Systems Integration and Support (TSIS) effort completed C-band upgrades to eight fixed TM ground sites, modified about half of the 412 TW's ground-based receivers to incorporate C-band capabilities, and accelerated integration plans for airborne C-band instrumentation pallets.  The Tunnel 4T Modernization completed fabrication and installation of new nozzle actuator and control systems, installation and checkout of a new data acquisition system (DAS), and completed fabrication and began installation of a new Captive Trajectory System (CTS) for AEDC's transonic wind tunnel.  The Tunnels A\/B\/C Modernization project completed installation and checkout of new nozzle actuator and control systems, installation and checkout of a new DAS, and modernized the flow-field visualization system for AEDC's continuous flow supersonic and hypersonic wind tunnels.  The Advanced Large Military Engine Capability (ALMEC) project completed design activities and initiated contract awards on the exhaust intercoolers and main drive exciters to upgrade the C1\/C2 aero-propulsion test cells for testing advanced high-speed air-breathing engines.  ALMEC also continued design efforts on the C1\/C2 plant control and air supply water systems.  The Advanced Small Military Engine Capability (ASMEC) project completed critical design and initiated procurement efforts on the gas heater system, began preliminary and critical design efforts on the air supply and mechanical bypass systems, and completed technical requirements for the plant control systems to upgrade the T3 test facility supporting high-Mach small-engine propulsion test requirements.  The Ultra-High Accuracy Reference System (UHARS) project completed design efforts, continued procurement activities of GPS and non-GPS based reference systems, and began integration efforts to develop a high-accuracy inertial-based Time Space Position Information (TSPI) truth source reference system for testing and evaluating future navigation and guidance systems.  The T&E Board of Directors led tri-service investment planning and joint T&E Reliance activities as directed by the Service Secretaries."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "21.511"
                                            },
                                            "Text": {
                                                "val": "ARSU will complete program upgrades to digital data display and analysis software, interactive display and analysis software, and mission control rooms at the 412 TW.  JAII will continue executing instrumentation systems upgrades to the test fleet's instrumented airborne platforms per the test fleet modernization plan.  TSIS will complete remote control capabilities of the TM mobile ground stations, continue C-band upgrades to the fixed TM ground antenna sites at Edwards AFB, continue to modify the remaining ground-based TM receivers at Edwards AFB to incorporate C-band capabilities, and continue to acquire and integrate the airborne TM systems into test aircraft.  Tunnel 4T will complete installation and begin verification and validation efforts of the new CTS rig, and will complete verification and validation efforts of the nozzle actuator and control systems and the DAS at AEDC's transonic wind tunnel.  Tunnels A\/B\/C will complete final acceptance program close-out activities.  ALMEC will complete design efforts and initiate development activities on the plant control and air supply water systems, and will begin installation and checkout of the exhaust intercoolers and main drive exciters, for the C1\/C2 aero-propulsion test cells.  ASMEC will complete procurement and installation and checkout of the gas heater system, will complete critical design and begin procurement activities on the air supply and mechanical bypass systems, and will begin preliminary design efforts on the plant control systems to upgrade the T3 test facility.  The Improved Transonic Test Capability (IMTTC) will begin design and development efforts to upgrade the 16T transonic wind tunnel systems to increase productivity and efficiency.   The Test Instrumentation, Data Systems & Control (TIDSC) project will initiate preliminary design and development efforts to provide instrumentation and data system upgrades across AEDC test infrastructure. UHARS will complete integration efforts and initiate fielding, installation and checkout of the GPS and non-GPS based reference systems needed to test and evaluate future navigation and guidance systems.  The T&E Board of Directors will continue to lead tri-service investment planning and joint T&E Reliance efforts as directed by the Service Secretaries."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "35.059"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "35.059"
                                            },
                                            "Text": {
                                                "val": "JAII will continue executing instrumentation systems upgrades to the test fleet's instrumented airborne platforms per the test fleet modernization plan.  TSIS will continue improvements to fixed TM acquisition systems by upgrading and integrating C-band ground-based receiver systems and airborne instrumentation pallets.  ALMEC will complete installation and checkout of the exhaust intercoolers and main drive exciters, will begin installation and checkout of the plant control and air supply water systems, and will initiate design and development efforts on the switchgear and heater systems for the C1\/C2 aero-propulsion test cells.  ASMEC will complete installation and checkout efforts on the air supply and mechanical bypass systems and continue design efforts on the plant control systems to upgrade the T3 test facility.  IMTTC will continue design and development efforts to upgrade the 16T transonic wind tunnel systems to increase productivity and efficiency.   The TIDSC project will continue design and development efforts to provide instrumentation and data system upgrades across AEDC test infrastructure.  UHARS will complete fielding and conduct verification and validation efforts of the GPS and non-GPS based reference systems needed to test and evaluate future navigation and guidance systems.  The Common Range Integrated Instrumentation System (CRIIS) Production project will begin design, development and procurement efforts to upgrade range TSPI instrumentation capabilities.  The T&E Board of Directors will continue to lead tri-service investment planning and joint T&E Reliance efforts as directed by the Service Secretaries."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Armament\/Munitions T&E I&M"
                                    },
                                    "Description": {
                                        "val": "Improvement and modernization of the AF capability to test and evaluate Armament\/Munitions (A\/M)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.638"
                                            },
                                            "Text": {
                                                "val": "The Advanced Command Destruct System (ACDS) project continued independent verification and validation (IV&V) efforts to upgrade the command destruct systems supporting test missions at Eglin AFB and Edwards AFB.  The Advanced Range Telemetry (ARTM) project completed the final TM receiver procurements and all remaining upgrades to the TM antennas implementing Continuous Phase Modulation (CPM) waveforms to improve usage of critical TM spectrum capabilities at the 96 TW.  The Advanced Munitions Test Improvement (AMTI) project began checkout of Millimeter Wave (MMW) simulator and GPS simulator hardware, and took delivery of low observable target and countermeasure models target models to provide new hardware-in-the-loop (HITL) capabilities for testing advanced multi-mode seeker\/sensor guidance technologies.  The Gulf Range Test and Training Center (GRTTCC) project procured and began installation of high resolution video system distribution and display hardware; increased data storage; began procurement of mission control room fiber data links and TM processing equipment; and initiated mission control room computer upgrades to support advanced programs.  The Joint Gulf Range Area Network Development (JGRAND) project awarded a fiber contract to connect test sites D-84 to D-1B, completed preliminary design work and began contract award activity for the alternate Range Network Operations Control Center (RNOCC), and accepted the delivery of fiber links from test sites D-1C to D-3 at the 96TW.  The Combined High-Speed\/High-Resolution (CHSHR) EO\/IR Imaging project completed delivery of approximately 25% of high-speed camera systems, and continued design and development of Cinetheodolite (Cine-T) modifications to provide improved tracking capabilities for small, high-speed A\/M, missiles and airborne platform testing at Eglin AFB and Holloman AFB.  The Next Generation Munitions Test Environment (NGMTE) project completed design and initiated environmental assessments for the range C-80B drop tower installation, and began design activity on a data acquisition system supporting range C-80B to upgrade aging gun and munitions test capabilities at Eglin AFB to support modern, smarter weapon systems requiring more precise data."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.830"
                                            },
                                            "Text": {
                                                "val": "ACDS will complete IV&V efforts and final report activities to close out the program.  The ARTM project will complete checkout of all CPM upgrades and integration of TM systems and processes at the 96 TW.  AMTI will complete integration and acceptance of the MMW and advanced GPS simulators.  GRTTCC will complete the installation and checkout of high-resolution video system distribution and display hardware, mission control room fiber data links, and TM processing equipment; continue development of mission control room computer upgrades; initiate a critical facility power upgrade; and continue development of upgrades to  range data systems including range communication, range interface and data display systems.  JGRAND will complete design efforts and award a contract for the alternate RNOCC, award a fiber contract to connect test site D-1B to D-3 and continue to develop remaining advanced fiber optic and network security systems to improve range communication capabilities at the 96TW.  CHSHR EO\/IR will complete delivery of approximately 50% of the high-speed camera systems and 30% of the infrared camera systems, continue design of and initiate Cine-T modifications for four long range optical tracking systems, and initiate designs for remote C2 operations to provide improved tracking capabilities of long-range photo optic tracking systems.  NGMTE will begin drop tower construction and site preparation on C-80B, continue design activity on the data acquisition system supporting range C-80B, and begin design activity for new ballistic scoring and fragmentation recording systems for arena test range C-80C supporting gun and munitions test capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.673"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.673"
                                            },
                                            "Text": {
                                                "val": "GRTTCC will continue procurement and integration efforts to upgrade range data systems including range communication, range interface, and data display systems.  JGRAND will continue to develop the alternate RNOCC capabilities and initiate additional contracts for advanced fiber optic systems to improve range communication capabilities at the 96TW.  CHSHR EO\/IR will continue procurement and integration of new high-speed digital cameras, modernization of long-range Cine-T photo optic tracking systems, and remote C2 operation upgrades to provide improved tracking capabilities.  NGMTE will continue to upgrade aging gun and munitions test infrastructure, develop and procure common data instrumentation and acquisition systems, and replace environmental test chambers supporting gun and arena test capabilities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "C4ISR T&E I&M"
                                    },
                                    "Description": {
                                        "val": "Improvement and modernization of the AF capability to test and evaluate C4ISR"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "The Command and Control Test Operations Center (C2TOC) project completed efforts to develop a Joint Air Operations Center (AOC) level test capability by fielding additional C2 connectivity and communication links of C2 computer systems, including computers, firewalls, and test tools to support end-to-end weapon system testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Early planning will begin for the Improved Command and Control Test Operations Center (I-C2TOC) project to develop net-centric C2 battle management operations capabilities, improve communication interfaces and data collection, handling, analysis and display capabilities to support C4ISR\/Cyber end-to-end weapon system testing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "I-C2TOC will begin formal design and development efforts for net-centric C2 battle management operations capabilities, improve communication interfaces and data collection, handling, analysis and display capabilities to support C4ISR\/Cyber end-to-end weapon system testing."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "RDTE: BA 06: PE 0604256F"
                                    },
                                    "Title": {
                                        "val": "Threat Simulator Development"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "22.348"
                                        },
                                        "CurrentYear": {
                                            "val": "14.841"
                                        },
                                        "BudgetYearOne": {
                                            "val": "24.418"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "24.418"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "24.003"
                                        },
                                        "BudgetYearThree": {
                                            "val": "22.020"
                                        },
                                        "BudgetYearFour": {
                                            "val": "22.436"
                                        },
                                        "BudgetYearFive": {
                                            "val": "22.833"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTE: BA 06: PE 0605807F"
                                    },
                                    "Title": {
                                        "val": "Test and Evaluation Support"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "670.586"
                                        },
                                        "CurrentYear": {
                                            "val": "722.658"
                                        },
                                        "BudgetYearOne": {
                                            "val": "689.509"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "689.509"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "672.427"
                                        },
                                        "BudgetYearThree": {
                                            "val": "680.719"
                                        },
                                        "BudgetYearFour": {
                                            "val": "688.020"
                                        },
                                        "BudgetYearFive": {
                                            "val": "700.796"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTE: BA 06: PE 0605976F"
                                    },
                                    "Title": {
                                        "val": "Facility Restoration & Modernization - T&E"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "38.854"
                                        },
                                        "CurrentYear": {
                                            "val": "44.160"
                                        },
                                        "BudgetYearOne": {
                                            "val": "46.955"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "46.955"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "40.787"
                                        },
                                        "BudgetYearThree": {
                                            "val": "43.319"
                                        },
                                        "BudgetYearFour": {
                                            "val": "44.157"
                                        },
                                        "BudgetYearFive": {
                                            "val": "44.723"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTE: BA 06: PE 0605978F"
                                    },
                                    "Title": {
                                        "val": "Facility Sustainment - T&E Support"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "24.986"
                                        },
                                        "CurrentYear": {
                                            "val": "27.643"
                                        },
                                        "BudgetYearOne": {
                                            "val": "32.965"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "32.965"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "28.080"
                                        },
                                        "BudgetYearThree": {
                                            "val": "28.598"
                                        },
                                        "BudgetYearFour": {
                                            "val": "29.154"
                                        },
                                        "BudgetYearFive": {
                                            "val": "29.623"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "This program element uses several different contracting strategies to provide the most cost effective T&E investment solutions.  The main acquisition strategy is to use full and open competition wherever possible to improve and modernize existing test capabilities."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}