{
    "id": "ad61b4da3a764e4a729bec28a15cefd53172c032",
    "meta": {
        "filename": "dod-2015_RDTE_2015_ARMY_BA3_RDTE_JustificationBook_Army_PB_2015.zzz_unzipped_RDTE_JustificationBook_Army_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603007A"
        },
        "ProgramElementTitle": {
            "val": "Manpower, Personnel and Training Advanced Technology"
        },
        "R1LineNumber": {
            "val": "35"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "8.756"
            },
            "CurrentYear": {
                "val": "7.796"
            },
            "BudgetYearOne": {
                "val": "13.580"
            },
            "BudgetYearOneBase": {
                "val": "13.580"
            },
            "BudgetYearTwo": {
                "val": "12.719"
            },
            "BudgetYearThree": {
                "val": "14.367"
            },
            "BudgetYearFour": {
                "val": "14.787"
            },
            "BudgetYearFive": {
                "val": "15.222"
            }
        },
        "ProgramElementNote": {
            "val": "FY13 decreases attributed to Congressional Reductions (-19 thousand); SBIR\/STTR transfers (-188 thousand); and Sequestration reductions (-893 thousand).\nFY15 funding increased for human behavioral research."
        },
        "ProgramElementMissionDescription": {
            "val": "This project element (PE) matures and demonstrates advanced behavioral and social science technologies that enhance performance to ensure that the Warfighter keeps pace with the transformations in systems, weapons, equipment, and mission requirements to meet the goals of the future force.  These technologies provide key capabilities through training methods and techniques that prepare Soldiers and leaders to effectively operate in complex digitized, networked environments; enable the use of embedded training technologies envisioned for future command and control (C2) systems; as well as foster cognitive, behavioral, and psychological flexibility, adaptability, and mission readiness.  Project 792 evaluates new selection measures, refines performance metrics, assesses innovative training techniques, and analyzes methods and tools to better adapt training to meet goals and requirements. Increased funding in FY15 for this PE is based on work shifted from PE 0602785A due to need for increased focus on maturation and demonstration of selection techniques and tools as well as training methods.\n\nWork in this project complements and is fully coordinated with 0603015A (Next Generation Training & Simulation Systems), 0602308A (Advanced Concepts and Simulation), PE 0602716A (Human Factors Engineering Technology) and PE 0602785A (Manpower\/Personnel\/Training Technology.)\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy\n\nWork in this PE is performed by the US Army Research Institute (ARI) for the Behavioral and Social Sciences in Ft. Belvoir, VA."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "9.856"
                },
                "CurrentYear": {
                    "val": "7.800"
                },
                "BudgetYearOne": {
                    "val": "7.070"
                },
                "BudgetYearOneBase": {
                    "val": "7.070"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "8.756"
                },
                "CurrentYear": {
                    "val": "7.796"
                },
                "BudgetYearOne": {
                    "val": "13.580"
                },
                "BudgetYearOneBase": {
                    "val": "13.580"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.100"
                },
                "CurrentYear": {
                    "val": "-0.004"
                },
                "BudgetYearOne": {
                    "val": "6.510"
                },
                "BudgetYearOneBase": {
                    "val": "6.510"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.019"
                    },
                    "CurrentYear": {
                        "val": "-0.004"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.188"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "6.510"
                                },
                                "BudgetYearOneBase": {
                                    "val": "6.510"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Sequestration"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.893"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "792"
                    },
                    "ProjectTitle": {
                        "val": "Personnel Performance & Training"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "8.756"
                        },
                        "CurrentYear": {
                            "val": "7.796"
                        },
                        "BudgetYearOne": {
                            "val": "13.580"
                        },
                        "BudgetYearOneBase": {
                            "val": "13.580"
                        },
                        "BudgetYearTwo": {
                            "val": "12.719"
                        },
                        "BudgetYearThree": {
                            "val": "14.367"
                        },
                        "BudgetYearFour": {
                            "val": "14.787"
                        },
                        "BudgetYearFive": {
                            "val": "15.222"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "This program element (PE) matures and demonstrates advanced behavioral and social science technologies that enhance the Soldier Lifecycle (e.g., selection, assignment, training, leader development) and human relations (e.g., culture of dignity, respect, and inclusion) . These technologies provide advanced personnel measures that more fully assess potential and predict performance, behavior, attitudes, and resilience. These technologies also provide innovative and effective training and mentoring methods to ensure Soldiers, leaders, and units have the knowledge, skills, and abilities to sustain positive unit climates and meet mission requirements in uncertain and complex environments. This PE validates new selection measures and performance metrics, assesses innovative training methods, and conducts scientific assessments to inform Human Capital policy and programs. Research in this PE will result in effective non-materiel solutions to help the Army adjust to changes in force size and structure, a variety of mission demands and contexts, challenges in human relations, and budgetary constraints.\n\nEfforts in this program element support the Army Science and Technology Soldier portfolio.\n\nWork in this project complements and is fully coordinated with and PE 0602785A (Manpower\/Personnel\/Training Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and\nthe Army Human Capital Strategy.\n\nWork in this PE is performed by the US Army Research Institute (ARI) for the Behavioral and Social Sciences in Ft. Belvoir, VA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Personnel Assessment"
                                    },
                                    "Description": {
                                        "val": "This effort, previously titled \"Personnel Technology,\" matures and assesses Soldier selection measures, techniques and tools to better predict behavior and performance to provide the Army the flexibility to adapt to changing recruiting environments.  The Army's current selection measures primarily focus on a candidate's cognitive (e.g., technical and analytical) ability which does not predict attrition, discipline, and motivation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.058"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Matured and assessed improved non-cognitive measures for enlisted selection and classification; performed validation checks and updated enlisted longitudinal databases."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.590"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Initiating validation of non-cognitive measures (e.g., temperament) to better match enlisted Soldiers to jobs (involves large-scale data collection and analysis, job\/task analysis, and predictive modeling) across multiple job types."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.397"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.397"
                                            },
                                            "Text": {
                                                "val": "Will validate non-cognitive measures as predictors of success (e.g., attrition, performance, attitudes) for enlisted Soldiers as well as non-commissioned officers (NCOs) in special assignments; will identify strategies for conducting classification analyses. Will initiate research to develop enhanced suitability screening for military positions of trust (e.g., Sexual Harassment\/Assault Response and Prevention Coordinators, Drill Sergeants."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Personnel Readiness, Performance and Conduct"
                                    },
                                    "Description": {
                                        "val": "This effort, previously titled, \"Training and Leader Development,\" matures methods to assess, enhance, and sustain individual and unit readiness, resilience, and effectiveness to improve Soldier and unit performance. This effort also develops efficient and empirically valid measures to assess command climate and associated outcomes, and matures methods to enable leaders and units to maintain or create climates of respect, dignity and inclusion."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.698"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Matured methods to assess the effectiveness of training tools to develop adaptive Soldiers and leaders (e.g., tactical decision making and judgment proficiency); matured training applications for operational units (e.g., visual threat detection, human terrain mapping) and designed methods for training instructors to leverage emerging learning technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.206"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developing adaptive instructional model that captures task type, training domain, level of expertise, and training method to improve training efficiency for cognitive\/decision-making tactical skills and tasks; expanding training approaches for operational units using live\/virtual\/constructive environments to train a broad range of military operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.183"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.183"
                                            },
                                            "Text": {
                                                "val": "Will initiate research to prevent sexual harassment and assault through more effective training and mentoring methods. Will initiate research on valid measures of command climates of dignity, respect, and inclusion. Will validate Army instructor methods and techniques to improve instructor skills."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}