{
    "id": "af4b42d56cb9ba4f13449ffce46bb8fbe18848e4",
    "meta": {
        "filename": "dod-2015_RDTE_2015_NAVY_BA4_RDTE_JustificationBook_Navy_PB_2015.zzz_unzipped_RDTE_JustificationBook_Navy_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603725N"
        },
        "ProgramElementTitle": {
            "val": "Facilities Improvement"
        },
        "R1LineNumber": {
            "val": "60"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "10.930"
            },
            "PriorYear": {
                "val": "3.116"
            },
            "CurrentYear": {
                "val": "3.019"
            },
            "BudgetYearOne": {
                "val": "2.588"
            },
            "BudgetYearOneBase": {
                "val": "2.588"
            },
            "BudgetYearTwo": {
                "val": "5.754"
            },
            "BudgetYearThree": {
                "val": "4.883"
            },
            "BudgetYearFour": {
                "val": "3.217"
            },
            "BudgetYearFive": {
                "val": "3.286"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Mission Description and Budget Item Justification: \nThis program provides for capabilities to: a) overcome performance limitations and reduce the life cycle cost of shore facilities and, b) provide protection against terrorist attacks for shore installations and their operations. The program focuses on technical and operational issues of specific Navy interest, where there are no unbiased test validated Commercial Off the Shelf (COTS) solutions available, and where timely capabilities may not materialize without specific demonstration or validation by the Navy. Additionally, the program completes the development of technologies originating from Navy, DOD and other sources of Science and Technology programs, including the National Science Foundation (NSF), the National Institute of Standards and Technology (NIST) and Department of Energy (DOE). Validated technologies are implemented in the Navy's Military Construction (MILCON) and Facilities, Sustainment Restoration and Modernization (FSRM) program, and Antiterrorism and Force Protection (ATFP) Other Procurement, Navy (OP,N) program. \n\nProject 0995 addresses the following Navy facilities requirements during FY 2012 through FY 2018: Advance Technology for Waterfront Facilities Repair and Enhancements, Facilities Technologies to Reduce the Cost of Facilities Sustainment, Restoration and Modernization for reducing the total ownership cost (TOC) of future and existing Facilities and addressing natural and catastrophic risk of critical Naval Waterfront Facilities. This project is consistent with recommendations of two National Academy of Sciences Reports: \"The Role of Federal Agencies in Fostering New Technology and Innovation in Building\" and \"Federal Policies to Foster Innovation and Improvement in Constructed Facilities.\" \n\nStarted in FY2006 the Force Protection Ashore Project 3155 addresses selective topics in modeling, and material technologies to reduce the vulnerability of installations; and reduce the acquisition and operating costs of protective technologies. The demonstrations and validations provide the independent, technical and operational test data for the development of competitive performance specifications to acquire the required capabilities. The ATFP project is coordinated with other DOD programs."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "3.401"
                },
                "CurrentYear": {
                    "val": "3.019"
                },
                "BudgetYearOne": {
                    "val": "3.446"
                },
                "BudgetYearOneBase": {
                    "val": "3.446"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "3.116"
                },
                "CurrentYear": {
                    "val": "3.019"
                },
                "BudgetYearOne": {
                    "val": "2.588"
                },
                "BudgetYearOneBase": {
                    "val": "2.588"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.285"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.858"
                },
                "BudgetYearOneBase": {
                    "val": "-0.858"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.006"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.500"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.500"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.001"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-1.358"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.358"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.278"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0995"
                    },
                    "ProjectTitle": {
                        "val": "Naval Facilities System"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "8.636"
                        },
                        "PriorYear": {
                            "val": "1.313"
                        },
                        "CurrentYear": {
                            "val": "1.387"
                        },
                        "BudgetYearOne": {
                            "val": "0.816"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.816"
                        },
                        "BudgetYearTwo": {
                            "val": "1.405"
                        },
                        "BudgetYearThree": {
                            "val": "1.862"
                        },
                        "BudgetYearFour": {
                            "val": "1.884"
                        },
                        "BudgetYearFive": {
                            "val": "1.921"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This program provides the Navy with new engineering capabilities that are required to overcome specific performance limitations of Naval shore facilities while reducing the cost of sustaining the Naval shore infrastructure. The program focuses available RDT&E resources on satisfying facility requirements where the Navy is a major stakeholder or where there are no tested validated Commercial Off the Shelf (COTS) solutions available, and a timely solution will not emerge without a Navy sponsored demonstration and validation. The program completes the development and validation of facility technologies originating in Navy science and technology programs, plus a variety of other sources which includes the National Science Foundation (NSF) and the National Institute of Standards and Technology (NIST). Validated technologies are implemented in the Navy's Military Construction (MILCON) and Facilities Sustainment Restoration and Modernization Programs (FSRM). The Duncan Hunter National Defense Authorization Act of 2009 laid down very specific guidelines for the correction of corrosion deficiencies in DoD shore facilities which is estimated to be $1.9B (DOD Annual Cost of Corrosion for the Department of Defense Facilities and Infrastructure July 2010). \n\nProject 0995 addresses two Navy facilities requirements: 1) waterfront facilities repair, upgrade and service life extension; and, 2) validation testing\/performance monitoring of critical facilities (such as dry docks, piers, runways, magazines, etc.), testing and evaluation of the performance of alternative materials, and surfacing concepts, and, methods and corrosion technologies to reduce the cost of Sustainment, Restoration and Modernization (SRM). \n\nWaterfront facilities, repair, upgrade and service life extension: \nAn urgent requirement exists for early identification of strategies and solution recommendations for seismic risk at Naval Facilities, and especially nuclear capable waterfront facilities. Recent Pacific Rim earthquakes have heightened anxiety levels on perceived huge risks to Navy waterfront facilities in the region. The sub-project will provide analysis and solution recommendations for facilities impacted by seismic risk. Waterfront facilities repair and upgrade: About 75% of the Navy's waterfront facilities are over 45 years old. They were designed for a service life of 25 years which was to satisfy the mission requirements existing at that time. The over aged reinforced concrete requires costly and repetitive repairs. Besides providing more pier side ship maintenance and thus reduce dry dock costs, these piers must be strengthened to support concentrated crane loads up to 140 tons when piers were originally not designed for concentrated loads. Piers were previously designed to service one or possibly two particular ship classes. Berthing flexibility is now limited by mooring and utility arrangements. This sub-project addresses new material design methods, and retrofit methods which extends the service life of existing waterfront facilities by an additional 15 or more years. The project also addresses updating the mission based service, environmental, and protection loading requirements imposed by changes in platforms, operations and threats. Other initiatives include: leveraging Building Information Modeling (BIM) technology to provide for enhanced facilities management processes and waterfront utilities service enhancements using models to achieve flexible berthing arrangements consistent with current and future platform mooring configurations and hotel service requirements including Facilities and Infrastructure Integrated Product Support for Acquisition Category (ACAT) Programs. \n\nTechnologies to reduce the cost of Sustainment, Restoration and Modernization (SRM): \nTechnologies to reduce the cost of SRM issues of high operational significance are addressed on a priority basis. The Navy portion of corrosion deficiencies at DoD shore facilities is estimated to be $433M (DOD Annual Cost of Corrosion for the Department of Defense Facilities and Infrastructure July 2010). This effort will demonstrate and validate the cost and reliability of advanced corrosion technologies in order to assure their acceptance and implementation in traditionally conservative public works and construction industries. These facility corrosion technologies will accelerate the validation, commercialization, and wide-spread implementation required to reduce the cost of correcting, the deficiencies in the Navy SRM backlog. The sub-projects include the continuing effort to validate, test and conduct performance monitoring of enhanced facility designs and coatings for facilities and equipment."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Waterfront facilities, repair, upgrade and service life extension:"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.464"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Waterfront facilities, repair, upgrade and service life extension: Continue analysis and solution set development for a CVN capable dry-dock and waterfront seismic analysis and standard seismic risk mitigation procedures. Transition approved methodology for analysis and assessment of remaining Navy dry docks to incorporate into Navy policies and procedures. Complete second generation waterfront BIM and integrate into corporate standards and specifications. Initiate identification of operational and maintenance issues of waterfront facilities associated with supporting the new class of ships, submarines and the Ford Class Carrier. Develop modeling and simulation of pier, dry dock, wharf and waterfront facility configurations with new ship and submarine platforms and associated systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.553"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Waterfront facilities, repair, upgrade and service life extension: Complete analysis and solution of CVN capable dry-dock and waterfront seismic analysis and standard seismic risk mitigation procedures and apply methodology to other dry docks and critical waterfront structures. Continue to identify and validate operational and maintenance issues of waterfront facilities associated with supporting the Navy's new class of ships and submarines, including the Ford Class Carrier. These new ships will create compatibility issues with existing infrastructure in terms of berthing loading, hotel services, and movement of people, ordnance and equipment. Modify and validate modeling and simulation of pier, dry dock, wharf and waterfront facility configurations with new ship and submarine platforms and associated systems. Initiate investigation of natural and catastrophic events on critical waterfront facilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.270"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.270"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete waterfront seismic analysis and standard seismic risk mitigation procedures for other dry docks and critical waterfront structures. Continue to identify and validate operational and maintenance issues of waterfront facilities associated with supporting the Navy's new class of ships and submarines, including the Ohio Class Replacement Submarine.  Continue to investigate natural and catastrophic events on critical waterfront facilities and begin to develop risk identification and mitigation methodologies. Initiate sea level rise effects on critical infrastructure. Initiate investigation of special design and maintenance requirements for Naval Facilities in the arctic environment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Sustainment, Restoration & Modernization:"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.849"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Sustainment, Restoration & Modernization: Continue validation testing\/performance monitoring of enhanced facility designs and coatings for facilities and equipment. Continue transition performance of alternative materials, and surfacing concepts and methods. Continue field (validation) testing of high temperature resistant pavement joint sealants. Initiate new Corrosion Prevention & Control projects, emphasizing sustainable design and improved lifecycle cost reductions. Continue evaluation of solutions to develop associated design and construction criteria to support the transition of new technologies into the shore facilities infrastructure."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.834"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Sustainment, Restoration & Modernization: Continue Corrosion Prevention & Control projects, emphasizing sustainable design and improved lifecycle cost reductions. Continue improved concrete construction and crack repair technologies utilizing affordable and green aggregate constituents.  Continue evaluation of solutions to develop associated design and construction criteria to support the transition of new technologies associated the shore facilities infrastructure.  Initiate new Corrosion Prevention & Control projects, emphasing sustainable design and improved lifecycle cost reductions. Initiate investigations for retrofitting existing facilities to conform to high performance building standards."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.546"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.546"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Sustainment, Restoration & Modernization: Continue Corrosion Prevention & Control projects, emphasizing sustainable design and improved lifecycle cost reductions. Continue improved concrete construction and crack repair technologies utilizing affordable and green aggregate constituents. Continue investigations for retrofitting existing facilities to conform to high performance building standards. Continue evaluation of solutions to develop associated design and construction criteria to support the transition of new technologies associated the shore facilities infrastructure. Initiate new Corrosion Prevention & Control projects, emphasizing sustainable design and improved lifecycle cost reductions. Initiate development of design criteria for closed piers and wharves."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Projects identified in this budget have been carefully selected to respond to both the facilities support for new Acquisition Category Programs, to address TOC considerations of an evolving and aging infrastructure, and to facilitate rational risk based decisions and solutions to protect and decrease risk levels for Department of the Navy-critical infrastructure and facilities. Each project has been assessed to ensure that it is addressing legitimate risks and requirements of the shore establishment. The results of these projects will be the development of design and construction criteria and or components that directly impact the shore facilities."
                        },
                        "PerformanceMetrics": {
                            "val": "Quarterly Program Reviews are conducted with the major performers to include funds status discussion, schedule review, assessment of plan to actual to meet FMB benchmarks at midyear and end-of-year for PY1 and CY, and review of accomplishments and issues to date."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0603725N_0995_FILE1.PNG"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0603725N_0995_FILE2.PNG"
                                }
                            }
                        ]
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3155"
                    },
                    "ProjectTitle": {
                        "val": "Force Protection Ashore"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "2.294"
                        },
                        "PriorYear": {
                            "val": "1.803"
                        },
                        "CurrentYear": {
                            "val": "1.632"
                        },
                        "BudgetYearOne": {
                            "val": "1.286"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.286"
                        },
                        "BudgetYearTwo": {
                            "val": "0.852"
                        },
                        "BudgetYearThree": {
                            "val": "1.025"
                        },
                        "BudgetYearFour": {
                            "val": "1.333"
                        },
                        "BudgetYearFive": {
                            "val": "1.365"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Protection of Navy Installations against terrorist activities requires deployment of advanced technology for force protection capabilities. This antiterrorism and force protection (AT\/FP) ashore project will develop, demonstrate and validate technologies for the following: access control and integrated perimeter security surveillance sensors and intelligent electronic security systems for automated intruder detection (Installation Protection); perimeter security; waterside protection against craft and swimmer intrusion; secure and efficient operations centers and emergency management centers including human and information support systems (Command and Control). Programs currently being evaluated are  standard-based enterprise physical security system integration and automation; Command, Control, and Communications (C3) capabilities for emergency operations; integrated and networked mass notification systems (MNS); Waterside intelligent video security systems; integrated over-the-water sensors and analytics for automated course of action planning; identifying and interdicting malevolent threats - watercraft, swimmers, divers, and unmanned underwater vessels (UUVs) to reduce injury and death to the war fighter and damage to high value units (HVUs). Through demonstration and validation of risk modeling and simulation models, the potential of emerging technologies will be evaluated and installation security strategies that reduce manpower and other costs will be formulated. These demonstrations and validations derive advanced technology from science and technology programs of government academia and industry. The technology evaluation and validation produces data for performance specifications used for competitive procurement. All work will be coordinated with other programs and through industry forums as appropriate."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Force Protection Ashore"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.803"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Complete Waterside Intelligent Video evaluation (OT) and procurement specification development.\n- Continue demonstration and validation of Swimmer\/Diver Intent Recognition and Interdiction project. \n- Begin integration and demonstration of Automated Sensor Assessment and Course of Action Planning (COAP) project Test & Evaluation (DT) for EHSS. \n- Initiate Integrated Physical Security and Access Control (PS\/AC) Automation project for sensor management, monitoring and response capability development.\n- Continue Net-centric Mass Notification System IP-enabled WAAN development and testing (DT\/OT) at operational Navy Installation with various COTS Vendors for Navy enterprise and inter-service\/agency interoperability."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.632"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue Integrated PS\/AC Automation project with the Regional Dispatch Center (RDC) to include developmental test and evaluation (DT)\n- Continue integration and demonstration of Automated Sensor Assessment and Course of Action Planning (COAP) (OT) with EHSS. \n- Complete integration and validation of advanced beyond swimmers and diver detection, tracking, and interdiction capabilities into EHSS. \n- Complete Net-centric Mass Notification System specification development for transition.\n-Initiate Waterside Protection - Boat Barrier Electronic Infrastructure project to assess impact of next generation boat barriers on existing Electronic Harbor Security System (EHSS) sensors and research, identify, integrate, implement and evaluate mitigation sensors and sensor infrastructure to augment performance in the presence of shadow zones caused by the new barriers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.286"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.286"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Complete integration and demonstration of Automated Sensor Assessment and Course of Action Plan (COAP) with EHSS and document baseline specifications. \n-Continue Boat Barrier Electronic Infrastructure project with a particular focus on environmental resilience and sustainability in an operational setting and integrated with existing Port Security Barriers and remote gate operations devices.\n- Initiate Waterside Protection - Boat Barrier Electronic Infrastructure project to assess impact of next generation boat barriers on existing Electronic Harbor Security System (EHSS) sensors and research, identify, integrate, implement and evaluate mitigation sensors and sensor infrastructure to augment performance in the presence of shadow zones caused by the new barriers.\n- Initiate ship-to-shore common information exchange project to rapidly share information and communications between shore security forces and docked ships.\n- Initiate versatile access control project to develop, integrate and test an access control system that is open architecture, enables biometrics and handles multiple credentials (driver's license, passport, etc.).\n- Complete PS\/AC automation project with an operational evaluation in NSW (OT)."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Demonstration and validation is conducted for maximum transfer and interaction with industry such as to influence the industry COTS with the results of  this demonstration and prototype validation.  Acquisition is based on performance specifications enabled by this project."
                        },
                        "PerformanceMetrics": {
                            "val": "Quarterly Program Reviews to include funds status, schedule review and assessment of plan to actual."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3347"
                    },
                    "ProjectTitle": {
                        "val": "Navy Expeditionary Energy Development"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.486"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.486"
                        },
                        "BudgetYearTwo": {
                            "val": "3.497"
                        },
                        "BudgetYearThree": {
                            "val": "1.996"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "5.979"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Development of advanced Environmental Control Unit (ECU) for expeditionary force camp shelters will reduce the heating and air-conditioning (HVAC) fuel consumption by 50% and also will reduce fuel transport convoys, and attendant manpower casualties and handling labor."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Expeditionary Environmental Control Unit  (EECU)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.486"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.486"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Initiate\/transition full scale development of S&T innovative concepts developed by ARPA-E to TRL 6 with funding from the Assistant Secretary of Defense Office of Operational Energy Plans and Programs."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Development of  this technology to TRL8 will be  shared and coordinated with U.S. Army CERDEC for potential acquisition through the DOD Program Manager for Mobile Electric Power( Army managed PM). The new Expeditionary Environmental Control Unit available for procurement by all Services will save fuel and associated logistics support."
                        },
                        "PerformanceMetrics": {
                            "val": "October 2014 Initiate Planning for Development Contracts"
                        }
                    }
                }
            ]
        }
    }
}