{
    "id": "b0479aaffe943c54682f858d1b8012d9991f584a",
    "meta": {
        "filename": "dod-2015_RDTE_2015_OSD_RDTE_JustificationBook_Office_of_Secretary_Of_Defense_PB_2015.zzz_unzipped_RDTE_JustificationBook_Office_of_Secretary_Of_Defense_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604400D8Z"
        },
        "ProgramElementTitle": {
            "val": "Unmanned Aircraft Systems Common Development"
        },
        "R1LineNumber": {
            "val": "103"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "24.161"
            },
            "PriorYear": {
                "val": "11.233"
            },
            "CurrentYear": {
                "val": "8.263"
            },
            "BudgetYearOne": {
                "val": "3.702"
            },
            "BudgetYearOneBase": {
                "val": "3.702"
            },
            "BudgetYearTwo": {
                "val": "3.150"
            },
            "BudgetYearThree": {
                "val": "3.519"
            },
            "BudgetYearFour": {
                "val": "4.030"
            },
            "BudgetYearFive": {
                "val": "3.884"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "PE 0305220F:  GLOBAL HAWK DEVELOPMENT\/FIELDING contains funding for the Common-ABSAA development.\nPE 0305219A:  MQ-1 Sky Warrior A UAV contains additional funding for GBSAA development.\nPE 0305220N: RQ-4 UAV (BAMS UAS) contains funding for an initial common RQ\/MQ-4 ABSAA capability via a Pilot In The Loop (PITL) Due Regard system.\nThe FY2014 President’s Budget transferred $83.169M (FYDP) to the above UAS programs’ PEs."
        },
        "ProgramElementMissionDescription": {
            "val": "The Department of Defense (DOD) UAS Common Development is a joint effort to develop and demonstrate common standards, architectures, and technologies that address UAS-specific issues across all Military Services.  The intent is to increase interoperability and effectiveness by promoting cooperative development of solutions that are applicable across major classes of UAS.  This effort will initially focus on addressing DOD UAS integration into the National Airspace System (NAS) and demonstration of a common, interoperable ground station architecture and associated interface standards."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "12.368"
                },
                "CurrentYear": {
                    "val": "8.300"
                },
                "BudgetYearOne": {
                    "val": "4.321"
                },
                "BudgetYearOneBase": {
                    "val": "4.321"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "11.233"
                },
                "CurrentYear": {
                    "val": "8.263"
                },
                "BudgetYearOne": {
                    "val": "3.702"
                },
                "BudgetYearOneBase": {
                    "val": "3.702"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.135"
                },
                "CurrentYear": {
                    "val": "-0.037"
                },
                "BudgetYearOne": {
                    "val": "-0.619"
                },
                "BudgetYearOneBase": {
                    "val": "-0.619"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Strategic efficiency Reduction"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-1.135"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.619"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.619"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FY 2014 Baseline Adjustment"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "-0.037"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The FY2014 President’s Budget transferred $83.169M (FYDP) to the above UAS programs’ PEs."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P440"
                    },
                    "ProjectTitle": {
                        "val": "UAS Airspace Integration"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "13.591"
                        },
                        "PriorYear": {
                            "val": "7.347"
                        },
                        "CurrentYear": {
                            "val": "4.703"
                        },
                        "BudgetYearOne": {
                            "val": "2.600"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.600"
                        },
                        "BudgetYearTwo": {
                            "val": "2.230"
                        },
                        "BudgetYearThree": {
                            "val": "2.390"
                        },
                        "BudgetYearFour": {
                            "val": "2.690"
                        },
                        "BudgetYearFive": {
                            "val": "2.627"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "ABSAA and GBSAA technology development transitioned to UAS programs of record during FY2013."
                        },
                        "ProjectMissionDescription": {
                            "val": "Global Hawk (GH) and the Triton, as well as other Group 3-5 UAS, need a sense-and-avoid (SAA) capability as an alternate means of compliance to Title 14 Code of Federal Regulations, Part 91.111 and Part 91.113, requirement to see-and-avoid other aircraft.  The Air Force is leading the effort to develop an Airborne Sense and Avoid (ABSAA) system that is suitable to support operations within US and foreign national airspace. The RQ-4 Global Hawk, MQ-4C Triton, MQ-1B Predator, MQ-1C Gray Eagle, and MQ-9 Reaper all have a requirement for SAA capability and will leverage the technology being developed by the Air Force. The Army is leading the development of a Ground Based Sense-and-Avoid (GBSAA) system using existing technology to provide a near-term solution for improved airspace access, both for terminal operations and for operations\/training within the GBSAA system's coverage area (e.g., Gray Eagle at El Mirage, Shadow operations at Cherry Point).\n \nProvides joint funding to support development of common operating concepts, standards, modeling and simulation, and technology to enable DoD UAS to routinely access the national and international airspace systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Unmanned Aircraft System Airspace Integration Initiatives"
                                    },
                                    "Description": {
                                        "val": "Starting in FY 2010 the Department's sense-and-avoid (SAA) developmental efforts are enhanced by this defense-wide program element. This program provides joint funding to accelerate the development of SAA technology and standards to enable UAS to routinely access the national and international airspace systems.  This program also develops UAS airspace integration requirements and standards, as well as supports the modeling, simulation, and operational analysis needed to validate the systems and standards.  In FY2013 ABSAA and GBSAA efforts transitioned to the Services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.347"
                                            },
                                            "Text": {
                                                "val": "ABSAA - Development transitioned to Service Programs of Record funding with a re-planned acquisition strategy.  \n\nStandards Development - Completed update of MIL-HDBK-516 for airworthiness criteria, standards, and methods of compliance for both fixed and rotary wing UAS, and began finalizing all Proof of Concurrence Reports for Tri-Service Technical Airworthiness Authority (TAA) signatures. Kicked off SAA systems airworthiness criteria, standards, and methods of compliance development. Conducted a detailed study of the certification of commercial-off-the-shelf (COTS) components in safety critical applications to satisfy a high priority safety gap identified by the Sense and Avoid Science Research Panel (SARP).  Leveraged Probabilistic Risk Assessment (PRA) methodologies to support the development of a safety case for integrating UAS in the NAS. Developed a potential methodology for evaluating the effectiveness of SAA system algorithms.  Started updating the current UAS Airspace Integration Concept of Operations (CONOPS) and conducted operational analysis to assist DoD in overcoming UAS AI challenges.  \n\nModeling & Simulation (M&S) - Supported analysis of modeling and simulation requirements to address high priority research gaps, as identified by the SARP.\n \nGBSAA – The GBSAA SIPT continued efforts to develop a common GBSAA system applicable across all Services. The efforts included Common Display work, development of top-level requirements, and participation in the SARP workshops - leading the development of SAA concepts, definitions and requirements. The display work included Display Usability Tests conducted with UAS operators in Huntsville, AL and at Ft Huachuca, AZ to refine the Alert & Traffic Display subsystem. In addition to the usability tests, a Common Display Quick Study utilizing 15 Army participants – including manned pilots, unmanned operators and air traffic control personnel - was conducted with a focus on intruder prioritization schemes for a common display. Army's top level GBSAA requirements and a high-level description of its approval process were submitted to the Federal Aviation Administration (FAA) to provide a framework for a written agreement between DoD\/Army and the FAA on full integrated GBSAA operations, starting with Ft Hood, TX. Army GBSAA is considered a “pathfinder” for SAA system certification by the FAA. Army GBSAA Block 0 system requirements are base-lined and the development of software certification is underway with integration testing scheduled to begin in July 2014. Cherry Point MCAS began flying segregated transit GBSAA operations under a Certificate of Authorization (COA) in June 2013.  Cherry Point’s COA approval provides a path for the Services to follow for self-certification and safety risk management."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.703"
                                            },
                                            "Text": {
                                                "val": "Standards Development - Complete and publish the update of MIL-HDBK-516 for airworthiness criteria, standards, and methods of compliance for both fixed and rotary wing UAS, and SAA systems. Leverage Probabilistic Risk Assessment (PRA) and Markov Decision Process (MDP) methodologies to better understand SAA system conflict mitigation strategies to support the development of a safety case for integrating UAS in the NAS. Complete and publish an update to the UAS Airspace Integration CONOPS. Research and facilitate a DoD-wide exemption to 14 CFR 91.113 to enable specified DoD UAS operations in the NAS. Conduct operational analysis to assist DoD in overcoming UAS AI challenges.  \n\nModeling & Simulation (M&S) - Support analysis of modeling and simulation requirements to address high priority research gaps, as identified by the SARP."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.600"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.600"
                                            },
                                            "Text": {
                                                "val": "Standards Development - Complete and publish the update of MIL-HDBK-516 for airworthiness criteria, standards, and methods of compliance for both fixed and rotary wing UAS, and SAA systems.  Conduct ongoing analysis of UAS Airspace Integration safety case development issues in order to facilitate expanded UAS access to the NAS. Conduct analysis to address high priority safety gaps as identified by the SARP. Coordinate system requirements and safety guidelines within appropriate standards development organizations. Conduct operational analysis to assist DoD in overcoming UAS AI challenges.  \n\nModeling & Simulation (M&S) - Support analysis of modeling and simulation requirements to address high priority research gaps, as identified by the SARP."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P442"
                    },
                    "ProjectTitle": {
                        "val": "Interoperability"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "10.282"
                        },
                        "PriorYear": {
                            "val": "3.455"
                        },
                        "CurrentYear": {
                            "val": "3.060"
                        },
                        "BudgetYearOne": {
                            "val": "0.898"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.898"
                        },
                        "BudgetYearTwo": {
                            "val": "0.700"
                        },
                        "BudgetYearThree": {
                            "val": "0.900"
                        },
                        "BudgetYearFour": {
                            "val": "1.100"
                        },
                        "BudgetYearFive": {
                            "val": "1.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The UAS Common Ground Station Demonstration project will develop and demonstrate an interoperable, standards-based, open ground station architecture for RQ\/MQ-4 (Global Hawk\/Triton), MQ-1 (Predator\/Gray Eagle), MQ-5 (Hunter), MQ-8 (Fire Scout), MQ-9 (Reaper), and future UAS.  The intent is to improve joint- and coalition-interoperability and to promote competition through the implementation of open standards and open architectures."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "UAS Common Ground Station Demonstration"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate an interoperable, standards-based, open ground station architecture for RQ\/MQ-4 (Global Hawk\/TRITON), MQ-1 (Predator\/Gray Eagle), MQ-5 (Hunter), MQ-8 (Fire Scout), MQ-9 (Reaper), and future UAS.  The intent is to improve joint- and coalition-interoperability and to promote competition through the implementation of open standards and open architectures."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.455"
                                            },
                                            "Text": {
                                                "val": "Released UAS Control Segment (UCS) V3.0 and v3.1, and completed development of the Open Business Model (OBM) which incorporates (tri-Service approved) common contracting language for UAS ground control stations. OSD completed development and deployment of the UCS Repository. The UCS Repository allows the rapid re-use of UAS \"apps\" across tri-Services. UCS was demonstrated in a live Army Bi-Directional Remote Video Terminal (BDRVT) Shadow Flight Test; this provided risk reduction and expedited Army BDRVT\/ One System Remote Video Terminal (OSRVT) program of record delivery. UCS was expanded\/adopted beyond UAS into the maritime domain."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.060"
                                            },
                                            "Text": {
                                                "val": "Release UCS V3.2 and v3.3, integrate Army\/Navy flight safety critical and information assurance requirements; complete alignment with the Joint Common Unmanned System Architecture (JCUA), Universal Systems Interoperability Profile (USIP), and Future Airborne Capability Environment (FACE) standard; and demonstrate UCS in hardware-in-the-loop Unmanned Maritime System (UMS) maritime simulations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.898"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.898"
                                            },
                                            "Text": {
                                                "val": "Release UCS V3.4 and v3.5 and demonstrate UCS in a live UMS maritime operational test."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "n\/a"
                        },
                        "PerformanceMetrics": {
                            "val": "n\/a"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P443"
                    },
                    "ProjectTitle": {
                        "val": "Unmanned Systems Road Maps"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.288"
                        },
                        "PriorYear": {
                            "val": "0.431"
                        },
                        "CurrentYear": {
                            "val": "0.500"
                        },
                        "BudgetYearOne": {
                            "val": "0.204"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.204"
                        },
                        "BudgetYearTwo": {
                            "val": "0.220"
                        },
                        "BudgetYearThree": {
                            "val": "0.229"
                        },
                        "BudgetYearFour": {
                            "val": "0.240"
                        },
                        "BudgetYearFive": {
                            "val": "0.257"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This effort supports the Department's Unmanned Systems Roadmap and updates.  The Unmanned Systems Roadmap provides a DoD vision for the continuing development, fielding and employment of unmanned systems technologies.  This roadmap defines a common vision, establishes the current state of unmanned systems in today’s force, and outlines a strategy for the common challenges that must be addressed to achieve the shared vision."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Unmanned Systems Roadmap"
                                    },
                                    "Description": {
                                        "val": "Develops and updates the Department's Unmanned Systems Roadmap."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.431"
                                            },
                                            "Text": {
                                                "val": "Updated the Department's Unmanned Systems Roadmap and performed related studies supporting the Department's vision for unmanned systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Update the Department's Unmanned Systems Roadmap and perform related studies supporting the Department's vision for unmanned systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.204"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.204"
                                            },
                                            "Text": {
                                                "val": "Update the Department's Unmanned Systems Roadmap and perform related studies supporting the Department's vision for unmanned systems."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Provide up-to-date Unmanned Systems Roadmap providing a DoD vision for the continuing development, fielding and employment of unmanned systems technologies."
                        }
                    }
                }
            ]
        }
    }
}