{
    "id": "b0515ce7c29f99d6719110fb0e5dc42835c5277e",
    "meta": {
        "filename": "dod-2015_RDTE_2015_NAVY_BA1_3_RDTE_JustificationBook_Navy_PB_2015.zzz_unzipped_RDTE_JustificationBook_Navy_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0601152N"
        },
        "ProgramElementTitle": {
            "val": "In-House Lab Independent Res"
        },
        "R1LineNumber": {
            "val": "2"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Basic Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "16.561"
            },
            "CurrentYear": {
                "val": "18.230"
            },
            "BudgetYearOne": {
                "val": "18.734"
            },
            "BudgetYearOneBase": {
                "val": "18.734"
            },
            "BudgetYearTwo": {
                "val": "19.126"
            },
            "BudgetYearThree": {
                "val": "19.499"
            },
            "BudgetYearFour": {
                "val": "19.852"
            },
            "BudgetYearFive": {
                "val": "19.852"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) sustains U.S. Naval Science and Technology (S&T) superiority by providing new technological concepts for the maintenance of naval power and national security, and by helping to avoid scientific surprise while exploiting scientific breakthroughs and providing options for new Future Naval Capabilities (FNCs).  The Department of Navy (DON) component responds to S&T directions of the Naval S&T Strategic Plan for long term Navy and Marine Corps improvements and is in consonance with future warfighting concepts and doctrine developed at the Naval Warfare Development Command and the Marine Corps Combat Development Command.  It enables technologies that significantly improve the Joint Chiefs of Staff's Future Joint Warfighting Capabilities.  The In-house Laboratory Independent Research (ILIR) program also adds increased emphasis to the revitalization of the scientist and engineer workforce component at the Navy's Warfare Centers and Laboratories by attracting superior candidates and retaining our best members through the provision of exciting and meaningful work.\n\nThis PE addresses DON Basic Research, which includes scientific study and experimentation directed toward increasing knowledge and understanding in national-security related aspects of physical, engineering, environmental, and life sciences, and is the core of Discovery and Invention.  Basic research projects are developed, managed, and related to more advanced aspects of research in some hundred-plus technology and capability-related 'thrusts', which are consolidated in thirteen research focus areas: Power and Energy; Operational Environments; Maritime Domain Awareness; Asymmetric and Irregular Warfare; Information, Analysis and Communication; Power Projection; Assure Access and Hold at Risk; Distributed Operations; Naval Warfighter Performance and Protection; Survivability and Self-Defense; Platform Mobility; Fleet\/Force Sustainment; Affordability, Maintainability and Reliability.  \n\nThis portion of the DON Basic Research Program provides participating Naval Warfare Centers and Laboratories with funding for: basic research to support the execution of their assigned missions; developing and maintaining a cadre of active researchers who can distill and extend results from worldwide research and apply them to solve Naval problems; promoting hiring and development of new scientists; and encouragement of collaboration with universities, private industry, and other Navy and Department of Defense laboratories.  \n\nILIR efforts are selected by Naval Warfare Centers\/Lab Commanding Officers and Technical Directors near the start of each Fiscal Year through internal competition.  Efforts typically last three years, and are generally designed to assess the promise of new lines of research.  Successful efforts attract external, competitively awarded funding.  Because the Warfare Centers and Labs encompass the full range of naval technology interests, the scope of ILIR topics roughly parallels that of PE 0601153N, Defense Research Science.\n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "18.261"
                },
                "CurrentYear": {
                    "val": "18.230"
                },
                "BudgetYearOne": {
                    "val": "18.758"
                },
                "BudgetYearOneBase": {
                    "val": "18.758"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "16.561"
                },
                "CurrentYear": {
                    "val": "18.230"
                },
                "BudgetYearOne": {
                    "val": "18.734"
                },
                "BudgetYearOneBase": {
                    "val": "18.734"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.700"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.024"
                },
                "BudgetYearOneBase": {
                    "val": "-0.024"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.108"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.049"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.024"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.024"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-1.543"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Not applicable.\n\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0000"
                    },
                    "ProjectTitle": {
                        "val": "In-House Lab Independent Res"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "16.561"
                        },
                        "CurrentYear": {
                            "val": "18.230"
                        },
                        "BudgetYearOne": {
                            "val": "18.734"
                        },
                        "BudgetYearOneBase": {
                            "val": "18.734"
                        },
                        "BudgetYearTwo": {
                            "val": "19.126"
                        },
                        "BudgetYearThree": {
                            "val": "19.499"
                        },
                        "BudgetYearFour": {
                            "val": "19.852"
                        },
                        "BudgetYearFive": {
                            "val": "19.852"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project sustains U.S. Naval S&T superiority, provides new technological concepts for the maintenance of naval power and national security, and mitigates scientific surprises, while exploiting scientific breakthroughs and providing options for new Future Naval Capabilities (FNC's).  It responds to S&T directions of the Naval S&T Strategic Plan for long term Navy and Marine Corps improvements.  It is in consonance with future warfighting concepts and doctrine developed at the Naval Warfare Development Command (NWDC) and the Marine Corps Combat Development Command (MCCDC), and enables technologies that significantly improve the Joint Chiefs of Staff's Future Joint Warfighting Capabilities.  \n\nThis portion of the DON Basic Research Program provides participating Naval Warfare Centers and Laboratories with funding for basic research to support the execution of their assigned missions, for developing and maintaining a cadre of active research scientists who can distill and extend results from worldwide research and apply them to naval problems, to promote hiring and development of new scientists, and to encourage collaboration with universities, private industry, and other Navy and Department of Defense laboratories."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "ADVANCED MATERIALS"
                                    },
                                    "Description": {
                                        "val": "Efforts include: structural materials; functional materials; maintenance reduction, hydrodynamics; power generation; energy conservation and conversion."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.941"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued ILIR projects that are intended to be approximately three years in length. Based on historical trends, approximately 30% of ILIR projects will turn over each year.\n- Continued ILIR projects that are intended to be approximately three years in length. Projects selected for FY 2012 will focus on supporting Naval Materials by Design and Intelligent Naval Sensors, Innovative Naval Prototype initiatives in Electromagnetic Gun and Sea Basing, and National Naval Responsibility initiatives in Undersea Weaponry and Naval Engineering.\n- Completed FY 2011 initiated ILIR projects during FY 2013.\n- Completed research for Biaxial Fatigue in Corrosive Environment with the overall effort to: (1) characterize the biaxial fatigue behavior in a corrosive environment, comparing with that in air, (2) identify the basic mechanism of environment-assisted biaxial fatigue cracking, (3) expand the model for corrosion fatigue crack growth under biaxial loading, and (4) demonstrate and validate the model in the application to aircraft structure.\n- Completed research for Control and Dispersion of Electromagnetic Energy Using Metamaterials, where the dispersion and control of electromagnetic (EM) waves in the microwave (RF) region, using fabricated metamaterial structures, were demonstrated. Six metamaterial structures were modeled using in-house programs, DOD supercomputer resources, and High Frequency Structure Simulation (HFSS) software, and fabricated use photolithography, vapor deposition, and chemical and reactive ion etching. Scattering parameters (transmittance and reflectance), were acquired using a Network Analyzer coupled to a free space analysis setup.\n- Completed research for Polyurea Silicate Composites.  The objective of this research is to identify the structural transitions and interactions of the polyurea and nanoparticle that underlie the enhanced mechanical mechanisms for the protective response of polyurea nanocomposites. The approach is to use small angle and wide angle x-ray scattering (SAXS and WAXS) simultaneously with tensile and recovered impact tests to obtain a fundamental understanding of the polyurea nanoparticle effect at the molecular level. The strain rate material responses, both elastic and plastic, would be incorporated into a constitutive equation needed for modeling and for hydrocode simulations for further calculations of optimized geometries and layer thicknesses. \n- Initiated fundamental research on high strength nanostructures\/nanomaterials.\n- Initiated research for new concepts, configurations, and applications for metamaterials.\n- Initiated research for high temperature alloys for engine applications.\n- Initiated research for low-cost, high-strength material repair.\n- Initiated ILIR projects that are intended to be approximately three years in length. Projects selected for FY 2013 will focus on supporting Naval Materials by Design and Intelligent Naval Sensors, Innovative Naval Prototype initiatives in Electromagnetic Gun and Sea Basing, and National Naval Responsibility initiatives in Undersea Weaponry and Naval Engineering."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.918"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Efforts in this R2 project have been continued in FY 2014 in the new ILIR Program."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "ELECTRONICS SENSOR SCIENCES"
                                    },
                                    "Description": {
                                        "val": "Description: Efforts include: sensing, diagnostics, and detectors; navigation and timekeeping; nano electronics; real time targeting, Electro Optical\/InfraRed (EO\/IR) electronics; EO\/IR electronic warfare; and EO\/IR sensors for surface and subsurface surveillance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.190"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued ILIR projects that are intended to be approximately three years in length. Based on historical trends, approximately 30% of ILIR projects will turn over each year.\n- Continued research for computer vision techniques on optical and acoustic sensor data for underwater object detection and classification.\n- Continued research for wideband retro-reflective arrays.\n- Continued research on an application of Green's function technique to explore exotic and unexpected nano-phenomena in the electromagnetic scattering of finite-length nanowires. This effort has broad applicability to a variety of nano devices, such as: nano-antennas; nano-lasers; nanosensors; subwavelength photonic integration; and metamaterial designs.\n- Continued research for high finesse optical domain radio frequency (RF) filters.\n- Continued ILIR projects that are intended to be approximately three years in length. Projects selected for FY 2012 will focus on supporting Electric Power Sources and Multifunctional Electronics for Intelligent Naval Sensors, Innovative Naval Prototype initiatives in Electromagnetic Gun and Persistent Surveillance, and the National Naval Responsibility in Undersea Weaponry.\n- Completed FY 2011 initiated ILIR projects during FY 2013.\n- Completed research for High Finesse Optical Domain RF Filters, where the objective is to design and fabricate a chip scale integrated optical\nfilter architecture with periodic flat passbands of narrow bandwidth compatible with conventional digital signal processing (i.e. < 50MHz) and\na finesse of 100 or greater. This type of filter design is previously unexploited in the optical domain and will help enable real time spectrum analysis and channelization in the photonic domain across multi-GHz RF signals.\n- Completed research for Computer Vision Techniques on Optical and Acoustic Sensor Data for Underwater Object Detection and Classification. The goal of this research is to use advances in machine learning and computer vision to utilize optical and acoustic sensors in concert for object detection and classification in underwater applications. This technology can be used for object identification in a multitude\nof scenarios, as well as for visual surveillance of a harbor. Furthermore, advanced computer vision can be used for self localization of an underwater vehicle. A specific goal of the research will be object detection and classification of mines found on the sea floor.\n- Completed research for Wideband Retro-Reflective Arrays. Metamaterial transmission lines (MTMs) are proposed to be investigated for the design of a wideband, retroreflective Van-Atta array. The technical objectives of the project are to explore the basic science behind metamaterial transmission line technologies and their practical implementation. The goal is to achieve enhanced bandwidth and increased gain performance of a Van-Atta array that is compact in size for low-observable, retro-reflective applications.\n- Initiated research for Wireless Highly Reliable Networks.\n- Initiated research for the Optimization of Autonomous ASW Sensor Suites.\n- Initiated research for Nano-sensor Technology.\n- Initiated research for Nano-circuit Devices.\n- Initiated research on Advanced Chem-Bio Sensor and Detection.\n- Initiated ILIR projects that are intended to be approximately three years in length. Projects selected for FY 2013 will focus on supporting Naval Materials by Design and Intelligent Naval Sensors, Innovative Naval Prototype initiatives in Electromagnetic Gun and Sea Basing, and National Naval Responsibility initiatives in Undersea Weaponry and Naval Engineering."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.178"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Efforts in this R2 project have been continued in FY 2014 in the new ILIR Program."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "ENERGY SCIENCES"
                                    },
                                    "Description": {
                                        "val": "Description: Efforts include: undersea weaponry; energetic materials and propulsion; directed energy; and TeraHertz Time-Domain Spectroscopy (THz-TDS) technology that addresses overseas contingency operations and Counter Improvised Explosive Device (C-IED) detection by detecting and spectroscopically identifying military and home-made explosives and formulations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.149"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued ILIR projects that are intended to be approximately three years in length. Based on historical trends, approximately 30% of ILIR projects will turn over each year.\n- Continued research on the microbial biosynthesis of critical energetic ingredients.\n- Continued research for accelerated quantum chemistry simulations of energetics using a novel metadynamics approach.\n- Continued research for convergent synthesis of high performance heterocycles via late amination.\n- Continued research to investigate the dispersion and control of electromagnetic (EM) waves in the microwave (RF) region using fabricated metamaterial structures.\n- Continued ILIR projects that are intended to be approximately three years in length. Projects selected for FY 2012 will focus on supporting Naval Battlespace Awareness and Intelligent Naval Sensors, Innovative Naval Prototype initiatives in Persistent Surveillance and Sea Basing, and the National Naval Responsibility in Undersea Weaponry.\n- Completed FY 2011 initiated ILIR projects during FY 2013.\n- Completed the research on the Microbial Biosynthesis of Critical Energetic Ingredients which investigated new methods of microbial synthesis in the production of feedstocks for energetics. Microbial synthesis is the controlled harvesting of organic molecules from biological factories such as E. coli. It is hypothesized that large scale control and manipulation of these efficient microbial factories could lead to increased availability of traditionally rare feedstocks, enhanced sustainability due to the reduced need for organics from non-petroleum-derived feedstocks, and the significant reduction of hazardous waste.\n- Completed the research for Accelerated Quantum Chemistry Simulations of Energetics using a Novel Metadynamics Approach, the goal of which is to develop methods based on a metadynamics approach that can predict important chemical properties of energetic materials and additives that are normally inaccessible to first-principles simulation. The main properties used to evaluate the method are uni- and bimolecular decomposition barriers, oxidation reactions, accelerated aging studies, and crystalline density predictions. The focus will be on complex or\nnovel systems that have previously been difficult to simulate, such as polymer chains, novel high-nitrogen explosives, and organometallic compounds.\n- Completed the research for Convergent Synthesis of High Performance Heterocycles via Late Amination, which focuses on convergent synthesis of energetic, high nitrogen CHNO heterocycles using novel energetic synthons to provide increased performance to Navy ordnance.\nDesigning higher heats of formation and higher densities into novel energetic CHNO compounds, while retaining good kinetic stability and safety properties, requires new structural motifs. The 1,2,3,4-tetrazine 1,3-dioxide structural motif, first described by Tartakovsky et al. in the\n1991 synthesis of benzo tetrazine dioxide, remains an undeveloped energetic synthon. Although furazano tetrazine dioxide has been known for the last decade, its energetic properties are still unknown. The synthetic routes chosen are expected to permit ready transition to the pilot level and offer reasonably priced materials.\n- Initiated research for High-Output, Low-Cost Energetic Materials\n- Initiated research for High-Speed Energetic Weapons.\n- Initiated research on Fundamental Development of Polymer Materials with Tunable Energy Levels.\n- Initiated Research for High-Density, High-Output Batteries.\n- Initiated ILIR projects that are intended to be approximately three years in length. Projects selected for FY 2013 will focus on supporting Naval Battlespace Awareness and Intelligent Naval Sensors, Innovative Naval Prototype initiatives in Persistent Surveillance and Sea Basing, and the National Naval Responsibility in Undersea Weaponry."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.144"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Efforts in this R2 project have been continued in FY 2014 in the new ILIR Program."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HUMAN PERFORMANCE SCIENCES"
                                    },
                                    "Description": {
                                        "val": "Description: Efforts include: biosensors, biomaterial, bioprocesses; marine mammals; casualty care management, undersea medicine; human factors and organizational design; manpower, personnel and advanced cockpit; and operational training and education. These efforts are coordinated with the Navy Medical Research Center (NMRC)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.833"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued ILIR projects that are intended to be approximately three years in length. Based on historical trends, approximately 30% of ILIR projects will turn over each year.\n- Continued research for characterization of decision making behaviors associated with Human Systems Integration (HSI) design tradeoffs.\n- Continued research for Localization of human spatial processing using dense-array Electroencephalography.\n- Continued Integration of an implantable potentiostat for continuous monitoring of Nitric Oxide (NO) into a rat model of Hyperbaric Oxygen (HBO) toxicity.\n- Continued research to characterize the naturalistic decision making processes used in Naval Aviation acquisition programs to assess cost, schedule and performance tradeoffs within and between Human Systems Integration (HSI) domains. Content analysis will be performed to identify knowledge, skills, abilities, heuristics, and biases associated with HSI decision making.\n- Continued ILIR projects that are intended to be approximately three years in length. Projects selected for FY 2012 will focus on supporting Naval Battlespace Awareness and Intelligent Naval Sensors, Innovative Naval Prototype initiatives in Persistent Surveillance and Sea Basing, and the National Naval Responsibility in Undersea Weaponry.\n- Completed FY 2011 initiated ILIR projects during FY 2013.\n- Completed research for Characterization of Decision Making Behaviors Associated with Human Systems Integration (HSI) Design Tradeoffs,\nwhere analysis is performed to identify knowledge, skills, abilities, heuristics, and biases associated with HSI decision making. This incorporates a coding study to gauge inter-rater reliability as part of the content analysis. The results will be used to (a) generate assessment test materials for a follow-on decision making experiment, and (b) create a summary of the recorded HSI tradeoff case studies, including key learnings and a description of tradeoff decision requirements.\n- Completed research for Localization of Human Spatial Processing using Dense-array Electroencephalography. Aviation mishap statistics\nconfirm that in-flight spatial disorientation (SD) poses one of the greatest human factor problems for military aviators. The impact of this cognitive threat costs the DoD an average of 20 aircraft and 25 flight personnel annually. Recent animal research has identified specialized neural structures involved in spatial orientation. The objective of this research is to determine if spatial neural mechanisms found in animal\nstudies and in human functional magnetic resonance imaging tests can be further localized and defined by introducing limited ranges of normal\nhuman motion.\n- Completed Integration of an Implantable Potentiostat for Continuous Monitoring of Nitric Oxide (NO) into a Rat Model of Hyperbaric Oxygen (HBO) Toxicity. The U.S. Navy has long used oxygen breathing for covert underwater operations. The major limitation to HBO is the risk of HBO-induced pulmonary and central nervous system toxicity. NO is a critical second messenger involved in the pathophysiology of HBO-induced toxicity. The study examines an implantable NO sensor in conjunction with both traditional and experimental implantable potentiostats. This work will lead to the development of new research capabilities to measure NO production in vivo.\n- Initiated research for Brain and Spinal (and other) Injury Due to Shock Blast.\n- Initiated research for Adaptive Learning Tools Based on Individual Awareness.\n- Initiated research for Warfighter Impact Due to Operational Noise on Navy Ships.\n- Initiated ILIR projects that are intended to be approximately three years in length. Projects selected for FY 2013 will focus on supporting Naval Battlespace Awareness and Intelligent Naval Sensors, Innovative Naval Prototype initiatives in Persistent Surveillance and Sea Basing, and the National Naval Responsibility in Undersea Weaponry."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.821"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Efforts in this R2 project have been continued in FY 2014 in the new ILIR Program."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "INFORMATION SCIENCES"
                                    },
                                    "Description": {
                                        "val": "Description: Efforts include: mathematical foundation and computational theory and tools for design communications; decision support theory;algorithm and tools, information assurance, secure and reliable infrastructure for command and control; mathematical optimization for optimalresource allocation and usage; modeling and computational propagation; seamless, robust connectivity and networking and cyber warfare."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.853"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued ILIR projects that are intended to be approximately three years in length. Based on historical trends approximately 30% of ILIR projects will turn over each year.\n- Continued research for the numerical analysis and design of methods for Partial Differential Equations (PDE) constrained optimization.\n- Continued research for framework for collaborative robotic asset management.\n- Continued research to develop a theory of Systems-of-Systems (SoS) network engineering and analysis based on the theory of time series of attributed graphs to understand how such systems can be mathematically formulated, simulated, analyzed, and tested.\n- Continued ILIR projects that are intended to be approximately three years in length. Projects selected for FY 2011 will focus on supporting Naval Battlespace Awareness and Intelligent Naval Sensors, Innovative Naval Prototype initiatives in Persistent Surveillance and Sea Basing, and the National Naval Responsibility in Undersea Weaponry.\n- Completed FY 2011 initiated ILIR projects during FY 2013.\n- Completed research for the Numerical Analysis and Design of Methods for Partial Differential Equations (PDE) Constrained Optimization.PDE Constrained Optimization problems arise in many areas of science and engineering, and include problems such as optimal shape design and parameter estimation. While advanced methods for general, non-linear optimization have existed for over a half century, the existence of PDE constraints in optimization problems make the existing optimization methods at best inefficient, and often times infeasible. The goal is to design and analyze new methods which build on previous efforts developed over the last decade, and enable these new methods to be used on\nproblems currently seen in the analysis of naval systems.\n- Completed research for Systems-of-Systems (SoS) Network Analysis where the design of Systems-of-Systems (SoS) requires careful analysis of not only the subsystems, but also the interconnections between the subsystems. These interconnections could possibly correspond to dependencies, communications, shared information, joint operation, or other relationships. This research seeks to develop a theory of SoS engineering and analysis based on graph theory, in particular the theory of time series of attributed graphs, in which the vertices and edges may have attributes (such as readiness levels or communication throughput). This theory will involve both a mathematical formulation of the SoS\nproblem, but also a consideration of how such systems can be simulated, analyzed, and tested.\n- Completed research for Framework for Collaborative Robotic Asset Management where a formalized and extensible approach for discovering,modeling, monitoring, and managing a distributed collection of disparate unmanned systems is defined. This framework will support near real-time system modeling, resource appraisal, and brokering functionalities while using scalable, abstract representations of mission, job,and resource capabilities to provide new levels of intelligent resource utilization to the Navy. The proposed work directly supports research initiatives in the areas of underwater communication networks, minimal operator intervention, intelligent decision-making, and promotes\nincreased situational awareness. This project will present the design of a hierarchical architecture of software components and definition of the elements that comprise the framework Knowledge Representation Scheme in order to provide deliberative management capabilities for a system of collaborating robotic assets.\n- Initiated research on Weak Signature Identification.\n- Initiated research on Advanced Target Classification.\n- Initiated research on Collaborative Unmanned Systems Communication and Asset Management\n- Initiated ILIR projects that are intended to be approximately three years in length. Projects selected for FY 2013 will focus on supporting Naval Battlespace Awareness and Intelligent Naval Sensors, Innovative Naval Prototype initiatives in Persistent Surveillance and Sea Basing,and the National Naval Responsibility in Undersea Weaponry."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.846"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Efforts in this R2 project have been continued in FY 2014 in the new ILIR Program."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "NAVAL PLATFORM DESIGN SCIENCES"
                                    },
                                    "Description": {
                                        "val": "Description: Efforts include: novel hull forms, materials, structures and signatures; and virtual shaping concepts for structures and platforms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.266"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued ILIR projects that are intended to be approximately three years in length. Based on historical trends, approximately 30% of ILIR projects will turn over each year.\n- Continued research for high fidelity, Reynolds-averaged Navier-Stokes (RANS) cavitation simulation.\n- Continued research for development of a new vehicle dynamics-based motion planning and control algorithm into the motion planning process.\n- Continued research for wall pressure fluctuation measurements in high Reynolds number turbulent pipe flow.\n- Continued research to characterize the biaxial fatigue behavior of carrier-based aircraft in a corrosive environment, identify the\nbasic mechanism of environment assisted biaxial fatigue cracking, develop an accurate model for corrosion fatigue crack growth under biaxial loading, and demonstrate and validate the model in the application to aircraft structure.\n- Continued ILIR projects that are intended to be approximately three years in length. Projects selected for FY 2012 will focus on supporting Naval Battlespace Awareness and Intelligent Naval Sensors, Innovative Naval Prototype initiatives in Persistent Surveillance and Sea Basing, and the National Naval Responsibility in Undersea Weaponry.\n- Completed FY 2011 initiated ILIR projects during FY 2013.\n- Completed Optical Propagation Studies for Non-Line-of-Sight (NLOS) Underwater Laser Communications. This project's objective investigated the fundamental propagation characteristics of \"broad beam\", or diffused, light sources for N-LOS optical links. N-LOS links provide the benefits of decreased pointing-and-tracking complexity, increased time for link closure, and decreased sensitivity to obstructions.\nThis project studied how the spatial distribution of light caused by scattering, or shaping of the initial source beam distribution, affects the\npropagation of modulated light in water and optimal source distributions matched to particular undersea environments.\n- Completed research for Turbulent Wake Characterization, where understanding the details of complex turbulent flows around a submerged body is critical for analysis of a propulsor operating in its wake. The inflow characteristics to the propulsor have a significant impact on its performance. This project focuses on predicting the turbulent wake characteristics of a submerged, appended, model-scale body using Large\nEddy Simulation (LES) techniques. Because the propulsor impacts the pressure field, it has an effect on its own inflow; therefore, the ultimate goal of this project will be to model a propulsor and an appended body in the same domain using LES.\n- Completed research for Surface Piercing Strut Wake Signature Reduction. Surface piercing struts in motion relative to water generate a fairly complex wave, producing a rising bow wave in the front of the strut, a cavity on the sides and a wake behind. The size of this white water wake is a function of the strut shape, Reynolds number (Re), Froude number (Fr), water salinity, surfactants, etc. The objective of this effort is to understand the bubble generation and transport phenomena, ideally minimizing the bubble entrainment visual detection to a level comparable to the strut itself. Two approaches are investigated: 1) an experimental method that provides insight into the physics of the flow field; and 2) a computational method that validates the existing results and tests new concepts.\n- Initiated research for Littoral Mine Detection and Avoidance.\n- Initiated research for Compact Broad Band Low Frequency Sonar.\n- Initiated research for Advanced Obstacle Avoidance for Unmanned Systems.\n- Initiated ILIR projects that are intended to be approximately three years in length. Projects selected for FY 2013 will focus on supporting Naval Battlespace Awareness and Intelligent Naval Sensors, Innovative Naval Prototype initiatives in Persistent Surveillance and Sea Basing, and the National Naval Responsibility in Undersea Weaponry"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.257"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Efforts in this R2 project have been continued in FY 2014 in the new ILIR Program."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "OCEAN  SPACE SCIENCES"
                                    },
                                    "Description": {
                                        "val": "Efforts include: Littoral Geosciences, Optics, and biology; Marine Mammals; Ocean Acoustics; and autonomous systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.256"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued ILIR projects that are intended to be approximately three years in length. Based on historical trends, approximately 30% of ILIR projects will turn over each year.\n- Continued optical propagation studies for Non-Line-of-Sight (NLOS) underwater laser communications.\n- Continued research for turbulent wake characterization\n- Continued research for surface piercing strut wake signature reduction.\n- Continued research to assess the effects of Mid-Frequency Active (MFA) sonar on the movement of fish species in a natural environment, to compare the behavior and movement of fish prior to exposure to sonar, during exposure, and for a significant amount of time post-exposure to provide valuable data on fish behavior, movement, and survival following exposure to highintensity,tactical MFA sonar.\n- Continued ILIR projects that are intended to be approximately three years in length. Projects selected for FY 2012 will focus on supporting Naval Battlespace Awareness, Innovative Naval Prototype initiatives in Persistent Surveillance and Sea Basing, and National Naval Responsibility initiatives in Ocean Acoustics and Undersea Weaponry.\n- Completed FY 2011 initiated ILIR projects during FY 2013.\n- Completed Optical Propagation Studies for Non-Line-of-Sight (NLOS) Underwater Laser Communications. This project's objective investigated the fundamental propagation characteristics of \"broad beam\", or diffused, light sources for N-LOS optical links. N-LOS links provide the benefits of decreased pointing-and-tracking complexity, increased time for link closure, and decreased sensitivity to obstructions.\nThis project studied how the spatial distribution of light caused by scattering, or shaping of the initial source beam distribution, affects the propagation of modulated light in water and optimal source distributions matched to particular undersea environments.\n- Completed research for Turbulent Wake Characterization, where understanding the details of complex turbulent flows around a submerged body is critical for analysis of a propulsor operating in its wake. The inflow characteristics to the propulsor have a significant impact on its performance. This project focuses on predicting the turbulent wake characteristics of a submerged, appended, model-scale body using Large Eddy Simulation (LES) techniques. Because the propulsor impacts the pressure field, it has an effect on its own inflow; therefore, the ultimate goal of this project will be to model a propulsor and an appended body in the same domain using LES.\n- Completed research for Surface Piercing Strut Wake Signature Reduction. Surface piercing struts in motion relative to water generate a fairly complex wave, producing a rising bow wave in the front of the strut, a cavity on the sides and a wake behind. The size of this white water wake is a function of the strut shape, Reynolds number (Re), Froude number (Fr), water salinity, surfactants, etc. The objective of this effort is to understand the bubble generation and transport phenomena, ideally minimizing the bubble entrainment visual detection to a level comparable to the strut itself. Two approaches are investigated: 1) an experimental method that provides insight into the physics of the flow field; and 2) a computational method that validates the existing results and tests new concepts.\n- Initiated research for Littoral Mine Detection and Avoidance.\n- Initiated research for Compact Broad Band Low Frequency Sonar.\n- Initiated research for Advanced Obstacle Avoidance for Unmanned Systems.\n- Initiated ILIR projects that are intended to be approximately three years in length. Projects selected for FY 2013 will focus on supporting Naval Battlespace Awareness and Intelligent Naval Sensors, Innovative Naval Prototype initiatives in Persistent Surveillance and Sea Basing, and the National Naval Responsibility in Undersea Weaponry."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.236"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Efforts in this R2 project have been continued in FY 2014 in the new ILIR Program."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "IN-HOUSE LABORATORY INDEPENDENT RESEARCH (ILIR)"
                                    },
                                    "Description": {
                                        "val": "Starting in FY 2015, these requirements have been consolidated into a separate R-2 project to provide greater visibility of the program by providing an easily navigable overview of all In-House Laboratory Independent Research (ILIR) Programs in a single location."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Completed research on how stresses and environment affect Aeta-phase precipitation in Al-Mg Alloys.\n- Completed the development of algorithms and simulation environment which addressed key issues in order to find approximate solutions to the coverage problem for static (wireless sensor networks) WSNs and dynamic WSNs (or UxVs). \n- Completed dynamic hybrid routing algorithm for Under Sea Sensors with integrated localization and tracking that may be implemented in a distributed manner, such that each node of such a network can intelligently and autonomously determine a wise routing strategy. \n- Completed research on increased weapon lethality focused on the design and synthesis of aluminum based cluster compounds so as to increase their reaction rates to the order of common CHNO High Explosives (HE). \n- Completed the development and investigation of new magnetoelastic\/piezoelectric composite materials and technology that combine extraordinary magnetoelectric (ME) coupling of composites with broadband tunability needed for applications such as sensitive magnetic sensors, transducers for sonar and energy harvesting.\n- Completed Principal Dynamic Mode (PDM) analysis to test the feasibility of detecting a mild emotional stressor and comparison of its performance against the standard power spectral density approach. \n- Completed effects of CO2 tolerance training on the incidence of high altitude pulmonary edema in rodents. \n- Completed investigation of the neural correlates of posttraumatic stress disorder (PTSD), both before and after clinical therapy, to discover the neural circuits most affected by the disorder and to use this information to optimize treatment strategies\n- Completed development of quantum codes and methods of construction, and verify their theoretical performance through various types of noise. Of particular interest are constructions that perform optimally through the Amplitude Damping channel. \n- Completed efforts to generate sharp and accurate images from synthetic aperture sonar (SAS) by utilizing Adjoint Control Filters for Nonlinear Partial Differential Equations.\n- Completed Automatic Code Parallelization utilizing Genetic Programming, where the computer code takes full advantage of the available parallel computers.\n- Completed effort addressing the problem of flow noise and flow induced vibration experienced by hull mounted and towed SONAR arrays.\n- Completed Sampling-Based Model Predictive Optimization With Application to Robot Kinodynamic Motion Planning for naval vehicles. \n- Completed parametric study of the effects displacement and step location have on the performance of a stepped planing hull for high speed naval craft.\n- Completed fundamental performance limitations imposed by acoustic interference on active sonar systems, concentrating on undersea networks in acoustically congested environments.\n- Completed embedded graph systems for robust, coordinated control of heterogeneous unmanned system networks. \n- Completed research for the Improved Understanding of Complex Flow Distribution over Towed Arrays.\n- Initiated ILIR projects that were intended to be approximately three years in length including:\n- Initiated research for polymer materials to understand improved helmet blast protection.\n- Initiated fundamental research for composite materials for reduced signature for undersea vehicles.\n- Initiated research for the fundamental understanding of graphene type Radio Frequency (RF) Antennas.\n- Initiated research for complex unmanned sensor networks."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.908"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.908"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue all efforts of FY 2014, less those noted as completed.\n-Continue research for polymer materials to understand improved helmet blast protection.\n-Continue fundamental research for composite materials for reduced signature for undersea vehicles.\n-Continue research for the fundamental understanding of graphene type Radio Frequency (RF) Antennas.\n-Continue fundamental research for the understanding of optimization of undersea sensor distribution in littoral environments. \n-Continue research for understanding effects of energetic materials under high pressure environment.\n-Continue research on Operational Fatigue of Warfighters due to Stress Environments.\n-Continue research on Human Gesture and Computer Interface and Functionality.\n-Continue research framework for Efficient Quantum Computing.\n-Continue research for Autonomous Routing of Unmanned Vehicles.\n-Continue fundamental research for undersea imaging and analysis.\n-Continue research framework for Efficient Quantum Computing.\n-Continue research for Autonomous Routing of Unmanned Vehicles.\n-Continue fundamental research for undersea imaging and analysis.\n-Continue research for modeling super-cavitation of Advanced Propulsor Designs.\n-Continue research for Predictive Performance Modeling of Advanced Naval Hull Designs.\n-Continue research for Design and Performance of High Speed Naval Vessels.\n-Continue research for Advanced Smart Wireless Cooperative Vehicular Network.\n-Continue research for Undersea Laser Communication and Identification in Littoral Environments.\n-Continue ILIR projects that are intended to be approximately three years in length researching littoral geosciences, optics, and biology; marine mammals; ocean acoustics; and autonomous systems.\nComplete FY 2013 initiated ILIR projects in many disciplines including:\n-A New Method to Generate Self-Adaptive Grid Point.\n-Energy Harvesting for Future Embedded Diagnostics Capability.\n-Sensorless Failover Design in High Criticality\/High Performance Applications.\n-Advanced Coding for Communication Links and Active Sensors The Role of Electrical Anomalies in Energetic Materials.\n-Direct Identification of Malaria Liver Stage vaccine Targets.\n-Reproductive Toxicity of Jet Propellant -5 (JP-5) and Alternative Jet Fuel Mixtures.\n-Diagnostics Capability Magnetostrictive Characterization and Modeling of HY100.\n-Directional Spreading of wind Waves.\n-Supercavitation - Impulsively Translated Projectiles.\n-Assessing the Effect of Biological Agent Ingestion.\n-Synthesis of Novel High Nitrogen Energetic Compounds by Simultaneous Shear and Pressure Loading.\n-Synthesis of Novel Tetraazapentalenes as HighPerformance, Insensitive Energetic Materials.\n-Affine-Invariant, Elastic Shape Analysis of Planar.\n-Highly Squinted Monopulse Synthetic Aperture Radar.\n-Estimation of Applied Forces Acting on a Ribbed Plate.\n-Plate Effect of Polyurea on the Shock Response of Composite Materials.\n-High Data Rate Undersea Laser Communication.\n-Machine Learning for Multi-Modal Data Analysis.\n-Sensorless Failover Design in High Criticality\/High Performance Applications\n-Energy Harvesting for Future Embedded Diagnostics Capability\n-Initiate FY 2015 ILIR projects that are intended to be approximately three years in length to research topics including :Structural materials, functional materials, maintenance reduction, hydrodynamics, power generation, energy conservation and conversion.  \n-Complete research to develop broadband dynamically controllable artificial dialetrics.\n-Sensing, diagnostics, and detectors; navigation and timekeeping; nano electronics; real time targeting, Electro- Optical\/InfraRed (EO\/IR) electronics; EO\/IR electronic warfare; and EO\/IR sensors for surface and subsurface surveillance. \n-Undersea weaponry, energetic materials and propulsion, directed energy, and TeraHertz Time-Domain Spectroscopy (THz-TDS) technology that addresses overseas contingency operations and Counter Improvised Explosive Device (C-IED) detection by detecting and spectroscopically identifying military and home-made explosives and formulations.  \n-Biosensors, biomaterial, bioprocesses; marine mammals; casualty care management, undersea medicine; human factors and organizational design; manpower, personnel and advanced cockpit; and operational training and education.  These efforts are coordinated with the Navy Medical Research Center (NMRC).\n-Mathematical foundation and computational theory and tools for design communications, decision support theory, algorithm and tools, information assurance, secure and reliable infrastructure for command and control, mathematical optimization for optimal resource allocation and usage, modeling and computational propagation, seamless, robust connectivity and networking and cyber warfare.\n-Novel hull forms, materials, structures and signatures; and virtual shaping concepts for structures and platforms.\n-Littoral geosciences, optics, and biology; marine mammals; ocean acoustics; and autonomous systems.\n-Naval Materials by Design and Intelligent Naval Sensors, Innovative Naval Prototype initiatives in Electromagnetic Gun and Sea Basing, and National Naval Responsibility initiatives in Undersea Weaponry and Naval Engineering.\n-Battlespace Awareness and Intelligent Naval Sensors, Innovative Naval Prototype initiatives in Persistent Surveillance and Sea Basing, and the National Naval Responsibility in Undersea Weaponry.\n-Command and Control and connectivity research."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SCIENCE TECHNOLOGY ENGINEERING AND MATH (STEM) EFFORTS AT NAVY LABS"
                                    },
                                    "Description": {
                                        "val": "Description: This effort will support both the Science and Engineering Apprenticeship Program (SEAP) and the Naval Research Enterprise Intern Program (NREIP) summer programs to encourage participating students to pursue science and engineering careers, to further their education via mentoring by laboratory personnel and their participation in research, and to make them aware of DoN research and technology efforts, which can lead to employment within the DoN. Participating students will spend eight to ten weeks during the summer doing research at approximately 19 to 20 DoN laboratories. Participants will receive a stipend distributed by the Contractor. The stipend is a monthly allowance paid to interns for their participation in the research efforts.\n\nThis activity is created starting in FY 2013 to highlight Science Technology Engineering and Math (STEM) efforts at Navy labs that were previously funded within the Ocean\/Space Sciences activity in this PE.\nThe increase in the STEM Efforts is in response to the Secretary of the Navy's commitment to doubling the Navy's investment and establishing a strong naval STEM program over the next five years."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.073"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued Naval Research Enterprise Intern Program (NREIP) to support undergraduate and graduate students performing Navy-related research at Naval Warfare Centers under the supervision and mentorship of DON Scientists, thus exposing them to interesting and challenging work done at the centers. NREIP is a continuing Navy education program.\n- Initiate Science, Technology, Engineering and Mathematics (STEM) projects that are intended to be approximately three years in length. Projects selected for STEM funding will focus on engaging and educating future Naval scientists and engineers and incorporating naval relevance, diversity, and STEM best practices. These efforts will complement and support the ongoing independent research, education and outreach efforts taking place at the Naval laboratories."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.830"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2013."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.826"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.826"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2013"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "The ILIR initiative seeks to improve the quality of defense research conducted predominantly through the Naval Warfare Centers\/Laboratories.  It also supports the development of technical intellect and education of engineers and scientists in disciplines critical to national defense needs through the development of new knowledge in a military laboratory environment.  Initial research focus is often conducted in an unfettered environment since it is basic research, but many projects focus on applying recently developed theoretical knowledge to real world military problems with the intention of developing new capabilities and improving the performance of existing systems.  Individual project metrics then become more tailored to the needs of specific applied research and advanced development programs.  The National Research Council of the National Academies of Science and Engineering's Congressionally directed \"Assessment of Department of Defense Basic Research\" concluded that the DoD is managing its basic research program effectively."
                        }
                    }
                }
            ]
        }
    }
}