{
    "id": "b1615be27f6b201271eccbef69ac1b264d5ebb76",
    "meta": {
        "filename": "dod-2015_RDTE_2015_AIRFORCE_V1_RDTE_JustificationBook_Air_Force_PB_2015.zzz_unzipped_RDTE_JustificationBook_Air_Force_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602602F"
        },
        "ProgramElementTitle": {
            "val": "Conventional Munitions"
        },
        "R1LineNumber": {
            "val": "10"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "70.039"
            },
            "CurrentYear": {
                "val": "81.521"
            },
            "BudgetYearOne": {
                "val": "87.387"
            },
            "BudgetYearOneBase": {
                "val": "87.387"
            },
            "BudgetYearTwo": {
                "val": "97.399"
            },
            "BudgetYearThree": {
                "val": "105.100"
            },
            "BudgetYearFour": {
                "val": "105.023"
            },
            "BudgetYearFive": {
                "val": "105.419"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program investigates, develops, and establishes the technical feasibility and military utility of guidance and ordnance technologies for conventional air-launched munitions.  Program supports core technical competencies of fuze technology; energetic materials; damage mechanisms; munitions aerodynamics, guidance, navigation, and control; terminal seeker sciences; and munition systems effects.  Technologies to be developed include blast, fragmentation, penetrating and low-collateral damage warheads, hard target fuzing, precise terminal guidance, and high performance and insensitive explosives.  Efforts in this program have been coordinated through the Department of Defense (DoD) Science and Technology (S&T) Executive Committee process to harmonize efforts and eliminate duplication.  This program is in Budget Activity 2, Applied Research, since it develops and determines the technical feasibility and military utility of evolutionary and revolutionary technologies."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "77.175"
                },
                "CurrentYear": {
                    "val": "81.521"
                },
                "BudgetYearOne": {
                    "val": "84.722"
                },
                "BudgetYearOneBase": {
                    "val": "84.722"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "70.039"
                },
                "CurrentYear": {
                    "val": "81.521"
                },
                "BudgetYearOne": {
                    "val": "87.387"
                },
                "BudgetYearOneBase": {
                    "val": "87.387"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-7.136"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "2.665"
                },
                "BudgetYearOneBase": {
                    "val": "2.665"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.150"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.513"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-6.473"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "2.665"
                                },
                                "BudgetYearOneBase": {
                                    "val": "2.665"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Decrease in FY13 Other Adjustments was due to Sequestration.\n\nIncrease in FY15 due to increased emphasis on advanced positioning, navigation and timing technologies."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "622068"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Guidance Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "29.914"
                        },
                        "CurrentYear": {
                            "val": "32.801"
                        },
                        "BudgetYearOne": {
                            "val": "40.757"
                        },
                        "BudgetYearOneBase": {
                            "val": "40.757"
                        },
                        "BudgetYearTwo": {
                            "val": "46.084"
                        },
                        "BudgetYearThree": {
                            "val": "49.015"
                        },
                        "BudgetYearFour": {
                            "val": "48.188"
                        },
                        "BudgetYearFive": {
                            "val": "47.544"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project investigates, develops, and evaluates conventional munitions guidance technologies to establish technical feasibility and military utility of innovative munition seekers, weapon aerodynamics, navigation and control, and guidance subsystem integration\/simulation.  Project payoffs include adverse-weather, GPS-degraded and GPS-denied, networked, and autonomous precision munition guidance capability; increased number of kills per sortie; increased aerospace vehicle survivability; improved weapon reliability and affordability; and improved weapon survivability and effectiveness."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Seeker Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop seeker technologies for air-delivered munitions to provide high confidence target discrimination and classification, precise target location, and robust terminal tracking."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.200"
                                            },
                                            "Text": {
                                                "val": "Developed technologies to simplify, increase the flexibility, and reduce the cost of passive and active electro-optical, infrared, and radar munition seekers, with focus on combat operations in adverse weather and in high-speed engagements.  Increased emphasis on developing seeker technologies that provide enhanced mission capability for fifth-generation aircraft, specifically as it applies to success in denied or anti-access environments.  Continued developing algorithms and processing technologies to acquire and track targets with and without an operator-in-the-loop.  Developed  bio-inspired seeker technologies to increase immunity to countermeasures, exploit multi-discriminant signatures, and reduce the size and cost of detectors"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.800"
                                            },
                                            "Text": {
                                                "val": "Increase emphasis in developing technologies that simplify, increase the flexibility, and reduce the cost of passive and active electro-optical, infrared, and radar munition seekers, with focus on combat operations in adverse weather and in high-speed engagements.  Continue to emphasize development of seeker technologies that provide enhanced mission capability for fifth-generation aircraft, specifically as it applies to success in denied or anti-access environments.  Develop algorithms and processing technologies to acquire and track targets with and without an operator in the loop.  Increase emphasis on revolutionary bio-inspired seeker technologies to increase immunity to countermeasures, to exploit multi-discriminant signatures, and to reduce the size and cost of detectors.  Increase emphasis on high-resolution wide field of view (WFOV) sensors, particularly with bio-inspired and high rate processing characteristics."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.000"
                                            },
                                            "Text": {
                                                "val": "Develop technologies that simplify, increase the flexibility, and reduce the cost of passive and active electro-optical, infrared, and radar munition seekers, with focus on combat operations in adverse weather and in high-speed engagements.  Continue to emphasize high-resolution WFOV sensors, particularly with bio-inspired and high rate processing characteristics to allow precise munition terminal guidance in degraded, contested environments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aerodynamics, Navigation and Control Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop weapon aerodynamic, control, navigation, and networking technologies for air-delivered munitions to provide precise, agile flight, networked effects, and immunity to countermeasures."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.114"
                                            },
                                            "Text": {
                                                "val": "Continued developing technologies that achieve precision navigation under GPS-degraded and GPS-denied conditions.  Developed weapon navigation and control networking technologies to provide options for enhanced mission capability in denied or anti-access environments.  These technologies facilitate agile and maneuverable weapons, foster autonomy, trust, and networking, and enable precise munition control and actuation, especially for boosted penetrating munitions or during high-speed engagements.  Increased emphasis in trusted terminal guidance and targeting flexibility\/autonomy after long ingress and high attrition."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.000"
                                            },
                                            "Text": {
                                                "val": "Further develop technologies that achieve precision navigation under GPS-degraded and GPS denied conditions.  Develop weapon navigation and control networking technologies that provide enhanced mission capability in denied or anti-access environments, facilitate agile and maneuverable weapons, foster autonomy, trust, and networking, and enable precise munition control and actuation, especially for munitions during high-speed engagements.  Investigate multi-functional, multi-strategy weapon swarms to defeat enemy defenses."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "24.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "24.000"
                                            },
                                            "Text": {
                                                "val": "Increase emphasis in developing technologies that achieve precision navigation under GPS-degraded and GPS-denied conditions.  Develop weapon navigation and control networking technologies that provide enhanced mission capability in denied or anti-access environments, facilitate agile and maneuverable weapons, foster autonomy, trust, and networking, and enable precise munition control and actuation.  Continue to investigate multi-functional, multi-strategy weapon swarms to defeat enemy defenses.  Develop technologies for weapon-platform interfaces that enable flexible, reprogrammable load-outs and achieve hardware and software modularity."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Guidance Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop guidance subsystem integration and evaluation technologies to provide open and closed loop ground testing, flight test risk reduction, and digital simulation of novel concepts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.600"
                                            },
                                            "Text": {
                                                "val": "Investigated precision guided munition integration technology issues and functionality.  Developed the capability to simulate, test, and refine pioneering seeker concepts and navigation and control approaches in a realistic operational environment.  Increased development efforts for guidance integration and evaluation technologies that provide enhanced mission capability for fifth-generation aircraft.  Continued pursuing multi-weapon search and attack technologies on a time critical moving target.  Established test technologies for evaluating higher speed weapon guidance subsystems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.001"
                                            },
                                            "Text": {
                                                "val": "Develop precision guided munition integration technology and functionality.  Focus on capabilities to simulate, test, and refine seeker concepts and navigation and control approaches in a realistic operational environment.  Continue emphasis on guidance integration and evaluation technologies that provide enhanced mission capability for fifth-generation aircraft.  Develop modeling techniques and tools to evaluate integrated, multi-weapon, and swarming search and attack.  Improve test technologies for evaluating higher speed weapon guidance subsystems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.757"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.757"
                                            },
                                            "Text": {
                                                "val": "Continue to develop a modular radio-frequency hardware-in-the-loop capability to support munitions concepts with high speed target engagement.  Continue developing new infrared projection capabilities to evaluate a new class of multi-aperture sensor systems.  Continue to develop a real-time radar\/millimeter wave signature generation capability for testing algorithms in real-time software and hardware in-the-loop environments."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "622502"
                    },
                    "ProjectTitle": {
                        "val": "Ordnance Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "40.125"
                        },
                        "CurrentYear": {
                            "val": "48.720"
                        },
                        "BudgetYearOne": {
                            "val": "46.630"
                        },
                        "BudgetYearOneBase": {
                            "val": "46.630"
                        },
                        "BudgetYearTwo": {
                            "val": "51.315"
                        },
                        "BudgetYearThree": {
                            "val": "56.085"
                        },
                        "BudgetYearFour": {
                            "val": "56.835"
                        },
                        "BudgetYearFive": {
                            "val": "57.875"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project investigates, develops, and evaluates conventional ordnance technologies to establish technical feasibility and military utility for advanced explosives, fuzes, warheads, submunitions, and weapon airframes, carriage, and dispensing.  The project also assesses the lethality and effectiveness of current and planned conventional weapons technology programs and assesses target vulnerability.  The payoffs include improved storage capability and transportation safety of fully assembled weapons, improved warhead and fuze effectiveness, improved submunition dispensing, low-cost airframe\/subsystem components and structures, and reduced aerospace vehicle and weapon drag."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Energetic Materials Technology"
                                    },
                                    "Description": {
                                        "val": "Investigate and develop energetic materials technology that can maximize weapon lethality, while applying appropriate safety and security features."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.980"
                                            },
                                            "Text": {
                                                "val": "Developed, modeled, and tested explosive fills that reduce pre-detonation during warhead penetration.  Continued developing low density energetic materials for small munition applications.  Demonstrated new nanoenergetic materials that enhance and tailor explosive effects.  Developed energetic materials with improved properties to enable the increased capability and capacity of fifth-generation aircraft."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "Continue to develop, model, and test explosive fills that reduce pre-detonation during warhead penetration.  Further develop low density energetic materials for small munition applications.  Exploit new nanoenergetic materials to enhance and tailor explosive effects.  Emphasize development of energetic materials that improve performance and reduce bomb and missile size to increase loadout."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "Continue to emphasize development of energetic materials, including reactive cases, that improve performance and reduce bomb and missile size so as to increase loadout and increase safety.  Continue to investigate energetic formulations that increase thermal and vibration tolerance required for very long range, high speed munitions.  Continue to develop a virtual design tool for use in material design activities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Fuze Technologies"
                                    },
                                    "Description": {
                                        "val": "Investigate and develop fuzes for air-delivered weapon applications to develop novel energetic initiation concepts, penetration fuzing, point burst fuzes, and develop predictive models."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.700"
                                            },
                                            "Text": {
                                                "val": "Expanded effort to investigate novel methods to initiate explosives, including new modeling and testing techniques.  Increased emphasis on fuze technologies that enable increased capacity and capability of fifth-generation aircraft, specifically as it facilitates success in denied or anti-access environments.  Continued to investigate and characterize the mechanical environment that a fuze must survive during hard target penetration events.  Continued to explore ground profiling imaging fuze technology, and developed a hardened chip fuze that uses integrated logic."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.800"
                                            },
                                            "Text": {
                                                "val": "Improve modeling and testing techniques to investigate novel methods to initiate explosives, to include distributed and embedded fuzing concepts.  Emphasize development of fuze technologies that enable increased capacity and capability of fifth-generation aircraft, specifically as it facilitates success in denied or anti-access environments.  Continue to investigate and characterize the mechanical environment that a fuze must survive during hard target penetration, and explore ground profiling imaging fuze technology."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.000"
                                            },
                                            "Text": {
                                                "val": "Continue developing a fuzing system employing ground profiling radar for miniature ordnance packages to enable more lethal forward-firing as well as low collateral damage.  Investigate the capability to predict and measure fuze performance during munition penetration at high impact speeds."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Warhead Technologies"
                                    },
                                    "Description": {
                                        "val": "Investigate and develop innovative warhead kill mechanisms, such as adaptable warheads, directional-control fragmenting warheads, and reactive metals."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.792"
                                            },
                                            "Text": {
                                                "val": "Developed novel warhead technologies that enable small, agile munitions to provide the capability to deliver selectable effects on targets.  Continued investigating directional warhead concepts to improve standoff kills for non-direct hit encounters by employing reactive fragments and by utilizing a forward focusing fragment capability.  Continued developing tools to better predict material-to-material interface dynamics, loading, and vibration during high-speed penetration."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.900"
                                            },
                                            "Text": {
                                                "val": "Increase emphasis in developing warhead technologies, especially those that enable munition agility, variable effects, and improved energy coupling.  Continue investigating directional warhead concepts to improve standoff kills for non-direct hit encounters by employing reactive fragments or by utilizing a forward focusing fragment capability.  Continue developing tools to better predict material-to-material interface dynamics, loading, and vibration during high-speed penetration."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.000"
                                            },
                                            "Text": {
                                                "val": "Develop penetrator technologies that address penetrator stability through novel nose shapes and increased survivability through internal structures for high-speed impacts into hard and deeply buried targets.  Continue to develop small, multi-output warhead technologies primarily for soft surface targets, but with limited penetration capability for hardened, shallow structures."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ordnance Technologies"
                                    },
                                    "Description": {
                                        "val": "Using a system approach, investigate and develop ordnance concepts by making technology trades between fuzes, warheads, and explosives and by improving weapon carriage, release, and dispensing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.653"
                                            },
                                            "Text": {
                                                "val": "Investigated precision guided munition integration issues and functionality in various flight environments.  Built interoperable simulations to evaluate emerging technologies.  Developed enhanced models with improvements for small munitions, penetrators, and counter chemical, biological, radiological, and nuclear effects.  Increased emphasis on pioneering ordnance concepts that increase the capacity and capability of fifth-generation aircraft."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.020"
                                            },
                                            "Text": {
                                                "val": "Continue to investigate precision guided munition integration issues and functionality in various flight environments, and continue building and using interoperable simulations to evaluate emerging technologies.  Continue developing technologies to improve models for small munitions, penetrators, and counter chemical, biological, radiological, and nuclear effects.  Develop ordnance concepts that increase the capacity and capability of fifth-generation aircraft."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.630"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.630"
                                            },
                                            "Text": {
                                                "val": "Continue to develop mission-level simulation architecture capability to enable weapon system and weapon technology assessments.  Continue development of multiphase physics models analyzing the detonation of a warhead and the dispersal of either a neutralizer or fuel. Continue to develop inventive ordnance concepts that increase the capacity and capability of fifth-generation aircraft."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}