{
    "id": "b216ecc248a3871c7403ac0ab1d8eb97a54c272d",
    "meta": {
        "filename": "dod-2015_RDTE_2015_AIRFORCE_V3B_RDTE_JustificationBook_Air_Force_PB_2015.zzz_unzipped_RDTE_JustificationBook_Air_Force_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0305220F"
        },
        "ProgramElementTitle": {
            "val": "RQ-4 UAV"
        },
        "R1LineNumber": {
            "val": "216"
        },
        "MdapCode": {
            "val": "252"
        },
        "PriorYearsDelta": {
            "val": "2031.377"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "2211.976"
            },
            "PriorYear": {
                "val": "240.234"
            },
            "CurrentYear": {
                "val": "120.180"
            },
            "BudgetYearOne": {
                "val": "244.514"
            },
            "BudgetYearOneBase": {
                "val": "244.514"
            },
            "BudgetYearTwo": {
                "val": "369.014"
            },
            "BudgetYearThree": {
                "val": "328.899"
            },
            "BudgetYearFour": {
                "val": "307.451"
            },
            "BudgetYearFive": {
                "val": "325.463"
            },
            "CostToComplete": {
                "val": "356.428"
            },
            "TotalCost": {
                "val": "4504.159"
            }
        },
        "ProgramElementNote": {
            "val": "Per direction of USD(AT&L), the Global Hawk program was restructured from the original project 675144 (Baseline) into multiple projects: (1) Block 30, (2) Block 40, (3) Ground Segment\/Communications System, and (4) Common Airborne Sense and Avoid (C-ABSAA).  Prior year funds in the amount of $2031.377M were accounted for in project 675144.\n\nIn FY15 and beyond, the RQ-4 Block 30 project 675145 includes budget necessary for enterprise management, test and evaluation, management services and fielding support for projects 675145, 675146 (Block 40) and 675147 (Ground Segment\/Comm System).  This reflects contracting\/acquisition strategy for these common elements within the Global Hawk program.  Projects 675148 (C-ABSAA) and 67RTIP (MP-RTIP) reflect separate costs as they are separately managed\/supported programs.\n \nThe Cost to Complete and Total Cost for MDAP projects in this program element are documented in the R3. Total Cost on the R2 is not reflective of the total cost for MDAP projects since the R2 does not account for prior years funding for previous program element."
        },
        "ProgramElementMissionDescription": {
            "val": "This program element funds six (6) related Air Force projects sharing the Global Hawk platform in common:  the Global Hawk Baseline (Block 10\/20) sub-program, the RQ-4 Block 30 sub-program, the RQ-4 Block 40 sub-program, the RQ-4 Ground Segment\/Communications System subprogram, the Common Airborne Sense & Avoid (C-ABSAA) sub-program, and the Multi-Platform Radar Technology Insertion Program (MP-RTIP).\n\nGlobal Hawk:\n\nThe Global Hawk Unmanned Aircraft System (UAS) provides a high altitude, deep look, long-endurance intelligence, surveillance, and reconnaissance (ISR) capability that complements space and other airborne collectors during peacetime, crisis, and war-fighting scenarios.  This funding supports the development of Global Hawk aircraft, payloads, ground and support segments.  The RQ-4B Remotely Piloted Aircraft (RPA) is the successor to the Block 10 RQ-4A, and is designed to employ 3,000 pounds of payload and enable multi-intelligence (multi-INT) collecting.  The Block 20 employs the Battlefield Airborne Communications Node (BACN) payload. \n\nBlock 30 (Project Number 675145) employs upgraded Synthetic Aperture Radar (SAR) and Electro-Optical\/Infrared (EO\/IR) sensors known as the Enhanced Integrated Sensor Suite (EISS) and the Airborne Signals Intelligence Payload (ASIP) sensor. Activities include mission planning development and testing, adverse weather capability development and testing, airspace and interoperability updates, airframe\/sensor upgrades and Next Generation Sensor integration. In FY15 and beyond, the RQ-4 Block 30 project 675145 includes budget necessary for enterprise management, test and evaluation, management services and fielding support for projects 675145, 675146 (Block 40) and 675147 (Ground Segment\/Comm System) as well as program protection projects, studies and analysis supporting future system enhancements. This reflects contracting\/acquisition strategy for these common elements within the Global Hawk program.  \n\nThe Block 40 (Project Number 675146) will integrate the Multi-Platform Radar Technology Insertion Program (MP-RTIP) radar sensor. In FY15 and beyond, the RQ-4 Block 40 project 675146 includes the Block 40 delta costs for the development of adverse weather capability development and testing, mission planning development and testing, airspace integration activities including IFF Mode 5 and ADS-B, airframe and sensor software and interoperability enhancements to the Block 40 fleet.  \n\nThe Ground Station Modernization (GSM)\/Communication System Modernization (CSM) Project Number 675147 includes the GSM, CSM and Next Generation Communication System.  The ground segment includes the Mission Control Element (MCE) and the Launch and Recovery Element (LRE).  As a result of the reinstatement of the Block 30s in the FY15 PB, the operational need for ground stations increased and drives the need for a GSTR that is planned to be re-initiated with phase 2 in FY16 in support of 20 year operational lifecycle. CSM and Next Generation Communications are planned for development and testing in FY18 and out.\n\nWhen judged feasible and affordable, this program will participate in the development, testing, and implementation of international standards to enhance joint, allied, and coalition interoperability.  Studies and activities may be initiated to explore the utility of incorporating the emerging architectural standards such as the USAF UAs Command and Control Initiative (UCI) or the DoD's Unmanned Control Segment standards (UCS).  \n\nThe Global Hawk program will maintain capability and interoperability for Blocks 20\/30\/40 including efforts with system of systems partners and continue to incorporate applicable synergies with other platforms such as  the U.S. Navy's Triton, other RPA weapon systems, and Processing, Exploitation & Dissemination (PED) elements.\n\nCommon Airborne Sense & Avoid (C-ABSAA): \nThe C-ABSAA funding supports design, development, integration, and testing of an Airborne Sense and Avoid capability for Group 3-5 UAS on a yet to be determined Threshold Platform.  Ongoing activities include technology development and maturation, sub-system integration and risk reductions activities. C-ABSAA is a separate ACAT II program in the Technology Maturation and Risk Reduction phase of the acquisition lifecycle, supports the \"Worldwide Operations\" Key Performance Parameter (KPP) found in larger UAS requirement documents, and provides the ability for UAS integration into the National Airspace System (NAS) and full worldwide UAS operations across all mission environments. This is a continuation of efforts which began in FY10 under OSD PEC, 64400D.  This project does not support platform specific integration or testing.\n\nMulti-Platform Radar Technology Insertion Program (MP-RTIP):\nThe MP-RTIP sensor was designed as a family of modular, scalable sensors that provide next generation capabilities to support sustainable network centric operations with integrated Command and Control Intelligence, Surveillance and Reconnaissance (C2ISR) capability. MP-RTIP provides the Global Hawk Block 40 aircraft with advanced Synthetic Aperture Radar (SAR) and Moving Target Indicator (MTI) sensor capabilities.\n\nThis project includes all MP-RTIP design, development, test, and integration efforts onto the GH Block 40 platform. Integration activities include platform integration of the MP-RTIP sensor and sustainment logistics planning support. MP-RTIP studies and development insertion include the implementation of Maritime Modes (MM), High Range Resolution (HRR) modes, electronic protection, technical refresh, product improvements and other advanced capabilities.  \n\nActivities also include studies and analysis supporting current and future program planning and future modes development based on user requirements. \n\nThis program is in Budget Activity 7, Operational System Development, because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "236.265"
                },
                "CurrentYear": {
                    "val": "134.406"
                },
                "BudgetYearOne": {
                    "val": "200.896"
                },
                "BudgetYearOneBase": {
                    "val": "200.896"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "240.234"
                },
                "CurrentYear": {
                    "val": "120.180"
                },
                "BudgetYearOne": {
                    "val": "244.514"
                },
                "BudgetYearOneBase": {
                    "val": "244.514"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "3.969"
                },
                "CurrentYear": {
                    "val": "-14.226"
                },
                "BudgetYearOne": {
                    "val": "43.618"
                },
                "BudgetYearOneBase": {
                    "val": "43.618"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.333"
                    },
                    "CurrentYear": {
                        "val": "-0.226"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "-24.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "16.000"
                    },
                    "CurrentYear": {
                        "val": "10.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-11.698"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "43.618"
                                },
                                "BudgetYearOneBase": {
                                    "val": "43.618"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY13 reductions in Other Adjustments were due to Sequestration.\nFY14 (-)$24.0M decrease:  Congressional reduction due to execution issues.  \nFY15 (+)$43.6M increase: Restoration of the Global Hawk Block 30."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "675145"
                    },
                    "ProjectTitle": {
                        "val": "RQ-4 Block 30"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "16.000"
                        },
                        "CurrentYear": {
                            "val": "10.000"
                        },
                        "BudgetYearOne": {
                            "val": "208.775"
                        },
                        "BudgetYearOneBase": {
                            "val": "208.775"
                        },
                        "BudgetYearTwo": {
                            "val": "264.347"
                        },
                        "BudgetYearThree": {
                            "val": "221.470"
                        },
                        "BudgetYearFour": {
                            "val": "129.674"
                        },
                        "BudgetYearFive": {
                            "val": "117.229"
                        },
                        "CostToComplete": {
                            "val": "178.160"
                        },
                        "TotalCost": {
                            "val": "1145.655"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "The FY13 President's budget directed divesture of all Block 30 efforts. The FY14 President's Budget reflected a continuation of the proposed Block 30 program divesture; however, Congressional funding was added to the FY13 and 14 President's Budget submissions. The FY15 PB funds the Block 30s for their full planned lifecycle."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Global Hawk Unmanned Aircraft System (UAS) provides a high altitude, deep look, long-endurance intelligence, surveillance, and reconnaissance (ISR) capability that complements space and other airborne collectors during peacetime, crisis, and war-fighting scenarios.\n\nRDT&E funding in this project supports design, development, integration, and testing of items needed to meet Key Performance Parameters (KPPs) for Block 30 aircraft, including continuing aircraft system modernization for Enhanced Integrated Sensor Suite (EISS) sensors and Block 30 Airborne Signals Intelligence Payload (ASIP) contractor support. \n\nThis funding also supports aircraft systems modernization to include continuing aircraft operations surety for information assurance and mission critical repair of test Government Furnished Equipment (GFE). \n\nThe Global Hawk program will maintain capability and interoperability for Block 30 including efforts with system of systems partners and continue to incorporate applicable synergies with other platforms, such as the U.S. Navy's Triton, other RPA weapon systems, and Processing, Exploitation & Dissemination (PED) elements.\n\nActivities include mission planning development and testing, adverse weather capability development and testing, airspace and interoperability updates, airframe and software upgrades and deficiency report resolution across Global Hawk fleet, ASIP and EISS sensor upgrades, integration activities associated with Next Generation Sensor capability including the comparison of how differences in flight performance would affect sensor performance, program protection projects, and studies and analysis supporting future system enhancements.  \n\nWhen judged feasible and affordable, this program will participate in the development, testing, and implementation of international standards to enhance joint, allied, and coalition interoperability.  Likewise, studies and activities may be initiated to explore the utility of incorporating the emerging architectural standards such as the USAF UAS Command and Control Initiative (UCI) or the DoD's Unmanned Control Segment standards (UCS)."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Global Hawk Block 30 Congressional Add"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "16.000"
                                        },
                                        "Text": {
                                            "val": "Continued Aircraft system modernization for Block 30 to include Enhanced\nIntegrated Sensor Suite (EISS) sensors and aircraft operations surety for\ninformation assurance, flight test support and repair of test Government Furnished Equipment (GFE)"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "10.000"
                                        },
                                        "Text": {
                                            "val": "Feasibility study and assessment for integration of U-2 sensors or alternative sensors of comparable capability onto the RQ-4B to include comparing how differences in flight performance would affect sensor performance such as adverse weather, mission planning and airspace and sensor interoperability."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Global Hawk Block 30 System Development and Demonstration (SDD)"
                                    },
                                    "Description": {
                                        "val": "Global Hawk Development and Demonstration"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "see Congressional Add below"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "see Congressional Add below"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "184.561"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "184.561"
                                            },
                                            "Text": {
                                                "val": "Development activities to support the development of next generation sensors for the RQ-4 as well as development of adverse weather capabilities, mission planning, airspace integration activities including IFF Mode 5 and ADS-B, sensor interoperability enhancements and continued system interoperability, information assurance and R&M improvements"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Global Hawk Block 30 Government Test and Non Prime Support"
                                    },
                                    "Description": {
                                        "val": "Government test, non-prime technical support and Other Government Costs (OGC) -- The majority of this funding supports Global Hawk development testing at the 412 Test Wing at Edwards AFB, CA and also includes funding for incidental support from Air Force Operational Test and Evaluation Center (AFOTEC), Joint Interoperability Test Command (JITC), Distributed Common Ground System (DCGS) and OGC."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "see Congressional Add below"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "see Congressional Add below"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "24.214"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "24.214"
                                            },
                                            "Text": {
                                                "val": "Continuing government test and non-prime engineering and technical support and Other Government Costs"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "APAF: BA04: Line Item # HAEUAV"
                                    },
                                    "Title": {
                                        "val": "RQ-4"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "118.360"
                                        },
                                        "CurrentYear": {
                                            "val": "11.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "65.403"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "65.403"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "103.935"
                                        },
                                        "BudgetYearThree": {
                                            "val": "29.699"
                                        },
                                        "BudgetYearFour": {
                                            "val": "31.534"
                                        },
                                        "BudgetYearFive": {
                                            "val": "29.908"
                                        },
                                        "CostToComplete": {
                                            "val": "432.821"
                                        },
                                        "TotalCost": {
                                            "val": "5079.019"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF: BA04: Line Item # RQ440P"
                                    },
                                    "Title": {
                                        "val": "RQ-4 Block 40 Proc"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "10.691"
                                        },
                                        "CurrentYear": {
                                            "val": "1.747"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "12.438"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF: BA05: Line Item # HAWK00"
                                    },
                                    "Title": {
                                        "val": "RQ-4 Mods"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "6.997"
                                        },
                                        "CurrentYear": {
                                            "val": "9.313"
                                        },
                                        "BudgetYearOne": {
                                            "val": "21.354"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "21.354"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "46.127"
                                        },
                                        "BudgetYearThree": {
                                            "val": "34.493"
                                        },
                                        "BudgetYearFour": {
                                            "val": "89.248"
                                        },
                                        "BudgetYearFive": {
                                            "val": "67.265"
                                        },
                                        "CostToComplete": {
                                            "val": "487.907"
                                        },
                                        "TotalCost": {
                                            "val": "1140.417"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF: BA05: Line Item # RQ4GCM"
                                    },
                                    "Title": {
                                        "val": "RQ-4 GSRA\/CSRA Mods"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "23.668"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "328.708"
                                        },
                                        "TotalCost": {
                                            "val": "352.376"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Global Hawk program uses an evolutionary acquisition strategy to provide the warfighter with a near-term combat capability with increased time-phased capability improvements as technology and risk achieve satisfactory levels. Northrop Grumman Corporation is the prime contractor. Development efforts are contracted on a legacy EMD contract which is being phased out with the completion of current efforts, and on the follow on IDIQ contract that was awarded May 2013 for future modernization efforts.  The next major planned programmatic event is a Milestone C decision (date TBD)."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "Target Value of the Global Hawk EMD & IDIQ Contracts is not segregated by Budget Project Number."
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "Target Value of the Global Hawk EMD & IDIQ Contracts is not segregated by Budget Project Number. FY15 and beyond contains budget necessary for GH fleet support with Northrop Grumman."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Engineering Manufacturing & Development\/IDIQ Block 30"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Northrop Grumman Integrated Systems"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Diego, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "15.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-09"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "10.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-04"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "184.561"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "184.561"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "802.126"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1011.687"
                                                    },
                                                    "TargetValue": {
                                                        "val": "1011.687"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Remarks": {
                                        "val": "Target Value of the Global Hawk effort is not segregated by Budget Project Number. FY15 and beyond contains budget necessary for GH fleet test support."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Flight Test & Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "412 TW"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Edwards AFB, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-09"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "16.022"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "16.022"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "63.912"
                                                    },
                                                    "TotalCost": {
                                                        "val": "80.934"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "Remarks": {
                                        "val": "Target Value of the Global Hawk Contracts is not segregated by Budget Project Number. FY15 and beyond contains budget necessary for GH fleet management services support."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "PMA: A&AS"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Dayton, OH"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "4.915"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "4.915"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "26.906"
                                                    },
                                                    "TotalCost": {
                                                        "val": "31.821"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "PMA: Other Government Costs"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Dayton, OH"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.277"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.277"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "17.936"
                                                    },
                                                    "TotalCost": {
                                                        "val": "21.213"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0305220F_BPAC_675145_0.jpg"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Enhanced Integrated Sensor Suite (EISS) TAC DMS"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Weather Radar"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "ADS-B\/Mode 5 Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "ASIP Inc 1"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Next Gen Sensor Study\/Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SAR Complex Imagery"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "ADC\/JPEG"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Mission Planning"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Program Protection"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "412 Test Wing Test Support"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "675146"
                    },
                    "ProjectTitle": {
                        "val": "RQ-4 Block 40"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "132.272"
                        },
                        "CurrentYear": {
                            "val": "61.651"
                        },
                        "BudgetYearOne": {
                            "val": "12.910"
                        },
                        "BudgetYearOneBase": {
                            "val": "12.910"
                        },
                        "BudgetYearTwo": {
                            "val": "16.064"
                        },
                        "BudgetYearThree": {
                            "val": "9.050"
                        },
                        "BudgetYearFour": {
                            "val": "14.418"
                        },
                        "BudgetYearFive": {
                            "val": "15.276"
                        },
                        "CostToComplete": {
                            "val": "21.450"
                        },
                        "TotalCost": {
                            "val": "283.091"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "1. The Global Hawk Block 40 Sub-Program was directed by an ADM signed 14 Jun 2011 by USD (AT&L). At the time of the ADM signature, and subsequent designation of sub-program projects, the FY11 and FY12 budgets had already been finalized within DoD.  The FY11 and FY12 budgets for all sub-programs are captured under the Global Hawk Baseline sub-program, as its related Project (675144) was the core project for the Global Hawk program prior to the directed restructure.\n\n2. Since the FY13 President's budget directed divesture of all Block 30 efforts, Block 40 activities were fully burdened with enterprise managment, flight test and management servies in FY13 and 14. The FY15 PB funds the Block 30s for their full planned lifecycle and includes budget necessary for enterprise management, test and evaluation, management services and fielding support for projects in Project Number 675145. The Block 40 Project Number 675146 contains delta costs specific to Block 40 development\/modernization."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Global Hawk Unmanned Aircraft System (UAS) provides a high altitude, deep look, long-endurance intelligence, surveillance, and reconnaissance (ISR) capability that complements space and other airborne collectors during peacetime, crisis, and war-fighting scenarios.  \n\nRDT&E funding in this project supports design, development, integration, and testing of items needed to meet Key Performance Parameters (KPPs) for Block 40 aircraft, including integration and test of the Multi-Platform Radar Technology Insertion Program (MP-RTIP) sensor.  Associated Block 40 airworthiness certifications are included in this effort.  The Block 40 program provides critical Synthetic Aperture Radar and Ground Moving Target Indicator data to the warfighter.\n\nThis funding also supports continued aircraft\/communications systems modernization to include Identification Friend or Foe (IFF) Mode 5, Automatic Dependent Surveillance Broadcast (ADSB), mission planning upgrade development and testing, program protection projects, adverse weather capability, and reliability and maintainability improvements.  Funding continues MP-RTIP sensor integration and integration of upgraded radar SW and capabilities deferred to post Block 40 IOT&E. \n\nIn FY15 and beyond, the RQ-4 Block 40 project 675146 includes the delta costs only for the development of above capabilities with the RQ-4 Block 30 project, 675145.  The RQ-4 Block 30 project, 675145, also contains the budget necessary for enterprise management, test and evaluation, management services and fielding support for the fleet.  \n \nWhen judged feasible and affordable, this program will participate in the development, testing, and implementation of international standards to enhance joint, allied, and coalition interoperability.  Likewise, studies and activities may be initiated to explore the utility of incorporating the emerging architectural standards such as the USAF UAS Command and Control Initiative (UCI) or the DoD's Unmanned Control Segment standards (UCS).\n\nThe Global Hawk program will maintain capability and interoperability for Block 40 including efforts with system of systems partners and continue to incorporate applicable synergies with other platforms, such as the U.S. Navy's Triton, other RPA weapon systems, and Processing, Exploitation & Dissemination (PED) elements.\n\nActivities also include studies and analysis supporting future system enhancements, current and future program planning, and project execution."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Global Hawk Block 40 System Development and Demonstration (SDD)"
                                    },
                                    "Description": {
                                        "val": "Global Hawk Block 40 Payload and Aircraft\/Communications Development and Demonstration"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "116.132"
                                            },
                                            "Text": {
                                                "val": "Developed and integrated MP-RTIP sensor integration, test and sustainment capability for Early Operational Capability for Block 40. Ramped up Aircraft\/Communication systems modernization to include IFF Mode 5\/ADSB pre-contract activities, and mission planning upgrade.  Continued aircraft operations surety for Information Assurance and Reliability and Maintainability initiatives."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "40.126"
                                            },
                                            "Text": {
                                                "val": "Continuing development and integration of MP-RTIP sensor integration, IOT&E and sustainment capability for Block 40. Continuing Aircraft\/Communication systems modernization to include IFF Mode 5, ADSB, and mission planning upgrade and program protection. Continuing aircraft operations surety for Information Assurance and Reliability and Maintainability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.910"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.910"
                                            },
                                            "Text": {
                                                "val": "Delta costs for the development of adverse weather capabilities, mission planning, airspace integration activities including IFF Mode 5 and ADS-B, sensor SW and interoperability enhancements and continued system interoperability, information assurance and R&M improvements"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Global Hawk Block 40 Government Test and Non Prime Support"
                                    },
                                    "Description": {
                                        "val": "Government test, non-prime technical support and Other Government Costs (OGC) -- The majority of this funding supports Global Hawk development testing at the 412 Test Wing at Edwards AFB, CA and also includes funding for incidental support from Air Force Operational Test and Evaluation Center (AFOTEC), Joint Interoperability Test Command (JITC), Distributed Common Ground System (DCGS) and OGC."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.140"
                                            },
                                            "Text": {
                                                "val": "Continued government test and non-prime engineering and technical support and Other Government Costs for Block 40 aircraft"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "21.525"
                                            },
                                            "Text": {
                                                "val": "Continuing government test and non-prime engineering and technical support for Block 40 IOT&E and Other Government Costs"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Costs are covered in the Block 30 project"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "APAF: BA04: Line Item # HAEUAV"
                                    },
                                    "Title": {
                                        "val": "RQ-4"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "118.360"
                                        },
                                        "CurrentYear": {
                                            "val": "11.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "65.403"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "65.403"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "103.935"
                                        },
                                        "BudgetYearThree": {
                                            "val": "29.699"
                                        },
                                        "BudgetYearFour": {
                                            "val": "31.534"
                                        },
                                        "BudgetYearFive": {
                                            "val": "29.908"
                                        },
                                        "CostToComplete": {
                                            "val": "432.821"
                                        },
                                        "TotalCost": {
                                            "val": "5079.019"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF: BA04: Line Item # RQ440P"
                                    },
                                    "Title": {
                                        "val": "RQ-4 Blk 40 Proc"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "10.691"
                                        },
                                        "CurrentYear": {
                                            "val": "1.747"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "12.438"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF: BA05: Line Item # HAWK00"
                                    },
                                    "Title": {
                                        "val": "RQ-4 Mods"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "6.997"
                                        },
                                        "CurrentYear": {
                                            "val": "9.313"
                                        },
                                        "BudgetYearOne": {
                                            "val": "21.354"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "21.354"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "46.127"
                                        },
                                        "BudgetYearThree": {
                                            "val": "34.493"
                                        },
                                        "BudgetYearFour": {
                                            "val": "89.248"
                                        },
                                        "BudgetYearFive": {
                                            "val": "67.265"
                                        },
                                        "CostToComplete": {
                                            "val": "487.907"
                                        },
                                        "TotalCost": {
                                            "val": "1140.417"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF: BA05: Line Item # RQ4GCM"
                                    },
                                    "Title": {
                                        "val": "RQ-4 GSRA\/CSRA Mods"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "23.668"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "328.708"
                                        },
                                        "TotalCost": {
                                            "val": "352.376"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTE: BA07: PE 0305238F"
                                    },
                                    "Title": {
                                        "val": "NATO AGS"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "192.571"
                                        },
                                        "CurrentYear": {
                                            "val": "221.589"
                                        },
                                        "BudgetYearOne": {
                                            "val": "232.851"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "232.851"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "138.400"
                                        },
                                        "BudgetYearThree": {
                                            "val": "39.604"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "825.015"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Global Hawk program uses an evolutionary acquisition strategy to provide the warfighter with a near-term combat capability with increased time-phased capability improvements as technology and risk achieve satisfactory levels. Northrop Grumman Corporation is the prime contractor. Development efforts are contracted on a legacy EMD contract which is being phased out with the completion of current efforts, and on the follow on IDIQ contract that was awarded May 2013 for future modernization efforts.  The next major planned programmatic event is a Milestone C decision (date TBD)."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "Target Value of the Global Hawk EMD & IDIQ Contracts is not segregated by Budget Project Number."
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "Target Value of the Global Hawk EMD & IDIQ Contracts is not segregated by Budget Project Number."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Engineering Manufacturing & Development\/IDIQ Block 40"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Northrop Grumman Integrated Systems"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Diego, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "116.132"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "40.126"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "12.910"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "12.910"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "76.258"
                                                    },
                                                    "TotalCost": {
                                                        "val": "245.426"
                                                    },
                                                    "TargetValue": {
                                                        "val": "245.433"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "Remarks": {
                                        "val": "Target Value of the Global Hawk Contract is not segregated by Budget Project Number."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Non-Prime Technical Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Dayton, OH"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.212"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.594"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.806"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Remarks": {
                                        "val": "Target Value of the Global Hawk effort is not segregated by Budget Project Number. FY15 and beyond budget necessary for GH fleet test support is contained in Budget Project Number 675145, RQ-4 Block 30."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Flight Test & Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "412 TW"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Edwards AFB, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "8.700"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "14.531"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "23.231"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "Remarks": {
                                        "val": "Target Value of the Global Hawk Contracts is not segregated by Budget Project Number. FY15 and beyond budget necessary for GH fleet management services support is contained in Budget Project Number 675145, RQ-4 Block 30."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "PMA: A&AS"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Dayton, OH"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "4.339"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "4.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "8.339"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "PMA: Other Gov't Cost"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Dayton, OH"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.889"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.400"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "4.289"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0305220F_BPAC_675146_0.jpg"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Weather Radar Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "ADS-B\/IFF Mode 5"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Mission Planning Upgrade"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Program Protection"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Early Operational Capability"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Block 40 IOT&E"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Post IOT&E Build"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Block 40 IOC"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Block 40 FOC"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "675147"
                    },
                    "ProjectTitle": {
                        "val": "RQ-4 Grnd Segment\/Comm System"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "55.268"
                        },
                        "CurrentYear": {
                            "val": "22.309"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "19.537"
                        },
                        "BudgetYearThree": {
                            "val": "53.551"
                        },
                        "BudgetYearFour": {
                            "val": "113.726"
                        },
                        "BudgetYearFive": {
                            "val": "142.596"
                        },
                        "CostToComplete": {
                            "val": "94.771"
                        },
                        "TotalCost": {
                            "val": "501.758"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "1. The Global Hawk Ground Segment\/Communications System Sub-Program was directed by an ADM signed 14 Jun 2011 by USD (AT&L). At the time of the ADM signature, and subsequent designation of sub-program projects, the FY11 and FY12 budgets had already been finalized within DoD.  The FY11 and FY12 budgets for all sub-programs are captured under the Global Hawk Baseline sub-program, as its related Project (675144) was the core project for the Global Hawk program prior to the directed restructure.\n\n2.  Ground Segment Modernization (GSM) was initiated to resolve significant obsolescence issues in the ground station in order to support a 20 year planned operational lifecycle for the Block 20\/30\/40 fleet; this effort was contracted in phases.  The FY13 PB proposed divestiture of the Block 30s and ACC resolved to divest of the Block 20 BACN aircraft within the FYDP leaving only the Block 40s.  As a result of the reduced ground segment requirements, the GSM effort was halted in favor of a Diminishing Manufacturing Sources (DMS) only approach which leveraged the equipment from Block 30 ground stations planned for divesture.  As a result of the reinstatement of the Block 30s in the FY15 PB, the operational need for ground stations increased making a DMS only strategy unfeasible; GSM will be re-initiated with phase 2 in FY16.\n \n3.  The FY14 President's Budget (PB) reflected a continuation of the proposed Block 30 program divesture.  The FY15 PB funds the Block 30s in support of the full planned lifecycle and resumes funding of the GSM and Communications System Modernization (CSM) efforts."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Global Hawk Unmanned Aircraft System (UAS) provides a high altitude, deep look, long-endurance intelligence, surveillance, and reconnaissance (ISR) capability that complements space and other airborne collectors during peacetime, crisis, and war-fighting scenarios.  \n\nRDT&E funding in this project supports design, development, integration and testing of the Ground Segment and the Communication System Modernization in support of the planned 20 year operational lifecycle and next generation communications system.  GSM solves fleet grounding DMS issues associated with legacy ground segment equipment and provides critical warfighter capabilities such as multi-aircraft control and net-ready KPP requirements.  CSM also resolves critical DMS issues in the GH communication infrastructure and provides communication enhancements across all five primary comm links.   \n\nWhen judged feasible and affordable, this program will participate in the development, testing, and implementation of international standards to enhance joint, allied, and coalition interoperability.  Likewise, studies and activities may be initiated to explore the utility of incorporating the emerging architectural standards such as the USAF UAS Command and Control Initiative (UCI) or the DoD's Unmanned Control Segment standards (UCS).\n\nActivities also include studies and analysis supporting future system enhancements, current and future program planning and project execution."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Global Hawk Ground Station \/ Communications System- Critical Obsolescence Issues"
                                    },
                                    "Description": {
                                        "val": "Global Hawk Ground Segment\/ Communications System Development"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "50.786"
                                            },
                                            "Text": {
                                                "val": "Continued ground station and communication systems updates to resolve critical obsolescence issues in the legacy Global Hawk ground segment equipment and communications infrastructure."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "21.080"
                                            },
                                            "Text": {
                                                "val": "Continuing ground station and communication system updates to resolve critical obsolescence issues"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Government Test and non prime support"
                                    },
                                    "Description": {
                                        "val": "Government test, non-prime technical support and Other Government Costs (OGC) -- The majority of this funding supports Global Hawk development testing at the 412 Test Wing at Edwards AFB, CA and also includes funding for incidental support from Air Force Operational Test and Evaluation Center (AFOTEC), Joint Interoperability Test Command (JITC), Distributed Common Ground System (DCGS) and OGC."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.482"
                                            },
                                            "Text": {
                                                "val": "Continued government test and non-prime engineering and technical support and Other Government Costs for Ground Segment \/ Comm systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.229"
                                            },
                                            "Text": {
                                                "val": "Continuing government test and non-prime engineering and technical support and Other Government Costs for Ground Segment \/ Comm systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "APAF: BA04: Line Item # HAEUAV"
                                    },
                                    "Title": {
                                        "val": "RQ-4"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "118.360"
                                        },
                                        "CurrentYear": {
                                            "val": "11.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "65.403"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "65.403"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "103.935"
                                        },
                                        "BudgetYearThree": {
                                            "val": "29.699"
                                        },
                                        "BudgetYearFour": {
                                            "val": "31.534"
                                        },
                                        "BudgetYearFive": {
                                            "val": "29.908"
                                        },
                                        "CostToComplete": {
                                            "val": "432.821"
                                        },
                                        "TotalCost": {
                                            "val": "5079.019"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF: BA04: Line Item # RQ440P"
                                    },
                                    "Title": {
                                        "val": "RQ-4 Block 40 Proc"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "10.691"
                                        },
                                        "CurrentYear": {
                                            "val": "1.747"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "12.438"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF: BA05: Line Item # HAWK00"
                                    },
                                    "Title": {
                                        "val": "RQ-4 Mods"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "6.997"
                                        },
                                        "CurrentYear": {
                                            "val": "9.313"
                                        },
                                        "BudgetYearOne": {
                                            "val": "21.354"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "21.354"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "46.127"
                                        },
                                        "BudgetYearThree": {
                                            "val": "34.493"
                                        },
                                        "BudgetYearFour": {
                                            "val": "89.248"
                                        },
                                        "BudgetYearFive": {
                                            "val": "67.265"
                                        },
                                        "CostToComplete": {
                                            "val": "487.907"
                                        },
                                        "TotalCost": {
                                            "val": "1140.417"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF: BA05: Line Item # RQ4GCM"
                                    },
                                    "Title": {
                                        "val": "RQ-4 GS\/CS Mods"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "23.668"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "328.708"
                                        },
                                        "TotalCost": {
                                            "val": "352.376"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Global Hawk program uses an evolutionary acquisition strategy to provide the warfighter with a near-term combat capability with increased time-phased capability improvements as technology and risk achieve satisfactory levels. Northrop Grumman Corporation is the prime contractor. Development efforts are contracted on a legacy EMD contract which is being phased out with the completion of current efforts, and on the follow on IDIQ contract that was awarded May 2013 for future modernization efforts.  The next major planned programmatic event is a Milestone C decision (date TBD)."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "Target Value of the Global Hawk EMD & IDIQ Contracts is not segregated by Budget Project Number."
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "Target Value of the Global Hawk EMD & IDIQ Contracts is not segregated by Budget Project Number."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Engineering, Manufacturing & Development\/IDIQ Ground Segment and Communication Systems"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Northrop Grumman Integrated Systems"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Diego, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "50.786"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "21.080"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "424.181"
                                                    },
                                                    "TotalCost": {
                                                        "val": "496.047"
                                                    },
                                                    "TargetValue": {
                                                        "val": "496.122"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "Remarks": {
                                        "val": "Target Value of the Global Hawk Contracts is not segregated by Budget Project Number."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Non-Prime Technical Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Dayton, OH"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.596"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.629"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.225"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Remarks": {
                                        "val": "Target Value of the Global Hawk effort is not segregated by Budget Project Number."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Flight Test & Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "412 TW"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Edwards AFB, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.500"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "Remarks": {
                                        "val": "Target Value of the Global Hawk Contracts is not segregated by Budget Project Number. FY15 and beyond budget necessary for GH fleet management services support is contained in Budget Project Number 675145, RQ-4 Block 30."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "PMA: A&AS"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Dayton, OH"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.269"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.350"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.619"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "PMA: Other Gov't Cost"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Dayton, OH"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.117"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.250"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.367"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0305220F_BPAC_675147_0.jpg"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Ground Station Modernization-Phase 1"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Ground Station Modernization-Phase 2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Comm Systems Modernization-Phase 1"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Comm Systems Modernization-Phase 2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Next Generation Comms"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "675148"
                    },
                    "ProjectTitle": {
                        "val": "Common-Airborne Sense & Avoid (C-ABSAA)"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "19.011"
                        },
                        "CurrentYear": {
                            "val": "17.098"
                        },
                        "BudgetYearOne": {
                            "val": "11.829"
                        },
                        "BudgetYearOneBase": {
                            "val": "11.829"
                        },
                        "BudgetYearTwo": {
                            "val": "52.866"
                        },
                        "BudgetYearThree": {
                            "val": "37.105"
                        },
                        "BudgetYearFour": {
                            "val": "37.733"
                        },
                        "BudgetYearFive": {
                            "val": "38.451"
                        },
                        "CostToComplete": {
                            "val": "62.047"
                        },
                        "TotalCost": {
                            "val": "276.140"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "In two related Acquisition Decision Memoranda signed by USD(AT&L) in January and June 2011, the Global Hawk program was directed to restructure into four major sub-programs: (1) Global Hawk baseline, (2) Block 30, (3) Block 40, and (4) Ground Station Re-Architecture (GSRA)\/Communications System Re-Architecture (CSRA). The AF created this Pre-Planned Product Improvement (P3I) line item to accommodate inclusion of required capability to meet warfighter needs beyond those requirements satisfied in the directed sub-programs.  In April 2013 the AF transitioned this line item from a Global Hawk platform-specific program to a platform-agnostic capability for Group 4-5 Unmanned Aircraft Systems (UAS), scalable to Group 3 UAS."
                        },
                        "ProjectMissionDescription": {
                            "val": "RDT&E funding in this project supports design, development, integration, and testing of a Common Airborne Sense and Avoid(C-ABSAA) capability for Group 3-5 Unmanned Aircraft Systems(UAS) on a yet to be determined Threshold Platform.  Ongoing activities include technology development and maturation, sub-system integration and risk reduction activities. C-ABSAA is a separate ACAT II program in the Technology Maturation and Risk Reduction phase of the acquisition lifecycle, supports the \"Worldwide Operations\" Key Performance Parameter (KPP) found in larger UAS requirement documents, and provides the ability for UAS integration into the National Airspace System (NAS) and full worldwide UAS operations across all mission environments. Funding covers the Common Airborne Sense and Avoid development activities as well as program infrastructure and other government costs. Platform specific integration and testing is not included.\n\nActivities also include C-ABSAA related studies and analysis supporting current and future C-ABSAA system capabilities, program planning and project execution."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "C-ABSAA System Technology Maturation and Risk Reduction"
                                    },
                                    "Description": {
                                        "val": "Develop a scalable & automatic Common Airborne Sense & Avoid (C-ABSAA) system for Group 3-5 Unmanned Aircraft Systems (UAS) providing the capability to integrate UAS operations into the US national airspace and globally.  Fielding of this capability is dependent upon DoD self-certification to meet the standards for operation & certification expected from the Federal Aviation Administration (FAA) IAW the FAA Modernization and Reform Act of 2012."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.011"
                                            },
                                            "Text": {
                                                "val": "Approved to initiate the program into the Technology Maturation and Risk Reduction (pre-MS B) phase of acquisition.  Conducted science and technology sense and avoid flight demonstrations with Air Force Research Lab (AFRL) and FAA on a surrogate UAS against multiple intruder aircraft, demonstrating automatic collision avoidance against both cooperative and non-cooperative threats.  Continued to develop and mature both the radar and next generation electro-optical sensors."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.098"
                                            },
                                            "Text": {
                                                "val": "Refining and clarifying C-ABSAA requirements with Air Combat Command.   Continuing C-ABSAA system maturation with AFRL. Building sub-system Modeling and Simulation capabilities to a sufficient level of fidelity to support Airworthiness under MIL-HDBK-516 and operational approval by the FAA. Preparing to award technology development contract(s) for Preliminary Design Review. Preparing plans and documents in support of Milestone (MS) B. Perform early logistics planning."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.829"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.829"
                                            },
                                            "Text": {
                                                "val": "Will continue to refine C-ABSAA requirements.  Will continue C-ABSAA system maturation with AFRL.  Will continue to define and build sub-system Modeling and Simulation models to a sufficient level of fidelity to support Airworthiness under MIL-HDBK-516.  Will prepare to award technology development contract (s) for Preliminary Design Review.  Will continue to prepare plans and documents in support of MS B. Will continue logistics planning."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The C-ABSAA program has integrated Better Buying Power 2.0 initiatives throughout its acquisition strategy and relies upon acquisition of government data rights to maximize contractor competition from Technology Development through Production.  The program uses an evolutionary acquisition strategy to provide the warfighter with a capability for Group 3-5 UAS with increased, time-phased capability improvements as technology and risks achieve satisfactory levels.  Group 3-5 UAS platforms will be required to integrate the C-ABSAA provided capability into their unique systems."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0305220F_BPAC_675148_0.jpg"
                                }
                            }
                        ]
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "67RTIP"
                    },
                    "ProjectTitle": {
                        "val": "MP-RTIP"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "180.599"
                        },
                        "PriorYear": {
                            "val": "17.683"
                        },
                        "CurrentYear": {
                            "val": "9.122"
                        },
                        "BudgetYearOne": {
                            "val": "11.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "11.000"
                        },
                        "BudgetYearTwo": {
                            "val": "16.200"
                        },
                        "BudgetYearThree": {
                            "val": "7.723"
                        },
                        "BudgetYearFour": {
                            "val": "11.900"
                        },
                        "BudgetYearFive": {
                            "val": "11.911"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "266.138"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "The Multi-Platform Radar Technology Insertion Program (MP-RTIP) program was previously funded by program 0207450F (MP-RTIP) from FY05 through FY08.  Beginning in FY09 funding was transferred to program 0305220F (RQ-4) Global Hawk.  Therefore, the data in this package includes only FY09 and subsequent funding related to program 0305220F."
                        },
                        "ProjectMissionDescription": {
                            "val": "The MP-RTIP sensor was designed as a family of modular, scalable sensors that provide next generation capabilities to support sustainable network centric operations with integrated Command and Control Intelligence, Surveillance and Reconnaissance (C2ISR) capability. MP-RTIP provides the Global Hawk (GH) Block 40 aircraft advanced Synthetic Aperture Radar (SAR) and Moving Target Indicator (MTI) sensor capabilities.\n\nThis project includes all MP-RTIP design, development, test, and integration efforts on the GH Block 40 Platform. Integration activities include platform integration of the MP-RTIP sensor and sustainment support including logistics planning support. MP-RTIP studies and development insertion include the implementation of Maritime Modes (MM), High Range Resolution (HRR) modes, electronic protection, technical refresh, product improvements and other advanced capabilities.\n\nActivities also include studies and analysis supporting current and future program planning and future modes development based on user requirements."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Development and integration"
                                    },
                                    "Description": {
                                        "val": "MP-RTIP development and integration"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.921"
                                            },
                                            "Text": {
                                                "val": "Completed sensor integration of MP-RTIP on GH platform for GMTI\/SAR\/Concurrent modes, including software release to GH, and FCA\/PCA.  Initiated planning for additional modes for MP-RTIP based on user requirements.  Completed Radar Software Development (RSD) 1.4 software build."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.964"
                                            },
                                            "Text": {
                                                "val": "Completing MP-RTIP RSD 1.4.5 software build.  Initiating MP-RTIP RSD 1.5 software build.  Completing System Level Performance Verification (SLPV)\/Integrated System Evaluation (ISE)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.955"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.955"
                                            },
                                            "Text": {
                                                "val": "Will complete RSD 1.5 software build.  Will initiate U.S. Maritime Modes (MM) and design\/development for remaining requirements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Test & Evaluation"
                                    },
                                    "Description": {
                                        "val": "MP-RTIP Test & Evaluation"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.762"
                                            },
                                            "Text": {
                                                "val": "Completed MP-RTIP sensor regression and RSD 1.4 software build Test and Evaluation on GH including but not limited to ground and flight integration of sensor and air vehicle, test force and range support. Initiated interoperability compliance and third party performance reviews."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.158"
                                            },
                                            "Text": {
                                                "val": "Completing Test & Evaluation support for SLPV (ISE) and MP-RTIP RSD 1.4.5 software build.  Initiating Test & Evaluation support for MP-RTIP RSD 1.5 software build including but not limited to test planning, test force and range support, interoperability compliance and third party performance reviews."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.045"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.045"
                                            },
                                            "Text": {
                                                "val": "Will complete MP-RTIP Test & Evaluation support for Radar Software Development (RSD) 1.5 software build. Also, will initiate and complete Test and Evaluation support for U.S. MM.  Also initiates Test and Evaluation Planning for remaining requirements including but not limited to test planning, test force and range support, interoperability compliance and third party performance reviews."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "APAF: BA04: Line Item # HAEUAV"
                                    },
                                    "Title": {
                                        "val": "RQ-4"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "118.360"
                                        },
                                        "CurrentYear": {
                                            "val": "11.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "65.403"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "65.403"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "103.935"
                                        },
                                        "BudgetYearThree": {
                                            "val": "29.699"
                                        },
                                        "BudgetYearFour": {
                                            "val": "31.534"
                                        },
                                        "BudgetYearFive": {
                                            "val": "29.908"
                                        },
                                        "CostToComplete": {
                                            "val": "432.821"
                                        },
                                        "TotalCost": {
                                            "val": "5079.019"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF: BA04: Line Item # RQ440P"
                                    },
                                    "Title": {
                                        "val": "RQ-4 Blk 40 Proc"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "10.691"
                                        },
                                        "CurrentYear": {
                                            "val": "1.747"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "12.438"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF: BA05: Line Item # HAWK00"
                                    },
                                    "Title": {
                                        "val": "RQ-4 Mods"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "6.997"
                                        },
                                        "CurrentYear": {
                                            "val": "9.313"
                                        },
                                        "BudgetYearOne": {
                                            "val": "21.354"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "21.354"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "46.127"
                                        },
                                        "BudgetYearThree": {
                                            "val": "34.493"
                                        },
                                        "BudgetYearFour": {
                                            "val": "89.248"
                                        },
                                        "BudgetYearFive": {
                                            "val": "67.265"
                                        },
                                        "CostToComplete": {
                                            "val": "487.907"
                                        },
                                        "TotalCost": {
                                            "val": "1140.417"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF: BA05: Line Item # RQ4GCM"
                                    },
                                    "Title": {
                                        "val": "RQ-4 GSRA\/CSRA Mods"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "23.668"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "328.708"
                                        },
                                        "TotalCost": {
                                            "val": "352.376"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDT&E: BA07: PE 0305238F"
                                    },
                                    "Title": {
                                        "val": "NATO AGS"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "192.571"
                                        },
                                        "CurrentYear": {
                                            "val": "221.589"
                                        },
                                        "BudgetYearOne": {
                                            "val": "232.851"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "232.851"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "138.400"
                                        },
                                        "BudgetYearThree": {
                                            "val": "39.604"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "825.015"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Continue to incrementally fund a sole source cost-plus fixed fee multi-year development contract to continue software development, integration, and testing on Global Hawk Block 40 platform.  Radar software development  1.5 software build, System level performance verification\/integrated system evaluation schedule extension and U.S. Maritime Modes are currently planned as cost-plus incentive fee."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "MP-RTIP"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Northrop Grumman Integrated Systems"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "El Segundo, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "143.604"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "14.178"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "6.826"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-04"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "7.543"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "7.543"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "32.724"
                                                    },
                                                    "TotalCost": {
                                                        "val": "204.875"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "IRT Study"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various,"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.105"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.105"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.105"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Logistics Planning"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Northrop Grumman Integrated Systems"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "El Segundo, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.667"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.667"
                                                    },
                                                    "TargetValue": {
                                                        "val": "3.667"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Joint Test Force, Edward AFB, Joint Interoperability Test Center, Navy, & IV&V"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various,"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "8.174"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.762"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.158"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.045"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.045"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "4.360"
                                                    },
                                                    "TotalCost": {
                                                        "val": "14.499"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "PMA: A&AS"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various,"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "22.063"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.234"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.759"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.929"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.929"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "8.520"
                                                    },
                                                    "TotalCost": {
                                                        "val": "36.505"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "PMA: Other Gov't Cost"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Boston, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.986"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.509"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2012-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.379"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.483"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.483"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "2.130"
                                                    },
                                                    "TotalCost": {
                                                        "val": "6.487"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0305220F_BPAC_67RTIP_0.jpg"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Depot Planning"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Functional Configuration Audit (LAB\/Qual\/Flight)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Test Phase 2B - Regression"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Test Phase 2B - Interoperability"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RSD 1.4.5 (additional software builds)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Test Phase 3 - ISE (SLPV)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RSD 1.5 software build (Post IOT&E Updates)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "OT&E Readiness &IOT&E"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "US MM Integration\/test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Remaining Requirements Design\/Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}