{
    "id": "b3977081c23547ba7f566826daec474df5580eea",
    "meta": {
        "filename": "dod-2015_RDTE_2015_NAVY_BA5_RDTE_JustificationBook_Navy_PB_2015.zzz_unzipped_RDTE_JustificationBook_Navy_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604231N"
        },
        "ProgramElementTitle": {
            "val": "Tactical Command System"
        },
        "R1LineNumber": {
            "val": "94"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "826.875"
            },
            "PriorYear": {
                "val": "65.416"
            },
            "CurrentYear": {
                "val": "63.438"
            },
            "BudgetYearOne": {
                "val": "70.248"
            },
            "BudgetYearOneBase": {
                "val": "70.248"
            },
            "BudgetYearTwo": {
                "val": "56.819"
            },
            "BudgetYearThree": {
                "val": "56.732"
            },
            "BudgetYearFour": {
                "val": "56.178"
            },
            "BudgetYearFive": {
                "val": "57.507"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Tactical Command System upgrades the Navy's Command, Control, Computer and Intelligence (C3I) systems and processes C3I information for all warfare mission areas including planning, direction and reconstruction of missions for peacetime, wartime and times of crises.\n\nTactical Support Center: The Tactical Mobile program provides evolutionary systems and equipment upgrades to support the Maritime Component Commanders (Expeditionary Ashore) and Maritime Patrol and Reconnaissance Force Commanders with the capability to plan, direct and control the tactical operations of Joint and Naval Expeditionary Forces and other assigned units within their respective area of responsibility. These operations include littoral, open ocean, and over land surveillance, anti-surface warfare, over-the-horizon targeting, counter-drug operations, power projection, antisubmarine warfare, mining, search and rescue, and special operations. The missions are supported by the Tactical Operations Centers (formerly Tactical Support Centers), the Mobile Tactical Operations Centers (formerly Mobile Operations Control Centers), and the Joint Mobile Ashore Support Terminal. TacMobile C2 systems are based on the Global Command and Control System - Maritime architecture which is Defense Information Infrastructure Common Operating Environment compliant.\n\nGlobal Command and Control System - Maritime (GCCS-M):  GCCS-M is the Maritime implementation of the Global Command and Control System (GCCS) Family of Systems (FoS).  It supports decision making at all echelons of command with a single, integrated, scalable C4I system that fuses, correlates, filters, maintains and displays location and attribute information on friendly, hostile and neutral land, sea and air forces, integrated with available intelligence and environmental information.  It operates in near real-time and constantly updates unit positions and other situational awareness data.  GCCS-M also records data in appropriate databases and maintains a history of changes to those records.  System users can then use the data to construct relevant tactical pictures using maps, charts, topography overlays, oceanographic overlays, meteorological overlays, imagery, and all-source intelligence information coordinated into a Common Operational Picture that can be shared locally and with other sites.  Navy commanders review and evaluate the general tactical situation, plan actions and operations, direct forces, synchronize tactical movements, and integrate force maneuver with firepower.  The system operates in a variety of environments and supports joint, coalition, and allied forces.  GCCS-M is implemented Afloat and at Ashore fixed command centers.  \n\nMission Planning:  The Joint Mission Planning System (JMPS) is the designated automated mission planning system for the Navy.  JMPS enables weapon system employment by providing the information, automated tools, and decision aids needed to rapidly plan aircraft, weapon, or sensor missions, load mission data into aircraft and weapons, and conduct post-mission analysis.  JMPS is a mission critical system which is a co-development effort between the United States Navy (USN) and United States Air Force (USAF). Common requirements are identified and capabilities are developed and prioritized in an evolutionary approach.  An individual JMPS Mission Planning Environment (MPE) is a combination of the JMPS framework, common capabilities, and the necessary system hardware required to satisfy mission planning objectives.  Most Tactical Naval Aviation platforms are dependent solely on JMPS to plan precision guided munitions, sensor systems, tactical data links, secure voice communications, and basic Safety of Flight functions.  The following type\/model\/series (T\/M\/S) naval aircraft are supported by JMPS:  AH-1W, F\/A-18 A-F, E-2C, EP-3E, EA-6B, AV-8B, S-3, V-22, Chief of Naval Air Training (CNATRA), EA-18G, MV-22, C-2, MH-53E, P-3, Aircraft Carrier Intelligence Center (CVIC), SH-60B\/F, HH-60H, CH-53D\/E, CH-46E, UH-1N, VH-3\/VH-60, AH-1Z, UH-1Y, MH-60R\/S and E-2D. All of the aforementioned T\/M\/S are required to transition to Microsoft Windows 7 before Microsoft XP support ends April 2014 by using Framework (FW) Version 1.3.5. An extension of Windows XP is planned to allow all naval aircraft to be supported during the transition.  Future JMPS platforms include: MQ-4C (Triton) and H-53K.  The next JMPS architecture version will support net-centric goals by providing route \"publish and subscribe\" capabilities, transition to 64 bit and emerging technology and Information Assurance (IA) requirements. Funding profile includes 64 bit development which requires a complete software restructure to address memory limitations and system errors resulting in JMPS computer crashes.  Failure to move to 64 bit will result in an inability to support future advanced platform mission planning needs based on processing space and capability.\n\nShipboard Local Area Network (LAN)\/Wide Area Network (WAN) : Integrated Shipboard Network System (ISNS):  ISNS provides Navy ships with reliable, high-speed SECRET and UNCLASSIFIED LANs, providing the network infrastructure (switches and drops to the PC), Basic Network Information Distribution Services and access to the Defense Information Systems Network WAN, Secure and Nonsecure Internet Protocol Router Network  (SIPRNET and NIPRNET) which are used by other hosted applications or systems such as Naval Tactical Command Support System, Global Command and Control System - Maritime, Defense Messaging System, Navy Standard Integrated Personnel System, Naval Mission Planning System, Theater Battle Management Core Systems, and Tactical Tomahawk Weapons Control System.  It enables real-time information exchange within the ship and between afloat units, Component Commanders, and Fleet Commanders, and is a key factor in the implementation of the Navy's portion of Joint Vision 2020.   \n\nNaval Tactical Command Support System (NTCSS): Enterprise Database and Maritime Logistics Data Network (MLDN): The NTCSS is a multi-function program designed to provide standard tactical support information systems to various afloat and associated shore-based fleet activities.  The mission is to provide the Navy and Marine Corps with an integrated, scalable system that supports the management of logistical information, personnel, material and funds required to maintain and operate ships, submarines, and aircraft.\n\nMaritime Tactical Command and Control (MTC2): MTC2 provides Navy with the ability to deliver maritime domain-unique tactical Command and Control (C2) capabilities from Maritime Operations Centers (MOC) down to the lowest tactical unit of operations and align to the Navy Tactical Cloud (NTC).  MTC2 supports alignment and provides interoperability of Navy C2 with the Department of Defense (DoD) joint C2 (jC2) way-forward.  The program also aligns to the jC2 data and service exposure and consumption goals, architectures, and Net-Centric Enterprise Service efforts.  These resources support the evolutionary acquisition, materiel solution analysis, technology development, engineering and software development of these capabilities.  Global Force Management - Data Initiative (GFM-DI) is the Department-wide enterprise solution that enables visibility\/accessibility\/sharing of data applicable to the entire DoD force structure.  GFM-DI is the enterprise solution for force structure representation and MTC2 will be the data source for the Navy's force structure representation.\n\nNavy Air Operations Command and Control (NAOC2): integrates and tests Air Force produced systems that provide for an integrated and  scalable planning system that provides standardized, secure, automated decision support for Air Force, Joint, and Allied commanders worldwide.  These programs provide automated air operations planning, execution management and intelligence capabilities at the Force level to include Fleet Commanders, Numbered Fleet Commanders, Commander Carrier Strike Group, Commander Expeditionary Strike Group, Commander Landing Force, and Joint Task Force Commanders. NAOC2 includes Theater Battle Management Core System (TBMCS), Command and Control Air and Space Operations Suite (C2AOS), plus Command, Control and Information Services (C2IS). C2AOS and C2IS are being developed as Service Oriented Architecture (SOA) services to allow for scalability and integration with Common Computing Environments (CCE). Continuation of these efforts will significantly enhance the Joint Force Air Component Commander (JFACC) and Combined Air Operations Center (CAOC) personnel to plan daily air operations including strike, airlift, offensive and defensive air, and tanker missions in support of combat operations, addressing the requirement of war fighter of distributed planning and execution processes and significantly improving Joint interoperability. TBMCS continues a hardware transition to CCEs such as Consolidated Afloat Networks and Enterprise Services (CANES). Currently, TBMCS is the key system that is used to conduct real world air planning in the Joint and Navy environment. C2AOS and C2IS will replace TBMCS in a SOA environment while bringing more flexibility to the war fighter, planner, and executor. \n\nFORCEnet:  Initiative's mission is to deliver Information Dominance by (a) accelerating the transformation to a Distributed, Networked force; (b) achieve interoperability based on Architectures and Standards; and (c) Experiment with, evaluate and employ the enabling technologies.  Effort is a non-acquisition program that is the operational instantiation of FORCEnet.  The end-state is a distributed network of weapons, sensors, Command and Control (C2), platforms and warriors.  \n\nTrident Warrior (TW): TW enables early delivery of Net-Centric Operation\/Warfare (NCO\/W) capabilities to the warfighter via Fleet-directed Trident Warrior operational events with an emphasis on delivering Maritime Domain Awareness (MDA) with Maritime Operations Center (MOC) capability."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "71.645"
                },
                "CurrentYear": {
                    "val": "68.463"
                },
                "BudgetYearOne": {
                    "val": "72.004"
                },
                "BudgetYearOneBase": {
                    "val": "72.004"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "65.416"
                },
                "CurrentYear": {
                    "val": "63.438"
                },
                "BudgetYearOne": {
                    "val": "70.248"
                },
                "BudgetYearOneBase": {
                    "val": "70.248"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-6.229"
                },
                "CurrentYear": {
                    "val": "-5.025"
                },
                "BudgetYearOne": {
                    "val": "-1.756"
                },
                "BudgetYearOneBase": {
                    "val": "-1.756"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.025"
                    }
                },
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-5.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.954"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "5.110"
                                },
                                "BudgetYearOneBase": {
                                    "val": "5.110"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.002"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-6.866"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-6.866"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-5.277"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Not applicable.\nSchedule:\n\nTACTICAL SUPPORT CENTER (Project 0486):\nN\/A\n\nGlobal Command and Control System - Maritime (GCCS-M) (Project 0709):\nEngineering milestones added to schedule to include Operational Test Readiness Review (OTRR). Due to the avail schedule of the targeted Operational Test (OT) platform shifting to the right, the following events were affected: Group Level - Operational Test Readiness Review shifted to Q3 2014, Group Level - Operational Test shifted to Q3 2014, and Group Level - Fielding Decision Review shifted to Q1 2015.\n\nNaval Tactical Command Support System (NTCSS) (Project 3032):\nIncreasing requirements in information security and functional capability have required shifts in the approach for systems design and development. The updated schedule reflects a more integrated plan to accomplish refined requirements, fact-of-life changes, and modernization of the NTCSS system.  As development approaches and build requirements are solidified, changes to the schedule will reflect more accurate time frames for multiple NTCSS system builds.\n\nMaritime Tactical Command and Control (MTC2) (Project 3323): \nMTC2 schedule and deliverables rebaselined as required to align efforts towards the Navy Tactical Cloud (NTC) Prototype in FY16."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0486."
                    },
                    "ProjectTitle": {
                        "val": "Tactical Support Center"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "110.795"
                        },
                        "PriorYear": {
                            "val": "4.698"
                        },
                        "CurrentYear": {
                            "val": "5.027"
                        },
                        "BudgetYearOne": {
                            "val": "4.254"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.254"
                        },
                        "BudgetYearTwo": {
                            "val": "5.356"
                        },
                        "BudgetYearThree": {
                            "val": "5.485"
                        },
                        "BudgetYearFour": {
                            "val": "5.656"
                        },
                        "BudgetYearFive": {
                            "val": "5.797"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Tactical\/Mobile program provides evolutionary systems and equipment upgrades to support Maritime Component Commanders (Expeditionary Ashore) and Maritime Patrol and Reconnaissance Force (MPRF) Commanders  with the capability to plan, direct, and control the tactical operations of Joint and Naval Expeditionary Forces and other assigned units within their respective area of responsibility.  These operations include littoral, open ocean, and over land all-sensor surveillance, anti-surface warfare, over-the-horizon targeting, counter-drug operations, power projection, antisubmarine warfare, mining, search and rescue, and special operations.\n\nThe missions are supported by the Tactical Operations Centers (TOCs), the Mobile Tactical Operations Centers (MTOCs), and the Joint Mobile Ashore Support Terminals (JMASTs).   Services provided include analysis and correlation of diverse sensor information; data management support; command decision aids; rapid data communication; mission planning, evaluation and dissemination of surveillance data and threat alerts to operational users ashore and afloat.  Tactical\/Mobile Command and Control systems are based on the Global Command and Control System - Maritime (GCCS-M) architecture, which is Defense Information Infrastructure (DII) Common Operating Environment (COE) compliant.\n \nTOCs and their equivalents provide Command, Control, Communications, Computers and Intelligence (C4I) capability, air-ground, satellite and point-to-point communications systems; sensor analysis capabilities; avionics and weapons system interfaces and facilities equipment.  MTOCs and their equivalents are scalable and mobile versions of the TOC for operations from airfields that do not have TOC support.  This program assures that existing TOCs and MTOCs are modernized to fulfill their operational requirements.  TOC\/MTOC will continue to provide the ground Command and Control capabilities and C4I interfaces for the Maritime Patrol and Reconnaissance Force (MPRF) Family of Systems (FOS) aircraft and systems evolution including P-3C aircraft updates to sensors and weapons systems, such as the Anti-Surface Warfare Maritime Improvement Program (AMIP), and the Command Control Communications Computers for Anti-Submarine Warfare (C4 for ASW) P-3C aircraft upgrades, P-8A Multi-mission Maritime Aircraft (MMA) Increment 1, as well as development of emergent, ground C4I support capabilities for the P-8A Poseidon Multi-mission Maritime Aircraft (MMA) Increment 2, Increment 3,  and the MQ-4C Triton Unmanned Aerial System. \n\nThe Joint Mobile Ashore Support Terminal (JMAST) supports the Fleet Commanders, Naval Component Commanders, and other military commanders from forward deployed bases or operational sites ashore that are not equipped with C4I facilities.  It provides the Navy Component, and other military commanders with flexible, mobile, organic response, to command, control and communicate with assigned forces via voice, video, and data media forms, during all aspects of military operations, including joint, combined, and coalition operations.  \n        \nThe TacMobile program was designated as an Acquisition Category (ACAT) III weapons system program July 2004 and is no longer directly associated with the GCCS-M program.  The TacMobile program follows an Evolutionary Acquisition approach, which provides a mechanism for adding a series of future capabilities that maintain and enhance the operational relevance of the systems provided, as well as augments improvements in airborne networking.  Transformation of the TOC\/MTOC Force to a more mobile, scalable, and Network-centric Services Oriented Architecture (SOA) configuration, convergence of TOC, MTOC to a single configuration, and as an integral component of the Maritime Patrol and Reconnaissance Force (MPRF) Family of Systems (FOS), operational C4I integration support for new and upgraded Maritime Patrol and Reconnaissance Aircraft (MPRA) such as MMA (Multi-mission  Maritime Aircraft), AIP, BAM UAS as well as other Command and Control (C2) and fighter aircraft are primary objectives.\n\nFY15: Funding supports final core TacMobile systems development and testing  to achieve interoperability with P-8A Posiedon Increment 2 and the MQ-4C Triton. Continues technical modernization to achieve increased modularity, and continues core development to enable establishment of additional security enclaves, and enhancing flexibility and mobility, to offset the size\/weight\/cube of additional required aircraft interfaces developed to support P-8A Increment 3, Advanced Airborne Sensor (AAS) and emerging Maritime Patrol and Reconnaissance Aircraft operations.  Network-centric Services Oriented Architecture (SOA) and airborne C4I integration efforts continue as improvements to airborne and Intelligence\/Surveillance\/Reconnaissance (ISR) networking technologies are matured.  Will achieve interoperability with emerging MPRF Aircraft and Sensors while reducing TacMobile footprint enhancing Mobility capability.\nThe DARK FUSION JCTD will provide intelligence analysts, joint warfighters, Combatant Commanders (COCOM) and other interagency senior decision makers significant maritime domain awareness (MDA) improvement, aimed at increased awareness of certain vessels and \"dark\" targets (e.g., smaller vessels, \"fast movers\/go fasts\", semi-submersibles, non-emitting vessels, etc.) not being detected by current means, using newly developed and under-utilized data sources. These vessels may not be emitting their normal complement of maritime signals (e.g., not participating in the electro-magnetic spectrum)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Net Ready"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.638"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Communications:  Continued study of alternatives for identified Joint Tactical Radio System (JTRS) and\/or other software definable radio options for incorporation into TacMobile (TM) communications architecture -- (TR 2.1.1).   Continued study for Range of Warfare Command and Control (ROWC2) reach-back Internet Protocol (IP) connectivity options for communications continuity -- (TR 2.1.1).  Commenced Maritime Patrol and Reconnaissance Force (MPRF)\/Air Anti-Submarine Warfare (ASW) Community of Interest (COI) data model development (an expansion of the ASW COI data model) -- (TR 2.1.1).  Conducted Services Oriented Architecture (SOA) instantiation on TacMobile prototype system for refinement of design implementation -- (TR 2.1.1).  Designed initial SOA testing, initiated coordination to conduct testing with Maritime Operational Laboratory Environment (MOLE) lab and other netted labs -- (TR 2.1.1).  Commenced update of Concept of Operations (CONOPS)\/ Concept of Employment (CONEMP)\/ Concept of Use (CONUSE) with capabilities for Multiple Security Enclaves (MSE) including higher than secret operations -- (TR 2.1.1 \/ Inc 3)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.638"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue Services oriented Architecture (SOA) design refinement -- (TR 2.1.1).  Continue Family of Systems collaboration on Maritime Patrol and Reconnaissance Force (MPRF)\/Air Anti-Submarine Warfare (ASW) Community of Interest (COI) data model -- (TR 2.1.1). Commence Tactical Operations Center (TOC)\/Mobile Tactical Operations Center (MTOC) Content Management Extensible Markup Language (XML) Data Dictionary and XML Schema development in support of the MPRF\/Air ASW COI data model -- (Inc 3).  Finalize Automated Digital Network System (ADNS) and Full Motion Video (FMV) designs and commence test and implementation -- (TR 2.1.1).  Continue Increment 3 Department of Defense Architecture Framework (DoDAF) product development. Commence TacMobile (TM) Data Strategy, Information Support Plan (ISP), and Capabilities Production Document (CPD) for Increment 3.  Commence Wideband Beyond Line of Sight (BLOS) Satellite Communications (SATCOM) requirements analysis -- (Inc 3).  Begin identifying requirements to evolve legacy point to point exchanges of information to utilize Services Oriented Architecture (SOA) and new technologies and down select sustainable technologies -- (TR 2.1.1).  Refine Measures of Effectiveness to maintain integrated requirements management with Increment 3 architecture elements -- (Inc 3)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.638"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.638"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue Services Oriented Architecture (SOA) design implementation and test -- (TR 2.1.1).   Commence initial Tactical Operations Center (TOC) Operational Control (OPCON) Prototype SOA (TOPS) fielding in TR 2.1.1.  Continue Automated Digital Network System (ADNS) and Full Motion Video (FMV) implementations -- (TR 2.1.1).  Continue Family of Systems collaboration on Maritime Patrol and Reconnaissance Force (MPRF)\/Air Anti-Submarine Warfare (ASW) Community of Interest (COI) data model development to support SOA environment with Extensible Markup Language (XML) schema and Tactical Operations Center (TOC)\/Mobile Tactical Operations Center (MTOC) Content Management XML Data Dictionary -- (Inc 3).  Mature TacMobile (TM) Data Strategy, Information Support Plan (ISP), and Capabilities Production Document (CPD) for Increment 3, supporting P-8A Poseidon Inc 3 - (Inc 3). Finalize TOC\/MTOC Operational view and System view Department of Defense Architecture Framework (DoDAF) products, and integrate to the MPRF\/Air ASW COI Family of Systems DoDAF products -- (Inc 3)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tactical Mobile Acoustic Support System (TACMASS)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.736"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conducted development testing of selected enhanced broadband processing capabilities - (TR 2.1.1).  Began integration and developmental testing of Acoustic Intercept System updated screeners - (TR 2.1.1).  Continued development and integration of analysis capabilities to support evolving data standards and media interfaces for Maritime Patrol Aircraft Intelligence\/Surveillance\/Reconnaissance (ISR) and Anti-Submarine Warfare (ASW) sensor systems - (TR 2.1.1).  Continued integration and begin developmental testing of Improved and Advanced Multi-Static Acoustic Analysis capabilities required to support fielding of P-8A Poseidon Increment 2 - (TR 2.1.1).  Continued integration and began developmental testing of High Altitude ASW (HAASW) capabilities -- (TR 2.1.1).  Established Analysis of Alternatives for expeditionary post flight analysis capability.  Began requirements analysis for Advance Airborne Systems (AAS) -- (Inc 3)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.736"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue Multistatic Active Coherent (MAC), High Altitude ASW (HAASW), High Altitude Anti Submarine Warfare (ASW) Weapons Capability (HAAWC),   and Automatic Identification System (AIS) integration system testing to support fielding of P-8A Poseidon Increment 2 -- (TR 2.1.1).  Down select alternative on expeditionary post flight analysis capability -- (TR 2.1.1).  Commence design support of P-8A Poseidon Increment 2 Engineering Change Proposal (ECP) 3 -- (TR 2.1.1 \/ Inc 3).  Continue requirement analysis and support preliminary Design Review (PDR) of P-8A Poseidon Increment 3 -- (Inc 3)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.736"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.736"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Commence implementation of P-8A Poseidon Increment 2 Engineering Change Proposal (ECP) 1 and ECP 2 -- (TR 2.1.1) and further requirements analysis and design of P-8A Poseidon Increment 2 ECP 3 -- (TR 2.1.1 \/ Inc 3).   Continue requirement analysis and commence design of TacMobile system in support of P-8A Poseidon Increment 3 -- (Inc 3)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aircraft Interfaces"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.583"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Media: Continued to evaluate interfaces required to support MQ-4C Triton Unmanned Aerial System (UAS) to ensure platform Warfighting wholeness.  Continued to evaluate and assess network-centric interfaces -- (TR 2.1.1).  Began development of those interfaces required to support P-8A Poseidon Increment 2 -- (TR 2.1.1).  Began requirements analysis for Advanced Airborne Sensor (AAS) -- (Inc 3).  Began analysis of integration requirements for P-8A Increment 3 -- (Inc 3)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.583"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Media: Continue development of those interfaces required to support P-8A Poseidon Increment 2 Engineering Change Proposal (ECP) 1 and ECP 2 -- (TR 2.1.1).  Commence P8 Poseidon Increment 2 ECP 3 requirements support -- (TR2.1.1). Continue production support in the form of requirements analysis and design work on TacMobile (TM) 1-1 Engineering Development Model (EDM) for Advanced Airborne Sensor (AAS) -- (Inc 3). Continue analysis of integration requirements for P-8A Poseidon Increment 3 trading off impacts from Applications Based Architecture (ABA) architecture -- (Inc 3). Support P8 Poseidon Increment 3 System Requirements Review (SRR) 2 and Technical Requirements Analysis (TRA) -- (Inc 3). Support interface design for Net Enabled Weapon and T-Sized Stores -- (Inc 3). Continue study of alternatives for P-8A Poseidon Fly Away Kits (FAK), for media grooming and split deployment support -- (Inc 3)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.583"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.583"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Commence test and production of P8 Poseidon Increment 2 ECP 1 and ECP 2 required TM support -- (TR 2.1.1).  Support all P-8A Poseidon Increment 2 Operational Evaluations (OPEVALs)-- (TR 2.1.1)   Continue refining Advanced Airborne Systems (AAS) and TacMobile (TM) stack integration -- (TR 2.1.1). Support P8 Poseidon Increment 3 preliminary Design Review (PDR) 1 -- (Inc 3)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tactical Data Links"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.158"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued assessment in preparation for prioritization and down select Analysis of Alternatives (AoA) options for development of TacMobile Tactical Data Link (TADIL) transition roadmap -- (Inc 3)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.160"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Study LINK-11 sundown plan, impacts on TacMobile, and potential adoption of LINK-22 \/NATO Improved Link Eleven (NILE) -- (Inc 3). Assess implementation of LINK-16 Concurrent Multi-Netting (CMN), adoption of Multifunctional Information Distribution System Joint Tactical Radio System (MIDS JTRS), and adoption of Tactical Targeting Network Technology (TTNT) -- (Inc 3)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.160"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.160"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Commence design for selected Tactical Targeting Network Technology (TTNT)  and Multifunctional Information Distribution System Joint Tactical Radio System (MIDS JTRS) Courses of Action (COA) -- (TR 2.1.1) Commence requirements analysis on Common Data Link Upgrade, Broadcast Intelligence Analysis, Joint Range Extension, Third Party Targeting -- (Inc 3)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enterprise Solutions"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.581"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Began integration and developmental testing of tactical mobile networking infrastructure to comply with net ready, Defense Information Systems Agency (DISA) and Navy Net-Centric Operating standards that support evolutionary transition to a Consolidated Afloat Network Enterprise Services (CANES) compatible Services Oriented Architecture (SOA) with Multiple Security level Enclaves (MSE, formerly called Multi-level Enclaves (MLE)) accessibility -- (TR 2.1.1 \/ Inc 3). Began developmental testing of data at rest storage, data content management, and security requirements for P-8A Poseidon Increment 2 -- (TR 2.1.1).  Assessed available options for incorporation of appropriate Distributed Common Ground System Navy (DCGS-N) capabilities -- (Inc 3)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.580"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop requirements for assessed option preference of appropriate Distributed Common Ground System Navy (DCGS-N) capabilities -- (Inc 3).  Continue development of mature Multiple Security level Enclaves (MSE, formerly called Multi-level Enclaves (MLE)) design -- (Inc 3).  Conduct Analysis of Alternatives on Mass Storage requirements for TacMobile including P-8A Poseidon Increment 3 and Advanced Airborne Sensor (AAS) -- (Inc 3). Maturing design of data content management and security requirements for P-8A Poseidon Increment 2 -- (TR 2.1.1).  Continuing to assess DCGS-N capabilities -- (Inc 3).  Commence Applications Based Architecture (ABA) requirements analysis, Just a Bunch of Disks (JBOD) replacement (Removable Media Consolidation) -- (Inc 3)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.580"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.580"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue with Applications Based Architecture (ABA) requirements analysis, and commence ABA design for TacMobile (TM) systems -- (Inc 3). Continue with Just a Bunch of Disks (JBOD) replacement requirement analysis, and commence JBOD design for TM systems - (Inc 3).  Continue development of Multiple Security level Enclaves (MSE) and design of Distributed Common Ground System Navy (DCGS-N) TM implementation -- (Inc 3).  Commence development of next generation Mass Storage requirement -- (Inc 3)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Command and Control (C2)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.402"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Identified Global Command and Control System - Maritime (GCCS-M ) 4.1 Group Level as  GCCS-M 4.0.3 replacement option to provide Intelligence Preparation of the Battle Space capabilities, access to Signal Intelligence (SIGINT), Electronic Warfare (EW), and General Military Intelligence database products, and Common Operational Picture (COP) management, display, and processing capabilities that meet information assurance standards and maintains interoperability -- (TR 2.1.1).  Continued integration of follow on Command and Control (C2) prototype -- (TR 2.1.1).  Began developmental test and integration of a correlator, to support Maritime Patrol and Reconnaissance Force (MPRF) Commander Task Force (CTF) C2 requirements and C2 track data correlation and fusion tool options -- (TR 2.1.1 \/ Inc 3)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.402"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Implement Tactical Operations Center (TOC) Operational Control (OPCON) Prototype Services Oriented Architecture (SOA) (TOPS) Situational Awareness (SA) into TacMobile (TM) SOA -- (TR 2.1.1).  Begin requirements analysis and design for Advanced Airborne Sensor (AAS) as part of TacMobile Multiple Security level Enclaves (MSE, formerly called Multi-level Enclaves (MLE)) system development -- (TR 2.1.1). Complete Global Command and Control System - Maritime (GCCS-M) replacement option design analysis Maritime Tactical Command and Control (MTC2) in TM architecture -- (Inc 3)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.402"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.402"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue Tactical Operations Center (TOC) Operational Control (OPCON) Prototype Services Oriented Architecture (SOA) (TOPS) implementations thru phase 5 -- (TR 2.1.1).   Continue requirements analysis and commence development of Advanced Airborne Sensor (AAS) system as part of TacMobile (TM) Multiple Security level Enclaves (MSE0 -- (Inc 3). Implement Complete Global Command and Control System - Maritime (GCCS-M) Group Level (GCCS-M GL) 4.1 and continue to assess next generation Maritime Tactical Command and Control (MTC2) -- (Inc 3)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Maritime Patrol and Reconnaissance Force (MPRF) Interoperability\/TacMobile Footprint Reduction"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.600"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Began developmental testing and evaluation of P-8A Poseidon Increment 2 and MQ-4C Triton Unmanned Aerial System (UAS) mission planning interoperability upgrades -- (TR 2.1.1).  Began TacMobile Architecture Simplification (TAS) developmental testing and integration of modular and hardware independent solutions to reduce mobile system architecture footprint on prototype system -- (TR 2.1.1).  Continued developmental Testing for convergence of Tactical Operations Center and Mobile Tactical Operations Center architecture toward common baseline to reduce platform unique training requirements and duplicative life cycle logistics costs -- (TR 2.1.1).  Conducted Analysis of Alternatives of automated TacMobile system functionality to reduce operator workload, to offset increasing MPRF Intelligence Surveillance and Reconnaissance (ISR) Mission\/Function\/Task growth -- (TR 2.1.1).  Continued design to achieve reduction and consolidation of Maritime Patrol and Reconnaissance Aircraft (MPRA) media interface devices and to optimize data transfer rates -- (TR 2.1.1).  Developed initial functionality that will support Multiple Security Enclaves (MSE) in an expeditionary operating environment -- (Inc 3)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.928"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct full system integration of P-8A Poseidon Aircraft Increment 2 Mission Planning interoperability upgrades -- (TR 2.1.1).  Continue full system testing and integration of modular and hardware independent solutions to reduce mobile system architecture footprint -- (TR 2.1.1).  Complete developmental Testing for convergence of Tactical Operations Center (TOC) and Mobile Tactical Operations Center (MTOC) architecture toward common baseline to reduce platform unique training requirements and duplicative life cycle logistics costs -- (TR 2.1.1). Down select Analysis of Alternatives of automated TacMobile (TM) system functionality to reduce operator workload, to offset increasing Maritime Patrol and Reconnaissance Force (MPRF) Intelligence Surveillance and Reconnaissance (ISR) Mission\/Function\/Task growth and develop an engineering design model -- (TR 2.1.1).  Complete implementing all hardware design optimizations which reduce and consolidate TM footprint and any Maritime patrol and Reconnaissance Aircraft (MPRA) media changes -- (TR 2.1.1). Utilize technology that best optimizes data transfer rates -- (Inc 3). Continue with development of Multiple Security level Enclaves (MSE, formerly called Multi-level Enclaves (MLE))  -- (Inc 3)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.155"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.155"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Commence design model development of automated TacMobile system functionality to reduce operator workload, to offset increasing Maritime Patrol and Reconnaissance Force (MPRF) Intelligence Surveillance and Reconnaissance (ISR) Mission\/Function\/Task -- (TR 2.1.1). Utilize technology that continues best optimizes data transfer rates -- (Inc 3). Continue with development of Multiple Security level Enclaves (MSE) -- (Inc 3)."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPN\/2246"
                                    },
                                    "Title": {
                                        "val": "MPRF Mission Support"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "16.965"
                                        },
                                        "CurrentYear": {
                                            "val": "18.130"
                                        },
                                        "BudgetYearOne": {
                                            "val": "14.390"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "14.390"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "13.867"
                                        },
                                        "BudgetYearThree": {
                                            "val": "14.287"
                                        },
                                        "BudgetYearFour": {
                                            "val": "14.561"
                                        },
                                        "BudgetYearFive": {
                                            "val": "14.887"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "OPN\/2906"
                                    },
                                    "Title": {
                                        "val": "TacMobile"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "14.435"
                                        },
                                        "CurrentYear": {
                                            "val": "18.189"
                                        },
                                        "BudgetYearOne": {
                                            "val": "16.766"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "16.766"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "14.489"
                                        },
                                        "BudgetYearThree": {
                                            "val": "14.926"
                                        },
                                        "BudgetYearFour": {
                                            "val": "15.214"
                                        },
                                        "BudgetYearFive": {
                                            "val": "15.550"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Evolutionary Acquisition -  Increment 2.0 provided enhanced Beyond Line of Sight (BLOS) Global Information Grid (GIG) reach back capability, and supports Maritime Situational Awareness connectivity enhancements for data exchange with Maritime Patrol and Reconnaissance Force (MPRF) aircraft and with Coalition data networks.  It incorporates Anti Submarine Warfare (ASW) acoustical analysis improvements and new P-3 aircraft ASW interfaces.  Increment 2.1 supports migration to follow on Global Command and Control System - Maritime (GCCS-M ) version 4.0.3 and introduction of the P-8A Multi-mission Maritime Aircraft (MMA) Increment 1.  Tech Refresh 2.1.1 will support technical engineer changes associated with the introduction of P-8A Multi-mission Maritime Aircraft (MMA) Increment 2, MQ-4C Triton Unmanned Aerial System (UAS), and migration to GCCS-M 4.1 Group Level. Increment 3 will incorporate support for other Maritime Patrol and Reconnaissance Force (MPRF) Family of Systems (FOS) Aircraft and Systems.\nThe Dark Fusion Joint Capabilities Technical Demonstration (JCTD) acquisitions will be executed by the JCTD Technical Manager (TM).  The TM is the Naval Research Laboratory (NRL)."
                        },
                        "PerformanceMetrics": {
                            "val": "The primary metrics utilized by the TacMobile program development process, include achieving\/maintaining all required Interface Exchange Requirements (IER's)  and successful achievement of 100% of Key Performance Parameters for incremental upgrade threshold capabilities, as observed by Commander Operational Test Force representatives during Operational Evaluation.  TacMobile Inc 2.1 development supported increased IER requirements of 486% from 112 to 544.  Development to support these new IER's taperd off in FY-12 as the  Increment entered the Operational Evaluation Phase.  Development focus then shifted to efforts required to retain fielded IER's and update IER's to comply with emerging and evolving standards associated with P-8A Multi-mission Maritime Aircraft (MMA) Increment 2, and the MQ-4C Triton Unmanned Aerial System (UAS), other Maritime Patrol and Reconaissance Force (MPRF) Family of Systems (FOS) Aircraft and Systems, and evolving operational employment concepts. Increment 3 development will increase IER's by extending the TacMobile  core to extend capabilities into higher than SECRET enclaves.  The quantification of the increase in IER's will be dependent upon final requirements which are still being defined.\nCritical Operating Issues (COIs) and Measures of Performance (MOPs) are outlined in the Dark Fusion JCTD Implementation Directive.  The JCTD will be conducting User Juries (UJs) for SME and analyst\nfeedback."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0604231N_0486_DOT_L39_FILE1.PNG"
                                }
                            }
                        ]
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "0709"
                    },
                    "ProjectTitle": {
                        "val": "GCCS-M Maritime Applications"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "194.634"
                        },
                        "PriorYear": {
                            "val": "5.141"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "199.775"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "GCCS-M is the Maritime implementation of the Global Command and Control System (GCCS) Family of Systems (FoS).  It supports decision making at all echelons of command with a single, integrated, scalable C4I system that fuses, correlates, filters, maintains and displays location and attribute information on friendly, hostile and neutral land, sea and air forces, integrated with available intelligence and environmental information.  It operates in near real-time and constantly updates unit positions and other situational awareness data.  GCCS-M also records data in appropriate databases and maintains a history of changes to those records.  System users can then use the data to construct relevant tactical pictures using maps, charts, topography overlays, oceanographic overlays, meteorological overlays, imagery, and all-source intelligence information coordinated into a Common Operational Picture that can be shared locally and with other sites.  Navy commanders review and evaluate the general tactical situation, plan actions and operations, direct forces, synchronize tactical movements, and integrate force maneuver with firepower.  The system operates in a variety of environments and supports joint, coalition, and allied forces.  GCCS-M is implemented Afloat and at Ashore fixed command centers."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "GCCS-M Increment 2"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.374"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed development, integration, and testing of GCCS-M Increment 2 for Group Level ships.  Completed transition of GCCS-M Increment 2 on Force, Group and Unit Level ships to the Common Computing Environment (CCE)\/Consolidated Afloat Networks Enterprise Services (CANES) environment.  Completed assimilation of requirements for developing new interfaces with PEO IWS Combat Systems (AEGIS) and systems for other Services, Agencies, and traditional and non-traditional partners.  Investigated and adopt Service Oriented Environment (SOE) to further the continued development of maritime tactical command and control capabilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Global Force Management - Data Initiative (GFM-DI)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.767"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Performed systems engineering and architecture efforts to analyze GFM-DI requirements and begin architecture development in order to support Naval integration and extension of enterprise force structure data."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPN\/2618"
                                    },
                                    "Title": {
                                        "val": "Navy Command and Control System (GCCS-M only)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "8.137"
                                        },
                                        "CurrentYear": {
                                            "val": "5.515"
                                        },
                                        "BudgetYearOne": {
                                            "val": "3.479"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "3.479"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "1.840"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.861"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.715"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.721"
                                        },
                                        "CostToComplete": {
                                            "val": "8.891"
                                        },
                                        "TotalCost": {
                                            "val": "41.651"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Increment 2 delivers two different materiel solutions: (1) Force Level, based on the Global Command and Control System-Joint (GCCS-J) 4.2 or higher software, and (2) Group and Unit Level, based on the Office of Naval Research (ONR) extensible Common Operational Picture (XCOP) software.  This approach satisfies the current validated requirements, supports the accelerated retirement of legacy systems, and reduces overall risk to the program.  Each solution will integrate maritime-specific capabilities and will be scalable to the ship class.\n\nThe Global Command and Control System-Maritime (GCCS-M) Program Office promotes full and open competition by competitively awarding software and Fleet support engineering services contracts.  Additionally, the Program Office has awarded a Command and Control (C2) Indefinite Delivery Indefinite Quantity (IDIQ) Multi-Award Contract (MAC) from which two delivery orders were awarded to SAIC, one of the C2 IDIQ MAC awardees."
                        },
                        "PerformanceMetrics": {
                            "val": "GCCS-M Increment 2 leverages software investments by Defense Information Systems Agency (DISA) and ONR to realize both the Force Level and Group\/Unit Level materiel solutions.  This greatly reduces the integration and testing costs associated with each software release.  The Force Level solution will reside on Common Computing Environment\/Consolidated Afloat Networks and Enterprise Services (CCE\/CANES) architecture; the Group\/Unit Level solution will be implemented on the current\/future infrastructure.  These Increment 2 software-only solutions eliminate the GCCS-M hardware procurement, installation and sustainment costs."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0604231N_0709_FILE1.PNG"
                                }
                            }
                        ]
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2213"
                    },
                    "ProjectTitle": {
                        "val": "Mission Planning"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "251.060"
                        },
                        "PriorYear": {
                            "val": "23.104"
                        },
                        "CurrentYear": {
                            "val": "20.059"
                        },
                        "BudgetYearOne": {
                            "val": "36.097"
                        },
                        "BudgetYearOneBase": {
                            "val": "36.097"
                        },
                        "BudgetYearTwo": {
                            "val": "25.704"
                        },
                        "BudgetYearThree": {
                            "val": "24.289"
                        },
                        "BudgetYearFour": {
                            "val": "22.129"
                        },
                        "BudgetYearFive": {
                            "val": "22.570"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Mission Planning:  The Joint Mission Planning System (JMPS) is the designated automated mission planning system for the Navy.  JMPS enables weapon system employment by providing the information, automated tools, and decision aids needed to rapidly plan aircraft, weapon, or sensor missions, load mission data into aircraft and weapons, and conduct post-mission analysis.  JMPS is a mission critical system which is a co-development effort between the United States Navy (USN) and United States Air Force (USAF). Common requirements are identified and capabilities are developed and prioritized in an evolutionary approach.  An individual JMPS Mission Planning Environment (MPE) is a combination of the JMPS framework, common capabilities, and the necessary system hardware required to satisfy mission planning objectives.  Most Tactical Naval Aviation platforms are dependent solely on JMPS to plan precision guided munitions, sensor systems, tactical data links, secure voice communications, and basic Safety of Flight functions.  The following type\/model\/series (T\/M\/S) naval aircraft are supported by JMPS:  AH-1W, F\/A-18 A-F, E-2C, EP-3E, EA-6B, AV-8B, S-3, V-22, Chief of Naval Air Training (CNATRA), EA-18G, MV-22, C-2, MH-53E, P-3, Aircraft Carrier Intelligence Center (CVIC), SH-60B\/F, HH-60H, CH-53D\/E, CH-46E, UH-1N, VH-3\/VH-60, AH-1Z, UH-1Y, MH-60R\/S and E-2D. All of the aforementioned T\/M\/S are required to transition to Microsoft Windows 7 before Microsoft XP support ends April 2014 by using Framework (FW) Version 1.3.5. An extension of Windows XP is planned to allow all naval aircraft to be supported during the transition.  Future JMPS platforms include: MQ-4C (Triton) and H-53K.  The next JMPS architecture version will support net-centric goals by providing route \"publish and subscribe\" capabilities, transition to 64 bit and emerging technology and Information Assurance (IA) requirements. Funding profile includes 64 bit development which requires a complete software restructure to address memory limitations and system errors resulting in JMPS computer crashes.  Failure to move to 64 bit will result in an inability to support future advanced platform mission planning needs based on processing space and capability."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "JMPS Framework (FW)  & Common Capabilities Development"
                                    },
                                    "Description": {
                                        "val": "Due to the end of Microsoft support for Windows XP in April 2014, there is a requirement to change to Windows Operating System (OS) 7.  FW Version 1.3.5 incorporates Windows OS 7 and provides additional capabilities for all naval aircraft to include air drop, air refueling and enhanced installation. Funding for FW will be used to support system engineering processes, management interface controls, software architectural analysis, requirements management and a centralized website for Mission Planning Environment (MPE) developers.  FW 1.4 will be incorporated in future FW versions to address migration to .NET environment and to enable interoperability improvements through utilization of services. FW 64 bit development efforts will start in FY14.  If a transition to 64-Bit architecture is delayed or minimized, the fleet will experience increased mission planning interruptions (crashes) with future Mission Planning Environments (MPE) as a result of legacy and new 32-Bit applications shared utilization of the 4G RAM limitation associated with 32-bit operating system (64-Bit provides 192GB RAM). Additionally, as platform(s) requirements emerge for new and enhanced mission planning capabilities, the demand for more complex integrated applications and software products increases. Ultimately, without this planned transition to a 64-Bit architecture, the volume of integrated mission planning capability for the fleet will be limited and restricted. Common capabilities software updates augment core mission planning capabilities across multiple aircraft."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conducted FW 1.3.5 testing with the objective to Initial Operational Capability (IOC) Windows 7 compatible system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.400"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Start Framework 64 bit transition."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.594"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.594"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Full initiation and implementation of the JMPS Framework 64-Bit transition development activities. The goal of this critical activity is to leverage the technical advantages of 64-bit technology in an effort to address current physical memory access and utilization limitations associated with the fielded Mission Planning Environment (MPE); thus eliminating systems interruptions (crashes) while increasing mission planning performance for the fleet.  This effort will also specifically address continued obsolescence maintenance and cost issues associated with legacy 32-bit JMPS software and applications.  The major events initiated under this activity include the re-coding of 2.38 million Lines of Logical Code (LOLC) for the JMPS Framework Core (Basic Flight Planning Capabilities) and JMPS Framework Common Components  for MPE\/UPCs, including significant efforts for the F\/A-18 A-F platforms."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint Mission Planning System Expeditionary (JMPS-E)"
                                    },
                                    "Description": {
                                        "val": "JMPS Expeditionary (JMPS-E): The goal of the JMPS-E team is to produce a scalable, tailorable, mission planning and execution monitoring tool for Amphibious Squadron staffs.  The primary focus of this system is to provide an automated capability to assist planners with mission analysis, course of action development and automated creation of doctrinal orders based on planning data in the system.  Current expeditionary planning is done manually on paper charts.  JMPS-E will provide a digital map enabling better response times to changing plans, easier distribution of planning artifacts and a reduction in human error during the planning process.  The variety and geographically separated nature of forces involved with Ship to Shore Maneuver amplifies the need for web-based technologies to enable collaborative planning, improve overall situational awareness and enable the monitoring of mission execution from different locations.  The primary outputs are tasking orders, route plans, battlespace geometries and decision briefs.  The system will also incorporate modeling and simulation tools to rehearse and deconflict mission plans.  This capability will be initially fielded using Framework Version 1.2.4.  JMPS-E will start Windows 7 Operating System transition efforts in FY13."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.293"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Initiated development, integration and testing of JMPS-E Mission Planning Environment (MPE) Version 2.0.0 to satisfy Windows 7 requirement."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.260"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete development and intermediate testing of JMPS-E MPE Version 2.0.0 to satisfy Windows 7 requirement."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.740"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.740"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop, integrate and test JMPS-E MPE Version 2.0.1."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mission Planning Environment (MPE) Integration and Test"
                                    },
                                    "Description": {
                                        "val": "Mission Planning Environment (MPE) Integration and Test efforts support the Navy's developmental testing\/operational testing, integration and system of system testing for MPE fielding.  Efforts consist of integration of components provided by various developers into a platform-centric MPE and testing of the integrated MPE.  MPE integration and testing results in a consistent and repeatable system configuration that enables stability and reliability.  Due to the end of Microsoft support for Windows XP in April 2014, there is a Mission Planning Environment (MPE) requirement to change to Windows Operating System (OS) 7."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "21.311"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Due to the end of Microsoft support for Windows XP in April 2014, there is a MPE requirement to change to Windows Operating System (OS) 7. Additional test and requirement verifications were required to ensure product stability to satisfy all platforms. Continued integration and test of 32 MPEs : AV-8B H61 4.0, MQ-4C 1.0, C-130 1.0 and 2.0, C-2A 3.0, CH-53K 1.0, CNATRA 1.0, E-2C 4.0 and 5.0, E-2D 1.0 and 2.0, EA-6B I3B5 6.0 and I3B6 7.0, F\/A-18 H8E\/2.4.0, 25X\/2.5.0, H10E\/27X\/3.0 and 27X\/3.1, Marine Helo  2.1, 3.0 and 4.0, MH-60R\/S 1.0 and 2.0, NLH 2.0, P-3 3.0, P-8 1.0 and 2.0, TacMobile 1.0 and 2.0, V-22 1.2, 2.0 and 3.0, VH-3\/VH-60 2.0."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.399"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Integration and test of MPEs in support of 36 aircraft Type\/Model\/Series (T\/M\/S)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.763"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.763"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Integration and test of MPEs in support of 43 aircraft T\/M\/S and increased efforts associated with platform integration to meet Initial Operational Capability (IOC) which include Triton and CH-53K."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPN\/287600"
                                    },
                                    "Title": {
                                        "val": "Naval Mission Plng System"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "9.411"
                                        },
                                        "CurrentYear": {
                                            "val": "14.131"
                                        },
                                        "BudgetYearOne": {
                                            "val": "13.950"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "13.950"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "13.905"
                                        },
                                        "BudgetYearThree": {
                                            "val": "10.521"
                                        },
                                        "BudgetYearFour": {
                                            "val": "10.373"
                                        },
                                        "BudgetYearFive": {
                                            "val": "10.596"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTE\/3858,5302,5380"
                                    },
                                    "Title": {
                                        "val": "Air Force Mission Plng Systems"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "69.377"
                                        },
                                        "CurrentYear": {
                                            "val": "62.605"
                                        },
                                        "BudgetYearOne": {
                                            "val": "86.628"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "86.628"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "86.700"
                                        },
                                        "BudgetYearThree": {
                                            "val": "78.456"
                                        },
                                        "BudgetYearFour": {
                                            "val": "79.010"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Engineering Manufacturing Development efforts:  The strategy entails a two-phased evolutionary approach to acquire the initial Joint Mission Planning System (JMPS) development effort.  Phase I was a combined United States Air Force (USAF) \/ United States Navy (USN) effort that obtained various studies, extensive joint requirements analysis, design to cost estimates, an architecture concept, and development statement of work.  The Program's Phase I was planned to identify reduced costs strategies through software reuse from both USN Tactical Automated Mission Planning Systems and USAF Air Force Mission Support Systems (AFMSS) legacy mission planning programs.  Additionally, this phase provided a risk reduction plan by identifying the most effective migration of existing mission planning systems.  Phase I was awarded to two contractors,  Post Phase I during the down select process, one contractor was selected to develop the JMPS architecture work and Version 1.0 basic flight planning components. Phase II focused on strike planning requirements (i.e., support Precision Guided Missions and other tactical data load intensive missions) in order to migrate platforms from legacy mission planning systems to JMPS.   The USAF continued development of JMPS Version 1.3 and has contractual control of the program which is facilitated via a Mission Planning Enterprise Contract.  The USN continued limited development in Joint Mission Planning System (JMPS) Version 1.2 which was focused on helicopter platform migrations.  USN integration and fielding strategy changed to support a Mission Planning Environment focus, where framework and common components are integrated as bundled packages and fielded by airwings.  The completion of Phase II is targeted for JMPS Version 1.3.5, which focuses on a transition to Windows 7 that both the USAF and USN will use.  As platforms plan their migration to JMPS, the acquisition strategy, plan, and baseline will be updated in order to drive the retirement of legacy mission planning systems."
                        },
                        "PerformanceMetrics": {
                            "val": "Average time to plan a flight:  Threshold value is  < 1 hour average time to plan a flight that includes a Military Training Route (MTR), routing to and from the MTR, kneeboard card production, Instrument Flight Rules (IFR) flight planning materials and a Data Transfer Device (DTD) Load.     \nObjective value is < 30 minutes average time to plan a flight that includes a MTR, routing to and from the MTR, kneeboard card production, IFR flight planning materials and a DTD Load. \n\nInteroperability:  Threshold value is 100% of top level Interoperability Exchange Requirements (IERs) designated critical will be satisfied.   \nObjective value is 100% of top level IERs will be satisfied."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0604231N_2213_FILE1.PNG"
                                }
                            }
                        ]
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2307"
                    },
                    "ProjectTitle": {
                        "val": "Shipboard LAN\/WAN"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.300"
                        },
                        "PriorYear": {
                            "val": "0.029"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "0.329"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Shipboard LAN \/ WAN \/ Integrated Shipboard Network System (ISNS) provides Navy ships, including submarines, and Ashore sites with reliable, high-speed SECRET and UNCLASSIFIED Local Area Networks (LAN)s and wireless network technologies. The LAN provides Basic Network Information Distribution Services (BNIDS) and access to the Defense Information Systems Network (DISN) Wide Area Network (WAN) (Secure and Nonsecure Internet Protocol Router Network -SIPRNet and NIPRNet).  It provides the network infrastructure and services to enable real-time information exchange within the ship and between afloat units, Component Commanders, and Fleet Commanders.  It is a key factor in the implementation of the Navy's portion of Joint Vision 2020 and the migration of existing legacy systems into the IT-21 strategy.  Program funding supports the design, development and testing of the ISNS LAN for surface ships, shore sites, and SubLAN for submarines.  \n\nThe ISNS program maximizes the use of both Commercial off the Shelf (COTS) software and hardware.  Engineering and technical support is provided so that existing systems will keep pace with hardware and software that continues to be commercially supported.  ISNS uses a combination of high speed wired and wireless switches, routers, access points, servers, workstations and operating system software technologies to provide network access to classified and unclassified applications for use by ship's force, embarked units, embarked commanders and their staffs.   Under the Navy's information modernization strategy, full synchronization of shipboard networks, mission and information applications, radio\/satellite communications, and shore data dissemination infrastructure are necessary to ensure end-to-end mission capability.   The Integrated Shipboard Networking System program is closely synchronized on a ship by ship basis with over 460 different systems of application configurations including the following: Global Command and Control System Maritime (GCCS-M), Navy Tactical Command Support System (NTCSS), Navy Standard Integrated Personnel System (NSIPS), Theatre Medical Information Program - Maritime (TMIP-M), Defense Messaging System (DMS), Automated Digital Network System (ADNS), Global Broadcasting System (GBS), Tactical Tomahawk Weapons Control System (TTWCS) and Information Security (INFOSEC) programs. The ISNS program provides the infrastructure to support implementation\/fielding of these programs.  The LAN modernization rate must keep pace with hardware and software that is supported commercially in order to provide a supportable and secure FORCEnet infrastructure.  ISNS includes Afloat Core Services (ACS) which is the mechanism to deliver the FORCEnet interface to the warfighter.  ACS provides a composeable warfighting environment enabling dynamic configuration of capabilities tailored to meet specific warfighting missions.  As the warfighting mission changes, the capabilities or services can be re-configured on the fly to meet the new warfighting requirement.  This dynamic reconfiguration of services also known as \"plug and fight\" meets the composeable services vision of FORCEnet.  ACS also provides the common core enterprise services and technical framework to allow organizations ubiquitous access to reliable, decision-quality information through a net-based services infrastructure and applications to bridge real-time and near-real-time communities of interest (COI). ACS will empower the end user to pull information from any available source, with minimal latency, to support the mission.  Its capabilities will allow Department of the Navy as well as Global Information Grid (GIG) users to task, post, process, use, store, manage and protect information resources on demand for warfighters, policy makers and support personnel.  ACS will utilize a spiral process for delivering capability to the warfighter.     \n\nThe ISNS Inc 1, Sensitive Compartmented Information (SCI) Networks and Combined Enterprise Regional Information Exchange System (CENTRIXS) programs began migration to ISNS Inc 2\/Consolidated Afloat Networks and Enterprise Services (CANES).  ISNS Inc 2\/CANES will serve to transition numerous Fleet networks to a single, adaptive, available, secure computing network infrastructure while delivering enhanced technologies in: Integrated Voice, Video and Data; Common Computing Environment (CCE); ACS; and Multi-Level Security (MLS)\/Cross Domain Solutions (CDS)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Integrated Shipboard Network System (ISNS)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.029"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued development of replacement solutions for End of Life (EOL) equipment as EOL occurs.  Developed replacement solutions for End of Sale (EOS) equipment\/software as EOS occurs.  Completed Certification and Accreditation efforts for ISNS variants."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "This program fully transitions to CANES in FY13."
                        },
                        "PerformanceMetrics": {
                            "val": "ISNS development and testing against ISNS variants as well as Early Adopter Common Computing Envrionment (CCE) testing on the Lincoln Strike Group met and exceeded all measures of effectiveness and suitability of the system."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3032"
                    },
                    "ProjectTitle": {
                        "val": "NTCSS (Naval Tactical Command Spt Sys)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "39.069"
                        },
                        "PriorYear": {
                            "val": "13.784"
                        },
                        "CurrentYear": {
                            "val": "16.600"
                        },
                        "BudgetYearOne": {
                            "val": "11.250"
                        },
                        "BudgetYearOneBase": {
                            "val": "11.250"
                        },
                        "BudgetYearTwo": {
                            "val": "4.220"
                        },
                        "BudgetYearThree": {
                            "val": "1.285"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "86.208"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Naval Tactical Command Support System (NTCSS) is a multi-function program designed to provide standard tactical support information systems to various afloat and associated shore-based fleet activities. The mission is to provide the Navy and Marine Corps with an integrated, scalable system that supports the management of logistical information, personnel, material and funds required to maintain and operate ships, submarines, and aircraft. FY2015 Funding: \n\n(1) Provides for the design, development, and testing of NTCSS OA development efforts to include: Global  Individual Component Repair List (Global-ICRL); Beyond Capability of Maintenance Interdiction (BCM-I); Operational Supply (O-Supply) to include Table Of Allowance & Personal Gear Issue TOA\/PGI; and Total Material Visibility & Requisition Management (TMV\/RM).\n(2) Provides for the design, development, and testing of the Relational Administration (RADM) application upgrade providing personnel management capability to unit and force level activities.\n(3) Provides for the transition of the current, client-server architecture to a service-oriented architecture (SOA) and web-based services (NTCSS OA). This will align with the initiative to bring Navy systems into a common computing environment afloat, interface with Navy Enterprise Resource Planning (ERP) ashore, and provide a more flexible system platform with greater responsiveness to security, information assurance, functional, and system requirements and with greater speed to capability."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "NTCSS (Naval Tactical Command Spt Sys)"
                                    },
                                    "Description": {
                                        "val": "Maintenance and Supply Management Capability"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.784"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued design, development, and testing efforts for NTCSS Open Architecture (OA), to include consolidation of  organizational and intermediate level NALCOMIS maintenance applications, multi-UIC capability, upgrades to Ships Store (Retail Operations Management (ROM)), Food Services Management (FSM)) products, Relational Administration, and an enterprise database system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.600"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued design, development, and testing efforts for NTCSS Open Architecture (OA), to include Global  Individual Component Repair List (Global-ICRL); Beyond Capability of Maintenance (BCM) Interdiction; Operational Supply (O-Supply) to include Table Of Allowance & Personal Gear Issue TOA\/PGI; and Total Material Visibility & Recquisition Management (TMV\/RM).  Software code conversion of NTCSS legacy software code to a modern JAVA-based system is also planned."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.250"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.250"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue design, development, and testing efforts for NTCSS Open Architecture (OA),  to include Global  Individual Component Repair List (Global-ICRL); Beyond Capability of Maintenance (BCM) Interdiction; Operational Supply (O-Supply) to include Table Of Allowance & Personal Gear Issue TOA\/PGI; and Total Material Visibility & Recquisition Management (TMV\/RM), and software code conversion of NTCSS legacy software code to a modern JAVA-based system.  Conduct pre-acquisition activities for NTCSS OA follow-on efforts."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPN\/2611"
                                    },
                                    "Title": {
                                        "val": "Naval Tactical Command Support System"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "32.108"
                                        },
                                        "CurrentYear": {
                                            "val": "15.703"
                                        },
                                        "BudgetYearOne": {
                                            "val": "18.192"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "18.192"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "22.106"
                                        },
                                        "BudgetYearThree": {
                                            "val": "17.277"
                                        },
                                        "BudgetYearFour": {
                                            "val": "18.062"
                                        },
                                        "BudgetYearFive": {
                                            "val": "18.473"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "NTCSS Open Architecture (OA) Interim Solutions (Global Individual Component Repair List (G-ICRL), Beyond Capability of Maintenance Interdiction (BCM-I), Table Of Allowance (TOA), Personal Gear Issue (PGI), Total Material Visibility (TMV), and Requisition Management (RM) serve as the initial steps toward achieving the NTCSS OA \"End-State\" by introducing web-enabled technology, promoting data sharing with operational fleet forces, and utilization of Navy Data Centers to expose data and move workload ashore. Additionaly, the software code conversion efforts will start the modernization of legacy code-based applications into a more modern JAVA code-base incorporating current Information Technology (IT) best practices and eliminating current IA vulnerabilities experienced with a client\/server system. This strategy provides the foundation for NTCSS programs to migrate to a full Service Oriented Architecture (SOA) based  enterprise system."
                        },
                        "PerformanceMetrics": {
                            "val": "NTCSS Open Architecture (OA) Interim Solutions (G-ICRL\/BCM-I) eliminate documentation inefficiencies at the Fleet Readiness Centers (FRCs).  Interim Solutions (TOA\/PGI & TMV\/RM) provide centralized and standardized management of PGI and TOA material through the utilization of Navy Data Centers, while at the same time preventing millions of dollars in Operational Forces obligation losses through improved Requisition Management.  Additionaly the software code conversion efforts will  lay the foundation for migration to a Service-Oriented Architecture (SOA) for NTCSS lowering system maintenance costs when compared to maintaining the current, client-server architecture."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0604231N_3032_FILE1.PNG"
                                }
                            }
                        ]
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3320"
                    },
                    "ProjectTitle": {
                        "val": "TRIDENT Warrior"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "3.619"
                        },
                        "PriorYear": {
                            "val": "3.169"
                        },
                        "CurrentYear": {
                            "val": "2.340"
                        },
                        "BudgetYearOne": {
                            "val": "2.260"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.260"
                        },
                        "BudgetYearTwo": {
                            "val": "2.247"
                        },
                        "BudgetYearThree": {
                            "val": "2.289"
                        },
                        "BudgetYearFour": {
                            "val": "2.316"
                        },
                        "BudgetYearFive": {
                            "val": "2.365"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Trident Warrior (TW) enables early delivery of Information Dominance (ID) capabilities to the warfighter via Fleet-directed TW operational events. Integrates stand-alone systems and efforts to achieve substantially enhanced capability, demonstrates\/tests these capabilities in both laboratory and operational environments, and evaluates their effectiveness. Develops supporting concepts and Concept of Operations to improve warfighting effectiveness. Coordinates ID efforts with other Service\/Joint\/Department of Defense\/National efforts to ensure Joint\/Interagency\/Allied\/Coalition applicability and interoperability."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Trident Warrior"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.169"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Focused on operational experimentation of Command, Control, Communications, Computers, Intelligence, Surveillance, and Reconnaissance (C4ISR) technologies during the Navy's premier, annual Fleet Experimentation (FLEX) events.  The primary goal was to validate information dominance capabilities, maritime warfighting policy and procedures, and interoperability between the United States (U.S.) and Coalition partners. \n-Provided systems engineering and analysis to rapidly identify emergent fleet needs and capability shortfall, assessing risk, validating cost and delivering capability.  Found solutions for the Office of the Chief of Naval Operations\/Commander, U.S. Fleet Force Command (USFFC) selected capability gaps and packaged them for operational use, favoring cost effective, disruptive technologies.  Facilitated the successful transition of identified technology capabilities into Programs of Record (POR). This process delivered Program Objective Memorandum (POM) recommendations and supporting roadmaps based on assessments of capability gaps with a focus on technologies that respond to irregular, catastrophic and disruptive technology insertion.\n-The majority of TW experimentation occurred during operational at-sea venues where new and emerging capabilities were integrated with current fleet units and either demonstrated or evaluated on their potential military utility. The Sea-based venue worked on an 18-month cycle and focused on the readiness of higher Technology Readiness Level technologies in a Maritime-based environment.  The at-sea portion of TW was executed in two phases. The venues were operational venues which support the experimental objectives of information dominance. \n-Developed FY14 TW FLEX plan and began to develop FY15 TW FLEX plan."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.340"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Finalize analysis of TW 13 experiment to result in recommendations by USFFC on experiment initiatives. \n-Explore Trident Warrior (TW) 14 in Commander Third Fleet (C3F)\/Commander Seventh Fleet (C7F) Area of Responsibility (AOR) using Carrier Strike Group\/Expeditionary Strike Group (CSG\/ESG) units with possible Allied\/Coalition presence.  \n-Direct, coordinate, assist and supervise primarily non-Systems Command (SYSCOM) participants, and SYSCOM participants as able with specific goal identification, risk identification, and experiment plan including data requirements and collection on schedule and in accordance with standardized procedures derived from experimentation best practices.  \n-Assist participants to achieve required installation and security certifications, accreditations and approvals. \n-Provide subject matter experts (SMEs) to maintain core ship services during the experimentation period. \n-Provide independent experts in experimentation to coordinate the establishment of, and compliance with, experiment plans and to lead analysis effort and provide unbiased assessment to decision makers for initiatives designated by United States Fleet Forces Command (USFFC). \n-Provide results to government sponsors to support the program's Planning, Programming, Budgeting, and Execution Process (PPBE) and engineering decisions. \n-Plan and execute TW 14 operational events to accelerate the transition of Information Dominance (ID) capability to the Fleet.  \n-Solicit participation for TW 15 of government sponsored and industry sponsored technologies responsive to identified Naval capability gaps.  Select technologies for participation in numbers supportable within resources."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.260"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.260"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Finalize analysis of TW 14 executed experiment in order to determine recommended next steps for Naval Warfare Development Center (NWDC).\n-Explore TW 15 in Fleet Forces Command AOR using CSG\/ESG units with possible Allied\/Coalition presence.  \n-Coordinate TW participant efforts with specific goal identification, risk identification, and experiment plans to include data requirements and collection, on schedule and in accordance with standardized procedures derived from experimentation best practices.  \n-Coordinate TW participant efforts to achieve required installation and security certifications, accreditations and approvals. \n-Provide SMEs for core ship services during the experimentation period. \n-Provide independent experts to coordinate the establishment of, and compliance with, experiment plans and to lead analysis effort and provide unbiased assessment to decision makers for initiatives designated by NWDC. \n-Provide results to government sponsors to support the program's PPBE and engineering recommendations. \n-Plan and execute TW 15 operational events to accelerate the transition of ID capability to the Fleet.  \n-Solicit participation for TW 16 and recommend inclusion of technologies responsive to identified Naval Capability Gaps.  Select technologies for participation in numbers supportable within resources."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Trident Warrior (TW) is an annual operational experiment covering an 18-month process and is not associated with acquisition efforts."
                        },
                        "PerformanceMetrics": {
                            "val": "Confirmation of Fleet and Joint Interoperability with technology candidates, Information Assurance Certification and Accreditation, and alignment with United States Fleet Forces (USFF) Commander's Guidance, and Systems Command (SYSCOM) Chief Engineer (CHENG) as well as related Program Executive Office (PEO) objectives and projected architectures."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0604231N_3320_FILE1.PNG"
                                }
                            }
                        ]
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3323"
                    },
                    "ProjectTitle": {
                        "val": "Maritime Tactical Command & Control (MTC2)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.003"
                        },
                        "PriorYear": {
                            "val": "6.916"
                        },
                        "CurrentYear": {
                            "val": "12.443"
                        },
                        "BudgetYearOne": {
                            "val": "11.955"
                        },
                        "BudgetYearOneBase": {
                            "val": "11.955"
                        },
                        "BudgetYearTwo": {
                            "val": "16.121"
                        },
                        "BudgetYearThree": {
                            "val": "20.318"
                        },
                        "BudgetYearFour": {
                            "val": "22.821"
                        },
                        "BudgetYearFive": {
                            "val": "23.421"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "MTC2 is a software program which will provide tactical Command and Control (C2) capabilities and Maritime unique Operational Level of War capabilities not supported by the joint C2 effort and align to the Navy Tactical Cloud (NTC).  MTC2 fields to all echelons of command within the Navy.  The goal is to provide a suite of maritime applications notionally as part of an \"Application Store\" that enables the Navy command structure enhanced situational awareness, planning, execution, monitoring, and assessment of its mission requirements.  MTC2 will field maritime applications designed to provide automated and structured support for tactical and operational planning, decision-making, and execution.  In FY15, MTC2 will complete software requirements specification, architectural design, and begin software development for fielding of NTC Prototype in FY16.  \n\nGFM-DI is the Department-wide enterprise solution that enables visibility\/accessibility\/sharing of data applicable to the entire DoD force structure. GFM-DI is the enterprise solution for force structure representation and MTC2 will be the data source for the Navy's force structure representation.  In FY15, GFM-DI will perform design and development for integration into MTC2 and will align to the joint command and control objective architecture and NTC."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Maritime Tactical Command and Control (MTC2)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.916"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Began initial development of Maritime Tactical Command and Control (MTC2) capabilities.  Analyzed, integrated and tested software transitioning from Command and Control Rapid Prototype Continuum (C2RPC) Science & Technology (S&T) efforts into the MTC2 Program of Record.  Performed systems engineering analysis, system design efforts, and acquisition documentation in support of a Build Decision (Release 1)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.943"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop software requirement specification (SRS).  Coordinate MTC2 requirements, design and architecture to ensure alignment with Navy Tactical Cloud effort.  Develop Requirements Definition Package (RDP) and update Capability Drop 1 (CD1) to align requirements to NTC.  Perform assessment of NTC to develop and align MTC2 processes.  Continue software development, analysis, integration, and testing to transition from C2RPC S&T efforts into MTC2 Program of Record. Conduct technical and information exchanges with international activities supporting cooperative-development of maritime C2 capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.094"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.094"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete SRS, RDP, and CD1 development.  Complete MTC2 design and architecture for alignment to NTC.  Begin software development for MTC2 fielding to NTC Prototype in FY16."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Global Force Management - Data Initiative (GFM-DI)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct design activity, systems engineering analysis and design review to identify integration of GFM-DI data into MTC2 objective architecture based on Navy Tactical Cloud (NTC).  Evaluate NTC to determine how GFM DI will be ingested by NTC."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.861"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.861"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Provide engineering plan for ingestion of GFM-DI data into MTC2 architecture that aligns with the NTC.  Determine criteria for and develop the plan for integration of scheduling tool (Slider\/Websked) capabilities into MTC2.  GFM-DI will perform design and development for integration into MTC2 and will align to the joint command and control objective architecture."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "RDTEN\/0604231N\/0709"
                                    },
                                    "Title": {
                                        "val": "GCCS-M"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "5.141"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "199.775"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "MTC2 is planning to execute a rapid software development acquisition strategy that is responsive to the fleet needs.  Software development will be comprised of multiple releases of increasing levels of net-centric services capability.  MTC2 will be software only, and require the Navy Tactical Cloud (NTC), Navy Common Computing Enterprise (CCE)\/Consolidated Afloat Networks and Enterprise Services (CANES) provided by other network centric programs to serve as the underlying information technology infrastructure of network and hardware for MTC2 software.  MTC2's primary contracting method for software development utilizes SPAWAR Systems Center - Pacific (SSC-PAC), San Diego, CA and SPAWARSYSCOM contracts."
                        },
                        "PerformanceMetrics": {
                            "val": "MTC2 leverages software investments by the Office of Naval Research (ONR), to realize recommended materiel solutions defined in the Initial Capabilities Document (ICD) for meeting Capability Drop 1 (CD1) Operational Level of Warfare (OLW) capability needs within a Maritime Operation Center (MOC).  MTC2 will align to the Navy Tactical Cloud (NTC) and reside on the Cloud, CCE\/CANES and Agile Core Services (ACS) technology architecture. Successfully complete initial engineering and design analysis, and acquisition documentation to achieve a minimum of two software releases."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0604231N_3323_FILE1.PNG"
                                }
                            }
                        ]
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3324"
                    },
                    "ProjectTitle": {
                        "val": "Navy Air Operations Command and Control (NAOC2)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "2.073"
                        },
                        "PriorYear": {
                            "val": "4.463"
                        },
                        "CurrentYear": {
                            "val": "4.045"
                        },
                        "BudgetYearOne": {
                            "val": "1.831"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.831"
                        },
                        "BudgetYearTwo": {
                            "val": "0.961"
                        },
                        "BudgetYearThree": {
                            "val": "0.982"
                        },
                        "BudgetYearFour": {
                            "val": "1.012"
                        },
                        "BudgetYearFive": {
                            "val": "1.037"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Navy Air Operations Command and Control (NAOC2) integrates and tests Air Force program of record systems that provide an integrated and scalable planning system for standardized, secure, and automated decision support for Air Force, Joint, and Allied commanders worldwide.  These programs provide automated air operations planning, execution management and intelligence capabilities at the Force level to include fleet commanders, numbered fleet commanders, commander carrier strike group, Commander Expeditionary Strike Group, Commander Landing Force, and Joint Task Force Commanders. NAOC2 includes Theater Battle Management Core System (TBMCS), Command and Control Air and Space Operations Suite (C2AOS), plus Command, Control and Information Services (C2IS). C2AOS and C2IS are being developed as Service Oriented Architecture (SOA) services to allow for scalability and integration with Common Computing Environments (CCE). Continuation of these efforts will significantly enhance the Joint Force Air Component Commander and Combined Air Operations Center personnel to plan daily air operations including strike, airlift, offensive and defensive air, tanker missions in support of combat operations, addressing the requirement of war fighter of distributed planning and execution processes and significantly improving Joint interoperability. TBMCS continues a hardware transition to CCEs such as Consolidated Afloat Networks and Enterprise Services (CANES). Currently, TBMCS is the key system that is used to conduct real world air planning in the Joint and Navy environment. C2AOS and C2IS will replace TBMCS in a SOA environment while bringing more flexibility to the war fighter. In FY2015, the program will continue Navy integration and testing for Air Force developed C2AOS and C2IS, with focus on two of the currently planned four Capability Packages."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "TBMCS CANES Migration"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.359"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued migration of Air Force designed, developed, and delivered Theater Battle Management Core System (TBMCS) software to the Navy unique Consolidated Afloat Networks and Enterprise Services (CANES) Common Computing Environment. Conducted integrated TBMCS\/CANES Developmental Tests."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.383"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete migration of Air Force designed, developed, and delivered Theater Battle Management Core System (TBMCS) software to the Navy unique Consolidated Afloat Networks and Enterprise Services (CANES) Common Computing Environment. Conduct Operational Assessment and Operational Test."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Command and Control Air and Space Operations Suite (C2AOS) \/ Command, Control and Information Services (C2IS) Integration and Testing"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.104"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conducted integration and testing of Air Tasking Order Management System (ATOMS) as part of Air Force developed Command and Control Air Operations Suite - Command and Control Information Services I (C2AOS-C2IS I), ensuring full functionality on Navy unique infrastructure to include Consolidated Afloat Networks and Enterprise Services (CANES) to ensure increased Joint interoperability and enhanced capability including theater level planning plus distributed air re-planning and execution processes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.662"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct continued integration and testing of Air Tasking Order Management System (ATOMS) along with initial integration and testing of Request Information Services for Command and Control (RISC2), Airspace Management Application\/Airspace Information Service (ASMA\/ASIS) and Integrated Air and Missile Defense (IAMD) Planner as part of Air Force developed Command and Control Air Operations Suite - Command and Control Information Services I (C2AOS-C2IS I) to ensure full functionality on Navy infrastructure to include Consolidated Afloat Networks and Enterprise Services (CANES) ensuring increased Joint interoperability and enhanced capability including theater level air planning with distributed re-planning and execution processes."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.831"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.831"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct continued integration and testing of Request Information Services for Command and Control (RISC2), Airspace Management Application\/Airspace Information Service (ASMA\/ASIS) and Integrated Air and Missile Defense (IAMD) Planner as part of Air Force developed Command and Control Air Operations Suite - Command and Control Information Services I (C2AOS-C2IS I) to ensure full functionality on Navy infrastructure to include Consolidated Afloat Networks and Enterprise Services (CANES) ensuring increased Joint interoperability and enhanced capability including theater level air planning with distributed re-planning and execution processes."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "TBMCS is designed, developed, and delivered by the Air Force and will be integrated for a Navy Common Computing Environment (CCE) such as CANES. As a Joint interest program, this approach satisfies the current validated requirements, supports the accelerated retirement of legacy hardware, and reduces overall risk to the program.\n\nCommand and Control Air and Space Operations Suite (C2AOS) and Command, Control and Information Services (C2IS) are designed, developed, and delivered by the Air Force and will be integrated for a Navy CCE and service oriented architecture environment such as CANES. This approach satisfies the current validated requirements and reduces overall risk to the program."
                        },
                        "PerformanceMetrics": {
                            "val": "TBMCS, C2AOS, and C2IS are designed, developed, and delivered by the Air Force. This leverage greatly reduces the integration and testing costs associated with each software release. The solutions will reside on CCE\/CANES  architecture. These software-only solutions eliminate hardware procurement, installation, and sustainment costs."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0604231N_3324_FILE1.PNG"
                                }
                            }
                        ]
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "9123"
                    },
                    "ProjectTitle": {
                        "val": "FORCEnet"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "225.322"
                        },
                        "PriorYear": {
                            "val": "4.112"
                        },
                        "CurrentYear": {
                            "val": "2.924"
                        },
                        "BudgetYearOne": {
                            "val": "2.601"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.601"
                        },
                        "BudgetYearTwo": {
                            "val": "2.210"
                        },
                        "BudgetYearThree": {
                            "val": "2.084"
                        },
                        "BudgetYearFour": {
                            "val": "2.244"
                        },
                        "BudgetYearFive": {
                            "val": "2.317"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "FORCEnet is the Navy and Marine Corps initiative to deliver Information Dominance and achieve Department of the Navy (DoN)\/Department of Defense (DoD) Transformation, Joint\/Allied\/Coalition Interoperability, implementing Maritime Domain Awareness (MDA), and Net-Centric Operations\/Warfare (NCO\/W). Chief of Naval Operations Information Dominance effort focuses prioritization and organizational responsibility for information dominance, cyber, intelligence and sensors resulting in increased scope of systems, platforms and mission areas. FORCEnet is a foundation of Sea Power 21, Naval Power 21, the Naval Operating Concept for Joint Operations, and the DoN's Naval Transformation Roadmap.\n \nThe FORCEnet project line funds the following efforts: \n\n(1) DoN Command, Control, Communications, Computers, Intelligence, Surveillance, and Reconnaissance (C4ISR) Transformation\/Strategic Planning within DoN\/Joint\/DoD Framework: Assesses existing and emerging capabilities, develops and evaluates Navy-wide policies, plans, requirements, and compliance; develops integration and investment strategies; and accelerates innovation, testing, assessment and fielding of material and non-material solutions for enhanced operational capability, Joint\/Allied\/Coalition interoperability and application\/enforcement of enterprise requirements\/architectures\/standards toward greater NCO\/W capability. Supports Navy implementation of MDA capability, Maritime Operations Centers (MOC), and enterprise network efforts. \n\n(2)Information Dominance Portfolio Health Assessment: Funding supports Portfolio Health Assessments of Navy mission areas and identifies gaps in Information Dominance capabilities in the context of assessed mission areas. Funds support vignettes, technical baselines, architecture products, and briefings developed to support sponsor decision making processes."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "FORCEnet"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.112"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "DoN C4ISR Transformation\/Strategic Planning within DoN\/Joint\/DoD Framework: Within the DoD, Joint Staff, and Combatant Commander management of Joint Capability Portfolios, continued to assess existing and emerging capabilities in selected operating environments, developed integration plans, executed system engineering reviews and investment strategies, accelerated innovation, technology insertion, and incorporation of material and non-material solutions for enhanced Joint operational capabilities in NCO\/W. \n-Continued to support Navy implementation of MDA, Standing Joint Force Headquarters, MOC and Coalition\/Allied operations. \n\nInformation Dominance Roadmaps and Analysis: Researched the Navy mission areas for interdependencies between programs for budget tradeoffs and mission impacts of those tradeoffs. \n-Identified Navy mission area gaps in Information Dominance capabilities to prioritize Science and Technology efforts for future budget decisions. \n-Evaluated Navy mission areas for linkages to roadmap action items and provided analytical and architectural support in the development of Information Dominance Roadmaps. \n-Ensured Information Dominance Roadmaps objectives provided stated capabilities to the warfighters."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.924"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Department of the Navy (DoN) Command, Control, Communications, Computers, Intelligence, Surveillance, and Reconnaissance (C4ISR) Transformation\/Strategic Planning within DoN\/Joint\/Department of Defense (DoD) Framework: Within the DoD, Joint Staff, and Combatant Commander management of Joint Capability Portfolios, continue to assess existing and emerging capabilities in selected operating environments, develop integration plans, execute system engineering reviews and investment strategies, accelerate innovation, technology insertion, and incorporation of material and non-material solutions for enhanced Joint operational capabilities in Net-Centric Operations\/Warfare. \n-Continue to support Navy implementation of Maritime Domain Awareness, Standing Joint Force Headquarters, Maritime Operations Centers and Coalition\/Allied operations. \n\nInformation Dominance Roadmaps and Analysis: Continue to research the Navy mission areas for interdependencies between programs for budget tradeoffs and mission impacts of those tradeoffs.\n-Continue to identify Navy mission area gaps in Information Dominance capabilities to prioritize Science and Technology efforts for future budget decisions. \n-Continue to evaluate Navy mission areas for linkages to roadmap action items and provide analytical and architectural support in the development of Information Dominance Roadmaps. \n-Continue to ensure Information Dominance Roadmaps objectives provide stated capabilities to the warfighters."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.601"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.601"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "DoN C4ISR Transformation\/Strategic Planning within DoN\/Joint\/DoD Framework: Within the DoD, Joint Staff, and Combatant Commander management of Joint Capability Portfolios, continue to assess existing and emerging capabilities in selected operating environments, develop integration plans, execute system engineering reviews and investment strategies, accelerate innovation, technology insertion, and incorporation of material and non-material solutions for enhanced Joint operational capabilities in Net-Centric Operations\/Warfare. \n-Continue to support Navy implementation of Maritime Domain Awareness, Standing Joint Force Headquarters, Maritime Operations Centers and Coalition\/Allied operations. \n\nInformation Dominance Portfolio Health Assessment: Utilize and study Navy mission areas in support of systems of systems engineering assessments used to inform sponsor.  These assessments identify integration and interoperability gaps, trades, and solutions for sponsor related equities.\n-Identify Navy mission area gaps in Information Dominance capabilities to prioritize Science and Technology efforts for future budget decisions.\n-Assess tradespace and solutions, insuring Force level capability and systems of systems integration and interoperability in studied mission areas.\n-Package assessments to support sponsor decision making processes."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "FORCEnet is a non-acquisition effort that informs and matures Navy decisions, which in turn impacts acquisition programs. Activities include acquiring intellectual capital in emerging technical areas through contracts providing technical engineering expertise and surge capacity for emerging tasks."
                        },
                        "PerformanceMetrics": {
                            "val": "FORCEnet Performance Metrics: Goal: Chief of Naval Operations (CNO) strategic planning and supporting acquisition of classified efforts. Metric: Echelon 1 response to emergent strategic needs and classified warfighting capability."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0604231N_9123_FILE1.PNG"
                                }
                            }
                        ]
                    }
                }
            ]
        }
    }
}