{
    "id": "b59eb142a62687332f2b1afa2ec22ebec24ac023",
    "meta": {
        "filename": "dod-2015_RDTE_2015_DLA_RDTE_JustificationBook_Defense_Logistics_Agency_PB_2015.zzz_unzipped_RDTE_JustificationBook_Defense_Logistics_Agency_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Defense Logistics Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605070S"
        },
        "ProgramElementTitle": {
            "val": "DoD Enterprise Systems Development and Demonstration"
        },
        "R1LineNumber": {
            "val": "126"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Defense Logistics Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "98.364"
            },
            "PriorYear": {
                "val": "100.056"
            },
            "CurrentYear": {
                "val": "25.217"
            },
            "BudgetYearOne": {
                "val": "15.326"
            },
            "BudgetYearOneBase": {
                "val": "15.326"
            },
            "BudgetYearTwo": {
                "val": "14.740"
            },
            "BudgetYearThree": {
                "val": "11.795"
            },
            "BudgetYearFour": {
                "val": "10.609"
            },
            "BudgetYearFive": {
                "val": "10.865"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The mission of the DoD Enterprise Systems is to coordinate and enable business transformation efforts across the Department of Defense (DoD. The DLA recognizes that DoD’s business enterprise must be closer to its warfighting customers than ever before. Joint military requirements drive the need for greater commonality and integration of business and financial operations."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "133.104"
                },
                "CurrentYear": {
                    "val": "27.917"
                },
                "BudgetYearOne": {
                    "val": "14.209"
                },
                "BudgetYearOneBase": {
                    "val": "14.209"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "100.056"
                },
                "CurrentYear": {
                    "val": "25.217"
                },
                "BudgetYearOne": {
                    "val": "15.326"
                },
                "BudgetYearOneBase": {
                    "val": "15.326"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-33.048"
                },
                "CurrentYear": {
                    "val": "-2.700"
                },
                "BudgetYearOne": {
                    "val": "1.117"
                },
                "BudgetYearOneBase": {
                    "val": "1.117"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-33.048"
                    },
                    "CurrentYear": {
                        "val": "-2.700"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Secretary of Defense Initiatives"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "1.117"
                                },
                                "BudgetYearOneBase": {
                                    "val": "1.117"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2013 ($-33.048M) and FY 2014 ($-2.700) Secretary of Defense Initiatives\nThe Defense Enterprise Business Systems (DEBS) was addressing not only Sequestration but an overall RDT&E proposed Congressional Reduction.  Due to the uncertainty of these issues,  investment programs reduced immediate FY2013 and FY2014 execution requirements to those actions needed to prevent breaks in service pending final resolution of the President's budget.  The delay in the final approval of the budget also impacted the ability to initiate planned acquisition  that have longer contractual lead times.  The combined impact of the actions resulted in  Defense Agencies Initiative (DAI) delaying the start of mandatory ERP software version migration to Oracle R12 to FY2014 and delaying the deployment to additional Agencies; Defense Retiree and Annuitant Pay System (DRAS2) 2, delayed the prime contract award until  FY 2014; Defense Information System for Security (DISS) delayed and down scoped key contract actions needed to fully implement the intent of Section 3001 Public Law 108-458, the Intelligence Reform and Terrorism Prevention Act of 2004 and Homeland Security Presidential Directive 12.  Funds that would have supported functional enhancements to the Defense Travel System (DTS), Wide Area Workflow and systematic technology research were diverted to the higher priority programs.\n\nFY 2015 Secretary of Defense Initiatives: $1.117million - due to additional DEBS program requirements."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "1"
                    },
                    "ProjectTitle": {
                        "val": "Business Enterprise Information Services (BEIS)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "3.927"
                        },
                        "PriorYear": {
                            "val": "5.740"
                        },
                        "CurrentYear": {
                            "val": "3.360"
                        },
                        "BudgetYearOne": {
                            "val": "0.957"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.957"
                        },
                        "BudgetYearTwo": {
                            "val": "0.905"
                        },
                        "BudgetYearThree": {
                            "val": "0.978"
                        },
                        "BudgetYearFour": {
                            "val": "0.992"
                        },
                        "BudgetYearFive": {
                            "val": "1.016"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The BEIS utilized the mature, existing infrastructure of Defense Corporate Database\/Defense Corporate Warehouse (DCD\/DCW), Defense Departmental Reporting System (DDRS), and Defense Cash Accountability System (DCAS) to provide timely, accurate, and reliable business information from across the DoD to support auditable financial statements as well as provide detailed information visibility for management in support of the Warfighter.  The goals of BEIS are to ensure data compliance with Standard Financial Information Structure (SFIS) standards; provide security-defined, enterprise-level access to information for ad hoc management queries; and produce external financial management reports\/statements based on standardized data.  BEIS provides solutions to these goals by:\n- Establishing the authoritative source for SFIS values and providing for standardization by implementing SFIS and United States Standard General Ledger (USSGL) compliant financial reporting capabilities for Audited Financial Statements and Budgetary Reports.\n- Providing an enterprise-wide information environment that will serve as the single source for enterprise-wide financial information.\n- Serving as the DoD-wide system for Treasury Reporting.\n- Providing decision makers with significantly greater access to financial information through data visibility and business intelligence (e.g., Executive Dashboard).\nThe BEIS functional baseline encompasses a family of services organized into six distinct lines of business, four of which have achieved Full Operational Capability (FOC).  The remaining two services, Financial Reporting Services and Cash Accountability Reporting Services, will provide DoD enterprise-wide financial visibility and will serve as the centralized financial data source and the single source for enterprise Audited Financial Statements and Budgetary Reports, as well as Treasury Reporting.  The BEIS financial management capabilities will be used by the Military Services, Defense Agencies, and the Under Secretary of Defense (Comptroller).  These modernization efforts will complete deployment\/implementation of BEIS capabilities and will serve the Department Auditability goals and objectives."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Business Enterprise Information Services (BEIS)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.740"
                                            },
                                            "Text": {
                                                "val": "BEIS DDRS Financial Reporting Services:\n- Continued toward completion of SFIS Compliant Budgetary Reporting for Defense Agencies (i.e., implemented Defense Agency Initiative interface for (Defense Media Activity (DMA), Office of Economic Adjustment (OEA), Defense Advanced Research Projects Agency (DARPA), and Defense Security Service (DSS)), North Atlantic Treaty Organization (NATO), TriCare Management Activity (TMA) Contract Resource Management (CRM), Washington Headquarters Service (WHS) Allotment Accounting System (WAAS) for Department of Defense Education Activity (DODEA), General Accounting and Finance System - Re-engineered (GAFS-R) 390 Limits, and Automated Financial Statements (AFS) Chief Financial Officer Load and Reconciliation System (CLRS)implementations). \n- Completed implementation of Defense Agency Unique Process for Government-wide Treasury Account Symbol (GTAS).\nBEIS DCAS Cash Accountability Reporting Services:\n- Continued deployment\/implementation of PowerBuilder to Web (PB2Web)\/PKI Initiative with Deployment 2."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.360"
                                            },
                                            "Text": {
                                                "val": "BEIS DDRS Financial Reporting Services:\n- Implementation of Government Treasury Account Adjusted Trial Balance System (GTAS)\n- Complete Standard Financial Information Service (SFIS) Compliant Budgetary Reporting for Defense Agencies (Entails Undistributed Cash, State Department, Classified Agencies (to include Masked Interface), Mechanization of Contract Administration Services (MOCAS) Adjustments (ADJ), and Enterprise Business Accountability System (EBAS) – Washington Headquarters Service (WHS))\n- Complete TI-97 compilation process\nBEIS DCAS Cash Accountability Reporting Services:\n- Complete deployment\/implementation of PowerBuilder to Web (PB2Web)\/PKI Initiative (i.e., Deployment 3 and 4)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.957"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.957"
                                            },
                                            "Text": {
                                                "val": "BEIS DCAS Cash Accountability Reporting Services:\n- Implementation of significant system enhancements\/modifications required to meet evolving regulatory and\/or statutory changes in support of DoD\/Treasury fiduciary reporting and\/or the DoD Audit Readiness effort."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "BEIS leveraged existing infrastructure in DoD’s investment in DCD\/DCW, DDRS, and DCAS. BEIS formally implemented a portfolio management approach to program management that helped to ensure a management strategy was in place to better reallocate assets within the portfolio. BEIS has and will continue to deliver needed capabilities more rapidly and efficiently using a Family of Systems (FoS) concept providing a functional baseline organized into six distinct lines of business: General Ledger Services, Business Integration Services, Reference Data Services, Enterprise Level Business Intelligence Services, Cash Accountability and Reporting Services, and Financial Reporting Services. These services are provided by individual IT systems that collectively, make up the BEIS FoS. The BEIS FoS program is composed of four core systems; Defense Departmental Reporting System (DDRS), Defense Cash Accountability System (DCAS) Enterprise Business Intelligence (EBI), and Defense Corporate Database\/Defense Corporate Warehouse (DCD\/DCW). Capabilities are being developed incrementally with multiple releases per year to meet the Enterprise Transition Plan milestones provided to Congress. BEIS has achieved FOC for the following system components\/services: DCD\/DCW, to include General Ledger Services, Business Integration Services, Reference Data Services, and Enterprise Business Intelligence (EBI) and transitioned these to DFAS for operations and sustainment.   Based on the list of remaining requirements for BEIS DDRS Financial Reporting Services and BEIS DCAS Cash Accountability and Reporting Services an overall schedule including integrated activities as well as identified products and milestones has been developed. Contracts are competitively awarded to keep costs down. Intra-governmental services are being used where possible for infrastructure support by the Defense Finance and Accounting Service (DFAS) Technical Services Organization and Defense Information Systems Agency (DISA) Information Processing Center."
                        },
                        "PerformanceMetrics": {
                            "val": "N \/ A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2"
                    },
                    "ProjectTitle": {
                        "val": "Defense Business Systems Acquisition (DBSAE) Staff"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Defense Business Enterprise Systems (DEBS) (formerly Defense Business Systems Acquisition (DBASE) Staff) is a core team of highly qualified individuals charged with supporting the development and maintenance of a portfolio of programs designed to meet the needs of the Department of Defense (DoD). The DEBS mission is to provide cross cutting program executive support and tools to include expert acquisition strategy, advise, oversight, and hands-on assistance to all of the DoD Enterprise Systems. The primary focus is to enhance the consistency of processes enabling streamlined program development and program process auditability; promote excellence and innovation by sharing key skill sets and resources across the portfolios."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "DBSAE Staff"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Continue to focus efforts to enhance the consistency of processes, and promote excellence in innovation.\n\nContinue with FISCAM assessment and remediation actions as needed.   Complete SSAE 16 assessment preparations."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N \/ A"
                        },
                        "PerformanceMetrics": {
                            "val": "N \/ A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3"
                    },
                    "ProjectTitle": {
                        "val": "Defense Agencies Initiative (DAI)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "57.349"
                        },
                        "PriorYear": {
                            "val": "59.806"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The DAI mission is to deliver auditable Chief Financial Officer (CFO) Act compliant business environments for Defense Agencies providing accurate, timely, authoritative financial data supporting the DoD goal of standardizing financial management practices improving financial decision support, and supporting audit readiness.  Currently, Defense Agencies use more than 10 different non-compliant financial management systems supporting diverse operational functions and the warfighter in decision making and financial reporting.  These disparate, non-integrated systems do not meet statutory requirements to produce timely, auditable reports.\n\n\nThe DAI program modernizes the Defense Agencies’ financial management processes by streamlining financial management capabilities, addressing financial reporting material weaknesses, and supporting financial statement auditability for the majority of  agencies and field activities across the DoD.  DAI will support a transformation of budget, finance, and accounting processes across participating defense agencies to help improve the quality of financial information, supporting financial auditability and decision making.   The DAI business solution, once implemented, will provide a near real-time, web-based system from a “.mil” environment of integrated business processes that will enable in excess of 84,000 Defense Agency financial managers, program managers, auditors, and Defense Finance and Accounting Service (DFAS) representatives to make sound financial business decisions.\n\n\nThe DAI implementation approach is to deploy a standardized system solution that is consistent with requirements in the Federal Financial Management Improvement Act (FFMIA) and the DoD Business Enterprise Architecture (BEA), while leveraging the out-of-the-box capabilities of the selected Commercial-Off-the-Shelf (COTS) product, Oracle e-Business Suite (EBS), version 11i (R11).  DAI implemented an Office of Management and Budget Financial Systems Integration Office (FSIO) qualified COTS financial management business solution with common business processes and data standards.   The Program Management Office (PMO) will not develop any objects that are included in core COTS software or services (i.e. vendor data from Federal authoritative source).  \n\n\nDAI supports the Quadrennial Defense Review (QDR) Strategy 5, “Reform the business and support functions of the Defense enterprise”.  DAI is also aligned to the FY 2012\/FY 2013 DOD Strategic Management Plan Business Goal 2: “Strengthen DoD financial management to respond to warfighter needs and sustain public confidence through auditable financial statements”. The objective of the Defense Agencies Initiative is to achieve auditable, CFO Act compliant business environments for the Defense Agencies with accurate, timely, authoritative financial data. \n\n\nThe primary goal is to deploy a standardized system solution to improve overall financial management and comply with BEA, Standard Financial Information Structure (SFIS), and Office of Federal Financial Management (OFFM) requirements. Common business functions within budget execution include  the Department’s BEA End to End (E2E) business processes: Cost Management; Budget to Report; Procure to Pay;  Acquire to Retire (real property lifecycle accounting only); Hire to Retire (Time and Labor reporting only); and Order to Cash.  Future capabilities will support Defense Working Capital Fund accounting, Budget Formulation, Grants Financial Management, and Re-Sale Accounting (for Defense Commissary Agency (DeCA)) as well as a Contract Writing capability.\n\n\nDAI is currently implemented at 11 Defense Agencies and the Office of the Under Secretary of Defense, Comptroller, (OUSD(C)) (Time and Labor only) and supporting over 9,200 users.  In addition, since Oracle is phasing out maintenance of Oracle EBS, Release 11i, the program is required to migrate to EBS Release 12 (R12). The program office is also responsible for operational sustainment of the system.  Funds are required for additional government and contractor support, licenses, maintenance, and hardware to accomplish the remaining capability developments and organizational deployments, complete the R12 upgrade, initiate the annual Statement on Standards for Attestation Engagements (SSAE 16) assertion packages, and sustain the system.  \n\n\nThe benefits of DAI are:\n- Common business processes and data standards;\n- Access to real-time financial data transactions;\n- Significantly reduced data reconciliation requirements;\n- Enhanced analysis and decision support capabilities; Standardized line of accounting with the use of SFIS; and\n- Use of United States Standard General Ledger (USSGL) Chart of Accounts to resolve DoD material weaknesses and deficiencies.\n\n\nThe DAI PMO will provide the R12 Upgrade system integration services that include: acquisition management, project management; blueprinting; design, build, and unit test; developing required Reports, Interfaces, Conversions, Extensions, Forms and Workflows (RICEFW) objects; testing (information assurance, integration, functional, performance, conversion, security, user acceptance, operational); end-user training (train the trainer\/change management preparing the users for the cross functional skills and awareness needed to perform well with an integrated enterprise resource planning system); system deployment; conversion; information assurance; sustainment; data service; help desk support; as well as studies and analysis support."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Defense Agencies Initiative (DAI)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "59.806"
                                            },
                                            "Text": {
                                                "val": "FY 2013 Accomplishments: \n\n*\tDLA Chief Information Officer declared DAI audit ready.\n*\tThe PMO delivered Release 3.0 full financial capabilities developed during FY 2012 to existing user Agencies as well as DARPA, DSS, OEA, and DMA.  The PMO also delivered a Data Services utility to convey Agency financial data from DAI to an Agency repository or data warehouse.  This generic service was implemented to populate the DARPA MSS.  The PMO also conducted a Continuity of Operations (COOP) test of the system; Successfully sustained integrity during Agency conducted external and internal penetration tests of the system; Conducted a third party led Federal Information Systems Controls Audit Manual (FISCAM) assessment; and Conducted a third party led functional assessment focusing on in-scope Federal Financial Management Improvement Act (FFMIA) requirements.\n\nThe PMO also: \n*\tCreated current baseline versions of acquisition and other reviews as an ACAT IA program.\n*\tDeveloped an Oracle EBS R12 upgrade Analyses of Alternatives in concert with the DCMO including performance and sizing requirements and develop a plan of action and milestones to conduct the upgrade.\n*\tPerformed business process re-engineering in concert with the Agencies that included improving the funds visibility processes, streamlining configuration management, and improving change management.  \n*\tIdentified and tracked new Financial Improvement and Audit Readiness (FIAR) preparatory audit’s Notices of Findings in the Federal Information Security Management Act (FISMA), FFMIA and other compliance areas.  \n*\tStudied DAI configuration changes reflecting the revised BEA 10.0 SFIS in view of the Government-Wide Treasury Account Symbol Adjusted Trial Balance System Requirements.\n*\tDeveloped a DAI portion of the DLA component plan to update the Department of Defense Standard Line of Accounting (SLOA)\/Account Classification in accordance with the joint Under Secretary of Defense, Comptroller\/Deputy Chief Management Officer Memo of September 14, 2012.  The target date for SLOA implementation (with data stored as discrete data elements) is September 2014. This effort will affect the underlying COTS configuration of the system and several RICEW objects in the current environment.  \n\t\n*\tConducted:\no\tMonthly release testing that addresses break fixes including regression.\no\tBusiness Process Reengineering events;\no\tBEA version 10.0 compliance certification review.\no\tPeriodic and automated DAI master data updates leveraging feeds from the authoritative data sources.\no\tMonthly reviews of the DIACAP POA&M to ensure required actions and currency of documentation in Enterprise Mission Assurance Support Service (EMASS) and the Vulnerability Management System (VMS).   \no\tContract renewal competitions and exercise options on existing contracts.  \n\t\t\t\n*\tOversaw\/managed:\no\tResolution of critical software errors and critical statutory\/regulatory enhancements that impact operations and incorporate changes identified during BPR and the Audit generated corrective action plans. \no\tCollection and definition of user requirements.\no\tContractor performance and billing; \no\tCurrency of operational and application software currency and security patches; \no\tCurrency of system requirements with statutory and regulatory policy with regard to function and data standards; \no\tSystem configuration (leveraging the best of DLA’s Gold Standard for documentation) \no\tAll of the databases: production; Test and Development (T&D), training; and COOP at two DECC locations;\no\tInterface communication with existing Federal, DFAS and target Enterprise systems.\no\tOperating system including the internal processes and the operation of several interfaces with external systems leveraging DLA Transaction Services as well as established Federal Enterprise system web services; \no\tUser roles and responsibilities at the system level and guide using Agencies at the Component level.\n\t\t\t\n*\tMonitored the operations of the DISA DECCs at Ogden, UT (Production and T&D (including training); and Columbus, OH (COOP).  \n*\tThe PMO leveraged the DECC for infrastructure support and host site related Information Assurance (IA) and internal controls."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "See PE 0605080S"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "DAI is being developed and implemented using an evolutionary\/incremental strategy including major annual software releases to accommodate upgrades as required by changes to the Department’s BEA including new laws, regulations and policies as governed by its Functional Sponsor and Milestone Decision Authority (MDA).  DAI anticipates receiving an Acquisition Decision Memorandum establishing DAI as a MAIS in the DoD Acquisition Lifecycle.  The DAI PMO will establish an Acquisition Program Baseline with the Program Executive Officer (PEO) and MDA.  The PMO will also prepare for an Acquisition Milestone B review.   \n\nThe PMO is responsible for all aspects of program control and execution. The DAI PMO will use a combination of contract types to support the development of required capabilities.  Since the DAI PMO serves as the system integrator, the PMO will use a collaborative team of support contractors that will provide expertise in critical\/functional areas.  The PMO will re-compete services as they expire.  The PMO will seek to increase small business involvement.  The PMO does not intend to bundle services or obtain a system integrator."
                        },
                        "PerformanceMetrics": {
                            "val": "The following performance metrics will be performed on the DAI system:  \n\nFunctionality: Financial system performance.  PEO will determine substantial compliance with the annual Investment Review of PMO assertion of compliance with the latest version of the Department’s BEA in scope requirements for Defense Financial Management Improvement Guidance (DFMIG) and other laws regulations and policy. Objective: Substantial compliance.\n\nProgram Conformance to BEA Processes, Data Standards, and Business Rules.  The PEO will determine substantial compliance with the annual Investment Review of PMO assertion of compliance with the latest version of the Department’s BEA. Objective: Substantial compliance.\n\nNet Ready Key Performance Parameter (NR-KPP) \nAttribute (Att) A - Support net-centric DoD military operations\nMission: Transform the budget, finance, and accounting operations of the DoD Agencies to achieve accurate and reliable financial information in support of financial accountability and effective and efficient decision making throughout the Defense Agencies in support of the missions of the warfighter.\n\nA.1. Budget to Report (B2R).  DAI provides General Ledger, Trial Balance, Budget Execution, and Financial Reporting Capabilities.  \nDAI will measure the percentage of successful attempts to:\n*   Generate and transmit Trial Balance Reports. Objective-95%;\n*   Receive budget information from agency-specific systems, to support budget execution.  Objective-95%; and \n*   Generate and transmit reports to support period end processing procedures.  Objective-95%\n\nA.2 Procure to Pay (P2P).  DAI provides the capability to Order Materials and Services (Commitments), Record Purchases and Contract Information (Obligations) Pay Bills (Accounts Payable), and Create Ready to Pay File.\nDAI will measure the percentage of successful attempts to:\n*   Exchange contract, obligation, receipt and invoice information with external systems to support procurement processes. Objective-95%;\n*   Receive Purchase Card information from external systems to manage government purchase cards (P-Cards). Objective-95%;\n*   Exchange data across agencies to support intergovernmental Purchase Request (PR) processes.  Objective-95%;\n*   Receive travel related data from external systems to support travel financial accounting events. Objective-95%; and \n*   Exchange miscellaneous payment information with trading partners. Objective-95%.\n\nA.3. Order to Cash (O2C).  DAI provides the capability to Receive Customer Orders, Record Work Performed on the orders, Bill Customers, and Track Accounts Receivable.  \nDAI will measure the percentage of successful attempts to:\n*   Exchange data with external systems to support management of customer orders. Objective-95%;\n*   Exchange receivables data with external systems. Objective-95%; and \n*   Manage exchange collections data with external systems.  Objective-95%.\n\nA.4. Acquire to Retire (A2R). DAI provides the capability to record Asset Acquisition, Depreciation, and Disposal DAI will measure the percentage of successful attempts to:\n*   Receive asset creation information from external systems. Objective-95%;\n*   Accumulate and transmit costs incurred for Capital Assets on Construction in Progress (CIP) and Work in Progress (WIP) projects. Objective-95%;\n*   Generate and transmit property accounting information. Objective-95%;\n*   Receive property maintenance data from external systems. Objective-95%; and\n*   Receive disposal of assets information from external systems. Objective-95%.\n\nA.5. Cost Management (formerly Cost Accounting).  DAI provides Cost Accounting and Allocation Capabilities\nDAI will measure the percentage of successful attempts to:\n*   Receive Project Budgets from external systems. Objective-95%; and \n*   Receive cost data to support cost collection processes. Objective-95%.\n\nA. 6. Hire to Retire (H2R). DAI provides Civilian, Military, and Contractor Time and Labor capabilities DAI will measure the percentage of successful attempts to:\n*   Exchange employee and timekeeping information with external systems. Objective-95%; and \n*   Process and send payroll data to external systems. Objective-95%.\n\nNR-KPP Att B - Managed in the Network\t\n1) Type of Networks that are connected: \n- The DAI application supports multiple Defense Agencies, and thus is accessible from multiple network points. A typical user accesses the application via the web browser from his\/her agency specific LAN\/WAN and\/or local site firewall configurations, traversing through the Non-Classified Internet Protocol Routing Network (NIPRNet) to reach the secure DAI application hosted within the DoD Demilitarized  Zone (DMZ) which is controlled and managed by DISA.\n- The DAI production application is hosted in a DISA DECC environment located in Ogden, UT and is managed by DAI Program Management Office\n\n\n2) MOPs to measure network entrance and management performance:\na) Network related (DISA) – as per DISA Catalog of Services \n-Interactive Availability - Portion of network\/system controlled by DISA CSD available to the partner during the interactive window\n-Batch Throughput – Completion rate and delivery by specified time during batch window specified in SLA\nb) Database related (DAI Program Management Office)\n-System Availability \n-On Line user system response\n\n\n3) Network Management:\n-The Agency (user) being supported is responsible for the communications infrastructure necessary for leaving their location to connect users to the NIPRNet \n-DISA is responsible for communications on NIPRNet between the end user and the main DAI environment\n-DAI Program Management Office is responsible for activities occurring within the application and the Oracle Database\n\n4) Systems Management \n-NIPRNet and Infrastructure  - Centralized within DISA CSD \n-DAI System – centralized within DAI Program Management Office\n\n\n5) Network Configuration Parameters – N\/A (within the realm of DISA management) DAI will measure the percentage of success for:\n*   Supports secure Internet\/NIPRNET access to solution. Interactive Availability. Objective-98.5%;\n*   Supports secure Internet\/NIPRNET access to solution.  Batch Throughput. Objective-95%;\n*   Provides adequate system response and availability to support operations.\tSystem Availability.  (Condition: 5000 users\/hour)  Objective-95%; and\n*   Provides adequate system response and availability to support operations. On-line system response. (Condition: 5000 users\/hour) Objective-95%.\n\nNR-KPP Att C -  Effectively Exchange Information.  \nDAI will satisfy all top-level critical Information Exchange Requirements (IERs) with all required DoD Enterprise, DFAS, Defense Agencies, and Federal Systems, as documented in SV-6.   There are 47 data exchanges with other systems.  The objectives are 100% for accuracy and ten seconds to 1 day for timeliness.  Additional details available upon request.  \n\nMajor Performers\nDISA\nDECC Ogden, Utah\nProduction Support \n\nDISA\nDECC Columbus, OH\nTest and Development, and COOP Hosting Support\n\nDISA\nDECC Mechanicsburg, PA\nTest and Development  \n\nDISA, Joint Interoperability Test Command (JITC)\nIndian Head, MD and Fort Huachuca, AZ\nTest Management and ITT Lead Services, Test tool, Information Exchange\/Interfaces, DLA Transaction Services Instance and limited Operational Assessment Support.\n\nNorthrop Grumman\nMcLean, VA\nInterface and management oversight\n\nDLT Solutions\nHerndon, VA\nApplication and database management support (FY 2012- 2nd Quarter (Q2) FY 2013)\n\nIBM\nBethesda, MD\nGlobal Model Development-Procure to Pay; Budget to Report; and Order to Cash\n\nCACI Inc., Federal\nChantilly, VA\nGlobal Model Development-Cost Accounting; Time and Labor; Acquire to Retire; and Infrastructure Support (Application and database management support (Q2 FY 2013 and beyond). \n\nComputer Sciences Corp\nFalls Church, VA\nGlobal Model Development-Reports, Interfaces, Conversions and Information Assurance"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "4"
                    },
                    "ProjectTitle": {
                        "val": "Defense Information System for Security (DISS)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "21.868"
                        },
                        "PriorYear": {
                            "val": "22.878"
                        },
                        "CurrentYear": {
                            "val": "8.469"
                        },
                        "BudgetYearOne": {
                            "val": "9.958"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.958"
                        },
                        "BudgetYearTwo": {
                            "val": "9.926"
                        },
                        "BudgetYearThree": {
                            "val": "10.572"
                        },
                        "BudgetYearFour": {
                            "val": "9.369"
                        },
                        "BudgetYearFive": {
                            "val": "9.595"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Defense Information System for Security (DISS) is a family of systems solution that specifically addresses the security clearance and suitability determinations requirements of Section 3001 of Public Law 108-458, the Intelligence Reform and Terrorism Prevention Act of 2004 (IRTPA) which requires 90% of all clearances – whether Top Secret, Secret, or Confidential – to be completed within 60 days, as well as supports Homeland Security Presidential Directive 12 (HSPD-12) compliance across the DOD.  The DISS will electronically collect, review, and share relevant data, government-wide, as mandated by the IRPTA and, guided by relevant Executive Orders, Congress, and GAO recommendations, deliver and maintain an appropriately vetted world-class workforce.  \n\nAs a secure, end-to-end IT system, the DISS will be the authoritative source for the management, storage, and timely dissemination of and access to personnel security, HSPD-12, and suitability information and will accelerate the clearance process, reduce security clearance vulnerabilities, decrease back-end processing timelines, and support simultaneous information sharing within various DOD entities as well as among a number of authorized federal agencies.  \n\nThe DISS family of systems is comprised of two components: the Case Adjudication Tracking System (CATS) and the Joint Verification System (JVS).  Once fully deployed, the DISS family of systems will replace the Joint Personnel Adjudication System, which contains approximately six million active security clearance records and supports over 80,000 users.  The DISS has also been designated as the repository for adjudicative results for Suitability and HSPD-12 determinations by the 13 July 2011 USD(I) memo “Storage of Adjudicative Results in the Defense Information System for Security.”"
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Defense Information System for Security (DISS)"
                                    },
                                    "Description": {
                                        "val": "The DISS (CATS) has been designated as the DoD non-Intelligence Community IT system for case management and adjudications by the 10 April 2009 USD(I) memo “Designation of the DoD Case Management and Adjudication Systems.”  Currently, CATS processes over 500,000 cases annually; electronically producing favorable adjudicative decisions for approximately 24% of Secret level cases.\n\nFurther, the 3 May 2012 Deputy Secretary of Defense Memo “DoD Central Adjudication Facilities (CAF) Consolidation” consolidated all DoD Central Adjudication Facilities (CAF) into one consolidated DoD CAF responsible for personnel security adjudicative functions as well as favorable Suitability and HSPD-12 adjudications.  The DISS (CATS) is the DOD CAF’s designated IT case management system.\n\nAchieving the above goals will significantly enhance the operational readiness of the national security community and the Federal government.  It will decrease the time required to get an individual through the investigation process.  It will strengthen and reinforce reciprocity throughout the federal community by eliminating redundant or incomplete investigations by standardizing adjudicative decisions and by making available to all agencies adjudicative determinations of the Federal government."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "22.878"
                                            },
                                            "Text": {
                                                "val": "•\tReceived Acquisition Decision Memorandum from the Milestone Decision Authority approving the CATS transition to full deployment and into the sustainment phase.\n•\tInitiated development of the Case Adjudication Tracking System (CATS) V4.0 electronic processing for the DoD Central Adjudication Facility (CAF) by consolidating all five of the existing CATS applications into a consolidated application that utilizes a single database.  \n•\tObtained additional hardware required to support the CATS and Joint Verification System (JVS) development efforts for the four environments: pre-production, production, development\/test and disaster recovery.  \n•\tPurchased additional DISS software components.  \n•\tDeveloped the JVS prototype to conduct End-User-Experience-Evaluation (EUEE) workshops to verify and validate JVS requirements.  \n•\tContinued development and testing of Defense Manpower Data Center (DMDC) Enterprise Security and Data Services (SDS).\n•\tContinued DISS data migration script development and conducted quality reviews of the migration scripts and data.  \n•\tDeveloped initial DISS common portal functionality.  \n•\tContinued change management\/communications outreach efforts, risk management, and schedule management. \n•\tInitiated the DISS JVS Milestone documentation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.469"
                                            },
                                            "Text": {
                                                "val": "•\tConduct initial analysis and development of the Enterprise Application Integration (EAI) layer.  \n•\tComplete End User Experience Evaluations using simulated DMDC Data Services to test and validate current JVS system and user requirements.  \n•\tInitiate JVS procurement action.    \n•\tFinalize requirements for HSPD-12 and Suitability.  \n•\tComplete development of CATS v4 functionality including human adjudication, reporting, and management capabilities  \n•\tComplete analysis and planning for the CATS physical transfer to the DMDC.  \n•\tComplete development and test of the DMDC SDS and DISS Data Migration.  \n•\tProvide support to Insider Threat and Continuous Evaluation communities. \n•\tContinue change management\/communications outreach, risk management, and schedule management tasks. \n•\tConduct JVS Milestone B review seeking approval of the transition of the JVS to the Engineering Development phase in which the program will refine system requirements, configure the software, build functionality, conduct developmental testing, and plan for operational testing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.958"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.958"
                                            },
                                            "Text": {
                                                "val": "•\tComplete development of the CATS Service Desk application.  \n•\tContinue development and testing of the JVS prototype.  \n•\tDevelop and deploy DISS common portal enhancements.\n•\tInitiate Development of JVS Self-Service user module and JVS Service Desk application.    \n•\tFinalize transfer of the CATS to DMDC.  \n•\tComplete interface development for EAI.  \n•\tComplete DMDC Data Migration for DISS.  \n•\tIntegrate JVS with DMDC Enterprise SDS.  \n•\tProvide support to Insider Threat and Continuous Evaluation communities.  \n•\tContinue change management\/communications outreach, risk management, and schedule management tasks."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Defense Information System for Security (DISS) is being fielded as a Family of Systems (FoS) employing an evolutionary acquisition approach by fielding incremental capabilities.  The CATS v3 is currently deployed to end users; however the CATS v4 Development will support the consolidated DoD Central Adjudication Facility business processes with a single CATS system.  The JVS increment will enter the Business Capability Lifecycle (BCL) at Milestone B, according to the Material Development Decision (MDD) Acquisition Decision Memorandum (ADM) signed by the Milestone Decision Authority on 25 April, 2011.   \n\nThe DISS PMO is responsible for program execution and will employ contract types as directed by the agency contracts policies in order to support the delivery and sustainment of the DISS Capabilities.  DISS development contractors employ an agile development methodology to allow for a flexible approach that incorporates user requirements and feedback throughout the development lifecycle while meeting delivery requirements as prescribed by the associated development contract. The Agile development methodology allows for the fielding of incremental capabilities IAW the program’s acquisition approach."
                        },
                        "PerformanceMetrics": {
                            "val": "N \/ A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "5"
                    },
                    "ProjectTitle": {
                        "val": "Defense Travel System (DTS)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.259"
                        },
                        "BudgetYearOne": {
                            "val": "0.221"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.221"
                        },
                        "BudgetYearTwo": {
                            "val": "0.209"
                        },
                        "BudgetYearThree": {
                            "val": "0.245"
                        },
                        "BudgetYearFour": {
                            "val": "0.248"
                        },
                        "BudgetYearFive": {
                            "val": "0.254"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Defense Travel System (DTS) is a fully integrated, electronic, end-to-end financial management system that automates temporary duty travel for the Department of Defense (DoD). DTS meets unique DoD mission, security and financial system requirements within the guidelines of Federal and DoD travel policies and regulations. DTS automates travel authorizations, reservations and arrangements, voucher processing, payment, reconciliation, accountability and archiving. DTS employs Digital Signature and Login\/Authentication which requires users to provide a signed response using a valid DoD Public Key Infrastructure (PKI) certificate to gain access to the DTS application. Travel documents created in DTS are digitally signed with the user’s PKI certificate to provide a means of identifying the signer, verifying the document’s integrity, and enforcing non-repudiation of the signature by the signer.\n\nDTS is a Major Automated Information System (MAIS), Acquisition Category (ACAT) 1AC program. DTS delivers capability by evolutionary acquisition utilizing incremental development; recognizing up front the need for future capability improvements. DTS has a flexible design so that each increment builds upon its core functionality, dependent on available, mature technology providing increasing capabilities to travelers, travel administrators, and process owners. Full Operational Capability (FOC) was declared in March 2010. Future capability improvements will be implemented as P3I beginning FY 2011."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Defense Travel System (DTS)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "-Continue Program Management and Engineering support to include acquisition compliance reporting, acquisition subject matter expertise, business case analysis, metrics, system analysis, requirements, support, contract execution, contract documentation and test management oversight.\n-Continue \"work-off\" of development related Software Problem Reports (SPRs)\n-Financial Partner System (FPS) system changes\n- Continue to update Interface Control Documents and Memorandums of Agreement (MOA) and perform Limited User Testing (LUT)\n- Continue Program Management and Engineering support to include acquisition compliance reporting, acquisition subject matter expertise, business case analysis, metrics, system analysis, requirements support, contract execution, contract documentation and test management oversight."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.259"
                                            },
                                            "Text": {
                                                "val": "-Continue \"work-off\" of development related Software Problem Reports (SPRs)\n-Continue Program Management and Engineering support to include acquisition compliance reporting, acquisition subject matter expertise, business case analysis, metrics, system analysis, requirements, support, contract execution, contract documentation and test management oversight.\n-Simplify User Interface\/Usability Enhancements\n-User functionality enhancements based upon user community requirements\n-Address system changes if needed in support of DoD Audit Readiness objectives."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.221"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.221"
                                            },
                                            "Text": {
                                                "val": "-Continue \"work-off\" of development related Software Problem Reports (SPRs)\n-Continue Program Management and Engineering support to include acquisition compliance reporting, acquisition subject matter expertise, business case analysis, metrics, system analysis, requirements, support, contract execution, contract documentation and test management oversight.\n-Simplify User Interface\/Usability Enhancements\n-Address system changes if needed in support of DoD Audit Readiness objectives."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "DTS prime contract will be completed within the coming year and separate contracts will be awarded for hosting and sustainment\/development."
                        },
                        "PerformanceMetrics": {
                            "val": "N \/ A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "6"
                    },
                    "ProjectTitle": {
                        "val": "Virtual Interactive Processing System (VIPS)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "12.636"
                        },
                        "PriorYear": {
                            "val": "1.975"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Virtual Interactive Processing System (VIPS) was planned to modernize and automate the Information Technology capabilities for qualifying Applicants into the Military Service.  VIPS would have been the future accessioning system to be used by the US Military Entrance Processing Command (USMEPCOM) and would have replaced their legacy system, USMEPCOM Integrated Resource System (USMIRS). USMEPCOM serves as the single entry point for determining the physical, aptitude, and conduct qualifications of candidates for enlistment. VIPS would have provided the capability to electronically acquire, process, store, secure, and seamlessly share personnel data across the Accessions Community of Interest. If VIPS had been fully implemented, VIPS would have reduced the cycle time required to induct enlistees to meet the needs of Homeland Defense, reduced the number of visits to the Military Entrance Processing Stations, reduced manual data entry errors, and reduced attrition through better pre-screening practices. GAO reported that better pre-screening practices would have yielded cost savings and cost avoidance of $83M per year for the VIPS automated elements.  \n\nDue to schedule delays and further refinement of the requirements, VIPS entered into a Critical Change state on May 11, 2011.  The Department of Defense (DoD) Deputy Chief Management Officer (DCMO) Acquisition Decision Memorandum dated December 7, 2012, cancelled the VIPS program and directed the Defense Logistics Agency (DLA) to conduct a Technical Demonstration (TD) of a Service-Oriented Architecture (SOA) to inform any future acquisition approach to meet existing requirements."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Virtual Interactive Processing System (VIPS)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.975"
                                            },
                                            "Text": {
                                                "val": "In FY 2013 the VIPS PMO acted in accordance with the DCMO directive to conduct a TD of a SOA capabilty to inform any future acquisition approach to meet existing requirement that was issued in FY2012.  Concluded any existing VIPS development efforts as part of a smart shutdown.  Additionally, conducted an orderly shutdown of the existing VIPS development efforts.  Identified critical deliverables such as hardware, design specifications, instrumentation, modeling tools, etc. for delivery to the Government.  \n\nIn coordination with USMEPCOM the former VIPS PMO established a TD for a Medical Pre-Screen Capability.  The TD was initiated in FY2013 and was established to inform an acquisition approach and business case for a future program to meet the existing USMEPCOM accession system requirements.  The TD was also established to serve as a risk reduction for a SOA link to the integrated Electronic Health Record (iEHR)program."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Originally the VIPS Progam had intended to align with the BCL and had planned to use an incremental approach to satisfy USMEPCOM’s requirements. Requirements had been articulated to support the development of the core platform for VIPS as well as capabilities to fully assess a candidate into the military. The revised Increment 1.0 content would have provided sufficient capability to retire the legacy system, USMEPCOM Integrated Resource System (USMIRS) through a series of capability deployments beginning in FY 2014. Future increments would have addressed the full VIPS capabilities necessary to realize the Return on Investment (ROI).\n\nOriginally the VIPS Increment 1.0 was procured under a single contract, competitively awarded to provide both a core infrastructure and business functions to support the accessions process. The VIPS PMO awarded a single Increment 1.0 contract on September 30, 2010 that would have initially provided for the design of VIPS Increment 1.0 through PDR. The prime contractor sucessfully completed the design, development, and acceptance testing of the ROC prototype. On May 11, 2011, the VIPS PMO entered Critical Change state and the DCMO directive dated December 7, 2012 issued new direction for the program to conduct a TD for a SOA capability.  The VIPS PMO has complied with the DCMO directive and is currently working with the prime contractor to satisfy the memo's direction."
                        },
                        "PerformanceMetrics": {
                            "val": "N \/ A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "7"
                    },
                    "ProjectTitle": {
                        "val": "Wide Area Work Flow (WAWF)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "WAWF is the DoD enterprise system for secure electronic submission, acceptance and processing of invoices. It is mandated for use by all DoD Services and Agencies for electronic invoicing by DFAR 252.232-7003. WAWF processes over 86 million transactions worth $301B per year and saves DoD millions of dollars annually in processing cost and avoided interest (over $77.6 M in FY10). WAWF brings together the invoice, the receiving report, and the contract from EDA to provide the accounting and entitlement systems with the three-way match needed to authorize payment. WAWF is also the Enterprise data entry point for the Item Unique Identifier (IUID) and Government Furnished Property (GFP) programs, the source of receipt and acceptance data for Service Enterprise Resource Planning Systems (ERP), and is central for the Business Enterprise Architecture (BEA) enterprise solutions for Standard Financial Information Structure (SFIS) and Inter Governmental Transfer (IGT). The benefits to DoD are a single face to industry suppliers, global accessibility of documents, reduced need for re-keying, improved data accuracy, real-time processing, secure transactions with audit capability, and faster processing resulting in reduced interest penalties. For vendors, benefits include the capability to electronically submit invoices, reduction of lost or misplaced documents, and online access to contract payment records."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Wide Area Work Flow (WAWF)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Continue System\/Program Testing and Analysis including integration of multiple systems developed for multiple\norganizations by multiple vendors into the Electronic Commerce Infrastructure.\n- Continue Joint Interoperability Test Command (JITC) developmental, system\/integration, and Operational\nAcceptance Testing for each version release of WAWF systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N \/ A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N \/ A"
                        },
                        "PerformanceMetrics": {
                            "val": "N \/ A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "8"
                    },
                    "ProjectTitle": {
                        "val": "Defense Retired and Annuitant Pay System (DRAS)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "2.581"
                        },
                        "PriorYear": {
                            "val": "4.200"
                        },
                        "CurrentYear": {
                            "val": "8.229"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The primary objective of Defense Retired and Annuitant Pay System 2 (DRAS 2) is to establish and maintain a modernized retired military pay accounts.  DRAS 2 will replace the current Defense Retiree and Annuitant Systems (DRAS) and selected manual processes with proven state of the market technology using Clinger-Cohen guidance for selection of the solution.  Rapid fielding techniques will be used to close business process gaps by delivering incremental capability that provides clear financial benefits.  This modernization will allow for the consolidation of disparate DRAS systems and processes, the reduction of system redundancies and inefficiencies, increased customer satisfaction and compliance to Department of Defense (DoD) and federally mandated Information Assurance (IA) requirements.  The DRAS2 modernization is in keeping with the DoD Strategic Management Plan for FY2014-2015 goals and the White House CIO Council 2.0 initiatives.  In FY2015, DRAS 2 has it's own PE 0605090S separate from the PE referenced in this submission."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Defense Retired and Annuitant Pay System (DRAS)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.200"
                                            },
                                            "Text": {
                                                "val": "Continue with the FY 2012 three primary objectives:\n\n-Establish retired military pay system.\n-Replace antiquated legacy system.\n-automate many manually intensive processes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.229"
                                            },
                                            "Text": {
                                                "val": "DRAS2 primary baseline activity will be to ensure the finalized Functional Requirements are received by the Functional Sponsor (DFAS) in an effort to receive a Material Development Decision (MDD) which will allow for the following achievements to be realized:\n-DRAS2 will obtain Final Contract Award on the Integration of services.\n-DRAS2 will obtain the appropriate COTS software licensing and begin the establishment of hosting and transport services.  \n-DRAS2 will begin Milestone-A activities to include: Cost Estimate, Economic Analysis, and Market Research.\n-DRAS2 to develop all appropriate artifacts and documentation in alignment with Business Capability Lifecycle (BCL) policy. This includes establishing strategies in the development and submission of all required documents to proceed to Milestone B; Systems Engineering Plan, Configuration Management Plan, Risk Management Plan"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "During FY2014, a System Development Task Order Delivery contract will be established for DRAS2 in order to begin system development activities.  Acquisition activities will follow the Business Capabilities Lifecycle (BCL) and system development will be in an incremental approach."
                        },
                        "PerformanceMetrics": {
                            "val": "N \/ A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "9"
                    },
                    "ProjectTitle": {
                        "val": "Enterprise Funds Distribution (EFD)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.003"
                        },
                        "PriorYear": {
                            "val": "5.457"
                        },
                        "CurrentYear": {
                            "val": "4.900"
                        },
                        "BudgetYearOne": {
                            "val": "4.190"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.190"
                        },
                        "BudgetYearTwo": {
                            "val": "3.700"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Enterprise Funds Distribution (EFD) is a multi-service\/multi-agency solution established as a key initiative to provide full visibility of funds distributed through echelon I and II for the Military Departments and at all levels for the Defense Agencies to improve and modernize the OUSD(C) funds distribution process.   Funds distribution by its nature is a key enabler of financial visibility within DoD enterprise systems. The concept of a fully visible enterprise funds distribution process serves as a reference where planned and coordinated funds development and execution takes place.  \n\nWithin the current DoD environment, progress has been made streamlining a diverse set of stove-piped budget execution and funds distribution processes and systems.  Efforts continue to improve the visibility of funding information, eliminate manual efforts and  undue complexities to the management of budget authority, and to eliminate impediments in the flow of funding documents.  The current environment relies heavily on manual processing and on disconnected standalone systems for the processing of Funding Authorization Documents (FADs) and reprogramming actions.   This environment made the implementation of internal controls difficult, negatively impacted the accuracy and timeliness of information while making the processes of integrating and obtaining management information arduous.  \n\nThe envisioned operational environment solves these problems by enabling lifecycle program value management in a web-based application utilizing an authoritative database with single-source data entry and automated workflow.  Capabilities within this integrated environment will enable the automation of all funds distribution and funds control processes within OUSD(C) using authoritative and highly visible data.  Specifically, capabilities include managing apportionments, distributing budget authority to the Military Departments and Defense Agencies, managing rescissions and continuing resolutions, creating and tracking reprogramming actions, and establishing program baselines and budget authority needed to support changes in funding priorities throughout the year.\n\nThe operational environment includes organizational elements down to the echelon II level responsible for managing DoD and Component appropriations operating in an unclassified environment.  The web-based application provides pre-planning, apportionment, reprogramming, rescission, continuing resolution, reporting of enterprise-level funds control and distribution of appropriated funding."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Enterprise Funds Distribution (EFD)"
                                    },
                                    "Description": {
                                        "val": "EFD will distribute funds to the Military Departments and the Defense Agencies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.457"
                                            },
                                            "Text": {
                                                "val": "•         Commenced development efforts to configure EFD to support lower level funds distribution to the final allotment holder.  \n\n•         Commenced work on the technology refresh\/upgrade of the COTS Momentum software software from Version 6.4.1 to 7.0.2.  This upgrade will provide usability enhancements and efficiencies for the EFD users."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.900"
                                            },
                                            "Text": {
                                                "val": "Modernization efforts for FY2014 focus on activities to continue the configuration of the COTS solution to support lower level funds distribution for all Defense Organizations receiving and distributing Defense-Wide funding. Activities planned for FY2014 include: \n\n• Add additional distribution levels within EFD to accommodate the Defense Organizations \n\n• Continue to configure the Budget Structure in EFD for the lower level funds distribution \n\n• Configuration of detailed reports \n\n• Delivery of a standard out-bound interface to Agency ERPs and accounting systems \n\n• Complete the Technology Refresh\/Upgrade of the COTS Momentum software from Version 6.4.1 to Version 7.0.2 \n\n• Configure USSGL to support deployment of the DoD Standard Line of Accounting \n\n• Configure drill-down capability for reports \n\n• Improve integration between system modules \n\n• Improve usability of the ad-hoc reporting"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.190"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.190"
                                            },
                                            "Text": {
                                                "val": "•         System integration and regression testing for the new configuration of the budget structure in EFD for the lower level funds distribution process\n\n•         Extensive training for the users at the Defense Organizations\n\n•         Planned implementation of the first subset of Defense Organizations onto EFD\n\n•         Conversion of Family Housing data into EFD"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The EFD strategy is to use a “single acquisition to full capability,” commercial-off-the-shelf (COTS) solution (Momentum software).  The effort needed to ensure EFD is fully implemented for all appropriation data for the Military Services and Defense Organizations has led to a full deployment date of September 2016."
                        },
                        "PerformanceMetrics": {
                            "val": "•         For performance, the objective is that 100% of the SFIS elements are SFIS compliant at FD."
                        }
                    }
                }
            ]
        }
    }
}