{
    "id": "b95b9060bfda8aad000a5264a54c0b933e319304",
    "meta": {
        "filename": "dod-2015_RDTE_2015_OSD_RDTE_JustificationBook_Office_of_Secretary_Of_Defense_PB_2015.zzz_unzipped_RDTE_JustificationBook_Office_of_Secretary_Of_Defense_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602000D8Z"
        },
        "ProgramElementTitle": {
            "val": "Joint Munitions Technology"
        },
        "R1LineNumber": {
            "val": "8"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "20.298"
            },
            "PriorYear": {
                "val": "18.701"
            },
            "CurrentYear": {
                "val": "17.959"
            },
            "BudgetYearOne": {
                "val": "20.065"
            },
            "BudgetYearOneBase": {
                "val": "20.065"
            },
            "BudgetYearTwo": {
                "val": "20.085"
            },
            "BudgetYearThree": {
                "val": "20.177"
            },
            "BudgetYearFour": {
                "val": "20.181"
            },
            "BudgetYearFive": {
                "val": "20.421"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program addresses applied research associated with improving the lethality, reliability, safety, and survivability of munitions and weapon systems.  The goal is to develop and demonstrate joint enabling technologies that can be used by the Program Executive Officers (PEOs) as they develop their specific weapon programs.  The program invests in and demonstrates technologies from a Joint Service perspective, thus maximizing efficiencies, ensuring the development of technology with the broadest applicability while avoiding duplication of efforts.\n\nMunition Area Technology Groups (MATGs) and Fuze Area Technology Groups (FATGs) have been established for each munition and capability area and are tasked with: 1) coordinating, establishing, and maintaining 2018, and 2023 year technology development plans and roadmaps, 2) coordinating biannual meetings to review technical and programmatic details of each funded and proposed effort, 3) developing and submitting Technology Transition Agreements in coordination with appropriate PEOs for insertion in their Insensitive Munitions (IM) Strategic Plans \/ Fuze Technology Development Plan, and 4) interfacing with other MATGs \/ FATGs and IM \/ fuze science and technology projects as appropriate.  The Joint Insensitive Munitions Technology Program (JIMTP) and Joint Fuze Technology Program (JFTP) will utilize a Technical Advisory Committee (TAC) (consisting of senior Department of Defense (DoD) and Department of Energy (DOE) laboratory representatives, and senior Munitions PEO representatives) to provide program oversight, policy, direction, and priorities during its annual meeting.\n\nThe Insensitive Munitions (IM) effort will demonstrate enabling technologies needed to develop weapons in compliance with requirements established in United States Code, Title 10, Chapter 141, Section 2389 and DoD Instruction 5000.1.  This effort will take promising technologies demonstrated at the laboratory scale and transition them into demonstration programs utilizing generic hardware based on priority munitions identified in the PEO IM Strategic Plans.  Mature demonstrated IM technology can be transitioned, thereby decreasing their program costs and schedule risk and facilitating spin-offs to other non-compliant munitions within their portfolios.\n\nThe JIMTP investments focus on five Munition Areas:  1) High Performance Rocket Propulsion (HPP), 2) Minimum Signature Rocket Propulsion (MSP), 3) Blast and Fragmentation Warheads (BFW), 4) Anti-Armor Warheads (AAW), and 5) Gun Propulsion (GP).  MATGs, under tri-service leadership, have developed technology roadmaps for each Munition Area that are used to guide investments based on goals consistent with the DoD IM Strategic Plan.  These IM technologies, alone or in combination, will be developed and tested at the small-scale, and for eventual incorporation in hardware, simulating real-world munitions, to demonstrate their utility and feasibility. \n\nThe Enabling Fuze Technology effort will also demonstrate fuze enabling technologies needed to develop weapons that address priority capability areas identified in the Guidance for Development of the Force (GDF), the Secretary of Defense Memorandum, DoD Policy on Cluster Munitions and Unintended Harm to Civilians, and shortfalls in current weapon systems.  This effort will develop fuzing technologies and mature them for transition into advanced technology (6.3) programs and\/or design tools and protocols for weapon fuzing.  In this way, the Service and Industrial base weapon and fuze will be able to heavily leverage and apply these emerging and promising technologies in fuzing modeling and simulation tools, multi-point initiation, high reliability fuze architectures, survivable components, modular fuze packaging, and fuze sensor. \n\nThe Joint Fuze Technology Program investments focus on four specific capability areas that have been identified by Department strategic guidance and current shortfalls in weapon systems and will be validated by the PEOs and the Heads of the Service Science and Technology (S&T) communities.  These capability areas are:  1) Hard Target Survivable Fuzing, 2) Tailorable Effects Weapon Fuzing, 3) High Reliability Fuzing, and 4) Enabling Fuze Technologies and Common Architecture."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "20.615"
                },
                "CurrentYear": {
                    "val": "20.065"
                },
                "BudgetYearOne": {
                    "val": "21.556"
                },
                "BudgetYearOneBase": {
                    "val": "21.556"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "18.701"
                },
                "CurrentYear": {
                    "val": "17.959"
                },
                "BudgetYearOne": {
                    "val": "20.065"
                },
                "BudgetYearOneBase": {
                    "val": "20.065"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.914"
                },
                "CurrentYear": {
                    "val": "-2.106"
                },
                "BudgetYearOne": {
                    "val": "-1.491"
                },
                "BudgetYearOneBase": {
                    "val": "-1.491"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-2.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "-1.701"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "-0.028"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.178"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Strategic Efficiency Savings"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-1.491"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.491"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC Adjustments"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "-0.106"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.007"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The reduction is a strategic efficiency approach to reduce funding and staffing.  As a result, we provide a better alignment of funding and provide support to a smaller military force."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P000"
                    },
                    "ProjectTitle": {
                        "val": "Insensitive Munitions"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "14.474"
                        },
                        "PriorYear": {
                            "val": "12.895"
                        },
                        "CurrentYear": {
                            "val": "13.936"
                        },
                        "BudgetYearOne": {
                            "val": "13.571"
                        },
                        "BudgetYearOneBase": {
                            "val": "13.571"
                        },
                        "BudgetYearTwo": {
                            "val": "13.580"
                        },
                        "BudgetYearThree": {
                            "val": "13.569"
                        },
                        "BudgetYearFour": {
                            "val": "13.561"
                        },
                        "BudgetYearFive": {
                            "val": "13.729"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Insensitive Munitions (IM) Technology Program (JIMTP) aims at developing the enabling technologies needed to build weapons in compliance with requirements established in statute (United States Code, Title 10, Chapter 141, Section 2389) and regulation (DoDI 5000.1 and CJCSI 3170.01F).  This effort will take promising technologies developed at the laboratory scale and transition them into demonstration programs utilizing generic hardware based on the priority munitions identified in the DoD IM Strategic Plan.  Mature and demonstrated IM technology can be transitioned, thereby decreasing the program costs and schedule risk.  This will additionally promote spin-offs to other non-compliant munitions within the DoD portfolio.  Without new technology, future variants of current weapon systems will have the same, or worse, response to IM stimuli.  New weapon developments will face similar challenges. \n\nThe JIMTP investments focus on five Munition Areas:  1) High Performance Rocket Propulsion, 2) Minimum Signature Rocket Propulsion, 3) Blast and Fragmentation Warheads, 4) Anti-Armor Warheads, and 5) Gun Propulsion.  Munition Area Technology Groups (MATGs), under tri-service leadership, have developed technology roadmaps for each Munition Area that are used to guide investments based on goals consistent with the DoD IM Strategic Plan.  The program is structured around these five areas with clear cross-cutting tasks."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "High Performance Rocket Propulsion (HPP)"
                                    },
                                    "Description": {
                                        "val": "High Performance Rocket Propulsion (HPP) focuses on the development and demonstration of technologies to improve the IM response of HPP systems (rocket motors with Ammonium Perchlorate and with or without a metal fuel) for rockets and missiles launched from air, ground, and sea platforms.  These technologies, when applied to rocket motors, improve to one or more threats, while not degrading the response to other IM threats and at least maintaining munition performance.  Technologies include, but are not limited to, rocket propellant ingredients (including synthesis, characterization and scale-up), reduced smoke or smoky propellants (including formulation, characterization and scale-up), rocket motor case design, materials for active and passive thermal mitigation, shock mitigation materials and techniques, passive and active coatings, active and passive venting techniques for motor cases or containers, ignition systems, sensors, and thrust mitigation techniques.  Operating conditions may be controlled or widely varying in both temperature and vibration.  The 2018 and 2023 year goals of the HPP MATG are concentrated on solving the IM response of missile propulsion systems due to Fragment Impacts and Slow Cook Off for the majority of HPP rocket motors, and solving the Fast Cook Off response of very large HPP motors."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.894"
                                            },
                                            "Text": {
                                                "val": "-  Studied thermal and mechanical responses of composite cases to slow cook off and aerodynamic heating. \n-  Completed scale up of high performance rocket propellants to five gallon size batches, refined processing procedures and conducted sensitivity and safety testing.\n-  Completed final assembly and conducted slow and fast cook off IM tests.\n-  Characterized novel ionic liquid candidates for high performance propulsion.  Downselected, scaled-up to one pound, and conducted mechanical property testing.\n-  Completed burning rate measurements and dynamic mechanical analysis of novel binder materials."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.772"
                                            },
                                            "Text": {
                                                "val": "-  Determine the IM response of less reactive propellants in steel and composite cases by conducting IM testing on sub-scale analogue motors.\n-  Characterize less reactive propellants with advanced ingredients with safety testing, mechanical property measurements, variable confinement cook off testing, and slow cook off visualization testing.\n-  Conduct small scale cook-off testing and gap testing on novel ionic liquid candidates for high performance propulsion.  \n-  Conduct small-scale slow cook-off study correlating historical subscale and full scale slow cook-off data for high performance rocket motors.  \n-  Formulate a novel high performance propellant in 1 pound quantities and conducted initial studies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.699"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.699"
                                            },
                                            "Text": {
                                                "val": "-  Synthesize and characterize less reactive ingredients for high performance rocket motor propellant that will maintain missile performance.\n-  Conduct bench-top testing of motor case venting devices.\n-  Conduct sub-scale testing and analysis to validate a new sub-scale test to predict full-scale reactions in cook-off and impact testing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Minimum Signature Rocket Propulsion (MSP)"
                                    },
                                    "Description": {
                                        "val": "Minimum Signature Rocket Propulsion (MSP) focuses on the development and demonstration of technologies to improve the IM response of MSP systems.  The development and demonstration of minimum signature (MS) rocket technologies, when applied to munition systems, will improve munition IM response to one or more threats, while not degrading the response to other IM threats and at least maintaining munition performance.  Technologies include but are not limited to MS rocket propellant formulations, ingredients for MS propellant formulations (including synthesis, characterization and scale-up), case and packaging design, active and passive venting techniques, rocket motor case design, ignition systems and thrust mitigation techniques. Of particular interest are technologies that provide a higher burning rate minimum signature propellant with state-of-the-art energy and reduced shock sensitivity.  The 2018 and 2023 year goals of the MSP MATG are concentrated on solving the IM response of missile propulsion systems due to Fragment Impact, Slow Cook Off, and Shaped Charge Jet (SCJ) threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.994"
                                            },
                                            "Text": {
                                                "val": "-  Generated 500 grams of novel coated material.  Characterized new materials, including safety and compatibility testing.  Performed small-scale IM tests on best candidates.\n-  Mixed pint-sized batches of coated materials and conducted mechanical, safety, and ballistic testing of the mixes.\n-  Synthesized, scaled-up, and performed safety testing on state of the art energetic materials.  Performed predictive thermochemical calculations for potential formulations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.651"
                                            },
                                            "Text": {
                                                "val": "-  Generate multi-gram batches of novel coated materials.  Produced 1 pint-scale mixes of two promising minimum signature propellants.\n-  Scale up and produced multi-grams of novel material. Built and down-selected candidate materials for unique venting mechanism.\n-  Characterize two min signature propellants in a unique configuration to determine the go\/no go threshold and investigated other design factors that contribute to ignition, to aide in the development of a modeling and simulation effort designed to predict the reaction of an analog rocket motor under fragment impact.\n-  Complete propellant development program using new binder and conducted gap testing.\n-  Conduct initial screening studies on two ingredients that have potential for MS propellants through solubility and ignition sensitivity testing.\nFurther narrowed the operational range for the autoignition materials and conducted trade studies.\nDemonstrated Army Burn-to-Violent Reaction (ABVR) screening test as discriminator for reaction violence."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.577"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.577"
                                            },
                                            "Text": {
                                                "val": "-  Conduct mechanical, safety, and card gap testing, and determine ballistic properties of novel coated material minimum signature propellant. \n-  Conduct design of experiments of candidate formulations and down-select to most promising candidate to provide desired performance characteristics. \n-  Conduct final characterization tests and slow cook-off tests to validate formulation. \n-  Build and test unique venting mechanisms in various configurations in environmental and cook-off tests."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Blast and Fragmentation Warheads (BFW)"
                                    },
                                    "Description": {
                                        "val": "Blast and Fragmentation Warheads (BFW) focuses on the development and demonstration of technologies to improve the IM response of Blast\/Fragmentation munitions.  The development and demonstration of explosive ingredients and explosives and warhead and fuze technologies that, when applied to munitions, improve IM response to one or more threats, while not degrading the response to other IM threats and at minimum maintain munition performance.  Munition operating conditions may be controlled or have widely varying environmental conditions, such as temperature and vibration, and other factors such as cost, availability and reliability may be critically important depending on the intended munition application.  Technologies include but are not limited to new ingredient synthesis and characterization, initial formulation development, scale-up, warhead\/charge configuration, venting techniques for both munitions and their containers, protection or packaging materials and systems, shock mitigation liners, initiation devices, techniques, and technologies.  Applications vary but include high performance warhead fills, booster explosives, bulk demolition charges, and bulk fills for blast and\/or fragmentation charges.  The 2018 and 2023 year goals of the BFW MATG are concentrated on solving the IM response of blast fragment warheads to the Sympathetic Detonation, Fast Cook Off, and SCJ threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.281"
                                            },
                                            "Text": {
                                                "val": "-  Concluded manufacturing studies and weaponization study for Compounded HE Composites and prepared to demonstrate IM characteristics of unique warhead explosive material. \n-  Concluded down-selecting materials and the sensitization process in order to conduct device scale testing to validate the process. \n-  Conducted characterization studies on novel explosive material. \n-  Conducted laboratory scale formulation, processing and analysis of melt cast enhanced blast and environmentally friendly explosive fill. \n-  Optimized novel explosive fill formulation for general purpose bombs. \n-  Conducted initial synthesis of unique booster materials for explosives.\n-  Scaled up to 10 gallon batch mix and conducted initial characterization tests of innovative explosive fill for general purpose bombs and transition to BA 6.3.\n-  Synthesized and characterized unique energetic material. Conducted initial sensitivity testing on the materials."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.796"
                                            },
                                            "Text": {
                                                "val": "-  Complete device scale experiments on sensitization process and transition to BA 6.3 project.\n-  Perform one kilogram scale-up of additional composite materials.  Formulated and tested IM characteristics of the material.  \n-  Synthesize 60 kilograms of new explosive ingredients and formulated explosives on the ten gallon scale.  Determined mid-scale performance and IM properties of new formulations.\n-  Conduct thermal cycling and IM testing on novel explosive material. \n-  Scale up to one gallon mix a melt cast enhanced blast explosive fill and performed sensitivity and performance testing. \n-  Prepare to transition to Task under PE 603000D8Z\/P301. \n-  Conduct characterization and performance testing, as well as IM assessments for novel general purpose bomb explosive fill formulation. Conducted characterization testing and down selected unique explosive booster material and transition to Task under PE 603000D8Z\/P301.\n-  Produce small quantities of unique energetic material for formulation and characterization testing.\n-  Conduct synthesis optimization process for novel energetic material and scaled up to produce several 100 gram batches."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.723"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.723"
                                            },
                                            "Text": {
                                                "val": "-  Scale up synthesis process of novel energetic material to produce 1 kg batches to provide multiple grain size material. Examine fundamental properties and conduct characterization testing on manufactured materials.  \n-  Perform safety, IM, and performance testing on novel energetic formulations.  Analyze results to define failure diameter and establish baseline data for designing IM formulations for transition to a possible 6.3 demonstrator.\n-  Scale up to 40 gram batches unique energetic material and conduct performance and thermal response testing.\n-  Prove concept for detonation train for IM fills for large warheads.  Analyze data for formulation to assess the insensitivity to an IM threat.\n-  Predict the potential for passing sympathetic reaction testing based on explosive data gathered during preliminary small-scale testing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Anti-Armor Warheads (AAW)"
                                    },
                                    "Description": {
                                        "val": "Anti-Armor Warheads (AAW) focuses on the development and demonstration of explosive ingredients, explosives, warhead and fuze technologies for improving IM of AAW munitions.  The development of explosive ingredients, explosives and warhead and fuze technologies that, when applied to munitions, improve IM response to one or more threats, while not degrading the response to other IM threats and at minimum maintain munition performance.  Technologies include but are not limited to new ingredient synthesis and characterization, initial formulation development, scale-up, warhead\/charge configuration, venting techniques for both munitions and their containers, protection\/packaging materials and systems, shock mitigation liners, and initiation devices, techniques, and technologies.  Applications vary but include high performance warhead fills, booster explosives, and all other technology to mitigate the violent response of Anti-Armor Warhead munitions to IM threats.  Munition operating conditions may be controlled or have widely varying environmental conditions, such as temperature and vibration, and other factors such as cost, availability, and reliability may be critically important depending on the intended munition application.  The 2018 and 2023 year goals of the AAW MATG are concentrated on solving the IM response of anti-armor warheads to the Fragment Impact, Sympathetic Reaction and Shaped Charge Jet threats for larger munitions and the Fragment Impact, Slow Cookoff, and Sympathetic Reaction \/ Shaped Charge Jet threats for Medium Caliber Munitions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.673"
                                            },
                                            "Text": {
                                                "val": "-  Conducted critical diameter and slow cook-off IM tests of down-selected formulations.\n-  Conducted formulation and initial screening of explosive material to determine physical and performance characteristics.   Prepared to transition to Task under PE 603000D8Z.\n-  Conducted initial formulation work and baseline testing on cast cured explosive, using fine grain materials. \n-  Conducted characterization tests on unique combined effects explosive.\n-  Conducted scale-up to one pound batch and demonstrated acceptable fragment testing for novel, cast cured, multi-effects explosives formulation. Conducted engineering assessment and began production of precursor materials for high energy melt-phase explosive.\n-  Scaled up to pint mixes formulations of energetic materials with less nitramine content and enhanced insensitivity. \n-  Produced 50 pounds of unique high energy melt cast explosive formulation precursor material for initial evaluation. \n-  Developed baseline data for modeling explosive reactions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.557"
                                            },
                                            "Text": {
                                                "val": "-  Scale up and conduct IM testing of energetic materials with less nitramine content and enhanced insensitivity. \n-  Conduct small scale performance and mechanical properties testing on unique combined effects explosive formulation.  \n-  Conduct aging study  and scaled up formulations to 50 pound batches for novel, cast cured, multi-effects explosives formulation.  \n-  Conduct larger scale formulation (five pounds) of explosive material and performed intermediate scale IM and performance tests.\n-  Produce unique high energy melt cast explosive formulation material for initial characterization and evaluation testing.\n-  Characterize materials, formulated, and down-selected high energy melt-phase explosive. \n-  Scale up to five gallon mix, conducted initial testing, completed aging study, and conducted standard IM tests on novel, cast cured, multi-effects explosives formulation. \n-  Scale up high energy pressed explosive and conducted performance testing. \n-  Assess additional explosive materials to validate the baseline model data.\n-  Down-select optimized formulation and conducted IM testing on cast cured explosive, using fine grain material.  Prepared to transition to Task under PE 603000D8Z."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.485"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.485"
                                            },
                                            "Text": {
                                                "val": "-  Scale up synthesis of newly identified explosive ingredient with high performance and low sensitivity potential.\n-  Development and characterization of explosive formulations using a recently scaled-up newly identified explosive ingredient.\n-  Conduct slow cook-off and small scale sympathetic detonation test on unique combined effects explosive formulation. \n-  Down-select formulations of energetic materials composed of finer particle size nitramine content and enhanced insensitivity and conduct small scale cookoff and fragment impact testing. Prepare five pound batches of selected formulation.\n-  Conduct small scale slow cook-off, fragment impact and shaped charge testing on unique high energy melt cast explosive formulation.\n-  Design surrogate munition and shaped charge jet impact initiation testing configurations to demonstrate models utility for weapon design."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Gun Propulsion (GP)"
                                    },
                                    "Description": {
                                        "val": "Gun Propulsion (GP) focuses on the development and demonstration of technologies in the area of Gun Propulsion systems.  The development and demonstration of gun propulsion technologies, that when applied to munition systems, will improve munition IM response to one or more threats, while not degrading the response to other IM threats and at least maintaining munition performance.  Technologies include but are not limited to gun propellant formulations, ingredients for gun propellant formulations (including synthesis, characterization and scale-up), cartridge case and packaging design, active and passive venting techniques, reduced sensitivity primer propellant and primer systems, and robust primers for insensitive propellants.  Applications vary, but include both large and medium caliber munitions, as well as propelling charges for mortars and shoulder launched munitions.  Operating requirements vary, and other factors such as barrel life and operation over varying environmental conditions may be critically important depending on the intended munition application.  The 2018 and 2023 year goals of the GP MATG are concentrated on solving the IM response of gun propulsion munitions to Fragment Impact and Slow Cook Off threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.053"
                                            },
                                            "Text": {
                                                "val": "-  Established design of experiments test matrix and complete subsequent modeling effort.  \n-  Concluded IM and mechanical tests on containers and compared results with the models’ predictions.  \n-  Optimized formulation and conducted IM tests to determine viability of down-select candidate for gun propellants.  \n-  Continued formulation development to manufacture three kilogram batches for extrusion into 15 pounds of propellant.  \n-  Conducted various tests to validate IM properties and suitability for gun propellant.  \n-  Performed initial characterization of ignition propellants after exposure to novel ignition methodology. \n-  Scaled up novel binder material to 25 gram batches and characterized material thermal and sensitivity properties. \n-  Conducted thermal and sensitivity testing on propellant formulation effort using unique less sensitive binder propellant. \n-  Conducted initial testing on representative samples to develop small-scale slow cookoff testing protocol."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.160"
                                            },
                                            "Text": {
                                                "val": "-  Conduct performance IM testing of down-selected candidates for gun propellants.\n-  Continue formulation development to manufacture six kilogram batches for extrusion into 30 pounds of propellant.  Conduct various tests to validated IM properties and suitability for gun propellant.\n-  Design and fabricate apparatus to test propellants and develop modeling code for small-scale slow cook-off protocol.\n-  Develop properties of ignition propellants after exposure to novel ignition methodology.  Performed sub-scale performance testing. Produce one gallon mixes of novel binder to complete IM testing. \n-  Scale up six pounds of unique less sensitive binder propellant formulation and conduct characterization testing.\n-  Conduct small scale unique processing of propellant grains."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.087"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.087"
                                            },
                                            "Text": {
                                                "val": "-  Conduct slow cook-off tests in new apparatus to validate test small scale test protocol for propellant formulations.   \n-  Establish data set of required material characteristics after exposure to novel ignition methodology.\n-  Down select unique process ingredients and complete sub-scale IM testing of propellant."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0603000D8Z P002"
                                    },
                                    "Title": {
                                        "val": "BA 3 Insensitive Munitions Advanced Technology"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "15.702"
                                        },
                                        "CurrentYear": {
                                            "val": "16.601"
                                        },
                                        "BudgetYearOne": {
                                            "val": "19.807"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "19.807"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "19.993"
                                        },
                                        "BudgetYearThree": {
                                            "val": "19.953"
                                        },
                                        "BudgetYearFour": {
                                            "val": "20.018"
                                        },
                                        "BudgetYearFive": {
                                            "val": "20.163"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "1) Transitions of technologies developed by the Program are tracked and documented using DoD\/NASA Technical Readiness Level (TRL) scale. \n2) Munition Area Technology Group Technology Roadmaps are prepared, evaluated, and analyzed by Joint Insensitive Munitions Technology Program management and technical staff. \n3) Chairman's Annual Assessments for each MATG are critically reviewed by the Technical Advisory Committee to determine progress, transition plans, and relevance of each project.  \n4) Project progress toward goals and milestones is assessed at each MATG meeting.  \n5) Annual technical reports and papers are tracked and documented for the Program. \n6) External Peer Review of Projects conducted as part of Joint Army\/Navy\/NASA\/Air Force meetings."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P204"
                    },
                    "ProjectTitle": {
                        "val": "Enabling Fuze Technology"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "5.824"
                        },
                        "PriorYear": {
                            "val": "5.806"
                        },
                        "CurrentYear": {
                            "val": "4.023"
                        },
                        "BudgetYearOne": {
                            "val": "6.494"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.494"
                        },
                        "BudgetYearTwo": {
                            "val": "6.505"
                        },
                        "BudgetYearThree": {
                            "val": "6.608"
                        },
                        "BudgetYearFour": {
                            "val": "6.620"
                        },
                        "BudgetYearFive": {
                            "val": "6.692"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This RDT&E effort will demonstrate fuze enabling technologies needed to develop weapons that address priority capability areas identified in the Guidance for Development of the Force (GDF), the Secretary of Defense Memorandum, DoD Policy on Cluster Munitions and Unintended Harm to Civilians, and shortfalls in current weapon systems.  This effort will develop enabling technologies at the laboratory scale and transition them into 6.3 demonstration programs for weapons where priority capabilities and technology needs have been identified and validated by the Program Executive Officers (PEOs) and the Heads of the Service Science and Technology (S&T) communities.  Mature 6.2 fuze technologies will be transitioned, thereby decreasing their program costs and schedule risk and facilitating spin-offs to other munitions within their portfolios.\nUnder the Joint Fuze Technology Program (JFTP), investments are focused on specific capability areas that have been identified by Department strategic guidance and current shortfalls in weapon systems and validated by the PEOs and Heads of the Service S&T communities.  These four capability areas are: 1) Hard Target Survivable Fuzing, 2) Tailorable Effects (TE) Weapon Fuzing, 3) High Reliability Fuzing, and 4) Enabling Fuze Technologies and Common Architecture."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Hard Target Fuzing"
                                    },
                                    "Description": {
                                        "val": "The Hard Target Fuzing challenges are grouped into three Technology Areas.  First, improved modeling and simulation capabilities provide the validated computational tools necessary for hard target applications.  Second, basic phenomenology and understanding of the Fuze Environment is the science-based endeavor of providing the test equipment, instrumentation, and analysis techniques for experimentation and data gathering necessary for next generation fuzing.  Third, hard target survivable fuze components are developed to increase the effectiveness of facility denial munitions by improving the prediction tools and testing methodologies to evaluate the survivability and functionality of legacy and future fuzes.  Development of these technologies will enable next generation boosted and hypersonic penetrators to execute missions against hardened and deeply buried targets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.470"
                                            },
                                            "Text": {
                                                "val": "-  Developed and validate modeling and simulation code using high fidelity, multi-scale simulation techniques.\n-  Developed survivable modular fuze technology for multi-common miniature munitions with distributed\/embedded fuzes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.048"
                                            },
                                            "Text": {
                                                "val": "-  Adapt and transition Joint Fuze Technology Program developed testing protocol in boosted and high speed penetrator development programs.\n- Demonstrate and transition survivable modular fuze technology for multi-role common miniature munitions with distributed\/embedded fuzes."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.665"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.665"
                                            },
                                            "Text": {
                                                "val": "- Develop and demonstrate alternative packaging technology for the electronic components of a fireset to improve fuze survivability and reliability for hypersonic penetrating weapon applications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tailorable Effects Fuzing"
                                    },
                                    "Description": {
                                        "val": "This area focuses on developing fuzing for tailorable effects weapons that encompasses the ability to selectively vary the output of the weapon (Dial-a-Yield) and\/or the ability to generate selectable effects (directed blast, fragmentation); developing initiation and multi-point technologies to include electronic safe and arm based multi-point initiators for tunable output – scalable yield warheads; MicroElectro-Mechanical Systems (MEMS) based multi-point initiators for tunable output\/scalable yield warheads; and smart fuzing for tailorable effects weapons.  These technologies will enable weapons that can effectively defeat a variety of targets while minimizing unintentional collateral effects."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.578"
                                            },
                                            "Text": {
                                                "val": "-  Continued to develop Tailorable Effects modeling and simulation using hydrocode.\n-  Developed hardened, Tailorable Effects firing systems for missile and projectile warheads to survive the high-g shock environments associated with impact with Military Operations in Urban Terrain (MOUT) targets."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.029"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate and transition into 6.3 advanced technology development of detonator, initiation, and fireset technologies.\n-  Apply initiation architecture and control technologies for application in the Services’ warhead development programs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.646"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.646"
                                            },
                                            "Text": {
                                                "val": "-  Begin development of a primary explosive ink with high output and low sensitivity for use in MEM’s micro-detonators."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Reliability Fuzing"
                                    },
                                    "Description": {
                                        "val": "Develop high reliability fuzing architectures, fuzing components, and Unexploded Ordnance (UXO) reduction features.  These technologies will enable the next generation of cluster munitions to achieve the required greater than 99 percent reliability goal.  Evolving DoD emphasis on increased weapon system reliability is driving the need to consider new and novel approaches for achieving increased fuze reliability while maintaining or enhancing fuze design safety.  DoD policy, higher weapon reliability expectations and harsher weapon system operational requirements are dictating the need for higher fuze reliability than available using current technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.440"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated high reliability fuze architecture concepts that satisfy reliability while maintaining safety by eliminating single-point and common-mode failures.\n-  Applied next generation cluster monitions fuze design and architecture, fabricate component technology prototypes, and conduct performance and reliability tests in ballistic and harsh environment testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.987"
                                            },
                                            "Text": {
                                                "val": "-  Research and develop novel technologies for UXO reduction features including fuze mechanisms and initiation energetic to eliminate any unexploded ordnance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.605"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.605"
                                            },
                                            "Text": {
                                                "val": "- Develop and demonstrate MEMS structures that give existing MEMS Fuzes the ability to self-report safety and reliability compromises in an effort to improve reliability."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enabling Fuze Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop common\/modular fuze architecture; innovative fuze component technologies; sensors; next generation fuze setting capability, tools and modeling; and fuzing power sources.  These fuzing technologies will provide smaller, more cost effective solutions while meeting or exceeding the performance of existing technologies.  Development of these technologies will enable future weapon applications to be more mission adaptive and smaller along with improved target detection capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.318"
                                            },
                                            "Text": {
                                                "val": "-  Established next generation system interface architecture between various fuze subsystems.\n-  Evaluated proximity fuze sensor, electronics and algorithm technologies in performance and functional testing in air-gun and ballistic environments.\n-  Transitioned to 6.3 development of exploitation resistant proximity fuze sensors and electronics technology."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.959"
                                            },
                                            "Text": {
                                                "val": "-  Conduct assessments of common fuze architecture technologies: safety components, modular electronics, sensors, interfaces, and packaging."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.578"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.578"
                                            },
                                            "Text": {
                                                "val": "- Begin research of failure modes in flash programmable logic devices (F-PLD) that enables reliable, safe and effective use of F-PLDs as fuze components."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0603000D8Z P301"
                                    },
                                    "Title": {
                                        "val": "BA 3 Enabling Fuze Advanced Technology"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "4.793"
                                        },
                                        "CurrentYear": {
                                            "val": "3.411"
                                        },
                                        "BudgetYearOne": {
                                            "val": "6.881"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "6.881"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "8.112"
                                        },
                                        "BudgetYearThree": {
                                            "val": "8.373"
                                        },
                                        "BudgetYearFour": {
                                            "val": "8.536"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "1) Transitions of technologies developed by the Program are tracked and documented using DoD\/NASA Technical Readiness Level (TRL) scale.\n2) Fuze Area Technology Group (FATG) Technology Roadmaps are prepared, evaluated, and analyzed by Joint Fuze Technology Program management and technical staff.\n3) Chairman's Annual Assessments for each FATG are critically reviewed by the Technology Advisory Committee to determine progress, transition plans, and relevance of each project.\n4) Project progress toward goals and milestones is assessed at each FATG meeting.\n5) Annual technical reports and papers are tracked and documented for the Program.\n6) Technology Transition Agreements in place with Munitions programs."
                        }
                    }
                }
            ]
        }
    }
}