{
    "id": "b9f030f7bfb112e95a362ced62b49ec909e08df5",
    "meta": {
        "filename": "dod-2015_RDTE_2015_ARMY_BA3_RDTE_JustificationBook_Army_PB_2015.zzz_unzipped_RDTE_JustificationBook_Army_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603008A"
        },
        "ProgramElementTitle": {
            "val": "Electronic Warfare Advanced Technology"
        },
        "R1LineNumber": {
            "val": "36"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "45.254"
            },
            "CurrentYear": {
                "val": "45.394"
            },
            "BudgetYearOne": {
                "val": "44.871"
            },
            "BudgetYearOneBase": {
                "val": "44.871"
            },
            "BudgetYearTwo": {
                "val": "46.431"
            },
            "BudgetYearThree": {
                "val": "46.145"
            },
            "BudgetYearFour": {
                "val": "48.306"
            },
            "BudgetYearFive": {
                "val": "50.022"
            }
        },
        "ProgramElementNote": {
            "val": "FY13 decreases attributed to Congressional General Reductions (-78 thousand); SBIR\/STTR transfers (1.203 million); and Sequestration reductions (-4.126 million)\nFY15 increases for wireless personal area network research efforts."
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) matures and demonstrates technologies to address the seamless integrated tactical communications challenge with distributed, secure, mobile, wireless, and self-organizing communications networks and networked transceivers that will operate reliably in diverse and complex terrains, in all environments. Efforts demonstrate seamlessly integrated communications and information security technologies across all network tiers, ranging from unattended networks and sensors through maneuver elements using airborne and space assets. Project TR1 investigates and leverages antennas; wireless networking devices, protocols, and software;  network operations tools and techniques; and combines these and other technology options in a series of command, control, communications, and computers, intelligence, surveillance, and reconnaissance (C4ISR) on-the-move (OTM) network modernization demonstrations to measure their potential battlefield effectiveness. Project TR2 researches information security devices, techniques, services, software and algorithms to protect tactical wired and wireless networks against modern network attacks; generate and distribute tactical cyber situational awareness; and focuses on configuration, operation, monitoring, defense and network reconstitution in bandwidth constrained tactical environments while reducing the operator workload required to conduct these functions.\n\nWork in this PE is complimentary of PE 0602782A (Command, Control, Communications Technology), and fully coordinated with PE 0602120A (Sensors and Electronic Survivability), PE 0602270A (Electronic Warfare Technology), PE 0602783A (Computer and Software Technology), PE 0603001A (Warfighter Advanced Technology), PE0603270A (Electronic Warfare Technology) and PE 0603772A (Advanced Tactical Computer Science and Sensor Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork is performed by the Army Research, Development, and Engineering Command (RDECOM), Communications-Electronics Research, Development, and Engineering Center (CERDEC), Aberdeen Proving Ground, MD."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "50.661"
                },
                "CurrentYear": {
                    "val": "40.416"
                },
                "BudgetYearOne": {
                    "val": "35.523"
                },
                "BudgetYearOneBase": {
                    "val": "35.523"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "45.254"
                },
                "CurrentYear": {
                    "val": "45.394"
                },
                "BudgetYearOne": {
                    "val": "44.871"
                },
                "BudgetYearOneBase": {
                    "val": "44.871"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-5.407"
                },
                "CurrentYear": {
                    "val": "4.978"
                },
                "BudgetYearOne": {
                    "val": "9.348"
                },
                "BudgetYearOneBase": {
                    "val": "9.348"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.078"
                    },
                    "CurrentYear": {
                        "val": "-0.022"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "5.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.203"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "9.348"
                                },
                                "BudgetYearOneBase": {
                                    "val": "9.348"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Sequestration"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-4.126"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "TR1"
                    },
                    "ProjectTitle": {
                        "val": "TAC C4 Technology Int"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "27.636"
                        },
                        "CurrentYear": {
                            "val": "29.072"
                        },
                        "BudgetYearOne": {
                            "val": "29.802"
                        },
                        "BudgetYearOneBase": {
                            "val": "29.802"
                        },
                        "BudgetYearTwo": {
                            "val": "31.737"
                        },
                        "BudgetYearThree": {
                            "val": "30.034"
                        },
                        "BudgetYearFour": {
                            "val": "32.145"
                        },
                        "BudgetYearFive": {
                            "val": "31.181"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates key communications and mobile networking technologies, such as antennas, transceivers, transceiver components, networking software and novel techniques to provide secure, reliable, mobile network solutions that function in complex and diverse terrains. This project concentrates on four major goals: to provide a series of technology demonstrations of new and emerging command, control, communications, computers, intelligence, surveillance and reconnaissance (C4ISR) technology enabled capabilities to significantly reduce risk associated with the network-of-networks concept; to lower the size, weight power and cost of wireless networking systems deployed on Army platforms; to provide critical improvements in the ability to communicate and move large amounts of information in radio frequency (RF) contested environments, in a seamless, integrated manner across the Army's highly mobile manned and unmanned force structure; and to assess the technology readiness level (TRL) of emerging network technologies in an operationally relevant environment. \n\nThis project supports Army science and technology efforts in the Command, Control, Communications and Intelligence, Ground Maneuver, Air and Soldier\/Squad portfolios.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Army Research, Development, and Engineering Command (RDECOM), Communications-Electronics Research, Development, and Engineering Center (CERDEC), Aberdeen Proving Ground, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Antenna Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates low cost, power efficient, communications and electronic warfare (EW) antenna technologies for terrestrial and tactical satellite ground terminals. The focus is to reduce the visual signature and cost of antennas and reduce the number of antennas required on platforms by proving the capability to transmit and receive on multiple frequency bands, such as X\/K\/KA\/Q for satellite communication (SATCOM) and ultra-high frequency\/very-high frequency (UHF\/VHF) and L Band for terrestrial communications on the same antennas. Work accomplished under PE 0602782A\/project H92 compliments this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.764"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Fabricated and demonstrated multifunctional armor-embedded and conformal antennas that support both communications and counter improvised explosive device (IED) missions by allowing multiple radios and jammers to use a single integrated antenna system; demonstrated K\/Ka\/Q band antenna integrated with the Ka\/Q band power amplifier (PA) in a relevant environment; designed and fabricated artificial impedance surfaces to cover unmanned aerial system (UAS) components such as rudders, stabilizers and struts to mitigate radio frequency blockage of antennas mounted on the UAS."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.615"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Demonstrate conformal antenna (including antenna feed system) integrated into Army ground platform; develop and fabricate EW antennas for nontactical vehicles; develop radio frequency (RF) multiplexers to enable multiple communications systems to use a single antenna simultaneously within the same frequency bands."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.845"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.845"
                                            },
                                            "Text": {
                                                "val": "Will design, fabricate and evaluate distributed On-the-Move (OTM) SATCOM antenna arrays to enable extension of high throughput satellite connectivity to tactical combat vehicles without interfering with weapons and targeting systems; develop a Government standard architecture for distributed SATCOM arrays to enable interoperability between various transceivers and antenna arrays."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "RF Interoperability Through Convergence"
                                    },
                                    "Description": {
                                        "val": "This effort designs transceiver hardware and software standard and proof of concept that will reduce size, weight, power and cost of multiple communications and EW systems on tactical platforms.  The standard and proof of concept demonstration takes advantage of common components within the communications and EW systems to define the internal and external interfaces to communications and EW devices. The effort includes implementing and publishing a reference architecture and associated specifications for a modular, open systems approach for integrating military communications and EW devices. Work being accomplished under PE 603270A\/project K16 compliments this effort."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "Will mature the radio reference architecture, specification and application program interfaces (API) to standardize radio modules and minimize life cycle cost of Army tactical communications devices on tactical vehicles; demonstrate, in a lab environment, a subset of communication systems components in an integrated package using the matured specification and API; investigate expansion of the reference architecture to include EW systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "C4ISR On-The-Move (OTM)"
                                    },
                                    "Description": {
                                        "val": "This effort provides a venue for the demonstration of new and emerging C4ISR technologies. This venue performs risk mitigation and technology assessments by evaluating the Technology Readiness Levels (TRLs) of candidate Army science and technology (S&T) and best of Industry efforts to support tactical network modernization."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.139"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Assessed the capability, functionality, and performance of network integrated architectures and emerging technologies and capabilities that support the Army Brigade Combat Team Modernization Plan and Network Modernization Strategy; finalized and executed an assessment of new technologies and hybrid\/bridging architectures for Capability Sets 13\/14; conducted initial planning for and developed assessment strategies for Capability Sets 15\/16 and the associated programmed increments of Joint Tactical Radio System (JTRS) (Mounted & Dismounted), Warfighter Information Network-Tactical (WIN-T), and Nett Warrior programs of record; provided a representative system of systems environment\/venue to evaluate technical progress, assessed the next generation of technologies, facilitated technology transition, and performed field based risk mitigation in preparation for candidate assessment\/selection for future Army Network Integration Exercise (NIE) events by assessing the TRL of Army S&T and best of industry efforts maturing in the FY13 timeframe to include Fourth Generation Long Term Evolution (4G LTE) to the edge, Soldier Radio Waveform spectrum reutilization, secure telemedicine and first look at S&T applications on the WIN-T Inc 2 infrastructure; continued to support research and development (R&D) of enabling Future Force capabilities and accelerated such capabilities to enhance and modernize the current force."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.205"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Assess the capability, functionality, and performance of network integrated architectures and emerging capabilities that support the Army Brigade Combat Team Modernization Plan and Network Modernization Strategy; finalize the evaluation of hybrid\/bridging architectures for Capability Sets 14\/15 and conduct initial assessments of Capability Sets 16\/17 architectures to support the associated programmed increments of WIN-T and Nett Warrior; provide a system of systems environment\/venue to evaluate technical progress, assess the next generation of Army technologies and facilitate transition of S&T efforts; perform risk mitigation and TRL assessment of Army S&T programs and best of Industry efforts maturing in the FY14 timeframe for selection\/inclusion as systems under evaluation for future Army NIEs; and continue to support R&D of enabling Future Force capabilities and accelerate capabilities to enhance the current force."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.941"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.941"
                                            },
                                            "Text": {
                                                "val": "Will assess the capability, functionality, and performance of network integrated architectures and emerging capabilities that support the Army Brigade Combat Team Modernization Plan and Network Modernization Strategy; conduct red team assessment of network technologies and architectures, assess the next generation of Army technologies and facilitate transition of S&T efforts with particular emphasis on enhancing field robustness and simplifying network set up and maintenance processes; perform risk mitigation and TRL assessment of Army S&T programs and best of industry efforts maturing in the FY15 timeframe; support the associated programmed increments of WIN-T and Nett Warrior."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Wireless Mobile Networking"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates components, software, algorithms and services that enable wireless networks to operate more efficiently in both the use of RF spectrum and networking resources for terrestrial and Satellite Communication (SATCOM) systems. This effort matures and demonstrates software to improve performance of wireless tactical networks in austere and hostile RF spectrum environments by composing and coding algorithms and protocols that sense network and spectrum conditions, to automatically adapt network node behaviors to make more efficient use of available resources. Efforts target improving RF communications performance in complex terrain, enabling communications while simultaneously operating electronic protection devices. Efforts also include adapting commercial wireless technology for use in the tactical environment. Work accomplished under PE 0602782A\/project H92 and 0603008A TR2 compliments this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.303"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Matured, integrated and assessed all-digital strategic ground terminal, consisting of digital transmitter and receiver interfaces, all-digital receiver and baseband signal processor; fabricated all-digital transmitter; integrated and matured government-off-the-shelf (GOTS) applique with commercial-off-the-shelf (COTS) third generation (3G) network software applications and algorithms to apply enhanced, military grade security and network management functionality that enables tactical use of COTS hand held computing devices such as smart phones and tablets, and enables the Soldier to manage these devices as an edge extension for voice, data and video on existing and emerging tactical networks; demonstrated militarized smart devices in a field relevant environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.316"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Mature all-digital strategic SATCOM terminal components to increase SATCOM channel capacity and reduce vulnerability to interference; for Army tactical ground communications, adapt and mature directional radio networking protocols and routing algorithms to improve spectral efficiency, network robustness and resistance to RF interference; adapt and integrate spatial diversity signal processing to improve wireless communications performance in complex (e.g. urban, forested) terrain; design modular waveform components and mature algorithms that support simultaneous communications and blue force jamming; design radio reference architecture, specification and application program interface (API) to standardize radio modules and minimize life cycle cost of Army tactical communications devices; continue to investigate, adapt and develop techniques to allow use of commercial cellular and smart devices in Army communications bands and environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.266"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.266"
                                            },
                                            "Text": {
                                                "val": "Will complete integration of all digital strategic ground terminal components and demonstrate improved bandwidth utilization at reduced size, weight and power; using the all digital strategic ground terminal, demonstrate SATCOM spectrum monitoring and control, and integrate RF signal modulation techniques to enable improved SATCOM performance against jamming; complete implementation of signals management module software; complete modifications to Soldier Radio Waveform (SRW) and radio operating environment to support frequency hopping at timeslot boundaries using parameters chosen by the software; integrate, test, and demonstrate signal management software with SRW modifications to support simultaneous communications and blue force jamming."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Network Operations (NetOps)"
                                    },
                                    "Description": {
                                        "val": "This effort matures network operations tools (network management, information dissemination management and cyber security) to simplify the planning, management and troubleshooting of complex tactical communications networks. Focus is on network visualization, incident correlation and decision aids that assist soldiers with managing the complexity inherent with wireless, On-the-Move communications networks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.430"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Matured and coded software that integrates network visualization tools on touch-screen environments with network information correlation tools that enhance interoperability among disparate NetOps tools; assessed the accuracy and usability of visualization and correlation tools in the laboratory and through user feedback, and modified the software to improve the effectiveness of the new tool set; matured a software engine that translates network information sources to any format for use by network correlation tools."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.936"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop and demonstrate software for automating the decision and implementation processes for configuring and re-configuring network components; develop a collaborative execution environment in an effort to provide a decision enhancing capability enabling unit signal officers to collaborate when managing tactical communication resources."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.750"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.750"
                                            },
                                            "Text": {
                                                "val": "Will complete integration of decision software tools and processes for configuring tactical network components with existing network monitoring tools and demonstrate the capability to visualize the function and health of the multi-tiered network; demonstrate reduced cycle times to automatically generate network configurations and anomaly corrections."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Networking technologies for Wireless Personal Area Networks (WPAN)"
                                    },
                                    "Description": {
                                        "val": "This effort develops and matures wireless personal area network (WPAN) technology for the Soldier in a manner approved by the National Security Agency (NSA) for up to Secret data traffic. This effort is coordinated with PE 0603001A\/Project J50."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Design and analyze networking architectures, frameworks and protocols to link devices into individual WPANs while allowing multiple WPANs to operate concurrently without interference; design and code a tactical standard waveform and protocols for up to Secret short range wireless communication between WPAN nodes that meet NSA security requirements; mature, integrate and demonstrate wireless hardware components for integration onto Soldier-borne equipment such as hand held computing platforms, radios, weapon sites, information displays and Soldier-borne sensors to develop a WPAN without impacting the size, weight power and cost of these devices."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "Will complete evaluation of multiple WPAN design solutions for performance, reliability and security; finalize specification and architecture development of WPAN hardware interfaces and software; establish WPAN standards for security and interface development; perform lab, RF chamber, and field electromagnetic compatibility, low probability of intercept and low probability of detection validation; conduct field evaluations of selected design(s) on multiple Soldier Systems."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TR2"
                    },
                    "ProjectTitle": {
                        "val": "Secure Tactical Information Integration"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "17.618"
                        },
                        "CurrentYear": {
                            "val": "11.322"
                        },
                        "BudgetYearOne": {
                            "val": "15.069"
                        },
                        "BudgetYearOneBase": {
                            "val": "15.069"
                        },
                        "BudgetYearTwo": {
                            "val": "14.694"
                        },
                        "BudgetYearThree": {
                            "val": "16.111"
                        },
                        "BudgetYearFour": {
                            "val": "16.161"
                        },
                        "BudgetYearFive": {
                            "val": "18.841"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates software, algorithms and services that focus on tactical cyber situational awareness, autonomous network defense, cross domain security and encryption solutions.  Efforts focus on configuration, operation, monitoring, defense and network reconstitution in bandwidth constrained tactical environments while reducing the operator workload required to conduct these functions.  This project codes, optimizes, and demonstrates software based technologies for intrusion detection, high assurance internet protocol (IP) encryption, seamless communications across security boundaries, as well as information sharing across operations and intelligence functions.  These capabilities to automate, protect, monitor, report and access cyber elements of the tactical network are intended to greatly reduce Soldier burden and protect the Army's tactical network by building upon enterprise solutions from commercial, Department of Defense, Department of the Army and other government agencies.  This project cumulatively builds science and technology capabilities in accordance with Army Cyber Material Development Strategy and the Office of the Secretary of Defense Cyber Community of Interest.\n\nThis project supports Army science and technology efforts in the Command, Control, Communications and Intelligence, Ground Maneuver, Air and Soldier\/Squad portfolios.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Army Research, Development, and Engineering Command (RDECOM), Communications Electronics Research Development and Engineering Center (CERDEC), Aberdeen Proving Ground, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Collaborative Battle Management"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates Mission Command software to improve sharing and understanding of data between the intelligence and operations communities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.021"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Coded, assessed and demonstrated collaboration and interoperability services such as the ability to interface Joint Battle Command Platform (JBC-P) vehicle variable message format chat with Defense Information Systems Agency-standard Extensible Messaging and Presence Protocol text chat in support of the Army Common Operating Environment; fabricated\/coded and assessed multi-touch mission command (MC) applications such as an electronic sand table that streamlines and improves the ability to plan, wargame and monitor Army missions; coded assessed and integrated software information assurance techniques into MC software to reduce vulnerabilities; matured and validated software design techniques that present information to users more intuitively and easier to understand to help cognitively unburden the Soldier using MC applications at all echelons."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Information Assurance"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates technologies that create new methods for proactively defending resource constrained tactical wireless networks against cyber attack using nontraditional methodologies. Work being performed under PE \/projects 0602782\/H92 and 0602783\/Y10 complement this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.597"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Demonstrated improved detection and automated response software and algorithms that reside on Army tactical host platforms and provide maximum protection to the host system against cyber threats with minimal platform resource usage; coded and demonstrated an intrusion detection system (IDS) response component that collaborates with an information operations (IO) response component to ascertain the source of a network attack; demonstrated IDS software agents operating on host platforms and across the network using a common network protection architecture; demonstrated a cyber toolkit for computer network defense (CND) including dynamic protocols, a dynamic decentralized network remapping framework and software for concealing network role and system identity for cyber security protection from potential attackers; adapted and demonstrated military grade security for use on commercial smart devices like smartphones and tablets; optimized and implemented security software standards on Army networks to provide a trustworthy operating environment for commercial smart devices; coded and matured automated analysis functionalities to assure software is clean of malicious content and vulnerabilities introduced by poor software coding techniques; validated the feasibility of employing network morphing software that dynamically modifies aspects of networks in order to prevent potential cyber attackers from accurately mapping networks in preparation for a cyber attack."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.322"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Mature dynamic moving target defense internet protocol (IP) and port network hopping techniques; design and code software to dynamically modify operating systems and applications to increase an adversary's work factor to exploit Army networks; design and code moving target defense capability management software tools; demonstrate integration of IP and port hopping, with protection capabilities within the Army's CND common operating environment ; develop cyber attack prediction techniques to include associated consequences to help reason on adversarial intent and motivation to predict cyber related attacks on Army networks and associated consequences; utilize polymorphic and metamorphic transformation engines to develop new techniques to detect malware variants; design and code algorithms to assess software at the binary code level to detect malicious intent; demonstrate software assurance capability to seamlessly integrate Army software assurance tools with those developed by other DoD laboratories; design and code protection software tools for server components and design and code network security controls for the tactical cloud computing environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.069"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.069"
                                            },
                                            "Text": {
                                                "val": "Will mature and code software  algorithms to differentiate between stealthy attacks and software coding errors to reduce the vulnerability in software applications; demonstrate dynamic moving target defense internet protocol (IP) and port network hopping techniques; demonstrate software to dynamically modify operating systems and applications to make it more difficult for an adversary to exploit Army networks; demonstrate moving target defense capability management software tools; demonstrate integration of IP and port hopping with existing protection capabilities; encode and demonstrate user behavior and operating system anomaly sensors, and anomaly based learning algorithms to provide protection against zero day malware; demonstrate ability to leverage tactical systems to augment local cyber situational awareness; demonstrate dissemination and correlation of offensive and defensive cyber data within the intelligence enterprise to enable tactical defensive cyber operations; investigate cloud based security architectures to enable self monitoring and healing of cloud security services that can perform rapid battle damage assessment and rapidly apply security services against threats; mature, fabricate and demonstrate an anti-tamper key loader for devices that use subscriber identity modules and smart cards; design and instantiate security architectures for multi-functional waveforms and converged communications and electronic warfare transceivers."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TR8"
                    },
                    "ProjectTitle": {
                        "val": "C3 DEMONSTRATIONS (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "5.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Due to a database error, the FY14 Congressional increase appropriated in PE 0603006 appears here."
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding for C3 Demonstrations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Congressional Add"
                                    },
                                    "Description": {
                                        "val": "Congressional Add"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Congressional Add"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}