{
    "id": "ba5849a82fb0d102c66438aedcd448c333bc1718",
    "meta": {
        "filename": "dod-2015_RDTE_2015_ARMY_BA2_RDTE_JustificationBook_Army_PB_2015.zzz_unzipped_RDTE_JustificationBook_Army_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602120A"
        },
        "ProgramElementTitle": {
            "val": "Sensors and Electronic Survivability"
        },
        "R1LineNumber": {
            "val": "6"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "40.842"
            },
            "CurrentYear": {
                "val": "43.148"
            },
            "BudgetYearOne": {
                "val": "33.515"
            },
            "BudgetYearOneBase": {
                "val": "33.515"
            },
            "BudgetYearTwo": {
                "val": "38.631"
            },
            "BudgetYearThree": {
                "val": "38.648"
            },
            "BudgetYearFour": {
                "val": "35.993"
            },
            "BudgetYearFive": {
                "val": "35.394"
            }
        },
        "ProgramElementNote": {
            "val": "FY 13 reductions attributed to General Congressional Reductions (-89 thousand); SBIR\/STTR transfers (-696 thousand); and Sequestration reductions (-3.633 million)\nFY15 funding realigned to support higher Army priorities."
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) investigates designs and evaluates sensors and electronic components and software that enhance situational awareness, survivability, lethality, and autonomous mobility for tactical ground forces. Project H15 focuses on Combat Identification (CID) technologies, which include devices to locate, identify, track, and engage targets in the Joint fires environment. Project H16 investigates sensors, signal processing and information fusion technologies to increase target detection range and speed of engagement. Project SA2 conducts applied research on biological sensors and biologically derived electronics that exploits breakthroughs in biotechnology basic research in collaboration with the Institute for Collaborative Biotechnology (ICB) a University Affiliated Research Center (UARC) led by the University of California, Santa Barbara in partnership with California Institute of Technology and Massachusetts Institute of Technology and their industry partners. Project TS1 researches and evaluates space-based remote sensing, signal, and information processing software in collaboration with other Department of Defense (DoD) and government agencies to support space force enhancement and space superiority advanced technology integration into Army battlefield operating systems. Project TS2 focuses on advancing perception for autonomous ground mobility, intelligent vehicle control and behaviors, human-robot interaction, robotic manipulation, and unique mobility for unmanned vehicles.  \n\nWork in this program element (PE) complements and is fully coordinated with efforts in PE 0602307A (Advanced Weapons Technology), PE 0602705A (Electronics and Electronic Devices), PE 0602709A (Night Vision Technology), PE 0602782A (Command, Control, Communications Technology), PE 0603001A (Warfighter Advanced Technology), PE 0603006A (Command, Control, Communications Advanced Technology), PE 0603008A (Command Electronic Warfare Advanced Technology),\nPE 0603710A (Night Vision Advanced Technologies), and PE 0603772A (Advanced Tactical Computer Science and Sensor Technology),\n \nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy\n\nWork is performed by the U.S. Army Research Laboratory, Adelphi, MD and Aberdeen Proving Ground, MD; the Communications-Electronics Research, Development, and Engineering Center, Aberdeen Proving Ground, MD; and the US Army Space and Missile Defense Technical Center, Huntsville, AL."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "45.260"
                },
                "CurrentYear": {
                    "val": "43.170"
                },
                "BudgetYearOne": {
                    "val": "47.802"
                },
                "BudgetYearOneBase": {
                    "val": "47.802"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "40.842"
                },
                "CurrentYear": {
                    "val": "43.148"
                },
                "BudgetYearOne": {
                    "val": "33.515"
                },
                "BudgetYearOneBase": {
                    "val": "33.515"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-4.418"
                },
                "CurrentYear": {
                    "val": "-0.022"
                },
                "BudgetYearOne": {
                    "val": "-14.287"
                },
                "BudgetYearOneBase": {
                    "val": "-14.287"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.089"
                    },
                    "CurrentYear": {
                        "val": "-0.022"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.696"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-14.287"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-14.287"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Sequestration"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-3.633"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "H15"
                    },
                    "ProjectTitle": {
                        "val": "Ground Combat Id Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.984"
                        },
                        "CurrentYear": {
                            "val": "2.327"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project conducts applied research and investigates emergent techniques, devices and software for combat identification (CID) of Joint, allied, and coalition forces, including air-to-ground and ground-to-ground for mounted, dismounted, forward observer, and forward air controller missions. Efforts include research to enable a common battlespace picture for Joint and coalition situation awareness and fusion efforts to increase the survivability and lethality of coalition forces by fusing battlefield sensor and situational awareness data to identify friend from foe.\n\nThis project supports Army science and technology efforts in the Command, Control, Communications and Intelligence, Soldier and Ground Maneuver portfolios. Efforts in this project are complimentary of PE 0602270A (EW Techniques), PE 0603270A (EW Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork is performed by the Communications-Electronics Research, Development, and Engineering Center (CERDEC), Aberdeen Proving Ground, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Combat Identification (CID) Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort evaluates and enhances CID modeling and simulation tools, concepts, and algorithms to improve anti-fratricide and combatant\/non-combatant identification capabilities. Soldier-to-Soldier CID algorithms that interoperate with non-traditional CID sensors (air and ground) are developed to increase situational awareness (SA), feed the common operating picture, and increase the combat effectiveness of Soldier and  Brigade Combat Teams (BCTs). Work being accomplished under PE 0603270A\/project K16 complements this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.984"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Evaluated tactical and emerging commercial communications, wireless personal area networks and position location information beaconing through modeling and simulation to assess their potential as components of a Soldier-to-Soldier CID capability; evaluated capacity of existing mobile\/handheld platforms to perform CID display and training; investigated signature data from multiple sensor types (infrared, RF and other) to support non-cooperative CID technology development."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.327"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Design and integrate tactical and commercial communications, wireless personal area networks and position location beaconing for a Soldier-to-Soldier CID capability utilizing equipment that is already employed by Soldiers; design CID display and training tools to implement on existing mobile and handheld platforms being targeted by applicable programs of record."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H16"
                    },
                    "ProjectTitle": {
                        "val": "S3I Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "19.509"
                        },
                        "CurrentYear": {
                            "val": "20.797"
                        },
                        "BudgetYearOne": {
                            "val": "17.936"
                        },
                        "BudgetYearOneBase": {
                            "val": "17.936"
                        },
                        "BudgetYearTwo": {
                            "val": "21.305"
                        },
                        "BudgetYearThree": {
                            "val": "21.518"
                        },
                        "BudgetYearFour": {
                            "val": "18.005"
                        },
                        "BudgetYearFive": {
                            "val": "18.129"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project designs, investigates and evaluates advanced sensor components, signal processing, and information fusion algorithms that will provide the future Soldier decisive new capabilities to locate, identify, decide and engage battlefield targets in tactical environments.  The ultimate impact and utility of this work will be to greatly increase the lethality, range, and speed of engagement of the Soldier.  Emphasis is on solving critical Army-specific battlefield sensing and information management problems such as false targets, complex terrain (including urban applications), movement of sensors on military vehicles, and exploitation of multimodal sensors.  Significant areas of research include: low cost sensors designed to be employed in large numbers of networked sensors for force protection, hostile fire defeat, homeland defense, counter terrorism operations, and munitions; fusion of disparate sensors such as non-imaging acoustic, seismic, electric-field (E-field), magnetic, radar; imaging infrared (IR), forward looking IR (FLIR), laser detection and ranging (LADAR), visible imagers; low cost acoustic, seismic, and magnetic sensors that can passively detect, classify, and track battlefield targets such as personnel, heavy\/light vehicles, and helicopters.  Other areas of research include sensing technologies for tagging, tracking, and locating (TTL) non-traditional targets as well as the location of direct and indirect fires and other hostile threats.  Further areas of research include ultraviolet (UV) optoelectronics for battlefield sensors, networked compact radar for vehicle and dismount identification and tracking; ultra wideband radar for buried and concealed threat detection, enhanced robotic mobility, stand-off characterization of infrastructure; and the detection, classification, and tracking of humans in urban terrain.  Additional areas of research are aided\/automatic target recognition (ATR) allowing sensors to autonomously locate and identify targets; advanced battlefield sensor and information processing to conduct a dynamic and real time situational assessment to present a common picture of the battlespace focused on low echelon commanders; protection of sensors (including Soldier's eyes) from battlefield laser threats; and advanced information processing methods to provide automatic information technologies that utilize widely dispersed sensor and legacy information sources.\n\nThis project supports Army science and technology efforts in the Command Control and Communications, Ground and Soldier portfolios.  The work in this project complements efforts funded in PE 0601104A (University and Industry Research Centers), PE 0602709A (Night Vision Technology), PE 0603710A (Night Vision Advanced Technologies), and PE 0603001A (Warfighter Advanced Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this area is performed by the U.S. Army Research Laboratory (ARL), Adelphi, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Non-Imaging Intelligence, Surveillance, and Reconnaissance (ISR) Sensing"
                                    },
                                    "Description": {
                                        "val": "This effort evaluates and designs technologies for multi-modal low-cost networked sensors to enhance persistent sensing capabilities with increased probability of target detection and reduced false alarms.  A key focus is on acoustic, seismic, magnetic, E-field, and passive radio frequency (RF) with unique capabilities for Army & DoD applications such as technologies that enable detection of underground facilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.109"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued to investigate, design, and code new algorithms and assess sensor performance to enable faster identification and localization of transient\/hostile threat events such as gunfire, explosions, weapon launches, etc. to enable rapid counter responses in urban environment and for base camps; and investigated and coded new algorithms for fusing the output of multi-modal sensors to differentiate, with very high confidence, the presence of humans versus animals to reduce the costs for sensor deployment required for target classification."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.340"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Evaluate combination of collocated passive IR sensors to discriminate humans from animals with high confidence; investigate new algorithms to detect digging using seismic and magnetic sensors; and develop and evaluate algorithms to fuse input from acoustic velocity sensors, electric-field charge detectors, burn-product sensor and infrared flash detector to improve detection and classification of hostile threats such as gunfire, mortars, and rockets."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.539"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.539"
                                            },
                                            "Text": {
                                                "val": "Will exploit multimodal sensing, fusion, and sensor processing to detect and locate diverse threats using static and mobile sensors and networked systems; enhance sensors and algorithms to provide persistent surveillance and actionable information; and exploit target features and mitigate environmental interference to enhance intelligence, surveillance, and reconnaissance (ISR) capabilities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Networked Sensing and Data Fusion"
                                    },
                                    "Description": {
                                        "val": "This effort will develop and assess a concept to link physical sensors and information sources to Soldiers and small units.  Specifically the research focuses on (1) multimodal sensor fusion for detection and classification of human activities and infrastructures such as personnel, vehicles, machinery, RF emissions, chemicals and computers in hidden and confined spaces, such as  tunnels, caves, sewers and buildings, (2) interoperability and networking of disparate sensors and information sources, (3) distributed information for decision making and (4) devise approaches for fusing results of processed outputs of multimodal sensors such as visible, IR and hyperspectral imagers, and acoustic, magnetic & electric field sensors. This effort is complementary with PE 0601104A\/H50 and PE0601104A\/J22."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.425"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued to develop and assess novel multimodal sensing and processing algorithms for acquiring information on human activity; investigated and performed experiments in a realistic or simulated environment to evaluate distributed networking and interoperability algorithms and tools (developed in FY12) for coalition information sharing and decision making; and implemented quality of information (QoI) based data discovery, collection and fusion techniques to extract desired information from large data sets."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.772"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop pattern of life algorithms and statistics to discriminate between potential threat activities and normal behavior; develop and evaluate fusion algorithms that correlates bearing information from multiple soldier-worn gunfire detection systems for localization of shooter with reduced errors and uncertainties; develop protocols and message formats to enable interoperability between disparate sensor systems; develop tools to understand value and quality of information based on data discovery, collection and fusion of large datasets; evaluate fusion of acoustic and electric field sensing systems to enable passive ranging of near-miss bullets based on wave propagation velocity differences; and develop passive electromagnetic (EM) target detection and localization using multi-axis electric-field and magnetic field sensors."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.843"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.843"
                                            },
                                            "Text": {
                                                "val": "Will implement anomaly detection algorithms by fusing the output of social network with disparate multimodal sensors to determine patterns of behavior; enhance acoustic, magnetic and electric-field sensors and algorithms to detect, classify, and localize hostile transient threat events such as mortars, rockets, gunfire, and moving ground\/air vehicles, to include unmanned aerial systems (UAS); and mitigate background noise resulting from mobile sensor systems in complex environments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tagging Tracking and Locating (TTL)"
                                    },
                                    "Description": {
                                        "val": "Conduct applied research to support advances in state-of-the-art clandestine TTL for non-traditional hostile forces and non-cooperative targets. Specific technical details related to this effort are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.793"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigated alternate technologies including UV, IR, RF, and acoustic modalities for application to TTL; designed advanced hyperspectral algorithms for locating and tracking targets of interest; and developed advanced biometric techniques for locating and identifying humans of interest."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.089"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigate battery-free tags for extending the operating life of tags; and develop and extract signals from targets of interest using mechanical and electromechanical coupling methods combined with applicable sensing modalities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ultra Wideband Radar (UWB)"
                                    },
                                    "Description": {
                                        "val": "Conduct research to examine the technical underpinnings of UWB radar for several key Army concealed target detection technology requirements including landmine and improvised explosive device (IED) detection, sensing through-the-wall (STTW), and obstacle detection. Use a combination of advanced computational electromagnetic algorithms, radar measurements and advanced signal processing techniques to define the performance boundaries of state of the art airborne and ground-based UWB radar for concealed target detection."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.030"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed FY12 assessments that combine electromagnetic models, rough surface models, measurement data and signal processing techniques to recommend forward looking radar parameters for optimized detection of IEDs to improve detection performance at increasing standoff distances; and continued to investigate utilizing radar data to build interior structure maps as well as stationary target detection techniques using three dimenstional (3-D) computer-generated radar images."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.379"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop techniques for combining UWB radar with complementary sensors, such as video, thermal IR, for improving probability of detection and confirmation of targets; and investigate computational electromagnetic models of the radar signature of RF devices placed in a complex building environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.913"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.913"
                                            },
                                            "Text": {
                                                "val": "Will assess performance of UWB radar with complementary sensor (techniques and technologies) and compare to the current target detection capabilities and performance metrics; and investigate computational electromagnetic models to address new target deployments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Networked Compact Radar, Wide Bandgap Optoelectronics, and Laser Protection Technologies"
                                    },
                                    "Description": {
                                        "val": "Investigate RF networking technology in support of integrated RF systems for use on ground, air, and Soldier platforms to support radio, radar, and control functions to allow communications, combat identification (ID), and target acquisition\/tracking. Research semiconductor-based ultraviolet (UV) optoelectronics for communications, water\/air\/surface purification, and detection and identification of biological threats. Research novel materials and high speed switching technology for sensor and eye protection."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.502"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Assessed the application of RF micro-doppler algorithms to the remote sensing of human activities for counter-IED applications; investigated non-traditional radar modes in a compact radar device for force protection and surveillance; improved performance of UV lasers, light emitting diodes (LEDs), and detectors operating at wavelengths of 230-275-nanometers for enabling communications, water\/air\/surface purification, and detection and identification of biological threats; and investigated new optical limiting components for detecting emerging laser threats."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.433"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Create software and hardware architectures that enable compact radars to network with other unattended ground sensors for small unit force protection; evaluate nonlinear optical materials and tune their properties to optimize performance of the overall vision protection system; and grow and characterize gallium nitride materials for extending the spectral range of UV lasers, LEDs, and detectors to wavelengths of 230-365-nanometers for enabling communications, water\/air\/surface purification, detection and identification of biological threats, and electro-optic countermeasures."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.141"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.141"
                                            },
                                            "Text": {
                                                "val": "Will grow and characterize wide bandgap semiconductor materials and develop device designs to extend the spectral range of UV lasers, LEDs, and detectors to wavelengths from 200 to 365 nanometers to enable water\/air\/surface purification and detection and identification of biological threats; investigate different materials and evaluate solutions for eye and sensor protection against ultra-short pulses and near-IR high power threats."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Adaptive Information Collection and Fusion"
                                    },
                                    "Description": {
                                        "val": "This effort develops network and processing infrastructure concepts, and validates algorithms to enable assets to dynamically modify their physical and information producing behaviors to adaptively operate within the dynamics and timelines of small unit decision makers."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.650"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Assessed cloud-based cellular architectures and explored implementation of decision support tools at the sensor level to more effectively support the collection and dissemination of information specifically tailored to the Soldier's cognitive requirements for more accurate decision making."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.784"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Evaluate decision-adaptive anomaly detection techniques as a means of filtering data at the sensor level to improve situation understanding for small unit decision makers and evaluate the impact of these techniques on data latency and situation awareness; integrate these filtering algorithms into an autonomous collaborative collection framework and assess the impact on delay and situation awareness."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi-Mode Air Defense Radar"
                                    },
                                    "Description": {
                                        "val": "This research supports the current and future technical challenges associated with air defense radar technology. In particular, this effort will analyze current and emerging RF spoofing, RF jamming and RF signature management technology to determine their impact on the performance of air defense radar technology. Electromagnetic modeling, RF measurements and experiments will be used to mitigate the effects of spoofing, jamming and signature management technology. This will include research extending from electronic devices, subassembly design, and laboratory prototypes to advance the state-of-the-art of air defense technology operating in contested environments."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.500"
                                            },
                                            "Text": {
                                                "val": "Will investigate current and emerging technologies, across a broad RF spectrum, which may limit the performance of current air defense radar systems; modify existing physics-based electromagnetic modeling techniques to assess performance and identify critical areas of research; and examine performance in contested environments and research techniques to mitigate performance limitations."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "SA2"
                    },
                    "ProjectTitle": {
                        "val": "Biotechnology Applied Research"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.011"
                        },
                        "CurrentYear": {
                            "val": "4.035"
                        },
                        "BudgetYearOne": {
                            "val": "2.860"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.860"
                        },
                        "BudgetYearTwo": {
                            "val": "2.993"
                        },
                        "BudgetYearThree": {
                            "val": "1.873"
                        },
                        "BudgetYearFour": {
                            "val": "2.195"
                        },
                        "BudgetYearFive": {
                            "val": "2.120"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project designs, develops and evaluates biotechnology with application to sensors, electronics, photonics, and network science.  This project funds collaborative applied research and integration of government, academic and industry scientific research on biotechnology from PE 0601104\/H05, Institute for Collaborative Biotechnologies (ICB) to advance innovative capabilities. Areas of applied research include bio-array sensors, biological, and bio-inspired power generation and storage, biomimetics, proteomics, genomics, network science, DNA research and development, control of protein, and gene expression.  \n\nThe ICB is a collaborative effort led by the University of California, Santa Barbara (Santa Barbara, CA) in partnership with the California Institute of Technology (Pasadena, CA), the Massachusetts Institute of Technology (Cambridge, MA), the Army Laboratories and Research, Development and Engineering Centers, and the ICB industrial partners.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork is performed by the Army Research Laboratory, Adelphi, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Biotechnology Applied Research"
                                    },
                                    "Description": {
                                        "val": "This effort exploits breakthroughs in biotechnology basic research invented at the ICB to enable capabilities in sensors, electronics, photonics, and network science."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.011"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed the design and fabricated hardware and software required to image single cells in three dimensional (3D) to better understand the interactions between biological materials and inorganic surfaces; experimentally validated increased electron acceptors ability to improve fermentation for bioprocessing and monitoring systems; analyzed wastewater treatment on increased laboratory scale to optimize bioremediation; characterized artificial biofilms doped with organic conductive structures for increased current density microbial fuel cells; evaluated bio-inspired algorithms for control of swarms of micro-unmanned aerial vehicles; and evaluated yeast cell based electrodes and membranes in a microbial fuel cell for powering unattended ground sensors."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.035"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Improve biofuel cell electrode and membrane materials design, and validate for powering unattended ground sensors and other monitoring systems; complete and validate bio-inspired algorithms for control of swarms of micro-unmanned aerial vehicles; evaluate the use of a virus to template electrode materials to design improved batteries for small-scale, unmanned aerial vehicles; and evaluate protein capture agents and synthetic bio-molecules as materials to improve stability, affinity for overall environmental tolerance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.860"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.860"
                                            },
                                            "Text": {
                                                "val": "Will investigate performance limits of hybrid biofuel cells for powering unattended ground sensors or other remote, stand-alone monitoring systems; study interface technologies for small-scale batteries using virus templated materials for use on unmanned aerial vehicles (UAVs); and develop and study rapid screening, selection and production bio-based processes for recognition and targeting of emerging threats to the soldier."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TS1"
                    },
                    "ProjectTitle": {
                        "val": "Tactical Space Research"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.795"
                        },
                        "CurrentYear": {
                            "val": "5.304"
                        },
                        "BudgetYearOne": {
                            "val": "4.778"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.778"
                        },
                        "BudgetYearTwo": {
                            "val": "5.850"
                        },
                        "BudgetYearThree": {
                            "val": "6.752"
                        },
                        "BudgetYearFour": {
                            "val": "7.079"
                        },
                        "BudgetYearFive": {
                            "val": "7.124"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project researches and evaluates technologies for space-based, high altitude, and cyberspace applications for Army tactical ground forces.  Applied research efforts include the design and development of sensors and electronic components, communications, signal and information processing, target acquisition, position\/navigation, and threat warning within space and high altitude environments as well as the design and development of technologies and analytical tools for cyber risk assessment and mitigation in acquisition systems.  The applied research and technology evaluations conducted under this Project leverage other DoD space science and technology applications to support Army space force enhancement and cooperative satellite payload development.  \n\nWork in this project complements and is fully coordinated with PE 0603006A (Space Applications Technology).\n  \nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.     \n  \nWork in this project is performed by the US Army Space and Missile Defense Command\/Army Forces Strategic Command (USASMDC\/ARSTRAT) in Huntsville, AL."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Tactical Space Research"
                                    },
                                    "Description": {
                                        "val": "This effort designs, develops, and evaluates space-based technologies, components, and tools that lead to smaller, lighter, more responsive payloads and applications. These technologies allow for the rapid integration and development of tactical payloads in support of responsive space environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.814"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Designed and developed optics, processor, and gimbaled systems component technologies for small satellite Electro-Optical (EO) imagery subsystems, small satellite deployable arrays, and small satellite constellation enablers."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.242"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Design and develop tracking system and antenna pointing component technologies for small satellites; develop orbit planning and analysis tools to support small satellite constellation concept of operation feasibility studies; research and develop propulsion concepts for small satellite station keeping and maneuvering."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.765"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.765"
                                            },
                                            "Text": {
                                                "val": "Will develop payload deployer subsystem for affordable launch vehicle; design and develop advanced attitude determination and control and propulsion subsystems for nanosatellites to change orbits in flight."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space and Analysis Lab"
                                    },
                                    "Description": {
                                        "val": "This effort provides an in-house capability to design and conduct analytic evaluations of space, high altitude, and cyberspace technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.981"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Designed payload ground systems to monitor health and status of small satellite systems during flight operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.062"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Design and implement a communications satellite testbed to conduct and evaluate nanosatellite assembly, payload integration, ground testing and preflight checkout; improve ground station capabilities within the lab to support on-orbit communications and imagery nanosatellite demonstrations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.013"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.013"
                                            },
                                            "Text": {
                                                "val": "Will validate performance of Hardware In The Loop nanosatellite attitude control, to include attitude control software, device integration, and in-flight simulation of commanded motion."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TS2"
                    },
                    "ProjectTitle": {
                        "val": "Robotics Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "11.543"
                        },
                        "CurrentYear": {
                            "val": "10.685"
                        },
                        "BudgetYearOne": {
                            "val": "7.941"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.941"
                        },
                        "BudgetYearTwo": {
                            "val": "8.483"
                        },
                        "BudgetYearThree": {
                            "val": "8.505"
                        },
                        "BudgetYearFour": {
                            "val": "8.714"
                        },
                        "BudgetYearFive": {
                            "val": "8.021"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project designs, evaluates, and investigates autonomous technologies to enable robotics to assist military missions.  Technical efforts are focused on advancing perception for autonomous ground mobility, intelligent vehicle control and behaviors, human-robot interaction, robotic manipulation, and improved mobility for unmanned vehicles of scales from micro-systems through tactical vehicles.  The project provides the underpinning research of the Robotics Collaborative Technology Alliance (CTA), a cooperative arrangement with industry and academia to conduct a concerted, collaborative effort advancing key enabling robotic technologies required for future unmanned systems.  \n\nThis project sustains Army science and technology efforts supporting the Air and Ground portfolios.\n\nThis project leverages basic research conducted under PE 0601102A, project T63 and PE 0601104A, project H09 and transitions knowledge and emerging technologies to PE 0603005A (Combat Vehicle Advanced Technology) for maturation and demonstration.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology focus areas, and the Army Modernization Strategy.\n\nWork in this project is performed by the U.S. Army Research Laboratory (ARL) at the Aberdeen Proving Ground, MD, and the Robotics Collaborative Technology Alliance consisting of: Boston Dynamics, Carnegie Mellon University, Florida A&M University, General Dynamics Robotics Systems, Jet Propulsion Laboratory, QinetiQ North America, University of Central Florida, and University of Pennsylvania."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Robotics CTA"
                                    },
                                    "Description": {
                                        "val": "Conduct applied research to provide essential capabilities for advanced perception, intelligent control and tactical behavior, human-robot interaction, robotic manipulation, and unique mobility for unmanned systems to conduct multiple military missions for a full range of robots from man-portable to larger systems. Research focuses on new sensor and sensor processing algorithms for rapid detection and classification of objects in cluttered and unknown environments, enabling autonomous mobility and intelligent tactical behavior by future unmanned systems; implementing adaptive control strategies that will enable unmanned systems to display intelligent tactical behavior, formulation of control strategies that will facilitate use of unmanned systems in populated environments and minimize the cognitive workload on Soldier operators enabling more dexterous manipulation of objects."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.195"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Designed algorithms to enable both improved comprehension of the sensed environment by small unmanned systems and adaptability in planning and execution of tactical behaviors; and investigated concepts for more efficient locomotion by small, legged unmanned systems to improve mobility."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.808"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to design perception and intelligence algorithms that will permit unmanned systems to team with soldiers in moderately complex environments and conduct missions; instantiate learning algorithms to enable robots to continually learn from experience and recognize intent of other agents; and focus on the implementation of hybrid cognitive\/metric architecture to minimize the workload placed upon soldier, including the implementation of non-traditional control techniques; and implement concepts for manipulation of objects and improved ground mobility for complex and constrained environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.573"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.573"
                                            },
                                            "Text": {
                                                "val": "Will incorporate perception and intelligence algorithms into effective teaming of humans and robots as part of a mixed team to successfully conduct missions; will conduct technology assessments of components and integrated systems to determine performance and technology maturity levels; and implement perception and reasoning skills with technology testbeds employing unique mobility modes, e.g., legs, and manipulation skills to assess technology performance levels."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Perception and Intelligent Control"
                                    },
                                    "Description": {
                                        "val": "Advance perception and intelligent control technologies required to achieve autonomous tactical behaviors and other objective capabilities for future unmanned vehicles of multiple size scales and to transition this technology to advanced development programs being conducted under PE 0603005A (Combat Vehicle and Automotive Advanced Technology)\/project 515 (Robotic Ground Systems) for integration into test bed systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.348"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigated previously learned understanding of tactical environment between soldier and unmanned systems to improve autonomous tactical behaviors and to validate technologies in collaboration with CTA efforts; investigated and evaluated the state-of-the-art in intelligent control; and focused on the technology gaps."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.877"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Implement algorithms for perception of the local environment employing a hybrid cognitive\/metric architecture; incorporate advanced algorithms for whole body manipulation on to testbed platforms; and implement novel approaches to mobility in complex and constrained environments; and assess performance of algorithms in an integrated context."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.368"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.368"
                                            },
                                            "Text": {
                                                "val": "Will develop the perceptual and reasoning capabilities necessary to enable an unmanned system to deduce the intent of actions\/activity; and explore and implement on testbed platforms the mechanisms and control algorithms that will enable autonomous unmanned systems to dexterously manipulate objects and maneuver through complex terrain, with an emphasis on increased efficiency."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}