{
    "id": "ba99f68503b34c8ef5e65e116e8c8dff19b4eb44",
    "meta": {
        "filename": "dod-2015_RDTE_2015_AIRFORCE_V3B_RDTE_JustificationBook_Air_Force_PB_2015.zzz_unzipped_RDTE_JustificationBook_Air_Force_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0303140F"
        },
        "ProgramElementTitle": {
            "val": "Information Systems Security Program"
        },
        "R1LineNumber": {
            "val": "182"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "60.837"
            },
            "CurrentYear": {
                "val": "74.530"
            },
            "BudgetYearOne": {
                "val": "70.497"
            },
            "BudgetYearOneBase": {
                "val": "70.497"
            },
            "BudgetYearTwo": {
                "val": "86.005"
            },
            "BudgetYearThree": {
                "val": "65.198"
            },
            "BudgetYearFour": {
                "val": "53.590"
            },
            "BudgetYearFive": {
                "val": "54.465"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "In FY 2014, Project 677820, Computer Security Firestarter efforts were transferred to PE 0208088F, Air Force Defensive Cyberspace Operations to better align efforts."
        },
        "ProgramElementMissionDescription": {
            "val": "The Information Systems Security Program (ISSP) Element provides cradle-to-grave research, development, acquisitions, supply, sustainment, depot maintenance, and demilitarization of the Air Force (AF) cryptographic and key distribution\/management systems.  Additionally, ISSP funds the AF operation of one of two Department of Defense (DoD) Tier 1 key distribution centers, and a special computer security program, designated FIRESTARTER.  The AF and the DoD require the capability to secure, collect, process, store, and disseminate an uninterrupted flow of information, while denying an adversary the ability to intercept, collect, destroy, interpret, or manipulate our information flows. Secure communication allows the DoD to achieve and maintain decision superiority; the key to successful application of the military instrument of national power. AF COMSEC equipment protects information such as, warfighter positions, mission planning, target strikes, commanders' orders, intelligence, force strength, and force readiness. This COMSEC program ensures adversaries cannot interpret, manipulate, or destroy information. When an adversary is capable of interpretation, manipulation, or destruction of the information used by the warfighter, DoD military forces will suffer significant and\/or devastating mission degradation that can result in loss of life and resources and\/or cede information that could be used against the United States in a public forum.\n\nThe overall focus of the Research, Development, Test, and Evaluation (RDT&E) efforts within this program is to transform electronic key delivery and cryptographic devices to meet the next generation warfighting requirements. These efforts are driven by the National Security Agency's (NSA) tenets calling for (1) a totally \"man-out-of-the-loop\" electronic crypto key distribution system from the actual generation of the key in the key processor all the way into the using End Crypto Unit (ECU) (eliminates the current key vulnerability to compromise\/interruption by individuals transporting or loading the key); and (2) an inventory of cryptographic devices that are more robust, modular, scalable, capable, net-centric, and durable (allows more effective and efficient performance including reduced inventory, expanded data rates, simplified upgrades, and ensured global information grid-compatibility).  \n\nThis program is in Budget Activity 7, Operational System Development, as these budget activities include development efforts to upgrade systems currently fielded or have approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "69.133"
                },
                "CurrentYear": {
                    "val": "90.231"
                },
                "BudgetYearOne": {
                    "val": "79.946"
                },
                "BudgetYearOneBase": {
                    "val": "79.946"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "60.837"
                },
                "CurrentYear": {
                    "val": "74.530"
                },
                "BudgetYearOne": {
                    "val": "70.497"
                },
                "BudgetYearOneBase": {
                    "val": "70.497"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-8.296"
                },
                "CurrentYear": {
                    "val": "-15.701"
                },
                "BudgetYearOne": {
                    "val": "-9.449"
                },
                "BudgetYearOneBase": {
                    "val": "-9.449"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.091"
                    },
                    "CurrentYear": {
                        "val": "-0.394"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "-25.307"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "10.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.784"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-6.421"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-9.449"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-9.449"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Reductions in FY13 Other Adjustments was due to Sequestration.\n\nCongressional Directed Reductions in FY14: (-$3.9M)Concept Refinement and (-$21.407M) Program Decrease.\nThere was also a Congressional Add (+$10M) for ASACoE in FY14.\n\nReductions in FY15 funding due to higher Air Force priorities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "674861"
                    },
                    "ProjectTitle": {
                        "val": "EKMS (Electronic Key Management System)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.844"
                        },
                        "CurrentYear": {
                            "val": "2.059"
                        },
                        "BudgetYearOne": {
                            "val": "0.592"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.592"
                        },
                        "BudgetYearTwo": {
                            "val": "0.629"
                        },
                        "BudgetYearThree": {
                            "val": "0.928"
                        },
                        "BudgetYearFour": {
                            "val": "0.947"
                        },
                        "BudgetYearFive": {
                            "val": "0.964"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Air Force Electronic Key Management System (AFEKMS) consists of multiple developments supporting the Air Force requirements portion of the DoD EKMS Program. (The National Security Agency [NSA] acts as the Executive Agency for the DoD EKMS Program.) AFEKMS, in concert with the overarching DoD EKMS program, provides a secure and flexible capability for the electronic generation, distribution, accounting, and management of key material, with users across DoD Command, Control, Communications, Computers, and Intelligence (C4I) and all current AF weapon systems. Bases  and units, in garrison and deployed DoD EKMS replaced the previous manual distribution and management system providing cryptographic keying material for U.S. DoD Information Assurance. Information Assurance emphasizes confidentiality, access control, multi-level secure databases, trusted computing, and information integrity. DoD EKMS has a three-tier hierarchical structure. This tiered structure provides capability to distribute, manage, and account for COMSEC keying material. Tier 1 installations comprise the key material general and control capability. Tier 2 installations comprise the local distribution network (COMSEC accounts) and Tier 3 is where keying material is transferred from the EKMS infrastructure to the consumers End Cryptographic Units (ECUs). Additionally, AFEKMS resources provide maintenance\/distribution of AF Communications Security (COMSEC) publications for all AF users. \n\nEKMS improved protection of national security-related information by substantially enhancing confidentiality, integrity, and non-repudiation characteristics over the legacy manual key management systems. EKMS has and continues to greatly accelerate availability of crypto key materials through electronic transmission through Public Switched Telephone Network (PSTN) versus the manual handling and shipping of materials. While the current EKMS level-of-effort is directed at enhancing current and developing systems, the ultimate goal is for it to seamlessly transition to the net-centric DoD Key Management Infrastructure (KMI). The AFEKMS Program continues to provide software development to support emerging requirements during the KMI transition period. Activities also include studies and analysis to support both current program planning and execution and future program planning.\n\nNOTE:  Software development (e.g., Data Management Device - DMD, Common User Application Software - CUAS, and Simple Key Loader - SKL) is rolled up into Tier 2\/Tier 3 Development. Software upgrades can be bundled and tracked as a unit, thereby allowing less management overhead and more focus on configuration management and control."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Tier 2\/Tier 3 Software Modification"
                                    },
                                    "Description": {
                                        "val": "Software modification that address emerging requirements for Tier 2 (base COMSEC account)\/Tier 3 (Key material field devices)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.420"
                                            },
                                            "Text": {
                                                "val": "Continued to update software releases for Tier 2\/Tier 3 cryptographic devices as development for Electronic Key Management System (EKMS) continues to ensure emerging requirements meet operational timelines"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.627"
                                            },
                                            "Text": {
                                                "val": "Will continue to update software releases for Tier 2\/Tier 3 cryptographic devices as required by field operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.245"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.245"
                                            },
                                            "Text": {
                                                "val": "Will continue to update software releases for Tier 2\/Tier 3 cryptographic devices as required by field operations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Fill\/Load Device"
                                    },
                                    "Description": {
                                        "val": "Fill\/Load Device Post Production Software Development"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.424"
                                            },
                                            "Text": {
                                                "val": "Continued to develop, test and evaluate new Simple Key Loader (SKL) User Application Software and develop SKL load profiles to enable new End Crypto Units the abilities to be loaded using the SKL."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.432"
                                            },
                                            "Text": {
                                                "val": "Continue to develop, test and evaluate new Simple Key Loader User Application Software and develop SKL load profiles to enable new End Crypto Units the abilities to be loaded using the SKL."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.347"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.347"
                                            },
                                            "Text": {
                                                "val": "Will continue to develop, test and evaluate new Simple Key Loader User Application Software and develop SKL load profiles to enable new End Crypto Units the abilities to be loaded using the SKL."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPAF:BA03: 831010"
                                    },
                                    "Title": {
                                        "val": "COMSEC Equipment"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "4.282"
                                        },
                                        "CurrentYear": {
                                            "val": "4.753"
                                        },
                                        "BudgetYearOne": {
                                            "val": "2.222"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "2.222"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "1.102"
                                        },
                                        "BudgetYearThree": {
                                            "val": "1.547"
                                        },
                                        "BudgetYearFour": {
                                            "val": "1.574"
                                        },
                                        "BudgetYearFive": {
                                            "val": "1.603"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "Other Program Funding reflects Air Force Electronic Key Management System (AFEKMS) portion of Information Systems Security Program (ISSP) OPAF total."
                        },
                        "AcquisitionStrategy": {
                            "val": "All major contracts within this Project are open to full and open competition with technology knowledge, expertise, and prior experience on similar projects weighted heavily in the evaluation process."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0303140F_BPAC_674861_0.jpg"
                                }
                            }
                        ]
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "675100"
                    },
                    "ProjectTitle": {
                        "val": "Cryptographic Modernization"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "44.483"
                        },
                        "CurrentYear": {
                            "val": "62.064"
                        },
                        "BudgetYearOne": {
                            "val": "60.543"
                        },
                        "BudgetYearOneBase": {
                            "val": "60.543"
                        },
                        "BudgetYearTwo": {
                            "val": "75.249"
                        },
                        "BudgetYearThree": {
                            "val": "53.656"
                        },
                        "BudgetYearFour": {
                            "val": "41.821"
                        },
                        "BudgetYearFive": {
                            "val": "42.472"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The AF Cryptographic Modernization Effort modernizes cryptographic devices protecting critical national security information across cyber domain operations. In September 2000, the Defense Review Board (DRB) tasked National Security Agency (NSA) to evaluate the security posture of the cryptographic inventory. Systems with aging algorithms, those approaching non-sustainability, and those generally incompatible with modern key management systems were also identified and have been replaced or are being fielded. Priority systems that required immediate replacement were also identified. In addition, NSA documented the need to modernize the cryptographic inventory with capabilities designed to enable network-centric operations. Replacements\/Modernization of the near term vulnerable systems must occur within the timeframe specified by device and algorithm in Chairman Joint Chiefs of Staff Notice (CJCSN) 6510. The DoD Cryptographic Modernization Program was established to develop a modern cryptographic base that provides this assured security robustness, interoperability, advanced algorithms, releasability, programmability, and compatibility with the future Key Management Infrastructure (KMI).  This AF effort supports an integrated effort across the cyber domain to transform  to next generation cryptographic capabilities providing U.S. forces and multinational and interagency partners the security needed to protect the flow and exchange of operational decision making information in accordance with national and international policy\/standards, the validated operational requirements of the warfighters, and the intelligence communities.  \n\nThe AF Cryptographic Modernization Effort is a collection of projects accomplished in three phases: replacement, modernization, and transformation. The replacement phase of the program focused on updating and\/or replacing out-of-date algorithms along with unsustainable cryptographic products. The modernization phase provides crypto devices with common solutions that are more robust, modular, scalable, and provide the durability to existing cryptographic end items, as well as updating mid-term aging\/unsupportable crypto equipment. Manpower and logistics requirements will be reduced and manpower efficiencies gained, while incremental capability enhancements and footprint reduction are provided. The third phase of the Cryptographic Modernization Program, transformation, provides common joint solutions which enable secure transparent network-centric capabilities across the cyber domain. Activities also include studies and analysis to support both current program planning and execution and future program planning.  FY14 funding increased to address pending crypto key\/algorithm decertifications due to increased threats identified by NSA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Remote Rekey (RRK)"
                                    },
                                    "Description": {
                                        "val": "The Remote ReKey (RRK) program will develop, acquire and install a replacement of the CI-13 cryptographic system at remote and unmanned North American Aerospace Defense Command (NORAD) surveillance sites.  Sites facilitate NORAD's aerospace control ensuring air sovereignty and air defense of the airspace of the United States.  Modernize RRK system complements Identification Friend or Foe (IFF) Mode 5 system upgrade and distribute cryptographic key for 14 different end cryptographic units.  The RRK system is net ready and compatible across multiple communication paths."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.409"
                                            },
                                            "Text": {
                                                "val": "Completed development and test efforts.  Received Milestone C permission to enter Production and Deployment phase."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "VINSON\/ANDVT Cryptograhic Modernization (VACM)"
                                    },
                                    "Description": {
                                        "val": "VINSON\/Advanced Narrowband Digital Voice Terminal (ANDVT) Cryptographic Modernization will develop and acquire cryptographic capability to replace the legacy capability on VINSON\/ANDVT secure voice communications on aircraft, ships, and ground fixed and mobile platforms (Devices: KY-57\/58, KY-99\/100, KYV-5 and ARC-234 with embedded crypto)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "26.628"
                                            },
                                            "Text": {
                                                "val": "Continued development and initiated testing and test production representative engineering models, perform NSA certification testing and developmental testing. Continued ARC-234 modification development using VACM technology."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.367"
                                            },
                                            "Text": {
                                                "val": "Will complete engineering manufacturing development and initiate production of 100 Low Rate Initial Production (LRIP) VACM units (to be delivered in FY14\/15). Will complete ARC-234 modification development using VACM technology."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.091"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.091"
                                            },
                                            "Text": {
                                                "val": "Will complete Force Development Evaluation to test and evaluate the VACM devices."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space Telemetry Tracking & Commanding (TT&C) Aerospace Vehicle Equipment Increment 1 (AVE Inc1)"
                                    },
                                    "Description": {
                                        "val": "Space TT&C AVE Inc 1 develops and delivers space qualified cryptographic products to satellite platforms for securing the TT&C link."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.115"
                                            },
                                            "Text": {
                                                "val": "Continued efforts to implement new algorithms in response to NSA mandates.\nCAROUSEL replaces CARDHOLDER algorithm. Will award Space TT&C AVE Inc 1\nCAROUSEL cryptographic engine (CCE) development contract modification;\nFY2014 CCE contract modification will be accomplished using active year\n(FY13) incremental funding."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.325"
                                            },
                                            "Text": {
                                                "val": "Will continue development activities on Space TT&C AVE Inc 1 CCE contract."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.156"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.156"
                                            },
                                            "Text": {
                                                "val": "Will continue development activities on Space TT&C AVE Inc 1 CCE contract."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Technical Development (TD)"
                                    },
                                    "Description": {
                                        "val": "Technical Development (TD) refines and develops critical technologies related to evolving threats and Communications Security (COMSEC) capability gaps across AF mission areas. Develops, plans and executes technology maturation efforts to mitigate risk for thousands of users affected by algorithm security issues and ensure required security upgrades can be integrated into the AF enterprise. Works with NSA and other services to develop standards that increase security of communication and information products and facilitate efficient crypto and COMSEC enterprise management. Includes but is not limited to: Secure Micro-digital Data Link (SMDDL), Classified Data at Rest (CDAR), Remote Operational Management of End-crypto-units (ROME), High Assurance Commercial-off-the-Shelf (COTS) Mobility (HACM), Combat Training System Encryption (CTSE), and Enhanced Firefly (EFF) replacement development. TD will also ensure the AF continues providing Distributed Common Ground System (DCGS) Crypto to support the rigorous speed and quality of service requirements of the AF DCGS global Intelligence, Surveillance, and Reconnaissance (ISR) Wide Area Network (WAN) Weapon System (AN\/GSQ-272). AF DCGS is based on legacy Asynchronous Transfer Mode (ATM) technologies that are no longer available from manufacturers. DCGS crypto will develop and procure cryptographic devices that allow AF DCGS to continue operating during and after an AF DCGS Communications Modernization from ATM to the Next Generation Deterministic Protocol (NGDP)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.537"
                                            },
                                            "Text": {
                                                "val": "Accomplished pre-MS B activities and continued development of common miniaturized cryptographic solution(s) for use in protecting Classified information on Size, Weight, and Power (SWaP) constrained platforms. Moved development of Mini Crypto high assurance crypto device into separate program line. Conducted SMDDL development, test, and certification activities. Funded CM analysis tool database support to the CM community. Developed ROME Common Crypto Management Information Base (MIB) identifying the framework for future common management of cryptographic devices. Conducted annual assessment of the state of the AF cryptographic enterprise. Began analysis of feasibility of common modular cryptographic solutions for the air and ground environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.062"
                                            },
                                            "Text": {
                                                "val": "Will accomplish CTSE requirements refinement and acquisition strategy in partnership with the P5 SPO at Eglin AFB.  Will complete SMDDL certification. Will evaluate HACM technologies and track secure mobility solutions impacting AF users. Will investigate classified Data At Rest solutions for tactical environments. Will begin planning replacement of legacy crypto in Air Force Distributed Common Ground System (DCGS-AF). Will plan a Link 16 cryptographic upgrade kit procurement. Will begin planning replacement or upgrade of 150,000 Air Force devices that incorporate EFF keying material. Will initiate development of Common Encryption Management software for disparate families of Internet Protocol (IP) encryptors. Will continue the analysis of common modular cryptographic solutions for the air and ground environment. Will support MLS Multi-Domain Simultaneous Access to Virtual Environments (MD SAVE) Joint Capability Technology Demonstration.\nApplication Software Assurance Center of Excellence (ASACoE) had a Congressional Mark of +$10M for FY14.   The Technical Development line will include this Congressional Mark of +$10M for ASACoE."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.931"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.931"
                                            },
                                            "Text": {
                                                "val": "Will continue HACM and CDAR development. Will finalize plans for the cryptographic portion of Link 16 upgrades. Will continue planning and begin executing replacement or upgrade of 150,000 Air Force devices that incorporate EFF-based keying material. Will continue development of Common Encryption Management software to manage Internet Protocol (IP) encryptors and develop standards for management of future devices. Will develop the cryptographic devices that allow AF DCGS to continue operating during and after a Communications Modernization from ATM to the Next Generation Deterministic Protocol."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mini Crypto (MC)"
                                    },
                                    "Description": {
                                        "val": "Mini Crypto (MC) plans to develop common miniaturized cryptographic solution(s) for use in protecting Secret and Below information on Size, Weight, and Power (SWaP) constrained platforms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.073"
                                            },
                                            "Text": {
                                                "val": "Releasing a Request for Proposal (RFP) for the Engineering & Manufacturing Development (EMD) phase contract.  Conducting a Full and Open Competitive Source Selection."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.188"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.188"
                                            },
                                            "Text": {
                                                "val": "After a formal Source Selection, a vendor will be selected and the EMD contract will be awarded for the development of MC.  Shortly following contract award, the program will hold a kick-off meeting with vendor and officially begin the EMD phase."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space Modular Common Crypto (SMCC)"
                                    },
                                    "Description": {
                                        "val": "Space Modular Common Crypto (SMCC) provides Information Assurance (IA) services for new satellite architectures via a family of common crypto solutions that integrate Tracking, Telemetry, & Commanding (TT&C), Mission Data (MD), and\/or Transmission Security (TRANSEC) key stream functions for the Air Force and Intelligence Community space systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.794"
                                            },
                                            "Text": {
                                                "val": "Continued pre-Milestone B activities of SMCC solutions for satellite applications including future TT&C, MD, TRANSEC and secure network connectivity (e.g. HAIPE (High Assurance Internet Protocol Encryption), IPSEC (Internet Protocol Security)). Completed Materiel Development Decision."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.591"
                                            },
                                            "Text": {
                                                "val": "Will continue pre-Milestone B activities, development and risk mitigation activities for SMCC solutions. Conduct SMCC Milestone B. Award SMCC Phase I development contract."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "28.107"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "28.107"
                                            },
                                            "Text": {
                                                "val": "Will continue risk mitigation activities. Continue SMCC Phase I development contract. Award SMCC Phase II development contract."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Algorithm Transition, Compliance and Support"
                                    },
                                    "Description": {
                                        "val": "Algorithm Transition, Compliance and Support provides Information Assurance (IA) Support that performs transition and governance efforts to be able to effectively analyze 30 classified algorithms, thousands of associated COMSEC keying material short titles, and hundreds of equipment types, and track and report algorithm\/device integration across the AF. Based on analysis, determines and monitors mitigation strategies; develops and plans technology maturation efforts to ensure new algorithms can be integrated into the AF enterprise. Assesses current state of AF crypto across the enterprise. Develops and maintains a classified CM database system that tracks status of AF crypto device types that is assessible by the CM community via SIPRNET. Efforts support NC3, ISR, all AF platforms, and most ground networks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.200"
                                            },
                                            "Text": {
                                                "val": "Crypto Algorithm Transition efforts are growing in complexity and the management of Crypto\/COMSEC is growing similarly. Will begin development on a method and\/or process to accurately transition, track, and manage crypto assets and COMSEC across the AF. Will support algorithm transition and governance efforts to effectively track, analyze, and report on AF use of 30 classified algorithms in over 270,000 devices across the AF enterprise comprised of over 300 equipment types\/families and requiring thousands of associated COMSEC keying material short titles. Will provide Crypto-Mod analysis database to AF community to assist in annual assessments during long term effort to develop enterprise capabilities based assessment (CBA) to identify management capability gaps. Will conduct annual assessment of the state of the AF cryptographic enterprise. Will evaluate impacts of the emerging NSA Commercial Solutions for Classified (CSfC) cryptographic development model and its impacts on AF acquisition and sustainment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.250"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.250"
                                            },
                                            "Text": {
                                                "val": "Will continue to support algorithm transition and governance efforts to effectively track, analyze, and report on AF use of 30 classified algorithms in over 270,000 devices across the AF enterprise comprised of over 300 equipment types\/families and requiring thousands of associated COMSEC keying material short titles. Will continue analysis and development of a method and\/or process to accurately transition, track, and manage crypto assets and COMSEC across the AF. Will provide Crypto-Mod analysis database to AF community to assist in annual assessments during long term effort to develop enterprise capabilities based assessment (CBA) to identify management capability gaps.Will conduct annual assessment of the state of the AF cryptographic enterprise.Will evaluate NSA recommendations for quantum computing resistant encryption."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Missile Electronic Encryption Device (MEED) Modernization"
                                    },
                                    "Description": {
                                        "val": "MEED was formerly accomplished under the TechnicalDevelopment Major Thrust as a Crypto Mod activity. To increase program transparency MEED will become an acquisition effort.\n\nMEED Modernization will modernize the legacy Missile Entry Control System (MECS) devices used to securely authenticate personnel attempting access to this Nation's ground-based Intercontinental Ballistic Missile (ICBM) facilities.  This effort will bring the MEED equipment into compliance with current NSA information assurance (IA) security design guidance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.446"
                                            },
                                            "Text": {
                                                "val": "Will initiate MEED Modernization development and accomplish MDD\/project activities"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.820"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.820"
                                            },
                                            "Text": {
                                                "val": "Will continue MEED Modernization"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPAF: BA03: 831010"
                                    },
                                    "Title": {
                                        "val": "COMSEC Equipment"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "108.697"
                                        },
                                        "CurrentYear": {
                                            "val": "76.309"
                                        },
                                        "BudgetYearOne": {
                                            "val": "38.738"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "38.738"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "26.354"
                                        },
                                        "BudgetYearThree": {
                                            "val": "14.861"
                                        },
                                        "BudgetYearFour": {
                                            "val": "19.213"
                                        },
                                        "BudgetYearFive": {
                                            "val": "19.558"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "Remarks: Other Program Funding reflects Crypto Modernization (CM) portion of Information Systems Security Program (ISSP) OPAF total."
                        },
                        "AcquisitionStrategy": {
                            "val": "The Crypto Modernization portfolio of component acquisition projects is executing using a variety of approaches that vary from an evolutionary acquisition strategy using spiral development (for new component development) to incremental improvement leveraging leading-edge, certified non-developmental items (for modernization). Contract type is selected for each of the individual projects based upon its acquisition approach and its unique technology risks. A mixture of fixed-price and cost-reimbursement contracts have been selected which maximize the best value for the Government."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0303140F_BPAC_675100_0.jpg"
                                }
                            }
                        ]
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "675231"
                    },
                    "ProjectTitle": {
                        "val": "AF Key Management Infrastructure (AF KMI)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "9.365"
                        },
                        "CurrentYear": {
                            "val": "10.407"
                        },
                        "BudgetYearOne": {
                            "val": "9.362"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.362"
                        },
                        "BudgetYearTwo": {
                            "val": "10.127"
                        },
                        "BudgetYearThree": {
                            "val": "10.614"
                        },
                        "BudgetYearFour": {
                            "val": "10.822"
                        },
                        "BudgetYearFive": {
                            "val": "11.029"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "AFKMI is listed on the AML. The Air Force Key Management Infrastructure (AF KMI) Program consists of multiple developments supporting the AF requirements\/portion of the DoD Key Management Infrastructure (KMI). (The National Security Agency [NSA] acts as the Executive Agency for the DoD KMI Program.) AF KMI, in concert with this overarching DoD KMI Program, will provide a secure and flexible capability for the electronic generation, distribution, accounting, and management of key material and other communications security (COMSEC) materials for all DoD Command, Control, Communications, Computers, and Intelligence (C4I) and for the Services' weapon systems. KMI represents a broad-scale replacement of the current Electronic Key Management System (EKMS). KMI will provide capabilities that will allow networked operation in consonance with the Global Information Grid (GIG) and other DoD, fellow Service, and AF enterprise objectives. It thereby will assure a viable support infrastructure for future weapons and C4I programs to incorporate key management into their system designs.\n\nThe DoD KMI will greatly improve protection of national, security-related information by substantially enhancing confidentiality, integrity, and non-repudiation characteristics over the legacy EKMS. KMI will greatly accelerate the availability of crypto key materials through electronic transmission versus shipping of materials, will enhance mission responsiveness and flexibility, and will eventually take the man \"out-of-the-loop\" in the distribution of crypto key materials.\n\nThe AF KMI Program in concert with the DoD KMI Program is transitioning the Air Force from the legacy EKMS to modern DoD KMI and building the AF KMI Last Mile architecture. This R&D effort includes system engineering, development and testing to successfully accomplish the transition and defining and developing the AF KMI Last Mile architecture. AF KMI Transition is supporting the DoD KMI program as it progresses through the development, testing, and production and fielding phase of the DoD KMI Program. AF KMI efforts includes the transitioning of existing key management capabilities to KMI. Re-engineering of repair parts may be required. The AF KMI Last Mile program is a holistic solution integrating the legacy and new and evolving cryptographic programs, materials, products, sources and consumers. The AF KMI Last Mile capabilities include distribution, management, and load of cryptographic materials from the KMI (COMSEC account) to the End Crypto Units (ECUs). It builds the linkage interfaces that will allow KMI systems to communicate and integrates other related developments to meet operational needs. AF KMI Last Mile is currently in the Technology Development Phase. Activities also include studies and analysis to support both current program planning and execution and future program planning.\n\nIn parallel with AF KMI, DoD and the Services are developing a new generation of End Crypto Units (ECUs) under the Joint Crypto Modernization Initiative that will be capable of direct interaction with the DoD KMI. (PE0303140F, BPAC 675100, Cryptographic Modernization, supports this initiative). In some cases these new ECUs, although needing to be supported by KMI, will not be KMI network-connected. \"Last mile\" transport of black (aka benign, or encrypted) and red (unencrypted) keying\nmaterial from a KMI client to a new generation ECU or current legacy ECU will need to be handled in the early years by one of two data transfer devices. Initial early systems engineering must also be addressed to accommodate future connectivity between the DoD KMI and future KMI Aware\/Enabled ECUs.  This enabling form factor functionally defined as a common ECU KMI aware\/enabled key load module.  This is targeted to be a standardized module to be provided to ECU developers and, as such, it must precede any future ECU developments."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Key Management Infrastructure Transition"
                                    },
                                    "Description": {
                                        "val": "Support included architectural planning, systems engineering, testing and studies and analyses for migration to the Key Management Infrastructure (KMI) (includes acquisition planning, systems integration, engineering support and System Program Office (SPO) support).  Transitioned existing key management capabilities to KMI."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.598"
                                            },
                                            "Text": {
                                                "val": "Continued architectural planning, systems engineering, in support of KMI CI-2 Spiral 2 Spin 1. Continued support testing of DoD KMI CI-2 components as new hardware\/software versions are completed.  Initiated the transition of existing key management capabilities to KMI."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.588"
                                            },
                                            "Text": {
                                                "val": "Will continue architectural planning, systems engineering, in support of KMI CI-2 Spiral 2 Spin 1. Will continue support testing of DoD KMI CI-2 components as new hardware\/software versions are completed.  Initiates the transition of existing key management capabilities to KMI."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.661"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.661"
                                            },
                                            "Text": {
                                                "val": "Will continue architectural planning, systems engineering, testing and studies & analysis in support of KMI CI-2 Spiral 2 Spin 1 and 2. Will continue support testing of DoD KMI CI-2 components as new hardware\/software versions are completed.  Continues the transition of existing key management capabilities to KMI."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Air Force KMI Last Mile"
                                    },
                                    "Description": {
                                        "val": "Air Force KMI Last Mile early system engineering and risk reduction to include: concept development; for distribution, load and management elements of last mile; studies and analyses for technology possibilities and prototyping efforts for the last mile."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.767"
                                            },
                                            "Text": {
                                                "val": "Completed concept refinement activities.  Concept Characterization and Technical Descriptions (CCTDs) and Alternative Supporting Analyses were completed.  At the request of HQ AFSPC a Material Development Decision (MDD) was approved to enter into the Technology Development phase.  A Technology Development contract was awarded to mature two critical technologies to Technology Readiness Level (TRL) 6. Assisted with assembly of AF KMI Last Mile draft Capabilities Development Document (CDD)"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.819"
                                            },
                                            "Text": {
                                                "val": "Executing the Technology Development contract, developing the requirements for the Engineering and Manufacturing Development (EMD) phase, and finalizing the associated Milestone B (MS B) documentation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.701"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.701"
                                            },
                                            "Text": {
                                                "val": "Will achieve MS B and will award\/manage the EMD contract."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPAF: BA03: 831010"
                                    },
                                    "Title": {
                                        "val": "COMSEC Equipment"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "8.579"
                                        },
                                        "CurrentYear": {
                                            "val": "11.606"
                                        },
                                        "BudgetYearOne": {
                                            "val": "14.457"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "14.457"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "10.981"
                                        },
                                        "BudgetYearThree": {
                                            "val": "12.131"
                                        },
                                        "BudgetYearFour": {
                                            "val": "12.345"
                                        },
                                        "BudgetYearFive": {
                                            "val": "12.566"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "Remarks: Other Program Funding reflects AF Key Management Infrastructure (KMI) portion of Information Systems Security Program (ISSP) OPAF total."
                        },
                        "AcquisitionStrategy": {
                            "val": "All major contracts within this project are open to full and open competition with technology knowledge, expertise, and prior experience on similar projects weighted heavily in the evaluation process."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0303140F_BPAC_675231_0.jpg"
                                }
                            }
                        ]
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "677820"
                    },
                    "ProjectTitle": {
                        "val": "Computer Security RDTE: Firestarter"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.145"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "Funding for Project 677820, Computer Security Firestarter efforts, were transferred to PE 0208088F, Air Force Defensive Cyberspace Operations in FY 2014."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Firestarter program provides technical transition opportunities for research in the area of Information Assurance (IA) technologies and tools needed to defend Air Force (AF) Command, Control, Communications, Computer, and Intelligence (C4I) systems from Information Warfare (IW) attacks, and ensure recovery in the event of an attack.  The emphasis of the program is directed toward defensive cyber operations; computer and network systems security; damage assessment and recovery; cyber threat recognition, attribution, and mitigation; and active response methodologies in response to evolving threats and changes to cyber environment.  These areas of emphasis are realized through research and development in the areas of: cyberspace surveillance; cyber indications and warning (CI&W); high-speed and host-based network intrusion detection; fusion and correlation of cyber intelligence; decision support; recovery; digital forensics; active response, etc.  Current Air Force systems, such as the Combat Information Transport System\/Base Information Protection (CITS\/BIP) leverage this technology to meet their information assurance needs\/requirements.  Additionally, this program utilizes IA and cyber technology investments by the Defense Advanced Research Projects Agency (DARPA), the National Security Agency (NSA), Director of National Intelligence (DNI), Intelligence Advanced Research Projects Activity (IARPA), and the Department of Homeland Security (DHS) to jump-start its development of solutions to existing Air Force IA and cyber requirements.  \n\nThis program coordinates and cooperates with 24th AF (AF component to Cyber Command (CYBERCOM)), Joint Task Force - Global Network Operation (JTF-GNO), Strategic Command (STRATCOM), Defense Information Systems Agency (DISA), National Security Agency (NSA) and other services to ensure Global Information Grid (GIG) IA requirements are being met.  Activities performed include those designed to identify, analyze, test, rapidly acquire, and integrate emerging IA and cyber technology into all regions of the GIG - terrestrial, airborne, and space systems.  Activities also include studies and analysis to support both current program planning and execution and future program planning.  \n\nThis program is in Budget Activity 7, Operational System Development, these budget activities include development efforts to upgrade systems currently fielded or has approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Cyber Forensic Tools & Methodologies"
                                    },
                                    "Description": {
                                        "val": "Cyber forensic tools & methodologies.  Includes: Initial metrics for reliable info assurance; secure coalition IA data management, collaboration and visualization; analysis of cyber security bots."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.450"
                                            },
                                            "Text": {
                                                "val": "Continued the development of methods and technologies to enhance \"real time\" cyber network forensic analysis."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cyber Threat Recognition"
                                    },
                                    "Description": {
                                        "val": "Cyber Threat Recognition. Includes: extended effort for info assurance metrics; integrated airborne network security IO platform"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.350"
                                            },
                                            "Text": {
                                                "val": "Developed non-signature based detection methods for discovery of malicious network activity."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cyber Threat Attribution & Mitigation"
                                    },
                                    "Description": {
                                        "val": "Cyber Threat Attribution and Mitigation.  Includes: risk mitigation techniques for wireless networks and systems; active response, dynamic policy enforcement and computer\/net attack attribution efforts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.440"
                                            },
                                            "Text": {
                                                "val": "Continued development of technologies to detect and attribute distributed computer network attacks, over time and distance, to specific adversaries."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Transition of IA Technology"
                                    },
                                    "Description": {
                                        "val": "Transitions DARPA\/DTO\/IARPA\/DHS information assurance (IA) technology into AF Information Protection, Detection, & Response architecture.  Includes: space systems IA solutions; terrestrial net defense technology development; airborne IP network IA tools; IA\/cyber modeling & sim; secure interoperable distributed agent computing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.905"
                                            },
                                            "Text": {
                                                "val": "Continued to enhance and transition customer funded IA technology to operational USAF components in accordance with rapid requirements documentation provided by AFSPC."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "All major contracts within this project are awarded after full and open competition utilizing evolutionary capability and incremental development."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0303140F_BPAC_677820_0.jpg"
                                }
                            }
                        ]
                    }
                }
            ]
        }
    }
}