{
    "id": "bcdfe8b8e569fcceca676ad056921b204727d8f1",
    "meta": {
        "filename": "dod-2015_RDTE_2015_DARPA_RDTE_JustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2015.zzz_unzipped_RDTE_JustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603760E"
        },
        "ProgramElementTitle": {
            "val": "COMMAND, CONTROL AND COMMUNICATIONS SYSTEMS"
        },
        "R1LineNumber": {
            "val": "60"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "189.909"
            },
            "CurrentYear": {
                "val": "239.078"
            },
            "BudgetYearOne": {
                "val": "243.265"
            },
            "BudgetYearOneBase": {
                "val": "243.265"
            },
            "BudgetYearTwo": {
                "val": "227.402"
            },
            "BudgetYearThree": {
                "val": "216.559"
            },
            "BudgetYearFour": {
                "val": "237.068"
            },
            "BudgetYearFive": {
                "val": "228.998"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Command, Control and Communications Systems program element is budgeted in the Advanced Technology Development Budget Activity because its purpose is to demonstrate and evaluate advanced information systems research and development concepts.\n\nThe goals of the Command and Control Information Systems project are to develop and test innovative, secure architectures and tools to enhance information processing, dissemination and presentation capabilities for the commander.  This will give the commander insight into the disposition of enemy and friendly forces, a joint situational awareness picture that will improve planning, decision-making and execution support capability and provide secure multimedia information interfaces and assured software to \"on the move\" users.  Integration of collection management, planning and battlefield awareness programs is an essential element for achieving battlefield dominance through assured information systems.\n\nThe goals of the Information Integration Systems project are to take diverse data inputs from a variety of sources, efficiently disseminate the information, and perform distributed and dynamic all-source correlation and fusion to produce an integrated, geo-spatially referenced, battlefield database and knowledge-base.  The principal element of this project is assured communications using standard and non-traditional means, on and off the battlefield.\n\nThe goals of the Secure Information and Network Systems project are to develop and test emerging computer and network systems where the impact of the systems and the vulnerabilities of the systems are not kinetically based.  Computer and network security technologies arising from other projects will be further identified, developed, integrated, and tested."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "237.859"
                },
                "CurrentYear": {
                    "val": "239.078"
                },
                "BudgetYearOne": {
                    "val": "216.950"
                },
                "BudgetYearOneBase": {
                    "val": "216.950"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "189.909"
                },
                "CurrentYear": {
                    "val": "239.078"
                },
                "BudgetYearOne": {
                    "val": "243.265"
                },
                "BudgetYearOneBase": {
                    "val": "243.265"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-47.950"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "26.315"
                },
                "BudgetYearOneBase": {
                    "val": "26.315"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.284"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "-39.133"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-2.910"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-5.623"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "26.315"
                                },
                                "BudgetYearOneBase": {
                                    "val": "26.315"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2013:  Decrease reflects Congressional reductions for Sections 3001 & 3004 and directed reductions, sequestration adjustments, reprogrammings,  and the SBIR\/STTR transfer. \nFY 2015:  Increase reflects expansion of the Spectrum Efficiency and Access program and a new effort for Assured Beyond Line-of-Sight Communications."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "CCC-01"
                    },
                    "ProjectTitle": {
                        "val": "COMMAND & CONTROL INFORMATION SYSTEMS"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "11.442"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Military operations since the end of the Cold War show theater-level command, control, communications, and intelligence\/information systems lack the ability to fully support operations in complex, time-critical environments.  Warfighters must be prepared for operations ranging from peacekeeping in urban centers to heavy battle actions in remote areas.  Current capabilities do not provide the commander with real-time, secure, situational awareness or the ability to orchestrate high-tempo planning, rehearsal, and execution.  The program in this project was involved in the development and testing of innovative, secure architectures and tools to enhance information processing, dissemination, and presentation capabilities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "ZETA"
                                    },
                                    "Description": {
                                        "val": "The ZETA program explored the aspects of novel physical devices, concepts, and techniques that leverage quantum physics for information technology.  Research in this area has the ultimate goal of demonstrating information technology components with radical improvements in power efficiency and\/or computational power relevant to military applications and opportunities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.442"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated improved performance of key physical devices.\n-  Fabricated samples with improved materials and demonstrated the expected increase in lifetime."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "CCC-02"
                    },
                    "ProjectTitle": {
                        "val": "INFORMATION INTEGRATION SYSTEMS"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "104.901"
                        },
                        "CurrentYear": {
                            "val": "152.913"
                        },
                        "BudgetYearOne": {
                            "val": "135.633"
                        },
                        "BudgetYearOneBase": {
                            "val": "135.633"
                        },
                        "BudgetYearTwo": {
                            "val": "141.332"
                        },
                        "BudgetYearThree": {
                            "val": "204.559"
                        },
                        "BudgetYearFour": {
                            "val": "225.068"
                        },
                        "BudgetYearFive": {
                            "val": "220.998"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The success of military operations depends on timely, reliable, secure, and synchronized dissemination of command and control and relevant situational awareness information to every military echelon.  While wired communications and networks are fairly well developed, providing assured high-bandwidth mobile wireless capabilities that match or exceed commercial wired infrastructure is needed to meet the demands of military users.  The goal of the Information Integration Systems project is to develop and demonstrate technologies that will provide effective communications to U.S. forces.  Approaches to this goal include developing technologies in these areas:\n-  High-Capacity Links technologies - enables greater back-haul capability\n-  Advanced Networking technologies - supports resilience, adaptability, and scalability\n-  Low Probability of Detection and Anti-Jam (LPD\/AJ) technologies - provides assured communications in a very high-threat environments\n-  Novel Radio Frequency and Spectral Sensing (RF\/SS) - supports efficient spectrum management in congested environments and detection of electromagnetic threats"
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Fixed Wireless at a Distance"
                                    },
                                    "Description": {
                                        "val": "Unlike commercial wireless communications, the military cannot count on a set of secure, fixed cell towers to establish wireless networks capable of receiving and distributing large amounts of data from distributed sources.  Rather, such communication must rely on approaches such as balloons and temporary communication towers that have a high logistical burden and are extremely vulnerable.  Building upon technologies investigated under other High-Capacity Links technologies programs within this project, the Fixed Wireless at a Distance program will overcome these limitations by developing a re-locatable, long-range (10-100s of km) communication infrastructure that provides high-capacity (10s of megabits per second) data links from within a protected space.  The key innovation in this program is the use of a large number of rapidly deployable, distributed, ground-based antenna arrays that can form a coherent aperture for directional transmission and reception of information to\/from tactical wireless networks.  Program challenges include the fundamental limits (power and extent) of transmitter gain as well as the rapid and practical deployment of the ground-based arrays.  When completed, the Fixed Wireless at a Distance program will significantly extend the reach of tactical communication systems without the need for vulnerable and costly infrastructure. Technologies developed in this program will transition to the Navy and Air Force."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.189"
                                            },
                                            "Text": {
                                                "val": "-  Assessed the fundamental limits of transmitter gain for a distributed ground-based wireless network.\n-  Initiated assessment of ground-based array to determine the required characteristics (number or antennas, spatial diversity, and power) to enable marked improvement in the range of tactical communication systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.500"
                                            },
                                            "Text": {
                                                "val": "- Field test collaborative beam focusing radios to measure power as a function of speed.\n-  Build prototype infrastructure module supporting 4 channels divided between a legacy military waveform selected in the 2013 effort, and a CLASS extended range waveform.\n-  Develop and test Application Specific Networking Patterns (ASNPs) networking software in a simulation environment to support mobile ad hoc communications with infrastructure using multiple military traffic use cases.\n-  Measure network performance improvement, throughput and pervasiveness, comparing Mobile Ad Hoc Network with Gateway and Fixed Wireless network protocol.\n-  Develop self-organizing communications software to automatically configure distributed communication systems without operator configuration."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "-  Integrate Soldier Radio Waveform (SRW) capability with Fixed Wireless Infrastructure.\n-  Perform a field test and demonstration of range and data rate of Fixed Wireless Infrastructure to CLASS-equipped radios and to SRW legacy radios.\n-  Demonstrate temporal conjugation technique from multiple, distributed field locations.\n-  Integrate a legacy waveform (e.g., Soldier Radio Waveform (SRW)) capability with Fixed Wireless Infrastructure.\n-  Perform a field test and demonstration of range and data rate of Fixed Wireless Infrastructure to CLASS equipped radios and to SRW legacy radios.\n-  Add two additional ASNPs to support transition of technology to service users."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Scalable Millimeter-wave (MMW) Architectures for Reconfigurable Transceivers (SMART)"
                                    },
                                    "Description": {
                                        "val": "The Scalable Millimeter-wave (MMW) Architectures for Reconfigurable Transceivers (SMART) program developed a new technology for producing very thin millimeter-wave array apertures and transceivers.  The technology development culminated in the demonstration of a large-sized coherent, active electronically-steerable array (AESA) with an output power density of 5W per square cm and a total layer thickness of less than 1cm.  As part of the High-Capacity Links efforts in this Project, the SMART technology approach resulted in a breakthrough in performance over conventional millimeter-wave approaches.  The 3-D multi-layer assemblies developed will greatly reduce AESA packaging complexity and enable very compact, low-cost, millimeter-wave, and radio frequency circuit \"building blocks\" to combine to form arbitrarily large arrays.  New capabilities, such as the ability to construct reconfigurable and\/or multi-band AESAs and other MMW circuits, will be enabled by this architectural approach.  The SMART program is transitioning through industrial producers of MMW radar and communication system components for DoD applications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "-  Built a W-band (94 GHz) SMART phased array prototype with transmit\/receive capability.  Successfully demonstrated the prototype in the laboratory as a range test set."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.000"
                                            },
                                            "Text": {
                                                "val": "-  Initiate transition of SMART baseline sub-array module fabrication techniques toward realizing Manufacturing Readiness Level (MRL) 5 through yield analysis and implementation of identified process improvements.\n-  Increase manufacturability and affordability of the SMART modules for mm-wave communication arrays through increased throughput of batch-fabricated modules."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "100 Gb\/s RF Backbone"
                                    },
                                    "Description": {
                                        "val": "The proliferation of video, voice, chat, and other important data-streams on the battlefield is driving a need for higher capacity, reliable, assured, and all-weather communications that are deployable on a wide range of air, ground, and maritime platforms.  The goal of this High-Capacity Links technologies program is to demonstrate a 100 Gigabit-per-second (Gb\/s) radio frequency (RF) backbone that will meet the anticipated mid-term (within 3-10 years) wireless networking requirements of deployed military forces.  DARPA's hybrid Free Space Optical RF Communications Adjunct (ORCA) system has broken the 10 Gb\/s wireless network boundary using free-space optical links, but all-weather Ku band components are currently limited to much less than 1Gb\/s capacity.  Furthermore, the hybrid optical\/RF system exhibits size, weight, and power (SWaP) consumption characteristics that preclude deployment on many SWaP-limited platforms.  Moving to a millimeter-wave (mmW) solution will provide high capacity and all-weather resiliency, but presents technical challenges that include the generation of higher-order waveforms (beyond common data link), efficient power transmission, high-speed routing, and low-noise receivers.  This program seeks to develop the constituent subsystems (waveform generation, efficient power amplifiers, and receivers) and spatial multiplexing architectures to construct an all-weather mmW 100 Gbps backbone at half the SWaP consumption of the current ORCA system.  The 100 Gbps RF Backbone program is intended for transition to multiple Services."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop millimeter-wave waveforms with higher modulation constellation to achieve high spectral efficiencies.\n-  Identify promising approaches to achieving power transmission efficiency improvements at mmW frequencies.\n-  Identify promising low noise-figure receiver technologies for mmW frequencies.\n-  Identify candidate architectures, hardware, and algorithms for spatial multiplexing to achieve high spectral efficiencies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.770"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.770"
                                            },
                                            "Text": {
                                                "val": "-  Build and evaluate modulators capable of generating high-order waveforms and demodulators capable of digitizing the high-order waveforms.\n-  Evaluate high-order modulation approaches at mmW frequencies in field demonstrations to tactically relevant distances.\n-  Build and evaluate the hardware and software capable of spatially multiplexing and de-multiplexing multiple mmW signals.\n-  Evaluate mmW spatial multiplexing approaches to distances at or beyond the Rayleigh Range."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mobile Hotspots"
                                    },
                                    "Description": {
                                        "val": "Communications requirements are growing exponentially due to the proliferation of high-data rate sensors (full motion video), Unmanned Aerial Vehicles (UAVs), and the emergence of the Soldier\/Marine as both an operator and a sensor within military networks.  However, limited spectrum availability results in a large disparity between capacity requirement and availability.  Supporting the development of Advanced Networks technologies, Mobile Hotspots will develop an airborne high capacity data distribution network to interconnect groups of tactical users in a manner that is conceptually similar to the commercial tiered approach of interconnecting cell towers and wireless hotspots.  Mobile Hotspots will exploit advances in millimeter-wave technology and airborne networking to develop a self-organizing, 1 Gbps mobility tactical airborne network formed from highly-directional communications links to interconnect mounted and dismounted warfighters, dispersed tactical operations centers, and intelligence, surveillance, and reconnaissance (ISR) assets.  Low size, weight, and power (SWaP) designs will be integrated with commercial and military communications equipment and mounted on tactical UAVs and ground vehicles to provide network access to mobile users via infrastructureless hotspots that are compatible with existing radios.  The Mobile Hotspots program is targeted to transition to the Army and Marine Corps Expeditionary Forces."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.100"
                                            },
                                            "Text": {
                                                "val": "-  Explored steerable antenna concepts, self-organizing network protocols, and efficient power amplifier implementations in a network topology to include UAVs, dismounted soldiers, and mobile platforms.\n-  Explored variable data rates, signal processing, and ad-hoc networking as a means to achieve range extensions in varying conditions.\n-  Evaluated capabilities of critical technologies in ground-based laboratory and field evaluations.\n-  Conducted system design trades for integration into a UAV pod and onto a tactical ground vehicle."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.678"
                                            },
                                            "Text": {
                                                "val": "-  Manufacture antenna, amplifier, modem, and networking hardware needed to implement a self-organizing network comprising at least five hotspot nodes interconnected by 1 gigabit per second point-to-point millimeter-wave links to form a tactical airborne network.\n-  Integrate the Mobile Hotspots technology into pods for mounting on UAVs and tactical ground vehicles.\n-  Evaluate initial capabilities of the Mobile Hotspot prototype network and millimeter-wave tactical airborne network in an initial ground-based field experiment.\n-  Identify and implement system and subsystem improvements in preparation for final field experimentation and flight tests."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.650"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.650"
                                            },
                                            "Text": {
                                                "val": "-  Conduct ground testing of integrated air and ground vehicle systems to validate system operation and performance.\n-  Conduct flight tests to evaluate system performance in various air-to-air, air-to-ground, and multi-node networking configurations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Content-Based Mobile Edge Networking (CBMEN)"
                                    },
                                    "Description": {
                                        "val": "The CBMEN program's goal is to provide tactical warfighters operating at the edge with interactive, on-demand access to relevant information and a greater ability for real-time sharing of new operational content.  This content can include images, video, maps, situational awareness, and command and control information.  Advances in communications technologies are enabling high-capacity communications in remote environments.  However, the current centralized or regional storage and dissemination of information presents reliability and capacity challenges with distributing relevant information to users at the edge.  Commercial industry has developed approaches to the autonomous dissemination of high demand information by using distributed servers and advanced networking and information database technologies, combined with highly-reliable fixed networking infrastructure that have embedded complex information exploitation tools.  The commercial system is enabled by infrastructure that is not available to the warfighter.  This Advanced Networks technologies program will leverage commercial technologies to develop, prototype, and demonstrate the networking technologies and information dissemination techniques needed to enable efficient and robust content distribution using dynamic, mobile, and ad hoc military networks.  CBMEN will be installed and demonstrated on existing radios.  Capabilities from this effort will transition to the DoD."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.732"
                                            },
                                            "Text": {
                                                "val": "-  Developed extended small unit scenarios for simulation and demonstration.\n-  Extended CBMEN software architecture for security and efficiency.\n-  Integrated hardware and software products to demonstrate CBMEN technologies in small unit scenario.\n-  Demonstrated limited content applications in a dynamic small unit mobile environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.510"
                                            },
                                            "Text": {
                                                "val": "-  Develop objective metrics for advanced scenarios and simulation development for program evaluation and analysis.\n-  Develop representative military small unit scenarios for simulations, over-the-air testing, demonstration, and transition.\n-  Demonstrate CBMEN software for content naming, distribution, management, and security in a dynamic mobile environment.\n-  Begin advanced development of CBMEN enabling technologies with increased scale, dynamics, and content rich applications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Wireless Network after Next (WNaN) and Advanced Wireless Networks for the Soldier (AWNS)"
                                    },
                                    "Description": {
                                        "val": "The Wireless Network after Next (WNaN) and Advanced Wireless Networks for the Soldier (AWNS) program goals are to develop and demonstrate Advanced Networks technologies and system concepts that will enable densely deployed radio networks to compensate for limitations of the physical layer of a low-cost wireless node. WNaN\/AWNS networks will manage node configurations and the topology of the network to reduce the demands on the physical and link layers of the network.  The technology created by the WNaN\/AWNS effort will provide reliable and available battlefield communications at low system cost.  AWNS also investigated the integration of Multi-User Detection (MUD) and Multiple-Input Multiple Output (MIMO) technology into the WNaN radio platform to position these technologies for transition into the WNaN radio node, as well as the Soldier Radio waveform (SRW) Anti-Jam (AJ) mode waveform.  In addition, this effort investigated Wireless Distributive Computing (WDC), Content Based Access (CBA), and smart antenna technologies to enhance the network and node ability to understand the operating environment, mission concept of operations, and node responsibilities to assist in data processing, information dissemination, and accomplishment of military mission objectives.  Further, this program will develop a low-cost handheld\/body wearable wireless node that can be used to form high-density ad hoc networks and gateways to the Global Information Grid.  This program will also develop robust networking architecture(s) and network technologies\/processes that will exploit high-density node configurations.  AWNS technology is planned for transition to the Services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.565"
                                            },
                                            "Text": {
                                                "val": "-  Integrated smart antenna capabilities with radio nodes.\n-  Demonstrated capability to integrate additional applications in an integrated network environment.\n-  Integrated MIMO, WDC, advanced Dynamic Spectrum Awareness, and related technologies into the network capabilities to improve network performance, and increase network scalability without increasing spectrum need.\n-  Commenced network integration evaluations, planning and execution of multiple field experiments with Marine Corps, Army, and Air Force to establish feasibility and utility for transition.\n-  Performed design changes to hardware and software for enhanced stability."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.500"
                                            },
                                            "Text": {
                                                "val": "-  Complete demonstration of network scaling to support company-level utility and scalability to large numbers of nodes.\n-  Complete network integration evaluations and field experiments with Marine Corps, Army, and Air Force to establish feasibility and utility for transition."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Wireless Network Defense"
                                    },
                                    "Description": {
                                        "val": "* Formerly Highly Networked Force\n\nA highly networked and enabled force increases efficiency, effectiveness, and safety by making relevant information available when it is needed and at the appropriate location (person\/platform\/system).  Accomplishing this depends on providing reliable wireless communications to all U.S. forces, platforms, and devices in all phases of conflict.  Based on initial work under this effort, the Spectrum Efficiency and Access program in this PE\/Project was created to enable reliable operation of military and commercial communications and radar systems when occupying the same spectrum bands.  As part of the Advanced Networks technologies effort, the Wireless Network Defense program increases wireless network capacity and reliability for tactical users, with the ultimate vision of making high quality data services pervasive throughout the DoD.  The primary focus is mitigation of advanced threats particular to the security of wireless networks.  The program intends to leverage the capabilities of the dynamic network to identify sources of misinformation, whether malicious or due to poor configuration, across the functional components of the complex system, and mitigate the corresponding effects.  Technologies developed under this program will transition to the Services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.000"
                                            },
                                            "Text": {
                                                "val": "-  Investigated techniques to determine the integrity of communications nodes and sub networks from both physical, network, and application-based information.\n-  Investigated new routing, naming, and networking mechanisms optimized for addressing network outages and security needs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop techniques to characterize reliability of information in networks with misbehaving devices and evaluate performance through simulation.\n-  Develop approaches to adapt the control functions of wireless networks to accept reliability values and create innately resilient control systems.\n-  Determine system-level performance goals for subsequent phase of the program.\n-  Begin integration of most promising technology components for reliability estimation and robust network control into laboratory prototypes of robust wireless networks."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.880"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.880"
                                            },
                                            "Text": {
                                                "val": "-  Complete integration of candidate algorithms and protocols for protecting networks from, and detecting and reacting to, misinformation attacks in laboratory-based prototype systems.\n-  Test resilience of prototype capabilities in a laboratory environment.\n-  Refine protection mechanisms based on test findings and begin development of systems for field demonstrations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Spectrum Efficiency and Access"
                                    },
                                    "Description": {
                                        "val": "Current Presidential Initiatives, FCC Broadband Task Force, and Congressional legislation are working to transition large swaths of spectrum (up to 500 MHz) from Federal (DoD is the primary contributor) to civilian use for broadband telecommunications.  The DoD will need more highly-integrated and networked data\/sensor capacity over the next decades and will therefore need new technology that requires less spectrum to operate.  The objective of the Spectrum Efficiency and Access program is to investigate improvements in spectral reuse, such as spectrum sharing of sensor\/radar bands.  The program will leverage technical trends in cooperative sharing to exploit radar anti-jam and interference mitigation technologies that could enable spectrum sharing by allowing overlay of communications within the same spectral footprint.  The approach will include exploring real-time control data links between radars and communications systems, and developing the advanced waveforms and components to enable radars and communication networks to operate in close proximity.  The ultimate goal is to turn the DoD spectrum loss into a net gain of up to hundreds of MHz in capacity.  Technology from this program will be made available to the DoD."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.400"
                                            },
                                            "Text": {
                                                "val": "-  Develop concepts and management policies for enabling radars and communications networks to share spectrum spatially and temporally.\n-  Develop models and simulation capability for research on spectrum sharing between radar and communications systems.\n-  Assess the limits on achievable spectral reuse between radar and communications in order to evaluate sharing concepts and implementations.\n-  Assess threats to military systems created by sharing spectrum information with non-military users."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.971"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.971"
                                            },
                                            "Text": {
                                                "val": "-  Model and assess multiple mechanisms for spatial and temporal spectrum sharing between radars and communications networks.\n-  Develop and assess a baseline set of strategies to defend military systems against threats created by sharing spectrum information between military radars and commercial communications systems.\n-  Develop concepts for a control system to manage mechanisms for spectrum sharing between radars and communication systems.\n-  Demonstrate technologies for signal separation between radar and communications systems operating at the same time, place, and frequency.\n-  Develop concepts and approaches for a joint system design between military radar and military communications systems operating in a shared spectrum allocation that improves overall performance in electronic countermeasure operating environments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced RF Mapping"
                                    },
                                    "Description": {
                                        "val": "One of the key advantages on the battlefield is the ability to actively sense and manipulate the radio frequency (RF) environment, enabling reliable and assured communications, as well as effectively mapping and manipulating the adversary's communications in ways that defy their situational awareness, understanding, or response.  Current approaches are emitter-based, with the signal processing techniques focused on array and time-based processing for each emitter.  As the RF environment becomes more complex and cluttered, the number of collection assets and the required level of signal processing inhibits our capability to pervasively sense and manipulate at the precision (time, frequency, and space) required for effective action.  To address these Radio Frequency and Spectral Sensing (RF\/SS) challenges, the Advanced RF Mapping program will develop and demonstrate new concepts for sensing and manipulating the RF environment based on distributed rather than centralized collection.  This approach will take advantage of the proliferation of RF devices, such as radios and cell phones, on the battlefield.  To leverage these existing devices effectively, the program will develop new algorithms that can map the RF environment with minimal communication load between devices.  It will also develop approaches to exploit our precise knowledge of the RF environment and the distributed proximity of RF devices to provide reliable and assured communications for our warfighter as well as to infiltrate or negate our adversaries' communications networks.  Building upon technologies investigated within other programs within this project, the Advanced RF Mapping program will enable both offensive and defensive operations in complex RF environments.  Advanced RF Mapping technology is planned to transition to the Services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.300"
                                            },
                                            "Text": {
                                                "val": "-  Established baseline capabilities for RF collection from distributed devices in complex RF environments.\n-  Initiated the development of algorithms to exploit distributed RF collections and to produce a full environmental map of frequency and space as a function of time.\n-  Assessed approaches to exploit RF environment knowledge and distributed RF devices to provide new capabilities to assess adversary networks and defend against hostile use of the RF spectrum."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.500"
                                            },
                                            "Text": {
                                                "val": "-  Develop and deploy prototype networks employing multiple types of RF devices of different types for experimentation with the RF mapping technology.\n-  Demonstrate RF mapping capability to characterize RF signals in tactically relevant VHF and UHF frequency bands, using a limited number of distributed devices while minimizing communications requirements between devices.\n-  Determine the performance improvement for signal detection and identification of RF mapping systems over tactically relevant collection times.\n-  Improve RF collection capabilities to cover low-rate tactical networks and limited device availability in tactical environments.\n-  Establish baseline capability for defending against hostile use of the RF spectrum."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.762"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.762"
                                            },
                                            "Text": {
                                                "val": "-  Carry out field experiments that demonstrate use of currently deployed tactical radios as sensors within a heterogeneous RF mapping network.\n-  Develop a software layer that simplifies addition of new capabilities to the heterogeneous RF mapping network after it has been fielded.\n-  Demonstrate improved battlefield spectrum planning and spectrum management operations through feedback of spectrum utilization information from RF sensors.\n-  Develop a command and control system for optimizing use of devices as RF sensors in a changing operational environment.\n-  Develop and demonstrate geo-location capability of RF emitters using the heterogeneous RF mapping network."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Computational Leverage Against Surveillance Systems (CLASS)"
                                    },
                                    "Description": {
                                        "val": "Commercial Test and Measurement equipment has advanced greatly with the emergence of sophisticated cellular and wireless local area network technology and can be used to intercept, analyze, and exploit our military communications signals.  The Computational Leverage Against Surveillance Systems (CLASS) program, working to expand Low Probability of Detection\/Anti-Jam (LPD)\/(AJ) technologies, seeks new ways to protect our signals from exploitation by increasingly sophisticated adversaries, in ways that can be maintained as commercial technology advances.  Three different techniques are in development: 1) Waveform Complexity uses advanced communications waveforms that are difficult to recover without knowledge and understanding of the signals itself; 2) Spatial Diversity uses distributed communications devices and the communication environment to disguise and dynamically vary the apparent location of the signal; and 3) Interference Exploitation makes use of the clutter in the signal environment to make it difficult for an adversary to isolate a particular signal.  The program's objective is to make modular communications technology that is inexpensive to incorporate in existing and emerging radio systems (<$100 incremental cost) but pushes adversaries to need more than 1,000x our processing power - supercomputer-level processing power.  Another track of the program will extend the CLASS technology to provide LPD communications.  These techniques will drastically reduce the detectability of communications signals beyond current capabilities.  Scalable performance will allow LPD techniques to better trade information rate for communications capacity.  Technologies from this program are planned to transition to the Services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.750"
                                            },
                                            "Text": {
                                                "val": "-  Integrated hardware and firmware technology into volume integrated circuits.\n-  Developed test and application driver software for CLASS technology.\n-  Initiated development of modular CLASS products.\n-  Developed LDP signaling techniques."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "28.325"
                                            },
                                            "Text": {
                                                "val": "-  Develop operational concepts for distributed airborne operations.\n-  Conduct RF transceiver studies for airborne operations.\n-  Finalize design of CLASS RF and modem integrated circuits; release to foundry for fabrication.\n-  Integrate application driver software for CLASS technology in preparation for Application Specific Integrated Circuits (ASIC) testing.\n-  Produce modular CLASS products and develop board for ASIC testing and a radio product module.\n-  Leverage advancements towards an alternative development environment for communications systems that takes advantage of commercial smartphone development environment methodology.\n-  Develop an alternative generalized reference architecture that supports communications system integration specifically, and that supports future revisions for other electronic systems anticipated in airborne force projection systems.\n-  Investigate and cost candidate satellite constellation configurations to quantify the trade-off between space segment cost and system coverage and capacity.\n-  Investigate techniques to collaborate among distributed transmitters and receivers for the geometries of beyond line-of-sight solutions (such as airborne and\/or space layers), and quantify expected performance relative to predicted system threats."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "22.600"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "22.600"
                                            },
                                            "Text": {
                                                "val": "-  Develop concepts for integrating CLASS technologies with aircraft antennas and communications equipment.\n-  Measure CLASS modem performance processing power, power consumption, and radio waveform interoperability.\n-  Integrate CLASS modular technology with host processor.\n-  Demonstrate CLASS communication capability with and without interference against Army threat intercept surrogates.\n-  Develop Emulation environment for the reference architecture; test and publish emulation models.\n-  Publish Beta version of the development environment to a third party service user for evaluation testing.\n-  Measure CLASS modem transmit power reduction as number of cooperative transmitters is increased from 1 to 8."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Communication in Contested Environments"
                                    },
                                    "Description": {
                                        "val": "Building upon the technologies explored and developed under the Computational Leverage Against Surveillance Systems (CLASS) program budgeted in this PE\/Project, the Communication in Contested Environments program will seek to address communications problems anticipated in networked airborne systems in the mid-21st century.\n\nExpected growth in sensor systems, unmanned systems, and internetworked weapons systems will strain the size of networks that our current communications technology can support in the contested environment. As adversary capabilities advance, the DoD will need new techniques to quickly and efficiently accommodate better networking and improved communications capabilities, specifically communications systems with higher capacity, lower latency, greater jamming resistance, and reduced detectability. As part of Advanced Networks technologies efforts, the Communication in Contested Environments (C2E) program addresses these needs with a three-pronged approach: first, to develop heterogeneous networking capabilities and advanced communication technology for airborne systems. Anti-jam, Low Probability of Detection (LPD), low latency, and high capacity communication protocols will be developed. Second, to create a government controlled and maintained reference architecture for communications systems that draws from commercial communication architectures. The defense contractor community can build specific communications systems based upon this reference architecture. Finally, to create a government controlled development environment to allow rapid refresh of communications technology and allow third party native application and waveform developers to contribute their own communications technologies."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "-  Create initial version of a development environment for military communications applications and waveforms similar to the development environments used in the commercial smartphone market.\n- Develop an initial reference architecture to support interoperable communications and heterogeneous networking."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.000"
                                            },
                                            "Text": {
                                                "val": "-  Build a communications reference hardware system to support L-band and microwave communications.\n-  Compile waveforms for the reference hardware.\n-  Build infrastructure networking automation layer for link establishment, maintenance, and service prioritization.\n-  Test infrastructure networking code to the reference system and evaluate pervasive networking performance."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Assured Beyond Line-of-Sight Communications"
                                    },
                                    "Description": {
                                        "val": "In areas where near-peer adversaries have denied effective U.S. operations, our current systems are unable to provide sufficient communications capabilities.  In support of Low Probability of Detection Anti-Jam (LPD\/AJ) technologies, the Assured Beyond Line-of-Sight Communications program seeks to provide the capability by which platforms can operate undetectably in denied areas while maintaining sufficient communications with assets outside the anti-access region.  Necessary system attributes include low probability of detection or exploitation, jam-resistance, and costs that reverse the imbalance of kinetic threats.  In addition, sufficient capacity to enable command and control of advanced weapons systems and communication of advanced intelligence, surveillance, and reconnaissance (ISR) artifacts are necessary.  The program will leverage advances from programs such as Computational Leverage Against Surveillance Systems (CLASS) in distributed, collaborative communications to reduce transmitter powers and increase system data rates and interference resistance for the required communication ranges.  Technology developed under this program will be transitioned to the Air Force, Navy, Marine Corps, and Army."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop candidate system designs, including system architecture, payload design, and ground segment component requirements.\n-  Develop communication signaling designs and associated performance analysis for widely separated collaborative transmitters and receivers for the candidate architectures.\n-  Begin development of hardware prototypes and integrate signal processing in preparation for testing communication system capabilities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Millimeter-wave Frequencies Transceiver"
                                    },
                                    "Description": {
                                        "val": "Military radars, communications systems, and signal intelligence equipment are expanding into the millimeter-wave portion of the spectrum to ease congestion, leverage available bandwidth, and for the low probability of detection, low probability of intercept, and anti-jam capabilities. Millimeter-wave signals are often challenging to detect, analyze, and exploit with low latency using state-of-the-art digital receivers and signal processors. Effective protection against these systems requires receiver and signal processing technologies that provide high sensitivity, high dynamic range, and low latency and interference resilience.  However, existing millimeter-wave receiver and signal processing capabilities lack the needed performance characteristics to address advanced threats. This program builds upon other millimeter-wave communications technologies developed under this PE\/Project and seeks to develop a transceiver that is capable of operating at millimeter-wave frequencies with high sensitivity and high dynamic range and processing signals with wide bandwidths.  The program will leverage the inherent broadband, high dynamic range, and low latency characteristics of photonic processing components to develop system prototypes for addressing adversary millimeter-wave communications and radar systems.  Technologies developed under this program will transition to the Navy and Air Force."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.000"
                                            },
                                            "Text": {
                                                "val": "-  Identify promising approaches to efficiently couple incoming microwave signals to the electro-optic modulators.\n-  Identify candidate photonic link architectures that achieve low noise figure, high dynamic range, and high receiver sensitivity.\n-  Identify candidate photonic circuit architectures that characterize the amplitude, frequency, phase, or time of a millimeter-wave signal.\n-  Identify candidate interference signals, including low power, high power, continuous, pulsed, narrowband, and broadband signals that will be used to evaluate the sensitivity and resilience of the photonically enabled systems.\n-  Develop field test plans that will be used to characterize the photonically enabled systems in the presence of interfering signals."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Communications Under Extreme RF Spectrum Conditions (CommEx)"
                                    },
                                    "Description": {
                                        "val": "The Communications Under Extreme RF Spectrum Conditions (CommEx) program will develop signal detection and reasoning technology that will allow radios to recognize interference and jamming attacks and then adapt to maintain communications, even in the presence of cognitive jammer attacks and dynamic interference of multiple cognitive network interactions.  As part of Low Probability of Detection\/Anti-Jam (LPD\/AJ) technologies efforts in the Project, the program will develop models of adversary, commercial, and friendly cognitive radios and implement those models to assess, in real time, the current and future dynamics of the communications network.  Core technologies for operation in highly dynamic and\/or high jamming to signal environments will be developed to include: automated jamming waveform forensics; local environment assessment (time, space, frequency, polarization); technologies for addressing known attack strategies and interference properties; and antenna, signal processing, modulation, and network optimization technologies.  Based on predictions of the level of communication success compared to mission communication requirements, the cognitive radio will choose waveform selections\/configurations that best achieve mission objectives.  The cognitive radio will include the capability to analyze and select optimum frequency, waveform, and network configurations during all aspects of a mission.  The design effort will lead to new radio communication architectures, more robust radio communication networking, and better understanding of selection amongst interference avoidance and interference suppression strategies.  This program also seeks to enable communication between dispersed and distributed emitters and receivers to provide a multiplier in capacity for both locating emitters and assessing effectiveness of an electronic attack.  Technologies developed in this program will transition to the Army, Navy, Air Force, and Marines."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.265"
                                            },
                                            "Text": {
                                                "val": "-  Performed third cycle of government performance evaluation for computer model simulations of spectrum analysis, reasoning about interference mitigation choices, interference mitigation, and reasoning update logic.\n-  Executed designs of system technologies to address the specific application(s) and platform(s) required for military operations.\n-  Performed laboratory experiments utilizing unknown attack strategies to validate developed mitigation techniques.\n-  Completed system design that addresses technology insertion within size, weight, and power constraints.\n-  Utilized properties and limitations of existing jammer technologies to assess performance.\n-  Demonstrated the ability to learn and rapidly recognize behavior patterns of various types of attacks against advanced radios.\n-  Performed laboratory experiments with brassboard and realistic communication systems to validate performance.\n-  Initiated prototyping of CommEx technologies in Link 16 and Wireless Network after Next (WNaN) system hardware for utilization in airborne and vehicular use.\n-  Demonstrated and measured a high level of co-site suppression on real time hardware on Frequency Shift Keying (FSK) waveforms using the same frequency and bandwidth."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.500"
                                            },
                                            "Text": {
                                                "val": "-  Validate the size, weight, power, cost (SWaP-C), and network overhead of systems that implement the principles developed in this program.\n-  Develop detailed technology and algorithms into specific hardware and platforms to assure that implementation specifics can be integrated into communication systems.\n-  Develop architecture to allow CommEx technology to be inserted into assessment platforms for military utility.\n-  Conduct study to evaluate the application of CommEx principles on existing military systems.\n-  Conduct field evaluations and demonstrations on airborne and ground platforms to determine military utility."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "CCC-04"
                    },
                    "ProjectTitle": {
                        "val": "SECURE INFORMATION AND NETWORK SYSTEMS"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "16.833"
                        },
                        "CurrentYear": {
                            "val": "10.120"
                        },
                        "BudgetYearOne": {
                            "val": "2.707"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.707"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Computer and networking technologies have rapidly matured in the last decade with profound effect on the DoD and the nation.  The Secure Information and Network Systems project will develop and demonstrate computer and network technologies and systems suitable for use in military networks, U.S. government enterprise networks, critical infrastructure, and embedded computing systems.  The project will develop, integrate, and test technologies for re-using software components, countering advanced persistent threats, and detecting compromise on enterprise networks.  Technologies will be developed using results generated in projects such as, but not limited to, DARPA's Information & Communications Program Element (PE 0602303E) for potential transition to the Services and Combatant Commands."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Rapid Software Development using Binary Components (RAPID)"
                                    },
                                    "Description": {
                                        "val": "The Rapid Software Development using Binary Components (RAPID) program will develop a system to identify and extract software components for reuse in new applications.  The DoD has critical applications that must be ported to future operating systems.  In many cases, the application source code is no longer available requiring these applications to continue to run on insecure and out-dated operating systems, impacting operations.  A companion applied research effort is budgeted in PE 0602303E, Project IT-03.  RAPID capabilities will transition to the Services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.133"
                                            },
                                            "Text": {
                                                "val": "-  Developed an end-to-end proof-of-concept system showing identification, extraction, and combination of components into new executables.\n-  Demonstrated scalable performance by extracting, assembling, and generating executables from a large number of components."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.120"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate the system to military users and conduct transition planning.\n-  Participate in technology evaluation exercises with military stakeholders.\n-  Support transition partners in developing a software reuse concept of operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.707"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.707"
                                            },
                                            "Text": {
                                                "val": "-  Deploy prototype systems at transition partner sites and support initial operations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cyber Insider Threat (CINDER)"
                                    },
                                    "Description": {
                                        "val": "The Cyber Insider Threat (CINDER) program developed technologies for identifying advanced cyber threat missions that may be currently ongoing within DoD and government interest systems and networks.  Current cyber defenses are primarily based on network and host intrusion detection and look for break-ins and abnormal behavior without context.  The CINDER program built tools and techniques that applied mission templates of advanced cyber espionage onto seemingly normal internal system and network activity.  The program focused on identifying ongoing adversary missions rather than a person, program, or particular piece of malware.  Through this CINDER uncovered ongoing advanced persistent cyber threats and espionage within our cyber environments.  Capabilities from this program transitioned to DoD and the defense industrial base."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.700"
                                            },
                                            "Text": {
                                                "val": "-  Transitioned advanced network scanning software for detecting insider data compromises to numerous government and commercial entities as open source software with over 3 million downloads to date.\n-  Developed a system to analyze crash artifacts to provide insight into novel attacks, gauge the capabilities of adversaries, and understand attacker goals and intentions.\n-  Developed a system for detecting and countering the threat to source code repositories posed by malicious insider access, tampering, and exfiltration.\n-  Developed a system for detecting malicious cyber insiders using a lightweight embedding technique on existing web applications, including a lightweight collection module, a detection point toolkit, an analysis server, and a management graphical user interface."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "CCC-06"
                    },
                    "ProjectTitle": {
                        "val": "COMMAND, CONTRO AND COMMUNICATION SYSTEMS"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "56.733"
                        },
                        "CurrentYear": {
                            "val": "76.045"
                        },
                        "BudgetYearOne": {
                            "val": "104.925"
                        },
                        "BudgetYearOneBase": {
                            "val": "104.925"
                        },
                        "BudgetYearTwo": {
                            "val": "86.070"
                        },
                        "BudgetYearThree": {
                            "val": "12.000"
                        },
                        "BudgetYearFour": {
                            "val": "12.000"
                        },
                        "BudgetYearFive": {
                            "val": "8.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project funds classified DARPA programs that are reported in accordance with Title 10, United States Code, Section 119(a)(1) in the Special Access Program Annual Report to Congress."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Classified DARPA Program"
                                    },
                                    "Description": {
                                        "val": "This project funds Classified DARPA Programs.  Details of this submission are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "56.733"
                                            },
                                            "Text": {
                                                "val": "Details will be provided under separate cover."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "76.045"
                                            },
                                            "Text": {
                                                "val": "Details will be provided under separate cover."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "104.925"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "104.925"
                                            },
                                            "Text": {
                                                "val": "Details will be provided under separate cover."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Details will be provided under separate cover."
                        }
                    }
                }
            ]
        }
    }
}