{
    "id": "bd03eaef5545a6966b618ce4259ec64307fbeea1",
    "meta": {
        "filename": "dod-2015_RDTE_2015_ARMY_BA1_RDTE_JustificationBook_Army_PB_2015.zzz_unzipped_RDTE_JustificationBook_Army_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0601103A"
        },
        "ProgramElementTitle": {
            "val": "University Research Initiatives"
        },
        "R1LineNumber": {
            "val": "3"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Basic Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "72.243"
            },
            "CurrentYear": {
                "val": "79.317"
            },
            "BudgetYearOne": {
                "val": "69.808"
            },
            "BudgetYearOneBase": {
                "val": "69.808"
            },
            "BudgetYearTwo": {
                "val": "73.136"
            },
            "BudgetYearThree": {
                "val": "73.288"
            },
            "BudgetYearFour": {
                "val": "74.511"
            },
            "BudgetYearFive": {
                "val": "76.550"
            }
        },
        "ProgramElementNote": {
            "val": "Funding reduced to support higher Army priorities."
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) supports Army basic research efforts in the Multidisciplinary University Research Initiative (MURI) program, the Defense University Research Instrumentation Program (DURIP) and the Presidential Early Career Awards for Scientists and Engineers (PECASE) program by funding basic research in a wide range of scientific and engineering disciplines pertinent to maintaining the U.S. land combat technology superiority.  Army MURI program efforts involve teams of researchers investigating high-priority, transformational topics that intersect more than one traditional technical discipline (e.g., Intelligent Luminescence for Communication, Display, and Identification).  For many complex problems, this multidisciplinary approach serves to accelerate research progress and expedite transition of results to application.  The DURIP provides funds to acquire major research equipment to augment current, or devise new, research capabilities in support of Army transformational research. The PECASE program funds single-investigator research efforts performed by outstanding academic scientists and engineers early in their independent research careers.\nProject V72 supports Minerva Research Initiative (MRI), a university based social science research project initiated by the Secretary of Defense in FY09.\n\nWork in the PE provides a foundation for applied research initiatives at the Army laboratories and research, development and engineering centers. \n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering science and technology focus areas and the Army Modernization Strategy.\n\nWork on this project is performed by the Army Research Laboratory (ARL), Research Triangle Park, NC."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "80.986"
                },
                "CurrentYear": {
                    "val": "79.359"
                },
                "BudgetYearOne": {
                    "val": "79.679"
                },
                "BudgetYearOneBase": {
                    "val": "79.679"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "72.243"
                },
                "CurrentYear": {
                    "val": "79.317"
                },
                "BudgetYearOne": {
                    "val": "69.808"
                },
                "BudgetYearOneBase": {
                    "val": "69.808"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-8.743"
                },
                "CurrentYear": {
                    "val": "-0.042"
                },
                "BudgetYearOne": {
                    "val": "-9.871"
                },
                "BudgetYearOneBase": {
                    "val": "-9.871"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.107"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.256"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-9.871"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-9.871"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments 1"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-6.380"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments 2"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "-0.042"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "D55"
                    },
                    "ProjectTitle": {
                        "val": "University Research Initiative"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "69.268"
                        },
                        "CurrentYear": {
                            "val": "75.981"
                        },
                        "BudgetYearOne": {
                            "val": "67.289"
                        },
                        "BudgetYearOneBase": {
                            "val": "67.289"
                        },
                        "BudgetYearTwo": {
                            "val": "70.083"
                        },
                        "BudgetYearThree": {
                            "val": "70.189"
                        },
                        "BudgetYearFour": {
                            "val": "71.358"
                        },
                        "BudgetYearFive": {
                            "val": "73.340"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project supports the Multidisciplinary University Research Initiative (MURI), the Defense University Research Instrumentation Program (DURIP) and the Presidential Early Career Awards for Scientists and Engineers (PECASE) program.  The MURI program funds university based basic research in a wide range of scientific and engineering disciplines pertinent to maintaining US land combat technology superiority.  Army MURI efforts involve teams of researchers investigating high-priority, transformational topics that intersect more than one traditional technical discipline (e.g. Intelligent Luminescence for Communication, Display, and Identification).  For many complex problems, this multidisciplinary approach serves to accelerate research progress and expedite transition of results to application.  The DURIP provides funds to acquire major research equipment to augment current, or devise new, research capabilities in support of Army transformational research.  The PECASE program funds single-investigator research efforts performed by outstanding academic scientists and engineers early in their independent research careers.\n\nWork in this project provides a foundation for applied research initiatives at the Army laboratories and research, development and engineering centers.   \n \nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.   \n \nWork on this project is performed by the U.S. Army Research Laboratory (ARL) located in Research Triangle Park, NC."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Multidisciplinary University Research Initiative (MURI)"
                                    },
                                    "Description": {
                                        "val": "MURI programs are typically 5 years in length at a cost of $1.25M\/yr."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "57.529"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Supported MURI awards made in prior years and initiated ten FY13 start MURI awards critical to supporting future force capabilities.  Effective transition mechanisms included collaboration among principal investigators, participation by 6.2\/6.3 program managers in MURI program reviews, and communication of the MURI research results to the U.S. ARL, the U.S. Army Research, Development, and the Engineering Centers (RDECs), the U.S. Army Engineer Research and Development Center (ERDC), the U.S. Army Medical Research and Materiel Command (MRMC), U.S. Army Research Institute (ARI), and industry."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "57.525"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Support MURI awards made in prior years and initiate 8 FY14 start MURI awards critical to supporting the future force.  Effective transition mechanisms include collaboration among principal investigators, participation by 6.2\/6.3 program managers in MURI program reviews, and communication of the MURI research results to the U.S. ARL, the U.S. Army RDECs, the U.S. Army ERDC, the U.S. Army MRMC, the U.S. ARI and industry."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "50.600"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "50.600"
                                            },
                                            "Text": {
                                                "val": "Will provide support for MURI awards made in prior years and will start six to eight new FY15 MURI awards critical to supporting the future force.  Effective transition mechanisms include collaboration among principal investigators, participation by 6.2\/6.3 program managers in MURI program reviews, and communication of the MURI research results to the U.S. ARL, the U.S. Army RDECs, the U.S. Army ERDC, the U.S. Army MRMC, the U.S. ARI and industry."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Presidential Early Career Awards for Scientists and Engineers (PECASE)"
                                    },
                                    "Description": {
                                        "val": "Supports PECASE investigators started in prior years."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.415"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued support for prior year awardees and selected four new awards."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.600"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Select four new awardees and support prior year's awardees."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.500"
                                            },
                                            "Text": {
                                                "val": "Will continue support for prior year awardees and select four new awards."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Defense University Research Instrumentation Program (DURIP)"
                                    },
                                    "Description": {
                                        "val": "Supports basic research through competitive grants for research instrumentation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.324"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Awarded 54 competitive grants for research instrumentation to enhance universities' capabilities to conduct world class research critical to Army transformation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.856"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Award competitive grants for research instrumentation to enhance universities' capabilities to conduct world class research critical to Army transformation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.189"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.189"
                                            },
                                            "Text": {
                                                "val": "Will award competitive grants for research instrumentation to enhance universities' capabilities to conduct world class research critical to Army transformation."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "V72"
                    },
                    "ProjectTitle": {
                        "val": "Minerva"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.975"
                        },
                        "CurrentYear": {
                            "val": "3.336"
                        },
                        "BudgetYearOne": {
                            "val": "2.519"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.519"
                        },
                        "BudgetYearTwo": {
                            "val": "3.053"
                        },
                        "BudgetYearThree": {
                            "val": "3.099"
                        },
                        "BudgetYearFour": {
                            "val": "3.153"
                        },
                        "BudgetYearFive": {
                            "val": "3.210"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project supports the Minerva Research Initiative (MRI), a university-based social science research program initiated by the Secretary of Defense in FY09.  It focuses on areas in the social sciences that are of strategic importance to U.S. national security policy which have not been substantially pursued in the past.  The Minerva research effort will be performed to understand the internal military-political dynamics of repressive regimes, the vulnerabilities of regimes and institutions to various kinds of disruption and instability, the nature of crowd dynamics, group violence, community belief structures, the potential to influence public opinion and attitudes in diverse cultures, cultural effects on network security and military operations, the influence of technology on military capabilities of potential adversaries and allies, and other intersections of social-cultural issues with military activities and national security.  Predictive models and other analysis tools will be developed.  Leveraging the expertise in the social sciences within the academic community is needed to provide understanding of the roots of terrorist organizations and the challenges and opportunities for military operations in a culturally diverse environment.  Better understanding at a fundamental level and new computational tools will provide a beneficial impact on war fighting capabilities at the national policy, military strategy, operational, and tactical levels, and will enhance the capabilities of intelligence activities at all levels.  All research results are open source.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "The Minerva Research Initiative (MRI)"
                                    },
                                    "Description": {
                                        "val": "The MRI is a university-based social science research program initiated by the Secretary of Defense.  It focuses on areas in the social sciences of strategic importance to U.S. national security policy.  It seeks to increase the Department's intellectual capital in the social sciences and improve its ability to address future challenges and build bridges between the Department and the social science community.  Minerva will bring together universities, research institutions, and individual scholars and support multidisciplinary and cross-institutional projects addressing specific topic areas determined by the Department."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.975"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued efforts on existing projects focused on social science and cultural issues affecting the U.S. military warfighting capabilities; continued providing support to OSD in managing the program in social science studies related to strategy and policy via research chairs and fellowships at Service schools and universities; validated predictive models developed in previous research with extensive field research and extended by new theoretical development; extended and strengthened collaborations with combatant commands, DoD policy staff, and governmental activities; and increased the number of workshops and training courses for high level policy staff."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.336"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete the university consortium projects started in FY09; support new and ongoing Minerva social science research of strategic importance to the Army and U.S. national security policy; focus research efforts on understanding group belief formation, factors causing or influencing social change and violence, societal resilience, theories of deterrence, and new approaches to conflict and cooperation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.519"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.519"
                                            },
                                            "Text": {
                                                "val": "Will test theories on the direct and indirect effects of characteristics of natural resources on violence and state stability, which may ultimately provide predictive models of the relationship between natural resources and conflict, and provide options for anticipating and mitigating the acceleration of violence around the globe; and perform social scientific surveys with neuroscientific brain imaging to reveal the role of moral values in social mobilization which in the long term may provide effective strategies and policies in reducing organized violence and preventing its contagion."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}