{
    "id": "be02d96868255a9c90f63355beec41523c114446",
    "meta": {
        "filename": "dod-2015_RDTE_2015_OSD_RDTE_JustificationBook_Office_of_Secretary_Of_Defense_PB_2015.zzz_unzipped_RDTE_JustificationBook_Office_of_Secretary_Of_Defense_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0601110D8Z"
        },
        "ProgramElementTitle": {
            "val": "Basic Research Initiatives"
        },
        "R1LineNumber": {
            "val": "3"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Basic Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "17.368"
            },
            "CurrentYear": {
                "val": "11.169"
            },
            "BudgetYearOne": {
                "val": "44.564"
            },
            "BudgetYearOneBase": {
                "val": "44.564"
            },
            "BudgetYearTwo": {
                "val": "46.709"
            },
            "BudgetYearThree": {
                "val": "46.799"
            },
            "BudgetYearFour": {
                "val": "48.047"
            },
            "BudgetYearFive": {
                "val": "50.533"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "The National Security Science and Engineering Faculty Fellowship (NSSEFF) program is realigned from the National Defense Education Program (NDEP), program element (PE) 0601120D8Z, to this PE beginning in FY 2015.\n\nThis program element (PE) incorporates Minerva Research Initiative activities, which include university-led basic research in social science and sponsored research faculty chair positions at defense education institutions, and activities to implement the basic research office strategic plan for the Department of Defense (DoD)."
        },
        "ProgramElementMissionDescription": {
            "val": "Basic research provides the DoD with a deep and broad awareness of current directions in science and engineering through the scientific performers in areas of research that are important to U.S. military capabilities including, among others, physics and the physical sciences, materials science, chemistry and chemical engineering, electrical engineering, applied mathematics, computer science, mechanical and aerodynamic engineering, ocean sciences, biological sciences, and the social sciences.  Basic research sustains scientific and engineering communities in areas that form the critical technical underpinnings of DoD capabilities.  Basic research through exploration and discovery provides the unique means for disruptive non-incremental advances that can improve or radically change military capabilities, strategy, and operations. \n\nThe Minerva Research Initiative is a university-based social science basic research program directed from within the Office of the Secretary of Defense (OSD) and executed by the Services, consistent with the January 2012 priorities document \"Sustaining U.S. Global Leadership: Priorities for 21st Century Defense\" and the Quadrennial Defense Review (QDR) requirements.  This program seeks to build a deeper understanding of the social, cultural, and political forces that shape regions of the world of strategic importance to the United States.  Deeper understanding of the cultural and political environments where threats, such as radical actors and regime disruptions, develop supports more effective strategic and operational policy decisions.\n\nThe Strategic Support for Basic Research (SSBR) program funds initiatives to implement the Assistant Secretary of Defense for Research and Engineering (ASD(R&E)) strategic plan for defense basic research.  This plan defines specific and quantifiable actions to help create conditions for defense basic research investments capable of creating high-payoff, transformative scientific breakthroughs for DoD.  The SSBR initiatives support the five aims of: (1) providing scientific leadership; (2) attracting the Nation’s best Scientists and Engineers (S&Es); (3) ensuring the coherence and balance of the Basic Research portfolio; (4) fostering connections between DoD performers and DoD; and (5) improving the efficiency of the defense research business environment.\n\nThe National Security Science and Engineering Faculty Fellowship (NSSEFF) program supports world-class researchers in scientific areas of critical importance to DoD and ensures the cultivation of exceptional talent.  NSSEFF provides a critical resource for connections between academia and the DoD science and engineering enterprise.  Fellows’ work spans all seven DoD S&T priorities and defines a broad set of emerging scientific areas.  Fellows serve as speakers at DoD events, reviewers on panels for DoD science, and as collaborators with DoD laboratory scientists and engineers."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "19.405"
                },
                "CurrentYear": {
                    "val": "11.171"
                },
                "BudgetYearOne": {
                    "val": "13.091"
                },
                "BudgetYearOneBase": {
                    "val": "13.091"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "17.368"
                },
                "CurrentYear": {
                    "val": "11.169"
                },
                "BudgetYearOne": {
                    "val": "44.564"
                },
                "BudgetYearOneBase": {
                    "val": "44.564"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.037"
                },
                "CurrentYear": {
                    "val": "-0.002"
                },
                "BudgetYearOne": {
                    "val": "31.473"
                },
                "BudgetYearOneBase": {
                    "val": "31.473"
                }
            },
            "AdjustmentDetails": {
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "-1.524"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "-0.025"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.479"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Realignment of the NSSEFF Program"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "33.193"
                                },
                                "BudgetYearOneBase": {
                                    "val": "33.193"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Strategic Efficiency Savings"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-1.720"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.720"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC Adjustments"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "-0.002"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.009"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The National Security Science and Engineering Faculty Fellowship (NSSEFF) program is realigned from PE 0601120D8Z to this PE in FY 2015.\n\nThe reduction is a strategic efficiency approach to reduce funding and staffing.  As a result, we provide a better alignment of funding and provide support to a smaller military force."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P010"
                    },
                    "ProjectTitle": {
                        "val": "Basic Research Initiatives"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "17.368"
                        },
                        "CurrentYear": {
                            "val": "11.169"
                        },
                        "BudgetYearOne": {
                            "val": "11.371"
                        },
                        "BudgetYearOneBase": {
                            "val": "11.371"
                        },
                        "BudgetYearTwo": {
                            "val": "11.528"
                        },
                        "BudgetYearThree": {
                            "val": "11.548"
                        },
                        "BudgetYearFour": {
                            "val": "12.148"
                        },
                        "BudgetYearFive": {
                            "val": "12.248"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Basic research provides the DoD with a deep and broad awareness of current directions in science and engineering through the scientific performers in areas of research that are important to U.S. military capabilities including, among others, physics and the physical sciences, materials science, chemistry and chemical engineering, electrical engineering, applied mathematics, computer science, mechanical and aerodynamic engineering, ocean sciences, biological sciences, and the social sciences.  Basic research sustains scientific and engineering communities in areas that form the critical technical underpinnings of DoD capabilities.  Basic research through exploration and discovery provides the unique means for disruptive non-incremental advances that can improve or radically change military capabilities, strategy, and operations. \n\nThe Minerva Research Initiative is a university-based social science basic research program directed from within the Office of the Secretary of Defense (OSD) and executed by the Services, consistent with the January 2012 priorities document \"Sustaining U.S. Global Leadership: Priorities for 21st Century Defense\" and the Quadrennial Defense Review (QDR) requirements.  This program seeks to build a deeper understanding of the social, cultural, and political forces that shape regions of the world of strategic importance to the United States.  \n\nThe Strategic Support for Basic Research (SSBR) program funds initiatives to implement the Assistant Secretary of Defense for Research and Engineering (ASD(R&E)) strategic plan for defense basic research.  This plan defines specific and quantifiable actions to help create conditions for defense basic research investments capable of creating high-payoff, transformative scientific breakthroughs for DoD.  The SSBR initiatives support the five aims of (1) providing scientific leadership; (2) attracting the Nation’s best Scientists and Engineers (S&Es); (3) ensuring the coherence and balance of the Basic Research portfolio; (4) fostering connections between DoD performers and DoD; and (5) improving the efficiency of the defense research business environment."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Minerva Research Initiative"
                                    },
                                    "Description": {
                                        "val": "The Minerva Research Initiative is a university-based social science basic research program directed from within the OSD and executed by the Services, consistent with the January 2012 priorities document \"Sustaining U.S. Global Leadership: Priorities for 21st Century Defense\" and the QDR requirements.  This program seeks to build a deeper understanding of the social, cultural, and political forces that shape regions of the world of strategic importance to the United States."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.000"
                                            },
                                            "Text": {
                                                "val": "A Department-wide solicitation of topics to be set as Minerva priority social science research areas drew responses from Service leadership, the Defense Advanced Research Projects Agency (DARPA), Combatant Commands (COCOMs), J5, the intelligence community, and others.  The resulting broad agency announcement (BAA) and correlated source selection process identified several new university-led research grants to be awarded in these newly derived focus areas.  The FY 2013 BAA yielded 270 white papers; 14 proposals were selected for award in accordance with recommendations from a panel of defense Science and Technology (S&T), defense policy, and academic experts as well as the appropriated FY 2013 budget.\n\nSponsored eight faculty chair positions for Minerva Research Fellows at defense education institutions (war colleges and Service academies)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.671"
                                            },
                                            "Text": {
                                                "val": "A Department-wide solicitation of topics to be set as Minerva priority social science research areas will engage Service leadership, DARPA, J5, the intelligence community, and others in the defense community.  The resulting BAA and correlated source selection process will select new university-led research grants to be awarded in these newly derived focus areas.\n\nThe Minerva Research Fellows program is being restructured to more effectively build in-house social science capabilities and better connect social science research insights to current and future defense leadership at professional military education institutions (PMEs) and elsewhere. An ongoing pilot program has been designed to augment existing institutional resources rather than funding new research faculty by enabling activities such as PME curriculum development, new academic-government exchange opportunities, and research-informed tabletop exercises."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.871"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.871"
                                            },
                                            "Text": {
                                                "val": "Continue and start new university-led research initiatives.  Based on lessons learned during FY 2014 pilot at defense education institutions, the Minerva program will continue strengthening DoD-internal social science capabilities by enabling activities such as PME curriculum development, new academic-government exchange opportunities, and research-informed tabletop exercises."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Strategic Support for Basic Research (SSBR)"
                                    },
                                    "Description": {
                                        "val": "The SSBR program funds initiatives to implement the ASD(R&E) strategic plan for defense basic research.  This plan defines specific and quantifiable actions to help create conditions for defense basic research investments capable of creating high-payoff, transformative scientific breakthroughs for DoD.  The SSBR initiatives support the five aims of (1) providing scientific leadership; (2) attracting the Nation’s best scientists and engineers; (3) ensuring the coherence and balance of the Basic Research portfolio; (4) fostering connections between DoD performers and DoD; and (5) improving the efficiency of the defense research business environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.368"
                                            },
                                            "Text": {
                                                "val": "Conducted workshops for scientific situational awareness.  Convened National research leaders to provide external perspectives on potential breakthroughs and barriers to advancement in rapidly evolving fields of basic research.  Analyzed university-related business practices for improvement.  Acquired scientific expertise to oversee engineering and science initiatives.  Established DoD-wide Basic Research objectives and priorities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.498"
                                            },
                                            "Text": {
                                                "val": "Conduct workshops for scientific situational awareness.  Convene National research leaders to provide external perspectives on potential breakthroughs and barriers to advancement in rapidly evolving fields of basic research.  Continue to analyze university-related business practices for improvement.  Continue support for scientific expertise to oversee engineering and science initiatives.  Conduct ASD(R&E) Deans Dialog event to foster active connections with research universities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.500"
                                            },
                                            "Text": {
                                                "val": "Conduct workshops for scientific situational awareness.  Convene National research leaders to provide external perspectives on potential breakthroughs and barriers to advancement in rapidly evolving fields of basic research.  Continue to analyze university-related business practices for improvement.  Continue support for scientific expertise to oversee engineering and science initiatives.  Conduct ASD(R&E) Deans Dialog event to foster active connections with research universities."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P101"
                    },
                    "ProjectTitle": {
                        "val": "National Security Science and Engineering Faculty Fellowship (NSSEFF)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "33.193"
                        },
                        "BudgetYearOneBase": {
                            "val": "33.193"
                        },
                        "BudgetYearTwo": {
                            "val": "35.181"
                        },
                        "BudgetYearThree": {
                            "val": "35.251"
                        },
                        "BudgetYearFour": {
                            "val": "35.899"
                        },
                        "BudgetYearFive": {
                            "val": "38.285"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "The National Security Science and Engineering Faculty Fellowship (NSSEFF) program will be realigned from the National Defense Education Program (NDEP) PE 0601120D8Z to this PE beginning in FY 2015."
                        },
                        "ProjectMissionDescription": {
                            "val": "The National Security Science and Engineering Faculty Fellowship (NSSEFF) program supports world-class researchers in scientific areas of critical importance to DoD and ensures the cultivation of exceptional talent.  NSSEFF provides a critical resource for connections between academia and the DoD science and engineering enterprise.  Fellows’ work is selected on the basis of basic research priorities and other emerging areas of potential importance to DoD basic scientific research and defines a broad set of emerging scientific areas.  Fellows serve as speakers at DoD events, reviewers on panels for DoD science, and as collaborators with DoD laboratory scientists and engineers."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "National Security Science and Engineering Faculty Fellowship (NSSEFF)"
                                    },
                                    "Description": {
                                        "val": "NSSEFF ensures that DoD has a research portfolio that supports the foremost creative, innovative, and productive university researchers.  The objectives of the program are to: (1) conduct innovative, unclassified, basic scientific and engineering research on topics of interest to DoD; (2) provide university researchers with an overview of DoD’s missions, employed technologies, and current and future challenges; (3) foster research collaborations between science and engineering faculty members and DoD; and (4) increase the cadre of ready and relevant technical expertise which DoD can call upon."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "33.193"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "33.193"
                                            },
                                            "Text": {
                                                "val": "Continue support for current NSSEFF Fellows.  Review program topic areas, eligibility, review process and selection criteria.  Solicit for a new class of NSSEFF Fellows.  Conduct a NSSEFF program review and report on Fellows' progress.  Use this venue to identify and facilitate new connections between Fellows and DoD scientists and engineers.  Organize and conduct a DoD-wide activity at a DoD Laboratory to further develop the collaborative relationships between DoD researchers and NSSEFF Fellows in areas of scientific or technological importance to DoD."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}