{
    "id": "cb443d893595c6096de4dc4b82a370d7e6d14d3f",
    "meta": {
        "filename": "dod-2015_RDTE_2015_NAVY_BA1_3_RDTE_JustificationBook_Navy_PB_2015.zzz_unzipped_RDTE_JustificationBook_Navy_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603123N"
        },
        "ProgramElementTitle": {
            "val": "Force Protection Advanced Technology"
        },
        "R1LineNumber": {
            "val": "16"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "16.273"
            },
            "CurrentYear": {
                "val": "28.286"
            },
            "BudgetYearOne": {
                "val": "25.831"
            },
            "BudgetYearOneBase": {
                "val": "25.831"
            },
            "BudgetYearTwo": {
                "val": "34.938"
            },
            "BudgetYearThree": {
                "val": "35.540"
            },
            "BudgetYearFour": {
                "val": "23.392"
            },
            "BudgetYearFive": {
                "val": "16.921"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "FY 2013 funding associated with Future Naval Capability (FNC) efforts are transferring to a new Program Element titled Future Naval Capabilities Advanced Technology Development (PE 0603673N).  This is to enhance the visibility of the FNC Program by providing an easily navigable overview of all 6.3 FNC investments in a single location."
        },
        "ProgramElementMissionDescription": {
            "val": "The efforts described in this Program Element (PE) are based on investment directions as defined in the Naval S&T Strategic Plan approved by the S&T Corporate Board (Sep 2011). This strategy is based on needs and capabilities from Navy and Marine Corps guidance and input from the Naval Research Enterprise (NRE) stakeholders (including the Naval enterprises, the combatant commands, the Chief of Naval Operations (CNO), and Headquarters Marine Corps). It provides the vision and key objectives for the essential science and technology efforts that will enable the continued supremacy of U.S. Naval forces in the 21st century. The Strategy focuses and aligns Naval S&T with Naval missions and future capability needs that address the complex challenges presented by both rising peer competitors and irregular\/asymmetric warfare. \n\nThis PE addresses advanced technology development associated with providing the capability of Platform and Force Protection for the U.S. Navy. This program supports the development of technologies associated with all naval platforms (surface, subsurface, terrestrial and air) and the protection of those platforms. \n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "18.616"
                },
                "CurrentYear": {
                    "val": "28.328"
                },
                "BudgetYearOne": {
                    "val": "32.354"
                },
                "BudgetYearOneBase": {
                    "val": "32.354"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "16.273"
                },
                "CurrentYear": {
                    "val": "28.286"
                },
                "BudgetYearOne": {
                    "val": "25.831"
                },
                "BudgetYearOneBase": {
                    "val": "25.831"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.343"
                },
                "CurrentYear": {
                    "val": "-0.042"
                },
                "BudgetYearOne": {
                    "val": "-6.523"
                },
                "BudgetYearOneBase": {
                    "val": "-6.523"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.042"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.262"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.521"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-6.523"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-6.523"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.001"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-1.561"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Not applicable.\n\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "2912"
                    },
                    "ProjectTitle": {
                        "val": "Force Protection Advanced Technology"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "14.097"
                        },
                        "CurrentYear": {
                            "val": "25.721"
                        },
                        "BudgetYearOne": {
                            "val": "23.207"
                        },
                        "BudgetYearOneBase": {
                            "val": "23.207"
                        },
                        "BudgetYearTwo": {
                            "val": "32.265"
                        },
                        "BudgetYearThree": {
                            "val": "32.815"
                        },
                        "BudgetYearFour": {
                            "val": "20.618"
                        },
                        "BudgetYearFive": {
                            "val": "14.147"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project addresses advanced technology development associated with providing the capability of Platform and Force Protection for the U.S. Navy. This project supports the development of technologies associated with all naval platforms (surface, subsurface, terrestrial, and air) and the protection of those platforms."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "SURFACE SHIP & SUBMARINE HULL MECHANICAL & ELECTRICAL (HM&E)"
                                    },
                                    "Description": {
                                        "val": "Activity includes: advanced technology demonstrations to evaluate emerging energy technologies and advanced technology development for Unmanned Sea Surface Vehicles.\nThe funding increase from FY 2014 to FY 2015 is due the ramping up of the Energy Systems Technology Evaluation Program (E-STEP) effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.004"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued development of autonomous navigation for Unmanned Sea Surface Vehicles from a host ship \n- Continued development of Integrated Damage Control Systems which includes Integrated Damage Control Communications and Advanced Magazine Protection System. \n- Continued Total Ship Survivability Damage Tolerance and Recoverability efforts which include integrated damage control situation awareness technologies. \n- Continued Affordable Submarine Propulsion and Control Surface Actuator technologies focused on the development and demonstration of affordable advanced material propellers and torque dense and quiet actuation of submarine control surface efforts. \n- Continued Underwater Total Ship Survivability\/Payload Implosion and Platform Damage Avoidance efforts. \n- Continued scaled testing and large scale analysis for ship protection systems. \n- Continued fabrication of scaled control surface actuator systems. \n- Continued air-independent energy system sub-scale component development, analysis, and benchtop testing. \n- Continued efforts to conduct advanced technology demonstrations to evaluate emerging energy technologies using Navy and Marine Corps facilities as test beds. \n- Initiated efforts to conduct advanced technology demonstrations to evaluate emerging energy technologies using Navy and Marine Corps facilities as test beds."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.821"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2013."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.656"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.656"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2014."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "AIRCRAFT TECHNOLOGY"
                                    },
                                    "Description": {
                                        "val": "DESCRIPTION: \nThe Aircraft Technology activity develops technologies for enhanced capability of Naval aviation aircraft platforms in terms of mission effectiveness, platform range, responsiveness, survivability, observability, readiness, safety and life cycle cost. It also develops new Naval air vehicle concepts and high impact, scalable Naval air vehicle technologies, such as - autonomous air vehicle command and control, helicopter and tiltrotor rotor drive systems, aerodynamics, propulsion systems, materials, structures and flight controls for future and legacy air vehicles. This activity directly supports the Naval Aviation Enterprise Science and Technology Objectives and the Naval Science and Technology Strategic Plan, principally in the Autonomy and Unmanned Systems, Platform Design and Survivability, Power and Energy and Total Ownership Cost Focus Areas. \n\nThe funding increase in FY 2013 and ramp up in FY 2014 are due to the Autonomus Areial Cargo\/Utility System (AACUS) program and the 6.3 portion of the Variable Cycle Advance Technology (VCAT) program.\n\nThe funding decrease in FY 2015 is due to a re-scoping of the 6.3 portion of the Variable Cycle Advanced Technology (VCAT) program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.093"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Initiated demonstration of initial core software, sensor, air vehicle, and capability applications for Autonomous Aerial Cargo\/Utility System (AACUS).\n- Initiated the advanced technology demonstration portion of the Variable Cycle Advanced Technology (VCAT) Program.  Critical technology development efforts will begin with major engine manufactures and system contractors to develop\/mature the highest priority, long-lead propulsion system technologies, including variable\/adaptive cycle engine components, for next generation carrier-based TACAIR\/ISR systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.900"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2013.\n- Demonstrate initial core software, sensor, air vehicle, and capability applications for Autonomous Aerial Cargo\/Utility System (AACUS).\n- Complete the majority of VCAT Phase I variable cycle engine\/propulsion subsystem technology development efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.551"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.551"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2014, less those noted as completed above.\n- Continue VCAT Phase I variable cycle engine\/propulsion subsystem technology development efforts through completion."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "The overall goals of this advanced technology program are the development of technologies which focus on the warfighter and providing the ability to win or avoid engagements with other platforms or weapons and, in the event of engagement, to resist and control damage, while preserving operational capability.  Overall metric goals are to transition the advanced technology projects into acquisition programs.  Each Activity within this PE has unique goals and metrics, some of which include classified quantitative measurements.  \n\nSpecific examples of metrics under this PE include:\n- Advanced technology demonstrations to evaluate emerging energy technologies."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3049"
                    },
                    "ProjectTitle": {
                        "val": "Force Protection"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "2.176"
                        },
                        "CurrentYear": {
                            "val": "2.565"
                        },
                        "BudgetYearOne": {
                            "val": "2.624"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.624"
                        },
                        "BudgetYearTwo": {
                            "val": "2.673"
                        },
                        "BudgetYearThree": {
                            "val": "2.725"
                        },
                        "BudgetYearFour": {
                            "val": "2.774"
                        },
                        "BudgetYearFive": {
                            "val": "2.774"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Develop advanced technologies, critical to protecting naval installations, to provide seamless full spectrum protection against asymmetric terrorist attack by improving the ability to: sense developing and immediate threats; shape our responses through improved situational awareness and decision making; shield personnel, mission critical facilities, infrastructure, and operating fleet assets; maintain essential functions; and sustain and restore critical services in the aftermath of an incident.  Technologies developed will also seek to reduce the required manpower and skill levels devoted to the force protection mission."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "EMERGING THREATS"
                                    },
                                    "Description": {
                                        "val": "This activity includes development of advanced technologies critical to protecting naval installations, and will provide seamless, full spectrum protection against asymmetric terrorist attack by improving the ability to: sense developing and immediate threats; shape our responses through improved situational awareness and decision making; shield personnel, mission critical facilities, infrastructure, and operating fleet assets; maintain essential functions; and sustain and restore critical services in the aftermath of an incident.  Technologies developed will also seek to reduce the required manpower and skill levels devoted to the force protection mission."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.176"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued development of lower cost\/higher performance Force Protection sensors and automated detection algorithms, and decision support tools. \n- Continued research to reduce force protection manpower and equipment costs through automation and predictive learning algorithms. \n- Continued threat characterization research and perception experiments for sensor performance optimization and model development and validation. \n- Continued development of all weather sensors optimized for installation of force protection. \n- Continued research into sensors for use in counter-surveillance around protected facilities. \n- Continued research to advance sensor fusion capabilities in high density networks with diverse sensor grids. \n- Continued development of assessment algorithms and information analysis technologies to augment skills or replace persons in operations centers. \n- Continued research into sensors and countermeasures for use against unmanned underwater vehicles.\n- Continued multi-band electro-optical sensor and fusion algorithm development and demonstrations in adverse weather conditions. \n- Conducted interim demonstration of acoustic sensors for perimeter and area surveillance in realistic environments.\n- Initiated multi-band electro-optical sensor and fusion algorithm development and demonstrations in adverse weather conditions.\n- Initiated development of protection technology for naval installation power and energy infrastructure.\n- Expanded research into sensors and countermeasures for use against unmanned underwater to include surface swimmers, underwater divers, and underwater diver propulsion aids."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.565"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2013, less those completed."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.624"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.624"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2014.\n- Continue demonstration of multi-band electro-optical sensors and fusion algorithms in adverse weather conditions. \n- Initiate demonstration of sensors and countermeasures for use against underwater to include surface swimmers, underwater divers, diver propulsion aids, and underwater unmanned vehicles.\n- Initiate research in non-acoustic detection, tracking, classification, and engagement of underwater threats to naval installations.\n- Initiate development of autonomous unmanned harbor defense systems for perimeter patrol and threat interdiction."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "The overall goals of this advanced technology program are the development of technologies which will provide seamless full spectrum protection against asymmetric terrorist attack by improving the ability to protect naval installations. Overall metric goals are to reduce the required manpower and skill levels devoted to the force protection mission. Specific metric under the Project includes: 50% reduction of manpower associated with FP surveillance, situational awareness, and decision making, 2x improvement in electro-optical sensor performance in adverse weather conditions, 50%reduction in sensor cost per square or cubic meter of detection at a given resolution, and a 50% reduction in false alarm rates for automated detection and tracking algorithms both above and below water."
                        }
                    }
                }
            ]
        }
    }
}