{
    "id": "cc8f6d6334f232bac7716d1a9d2efe55c1a68d47",
    "meta": {
        "filename": "dod-2015_RDTE_2015_DLA_RDTE_JustificationBook_Defense_Logistics_Agency_PB_2015.zzz_unzipped_RDTE_JustificationBook_Defense_Logistics_Agency_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Defense Logistics Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0708012S"
        },
        "ProgramElementTitle": {
            "val": "Logistics Support Activities (LSA)"
        },
        "R1LineNumber": {
            "val": "240"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Defense Logistics Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "5.250"
            },
            "PriorYear": {
                "val": "4.328"
            },
            "CurrentYear": {
                "val": "4.659"
            },
            "BudgetYearOne": {
                "val": "1.574"
            },
            "BudgetYearOneBase": {
                "val": "1.574"
            },
            "BudgetYearTwo": {
                "val": "1.531"
            },
            "BudgetYearThree": {
                "val": "1.649"
            },
            "BudgetYearFour": {
                "val": "1.587"
            },
            "BudgetYearFive": {
                "val": "1.690"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Pacific Disaster Center (PDC) has been in operation since February 1996. The PDC is a public\/private partnership managed by the University of Hawaii (UH) under a cooperative agreement with the Department of Defense.  It is functionally within the organization of the USD(P),  ASD(HD&ASA), and DASD(DCCM). The PDC  is a world-recognized authority and leader in science and information technology applications relating to humanitarian assistance and disaster relief (HA\/DR)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "4.711"
                },
                "CurrentYear": {
                    "val": "4.659"
                },
                "BudgetYearOne": {
                    "val": "4.710"
                },
                "BudgetYearOneBase": {
                    "val": "4.710"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "4.328"
                },
                "CurrentYear": {
                    "val": "4.659"
                },
                "BudgetYearOne": {
                    "val": "1.574"
                },
                "BudgetYearOneBase": {
                    "val": "1.574"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.383"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-3.136"
                },
                "BudgetYearOneBase": {
                    "val": "-3.136"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Program Transfers"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-2.500"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.500"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Sequestration"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.383"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Program Changes"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.636"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.636"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY2013 Sequestration: -$0.383\n\nFY2015 Other Program Changes (Budget Control Act 2011): -$0.636M\nThis proposed cuts are cumulative and long-term.  RDT&E funds program engineering support and system integration activities.  The proposed reduction will slow the current level of operations and delay required system upgrades."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "1"
                    },
                    "ProjectTitle": {
                        "val": "Logistics Support Activities (LSA)"
                    },
                    "SpecialProject": {
                        "val": "1"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "5.250"
                        },
                        "PriorYear": {
                            "val": "2.678"
                        },
                        "CurrentYear": {
                            "val": "2.889"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This program is reported in accordance with Title 10, United States Code, Section 119 (a)(1) in the Special Access Program Annual Report to Congress.  The staff cognizance and oversight was transferred to the Defense Logistics Agency (DLA) in 1994. In accordance with DoD Directive 5111.1, Defense Continuity & Crisis Management (DCCM) was established to consolidate continuity-related policy and oversight activities within DoD in order to ensure the Secretary of Defense can perform his mission essential functions under all circumstances. DCCM provides the secretary of Defense policy, plans, crisis management, and oversight of the Department of Defense continuity related program activities. The DCCM's primary mission is to support the continued execution of the Department's mission essential functions across the full spectrum of threats. The threats range from major natural disasters to weapons of mass destruction in major metropolitan areas, as well as large-scale terrorist attacks."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2"
                    },
                    "ProjectTitle": {
                        "val": "Pacific Disaster Center"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "1.650"
                        },
                        "CurrentYear": {
                            "val": "1.770"
                        },
                        "BudgetYearOne": {
                            "val": "1.574"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.574"
                        },
                        "BudgetYearTwo": {
                            "val": "1.531"
                        },
                        "BudgetYearThree": {
                            "val": "1.649"
                        },
                        "BudgetYearFour": {
                            "val": "1.587"
                        },
                        "BudgetYearFive": {
                            "val": "1.690"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Pacific Disaster Center (PDC) has been in operation since February 1996. The PDC is a public\/private partnership managed by the University of Hawaii (UH) under a cooperative agreement with the Department of Defense.  It is functionally within the organization of the USD(P),  ASD(HD&ASA), and DASD(DCCM). The PDC is a world-recognized authority and leader in science and information technology applications relating to humanitarian assistance and disaster relief (HA\/DR). PDC’s applications and information products enhance preparedness, situational awareness, and civil-military communications for humanitarian missions worldwide, while its national-level socio-economic Risk and Vulnerability Assessments help inform strategies by measuring indicators for national resiliency using scientific methods.\n\nThe PDC Program Office’s (USD(P),  ASD(HD&ASA), and DASD(DCCM)) primary responsibility is for management and stewardship of governmental funds provided in Defense Department appropriations for DoD missions associated with DoD CrM, HA\/DR, Theater Security Cooperation, and DSCA. In doing this, the Program Office develops and provides policy, oversight and guidance, and jointly develops strategic guidelines, programmatic content and priorities with the UH and PDC. The PDC Program Office also serves as a support element of the Hawaii-based organization especially in the area of gaining Federal agency support and resources, as well as business opportunities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Pacific Disaster Center (PDC)"
                                    },
                                    "Description": {
                                        "val": "Accept  the transfer of  the Pacific Disaster Center (PDC) per (OUSD(AT&L direction (OPS-6471-Pacific Disaster Transfer):\n\nThe March 14, 2011 Secretary of Defense memorandum, subject: Track Four Efficiency Initiatives Decisions, directed the Under Secretary of Defense (Policy) (USD(P)) to transfer the Pacific Disaster Center (PDC) function, manpower, and budget resources to the Office of the Under Secretary of Defense (Acquisition, Technology, and Logistics) (OUSD(AT&L)) and the Defense Logistics Agency (DLA).\n\nMajor FY 2013 programmatic and technical accomplishments of the Center include:\n•\tEnhanced DisasterAWARE disaster monitoring and situational awareness platforms, including DoD’s RAPIDS application, operationally used by DoD, DHS\/FEMA, USAID\/OFDA, and national and international disaster management agencies around the world.  Released new web and mobile apps reaching more than 1.3M users. \n•\tIncreased coverage, themes, and analytical capabilities of global information services, including automated situational assessment and impact assessments reports.\n•\tSupported OSD and COCOMs in over 30 major events and exercises, producing hundreds of analytical products, and delivering more than a dozen training programs.\n•\tReceived competitive grants and funding to support DM\/DRR projects for USG and other international clients in US, ASEAN and LAC regions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.650"
                                            },
                                            "Text": {
                                                "val": "Accept  the transfer of  the Pacific Disaster Center (PDC) per (OUSD(AT&L direction (OPS-6471-Pacific Disaster Transfer):\n\nThe March 14, 2011 Secretary of Defense memorandum, subject: Track Four Efficiency Initiatives Decisions, directed the Under Secretary of Defense (Policy) (USD(P)) to transfer the Pacific Disaster Center (PDC) function, manpower, and budget resources to the Office of the Under Secretary of Defense (Acquisition, Technology, and Logistics) (OUSD(AT&L)) and the Defense Logistics Agency (DLA)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.770"
                                            },
                                            "Text": {
                                                "val": "Pacific Disaster Center's (PDC) mission and plan is to continually enhance disaster risk reduction (DRR) concepts and practices through application of science, information and technology for more effective evidence-based decision making.  PDC's products and services are used in major disaster response and civil-military humanitarian assistance operations by the US Military and US agencies, state agencies, United Nation agencies, ASEAN, national governments, and International\/Non-Governmental Organizations (I\/NGO). Many of the Center's services are also available to the public via the internet, social networks, and apps for mobile devices.\n\nEmphasis areas in FY 2014 include:\n•\tImprove Situational Awareness and Decision Support Applications, including planned release of internet-based and mobile applications.\n•\tExpand national socio-economic risks and vulnerability assessment, and resilience indicators.\n•\tProvide location-based notifications, information, and analytical support to DoD and other HA\/DR stakeholder during major disasters in the US and around the globe.\n•\tMaintain and expand content and capabilities of global information services to increase situational awareness and to address humanitarian relief operational needs.\n•\tBuild capacity in stakeholder agencies through exercise and training, and enhance partnerships with USG agencies, their counterparts in key partner nations, and within I\/NGOs to improve outcomes of     \n                      of HA\/DR and related activities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.574"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.574"
                                            },
                                            "Text": {
                                                "val": "For the past 18 years, Pacific Disaster Center (PDC) has been at the forefront of improving disaster-reduction decision-support capabilities through the application of science and technology.  PDC's products and services enhance foundational and global services supporting civil-military humanitarian assistance operations by the US Military and US agencies, state agencies, United Nation agencies, ASEAN, national governments, and International\/Non-Governmental Organizations (I\/NGO).  Foundational and Global Services include projects supporting development, analysis, and delivery of relevant and actionable information.  These activities fall into three categories:  Global Information Services; Anticipatory Sciences and Socio-Economic Risk and Vulnerability Assessment; and Decision Support Platforms and Applications.\n\nEmphasis areas in FY 2015 include:\n•\tImplement uniform communication, expanding operational utility of mobile applications\n•\tImprove automated damage and needs assessment and other analytical reports\n•\tExpand bio\/health related monitoring capabilities (in partnership with Navy).\n•\tContinue to grow competitive grants and proposals as a mean to grow the center’s capabilities, and leverage these new capabilities in support of DoD missions.\n•\tBuild capacity in stakeholder agencies through exercise and training, and enhance partnerships with USG agencies, their counterparts in key partner nations, and within I\/NGOs to improve outcomes of HA\/DR and related activities"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "PDC projects beyond the baseline Situational Awareness & Decision Support Applications\/Tools architecture (Atlas\/EMOPS\/RAPIDS) undertaken in support of the DoD Cooperative Agreement (CA) with the University of Hawaii (UH) are from PDC customers (e.g., DoD, NGOs, other nations, academia, and industry). The PDC prepares the public, disaster managers, governments, and others to mitigate the effects of disasters.  The goal is to have people and technology work together to preserve life, safeguard livelihoods, protect property to foster disaster-resilient communicates. Projects obtained and funded from this customer base serve as a means to determine PDC product and services relevancy."
                        },
                        "PerformanceMetrics": {
                            "val": "Projects objectives and tasks are designed to build upon the previous year’s successes and are consistent with the framework and direction provided by the 2011-2015 PDC Strategic Plan.  At the beginning of each calendar year, an Annual Plan is in-place to guide the program and enable a framework for performance feedback to the DoD PDC Program Manager, the PDC Executive Director, WHS CA Contracting Office, and the UH. At the end of each calendar year, these stakeholders meet to review the past year performance and finalize a new Annual Plan for the next calendar year.  This plan details a set of specific objectives to further capabilities and capacities supporting the PDC’s mission and increasing operational value to the stakeholders."
                        }
                    }
                }
            ]
        }
    }
}