{
    "id": "ce03ffb8308758937215a68a46be9b09ed639594",
    "meta": {
        "filename": "dod-2015_RDTE_2015_NAVY_BA5_RDTE_JustificationBook_Navy_PB_2015.zzz_unzipped_RDTE_JustificationBook_Navy_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604280N"
        },
        "ProgramElementTitle": {
            "val": "JT Tact Radio Sys (JTRS)"
        },
        "R1LineNumber": {
            "val": "104"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "3891.252"
            },
            "PriorYear": {
                "val": "197.819"
            },
            "CurrentYear": {
                "val": "3.259"
            },
            "BudgetYearOne": {
                "val": "7.106"
            },
            "BudgetYearOneBase": {
                "val": "7.106"
            },
            "BudgetYearTwo": {
                "val": "6.183"
            },
            "BudgetYearThree": {
                "val": "1.732"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "4107.351"
            }
        },
        "ProgramElementNote": {
            "val": "In FY13, Program Element (PE) 0604280N represents the total JTRS RDT&E Budget (includes Multifunctional Information Distribution System (MIDS), Airborne and Maritime\/Fixed Station (AMF) JTRS, Handheld\/Manpack\/Small Form Fit (HMS) JTRS, and JTRS Network Enterprise Domain (JNED) and Digital Modular Radios (DMR)). \n\nIn FY14-19, Program Element (PE) 0604280N no longer includes funding associated with the JTRS Programs.  In accordance with the Acquisition Decision Memorandum (ADM) dated 11 July 2012, the JTRS Programs of Record (PORs) transitioned to a Military Department-managed program.  AMF JTRS and HMS JTRS transitioned to the Army and can be found under PE 0604280A and MIDS transitioned to the Navy under PE 0205604N. The Joint Tactical Networks (JTN) (formally known as JNED) continues to remain under a joint budget strategy in the three Services in the Army PE 0605030A, the Navy PE 0605030N, and the Air Force PE 0605030F."
        },
        "ProgramElementMissionDescription": {
            "val": "Digital Modular Radio (DMR) is the Navy's technical solution for Mobile User Objective System (MUOS). In the prior years, funds previously identified for JTRS AMF were realigned to support the development of the DMR MUOS. The DMR AN\/USC-61(C), is the first software defined radio to become a communications system standard for the U.S. Military. The compact, multi-channel DMR provides multiple waveforms and multi-level information security for voice and data communications. DMR radios currently operate aboard U.S. Navy surface and subsurface vessels, fixed-sites and other Department of Defense communication platforms using frequencies ranging from 2 MHz to 2 GHz."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "337.480"
                },
                "CurrentYear": {
                    "val": "3.302"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "197.819"
                },
                "CurrentYear": {
                    "val": "3.259"
                },
                "BudgetYearOne": {
                    "val": "7.106"
                },
                "BudgetYearOneBase": {
                    "val": "7.106"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-139.661"
                },
                "CurrentYear": {
                    "val": "-0.043"
                },
                "BudgetYearOne": {
                    "val": "7.106"
                },
                "BudgetYearOneBase": {
                    "val": "7.106"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.043"
                    }
                },
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-50.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-7.633"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.002"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "7.106"
                                },
                                "BudgetYearOneBase": {
                                    "val": "7.106"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional Recision Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-11.500"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.526"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional Directed Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-70.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Digital Modular Radio (DMR) realigned OPN to RDTE for Mobile User Objective System (MUOS) in FY15."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "3020"
                    },
                    "ProjectTitle": {
                        "val": "MIDS\/JTRS"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "MdapCode": {
                        "val": "554"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "511.399"
                        },
                        "PriorYear": {
                            "val": "41.658"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "553.057"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "In FY12-FY13, Project No. 3020 represents the total Multifunctional Information Distribution System (MIDS) RDT&E budget for those years.  All references to MIDS funding includes funding for both MIDS-LVT and MIDS JTRS. \n\nIn FY14-19, Program Element (PE) 0604280N no longer includes funding associated with the JTRS Programs.  In accordance with the ADM dated 11 July 2012, the JTRS Programs of Record (PORs) transitioned to a Military Department-managed program.  MIDS transitioned to the Navy under PE 0205604N."
                        },
                        "ProjectMissionDescription": {
                            "val": "JTRS is the Department of Defense (DoD) family of common software-defined programmable radios that will form the foundation of information radio frequency transmission for Joint Vision 2020.  The JTRS family of products will be multifunctional, multiband, multimode, network capable, capable of providing communications through a range of low probability of intercept, low probability of detection and anti-jam waveforms. JTRS products will provide transformational communication capabilities for the warfighter.  JTRS is intended to support communications readiness and mission success, in the 2 Megahertz (MHz) to 2 Gigahertz (GHz) operating frequency range, by providing military commanders with the ability to command, control and communicate with their forces via secure voice\/video\/data media forms.  JTRS products are hardware-configurable and software-programmable radio systems that provide increased interoperability, flexibility and adaptability to support varied mission requirements.\n\nMIDS-Low Volume Terminal (LVT) is a jam-resistant, secure, digital (voice and data) information distribution system enabling rapid integrated communications, navigation and identification for tactical and command and control operations. The technical objective of the MIDS JTRS program is to transform the MIDS-LVT into a four-channel, Software Communications Architecture (SCA) compliant JTRS, while maintaining current Link-16 and tactical air navigation system (TACAN) functionality.  MIDS JTRS is designed to be plug-and-play interchangeable for U.S. Navy and U.S. Air Force platforms that use MIDS-LVT, while accommodating future technologies and capabilities.  Improvements such as Link-16 frequency remapping and programmable crypto are also realized in the MIDS JTRS design.  The MIDS JTRS core terminal includes three 2 MHz to 2 GHz programmable channels that allow the warfighter to use multiple waveforms in development by JNED.  Total core terminal program requirements include: terminal development, F\/A-18 Level 0 integration, software hosting (operating environment\/waveforms) and production transition.  MIDS JTRS will also provide Concurrent Multi-Netting-4 (CMN-4) and Tactical Targeting Network Technology (TTNT).  CMN-4 consists of two capabilities, Concurrent Multi-Netting (CMN) and Concurrent Contention Reception (CCR). CMN is the ability of a Link 16 Terminal to receive multiple messages, each in different Link 16 nets, within the same Link 16 time slot.  CCR is the ability of a Link 16 Terminal to receive multiple messages in the same Link 16 net within the same Link 16 time slots.  These capabilities provide Joint Airborne Network-Tactical Edge (JAN-TE) functionality to run advanced mission applications in a cross-platform\/cross-domain tactical network enterprise and the ability to simultaneously participate in four Link-16 Nets."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "MIDS\/JTRS"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "41.658"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Delivered MIDS JTRS Crypto Modernization (CM) capability.  Awarded the development, design and implementation of four (4) nets Concurrent Multi-Netting with Concurrent Contention Receive (CCR) for MIDS JTRS.  \nBegan specification development\/technical analysis for Tactical Targeting Network Technology (TTNT) for MIDS JTRS Naval Integrated Fire Control Counter Air (NIFC-CA) and From the Air Advanced Tactical Data Links (FTA ATDL).  Assumed responsibility of the TTNT waveform development.  \nContinued on Block Upgrade 2 (BU2) development to include Frequency Remapping (FR), a required Department of Transportation (DOT) mandate to enable the continued use of MIDS Link-16 to remap at least 14 of its 51 data transmission and receipt time slots to frequencies which do not interfere with current and planned Federal Aviation Administration (FAA) safety of flight systems.  Began development of Enhanced Throughput (ET) capabilities for MIDS-LVT under BU2.  Continued MIDS systems engineering, COMSEC, IA and program management support."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "In FY14, Program Element (PE) 0604280N no longer includes funding associated with the JTRS Programs.  In accordance with the ADM dated 11 July 2012, the JTRS Program of Records (PORs) transitioned to a Military Department-managed program.  MIDS transitioned to the Navy under PE 0205604N."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "APN\/0143"
                                    },
                                    "Title": {
                                        "val": "EA-18G"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "8.401"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "32.208"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "MIDS JTRS development was initiated as a major modification to the MIDS-LVT using an Engineering Change Proposal to the existing production contracts.  Development efforts included the Phase 2B Core terminal.   The U.S. prime contractors from the MIDS-LVT program, Data Link Solutions (DLS) and ViaSat Inc., cooperatively designed and developed the Core terminal.  Each prime contractor built and qualified Production Verification Terminals.  The U.S. implemented a continuous competition strategy between DLS and ViaSat that will be maintained throughout the MIDS JTRS production phase.  This strategy was successfully used on MIDS-LVT production.  The FY14 budget supports development and implementation of Crypto Modernization, Frequency Remapping, and Enhanced Throughput capabilities for the MIDS-LVT terminal as well as the initial development to incorporate Concurrent Multi-Netting-4 (CMN-4) and Tactical Targeting Network Technology (TTNT) into MIDS JTRS.  MIDS JTRS also takes over the responsibilty of developing the TTNT waveform."
                        },
                        "PerformanceMetrics": {
                            "val": "The JTRS programs are employing mature, software-defined radio technologies and developing more than 10 million lines of code as part of the Increment 1 baseline.  Early on, a JTRS enterprise software metrics requirements effort established a baseline of standard software metrics which are monitored on each JTRS contract involving software development.  Example metrics are: the number of requirements and the number of use cases required for design are estimated during the requirement and design phase and analyzed for trend-actual vs. scheduled; the software lines of code (SLOC) counts are used to determine progress during the coding phase; and the execution of test cases as well as trouble reports are monitored during the integration and test phase.  Further, a software complexity product metric is collected which demonstrates the testability of the code and is an important criterion for software certification.  These software metrics are used to quantify the quality and progress of each software product's development over time.  Additionally, MIDS employs Earned Value Metrics to monitor contract performance on its Prime Development Contracts, as required."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3073"
                    },
                    "ProjectTitle": {
                        "val": "AMF JTRS"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "MdapCode": {
                        "val": "421"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "1445.995"
                        },
                        "PriorYear": {
                            "val": "8.946"
                        },
                        "CurrentYear": {
                            "val": "3.259"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "1458.200"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "In FY13, Project No. 3073 represents the total Airborne Maritime\/Fixed Station Joint Tactical Radio Systems (AMF JTRS) RDTE budget for those years.  In FY14, RDTE funding for AMF JTRS transitions to Army Program Element (PE) 605380A.\n\nIn FY13-FY14, Project No. 3073 includes funding associated with system and shipboard integration planning\/design and OPEVAL planning and coordination of Mobile User Objective Systems (MUOS) terminals on Navy platforms and shore locations.\n\nIn FY15, the Digital Modular Radio (DMR) program, funded here under Project 3073, is transitioning to Project 3078."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Airborne and Maritime\/Fixed Station Joint Tactical Radio System (AMF JTRS) radios are software programmable, multi-band, multi-mode, mobile ad hoc networking radios, providing simultaneous voice, data, and video communications.  The radios will operate in networks supporting the Common Operational Picture, situational awareness, and interoperability of Mission Command (MC) systems throughout the battlefield.  AMF JTRS must ensure the Warfighter's ability to communicate both horizontally and vertically via voice and data within all mission areas and Combat Operational Environments.  AMF JTRS helps close capability gaps by extending data networking to company and below echelons, enabling network services to the platform and connecting Army Aviation platforms to Army ground and Joint air network domains.  Per Milestone Decision Authority (MDA) direction, the redefined AMF JTRS Program will procure radios as Non-Developmental Items (NDI).\n\nAMF JTRS will operate networking waveforms and select waveforms that are widely deployed by Joint Forces today, enable interoperability between different types of platforms, and transport operational and MC information through the tactical network to joint network member nodes.  The system will also reach back to access Global Information Grid (GIG) services, where required.  The need for interoperable systems, including common waveforms, software applications, and network operations is critical to the mobile tactical network capability.  AMF JTRS is relevant to the Joint Functional Concept (Net-Centric Environment), Joint Integrating Concept (Net-Centric Operational Environment), Joint Operating Concept (Major Combat Operations, Stability Operations), and JTRS Concept of Operations (Tactical Wireless Joint Networks).  AMF JTRS shall support and enhance three principal Warfighter outcomes: Information Superiority, Joint Force Interoperability, and Networking.\n\nDigital Modular Radio (DMR) is the Navy's technical solution for Mobile User Objective System (MUOS). Funds previously identified for JTRS AMF were realigned to support the development of DMR MUOS. The DMR AN\/USC-61(C), is the first software defined radio to have become a communications system standard for the U.S. Military. The compact, multi-channel DMR provides multiple waveforms and multi-level information security for voice and data communications. DMR radios currently operate aboard U.S. Navy surface and subsurface vessels, fixed-sites and other Department of Defense communication platforms using frequencies ranging from 2 MHz to 2 GHz. Certified to pass secure voice and data at Multiple Independent Levels of Security (MILS) over High Frequency (HF), Very High Frequecy (VHF), Ultra High Frequency (UHF), and Satellite Communications (SATCOM) channels, the DMR system was developed to the U.S. Navy's specifications and meets all the stringent environmental, Electromagnetic Interference (EMI) and performance requirements for use in the U.S. Fleet. This task is to continue the development of the Integrated Waveform (IW) and the Mobile User Objective System (MUOS) waveforms for the Digital Modular Radio (DMR) in accordance with Military Standards 188-181,2,3 . IW uses a Time Division Multiple Access (TDMA) communication system in an attempt to improve satellite bandwidth utilization over legacy SATCOM waveforms. This enables demand assigned services on UHF SATCOM networks to support new applications that require better performance and higher channel throughput. The MUOS waveform will enable MUOS satellites to provide worldwide communication satellite coverage for DoD requirements. MUOS will provide functionality comparable to commercial mobile phone systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "AMF JTRS"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.218"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued development and issue of Request for Proposals (RFP). Completed market research.  Continued preparation of contract documents, as well as Source Selection for Link 16 and a networking waveform capability in Army Aviation platforms (e.g. Apache, Black Hawk, and Chinook). Set up government lab facilities and equipment to support Source Selection. Fund external agencies (e.g., Army Test and Evaluation Command [ATEC], Joint Interoperability Test Command [JITC], and Training and Doctrine Command [TRADOC]) to support program test & evaluation and requirements efforts.  Complete closeout of current SDD Prime contract."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The FY14 plan is contained in Army PE 0605380A."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "DMR Mobile Users Objective System (MUOS)"
                                    },
                                    "Description": {
                                        "val": "Formerly included in JTRS AMF for Navy integration and porting efforts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.728"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Researched a technical solution for the Navy's MUOS requirement."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.259"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Development efforts on the technical solution for Navy's MUOS requirement including integration and porting the MUOS waveform into the DMR. Complete HFDAG development, testing, and evaluation efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "RDTEA\/0605380A"
                                    },
                                    "Title": {
                                        "val": "AMF JTRS"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "33.219"
                                        },
                                        "BudgetYearOne": {
                                            "val": "7.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "7.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "12.536"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "52.755"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "OPA\/B90110"
                                    },
                                    "Title": {
                                        "val": "JTRS (AMF)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "15.536"
                                        },
                                        "BudgetYearThree": {
                                            "val": "18.600"
                                        },
                                        "BudgetYearFour": {
                                            "val": "19.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "20.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "73.136"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "AMF JTRS underwent a program restructure in accordance with Milestone Decision Authority (MDA) direction. The program is revising its material solution strategy to leverage commercially available Non-Developmental Item (NDI) tactical radios in order to rapidly deliver AMF JTRS capabilities to the warfighter. The strategy will support a concept in which NDI radios can be selected from the vendor base and tailored to platform needs.  The current strategy is to procure two variations of NDI radios for Airborne platforms.  Maritime\/Fixed Station sites will not be part of the revised procurement."
                        },
                        "PerformanceMetrics": {
                            "val": "Acquisition Decision Memorandum (ADM) received on 11 July 2012 directing a restructure of the AMF JTRS Program. Performance metrics will be evaluated after the program Acquisition Strategy has been finalized and the new Acquisition Program Baseline approved."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3075"
                    },
                    "ProjectTitle": {
                        "val": "HMS JTRS"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "MdapCode": {
                        "val": "385"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "772.767"
                        },
                        "PriorYear": {
                            "val": "86.766"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "859.533"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "In FY14-19, Program Element (PE) 0604280N no longer includes funding associated with the JTRS Programs.  In accordance with the Acquisition Decision Memorandum (ADM) dated 11 July 2012, the JTRS Program of Records (PORs) transitioned to a Military Department-managed program.  Handheld\/Manpack\/Small Form Fit (HMS) JTRS is now associated with Program Executive Office Command, Control and Communications-Tactical (PEO C3T) under Project Manager Tactical Radios (PM TR) PE 0604280A."
                        },
                        "ProjectMissionDescription": {
                            "val": "JTRS is the Department of Defense (DoD) family of common software-defined programmable radios that will form the foundation of information radio frequency transmission for JointVision 2020. The JTRS products will be multifunctional, multiband, multimode, network capable, capable of providing communications through a range of low probability of  intercept, low probability of detection and anti-jam waveforms. JTRS products will provide transformational communication capabilities for the warfighter. JTRS is intended to support communications readiness and mission success, in the 2 Megahertz (MHz) to 2 Gigahertz (GHz) operating frequency range, by providing military commanders with the ability to command, control and communicate with their forces via secure voice\/video\/data media forms. JTRS products are hardware-configurable and software-programmable radio systems that provide increased interoperability, flexibility and adaptability to support varied mission requirements.\n\nHMS provides the capability to meet Joint Ground Mounted, Dismounted & Embedded Radio Requirements. Increment 1, Phase 1 developed Small-Form-Fit (SFF) SFF-A, SFF-D and AN\/PRC-154 Rifleman Radio running Soldier Radio Waveform (SRW) for use in a sensitive but unclassified environment (Type 2). Increment 1, Phase 2 will develop the 2 Channel Manpack and SFF-B. Phase 2 radios are all Type 1 compliant for use in a classified environment running Satellite Communications (SATCOM), Soldier Radio Waveform (SRW), Mobile User Objective System (MUOS), and Single Channel Ground to Air Radio System (SINCGARS) waveforms."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "HMS JTRS"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "86.766"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Participated in Phase 2 Customer Test Event for Manpack radio; Participated in a Customer Test event for the AN\/PRC154 and AN\/PRC154A; Continued to redesign of SFF-B capabilities; Tested redesigned SFF-B in a radio-specific development test and combined vendor development test; Continued MUOS porting and testing activities to include Public Key Information (PKI) updates on the Manpack; Participated in multiple MUOS Risk Reduction test events with the satellite system; Completed SFF-B CDT and all related development efforts; Obtained Information; Assurance certification for the SFF-B; Began work on additional software capabilities including over the air management and the Wideband Networking Waveform (WNW); Provided technical and engineering support for development efforts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "In FY14-19, Program Element (PE) 0604280N no longer includes funding associated with the JTRS Programs.  In accordance with the ADM dated 11 July 2012, the JTRS Programs of Record (PORs) transitioned to a Military Department-managed program.  HMS JTRS transitioned to the Army and can be found under PE 0604280A."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPN\/3057"
                                    },
                                    "Title": {
                                        "val": "COMMUNICATION ITEMS UNDER $5M"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "3.300"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "3.300"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTEA\/0604280A"
                                    },
                                    "Title": {
                                        "val": "HMS JTRS"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "31.826"
                                        },
                                        "BudgetYearOne": {
                                            "val": "6.523"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "6.523"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "4.615"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "42.964"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "This project supports completion of the HMS Engineering and Manufacturing Development phase efforts and execution of the HMS acquisition strategy to procure modified non-developmental items (NDI) through full and open competition open to all potential industry partners. The HMS Program received Milestone (MS) C approval on 17 June 2011. The HMS modified NDI acquisition strategy will deliver NSA certified capabilities. Following full and open competition, qualified NDI Rifleman and Manpack radios will require operationally-relevant testing to inform a FRP decision and to support fielding to Capability Set (CS) units. The contract will be Firm Fixed Price (FFP). The minimum set of waveforms to be supported on the HMS Manpack include: SATCOM, SRW, MUOS, and SINCGARS waveforms."
                        },
                        "PerformanceMetrics": {
                            "val": "HMS employs mature, software-defined radio technology.  JTRS enterprise software metrics requirements established a baseline of standard software metrics which are monitored on the HMS contract. Further, a software complexity product metric is collected which demonstrates the testability of the code and is an important criterion for software certification. These software metrics are used to quantify the quality and progress of each software product's development over time. Additionally, HMS employs Earned Value Metrics to monitor contract performance on the Prime Development Contract."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3076"
                    },
                    "ProjectTitle": {
                        "val": "JTRS Network Enterprise Domain (JNED)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "MdapCode": {
                        "val": "284"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "1156.704"
                        },
                        "PriorYear": {
                            "val": "56.983"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "1213.687"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "In FY 2013 and Prior Years, Project No. 3076 represents the total Joint Tactical Radio System Network Enterprise Domain (JNED) RDT&E budget.\n\nIn FY 2014 funding resides in PE 0605030A represents the total Joint Tactical Networking Center (JTNC) Budget (formally known as JNED). \n\nIn FY15-19, Program Element (PE) 0604280N no longer includes funding associated with the JTRS Programs. In accordance with the ADM dated 11 July 2012, the JTRS Programs of Record (PORs) transitioned to Military Department-managed programs. The continuing Joint Tactical Networking Center (JTNC) (formally known as JNED) will remain under a joint budget strategy in the three Services in PEs (Army PE 0605030A, the Navy PE 0605030N, and the Air Force PE 0605030F).  As part of the JTRS joint program budget strategy, each Military Department (MILDEP) budgets for approximately one-third of the total program RDT&E funds.  Prior to the year of execution, the funding is consolidated in the Army PE.\n\nThe Joint Tactical Networking Center (JTNC) provides the DoD centralized management, development and sustainment of joint waveform and network management applications."
                        },
                        "ProjectMissionDescription": {
                            "val": "Joint Tactical Networking Center (JTNC) will provide interoperable, secure Joint Tactical Networking applications capable of operating in a variety of radio solutions to maintain and sustain an affordable, government-controlled open architecture, in support of Combatant Commanders', Services' and Coalition mission network requirements.  \nJTN is responsible for the continuous development, delivery, and maintenance of networking waveforms and modified legacy radio waveforms that are Software Communications Architecture (SCA) compliant. SCA compliant waveforms enable interoperability and support Net-Centric operational warfare at sea, air and on the ground.  Networking waveforms extend the Global Information Grid (GIG) to the first tactical mile and to the warfighter."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Mobile User Objective System (MUOS)"
                                    },
                                    "Description": {
                                        "val": "Mobile User Objective System (MUOS) Waveform will enable MUOS satellites to provide worldwide communication satellite coverage for DoD requirements. MUOS will provide functionality comparable to commercial mobile phone systems. MUOS offers secure streaming video, netted communications, and voice\/data in real time to provide essential connectivity.  The JTN program will modify this waveform, making it compatible and certifiable with DoD security requirements while enabling porting to tactical radio sets. MUOS is currently being ported by 7 vendors on 7 different platforms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.317"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed development of MUOS v3.1 in 1Q FY13. Began Software In Service Support for the MUOS waveform."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier Radio Waveform (SRW)"
                                    },
                                    "Description": {
                                        "val": "Soldier Radio Waveform (SRW) will operate on tactical radio sets to provide a networked battlefield communications capability for power disadvantaged users engaged in land combat operations and will support voice, data, and video communications on the immediate battlefield. These forces include vehicles, rotary wing, dismounted soldiers, munitions, sensors, and unmanned air vehicles (UAV). Functional software applications will use SRW enabled JTR sets over Internet Protocol (IP) capable networks and sub-networks. SRW will be interoperable with higher throughput, IP-based network waveforms, such as Wideband Networking Waveform. As applicable, these IP-based networking waveforms will enable information exchanges through the GIG to the soldier and provide entirely new capabilities for battlefield communications and information sharing. SRW is currently ported on 19 different platforms with 11 different vendors."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.147"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued Software In Service Support for the SRW waveform."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "JTRS Enterprise Network Manager (JENM)"
                                    },
                                    "Description": {
                                        "val": "TRS Enterprise Network Manager (JENM) provides consolidated communications planning, network configuration, network activation, position reporting, fault management, security management, and network health and status reporting needed to establish and maintain a mobile wireless network comprised of JTN network waveforms.  JENM can interface with other external network managers, mission planning systems, network planning systems, key management systems, and spectrum planning systems.  JENM is considered a mission essential system and a critical element within the JTN configuration management tool kit."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.101"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed development and performed Functional Qualification Test (FQT) for JENM Phase 2 enhancement effort in 1Q FY13. Continued Software In Service Support for Network Services and Network Managers. Continued to provide JTN technical support, including waveform development, systems engineering, spectrum allocation, system security engineering, problem resolution and support of Software Communications Architecture (SCA) activities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Wideband Networking Waveform (WNW)"
                                    },
                                    "Description": {
                                        "val": "Wideband Networking Waveform (WNW) is a high data rate Mobile Adhoc NETworking (MANET) waveform application that provides the mid tier tactical internet backbone and connects tactical forces across the battle sphere. WNW will provide high throughput, dynamically adaptable connectivity for the exchange of Internet Protocol (IP) based voice, data, and video traffic. WNW will feature two signals-in-space (SiS), which are the Orthogonal Frequency Division Multiplexing (OFDM) and Anti-Jam (AJ). WNW will support network nodes on mobile, airborne, and maritime platforms. WNW includes networking services, security, High Assurance IP Equipment (HAIPE) capabilities, red black switching, and internal routing of other WNW signals. WNW is currently ported on 7 platforms with 7 different vendors."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.440"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued Software In Service Support for the WNW waveform."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint Airborne Networking -Tactical Edge (JAN-TE)"
                                    },
                                    "Description": {
                                        "val": "Joint Airborne Networking - Tactical Edge (JAN-TE) will operate on JTRS airborne sets to provide a networked tactical communications capability for tactical aircraft. JAN-TE will provide increased throughput, highly responsive connectivity, and ad hoc mobile networking for fighters engaged in air operations. This networking waveform is uniquely designed and engineered for highly maneuverable, fast moving aircraft for rapidly establishing networks to share high value data communications. USD(AT&L) directed that the development of the JAN-TE waveform be discontinued after Critical Design Review in October 2008, but allowed the Navy and\/or Air Force to continue funding its development independently, if desired. In FY2011, the Navy began to budget and execute funding for continuation of JAN-TE's\ndevelopment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.477"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued support of the JAN-TE waveform."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Legacy Radio Waveforms"
                                    },
                                    "Description": {
                                        "val": "Legacy Radio Waveforms Management: Includes the continued development, incremental upgrades, and software efficiencies of legacy software and other related activities (Information Repository & Software Communications Architecture compliant (SCA)) to support the legacy waveform integration into hardware solutions in the field."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "32.501"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued to support waveform integration, test and evaluation to include hardware and Software Waveform Certification Process (SCA compliance testing) to meet program requirements. Continued JTN program management office support. Continued Software In Service Support for Legacy waveforms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "RDTEA\/0605030A"
                                    },
                                    "Title": {
                                        "val": "JTN"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "68.148"
                                        },
                                        "BudgetYearOne": {
                                            "val": "19.909"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "19.909"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "21.788"
                                        },
                                        "BudgetYearThree": {
                                            "val": "26.849"
                                        },
                                        "BudgetYearFour": {
                                            "val": "25.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "25.025"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTEN\/0605030N"
                                    },
                                    "Title": {
                                        "val": "JTN"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "15.075"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "15.075"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "12.481"
                                        },
                                        "BudgetYearThree": {
                                            "val": "12.578"
                                        },
                                        "BudgetYearFour": {
                                            "val": "12.949"
                                        },
                                        "BudgetYearFive": {
                                            "val": "13.264"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "66.347"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTEF\/0605030F"
                                    },
                                    "Title": {
                                        "val": "JTN"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "20.088"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "20.088"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "22.346"
                                        },
                                        "BudgetYearThree": {
                                            "val": "22.255"
                                        },
                                        "BudgetYearFour": {
                                            "val": "22.656"
                                        },
                                        "BudgetYearFive": {
                                            "val": "23.064"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "110.409"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Joint Tactical Networks (JTN) is responsible for common core activities including developing and updating the SCA compliant legacy and networking waveforms that operate on multiple hardware sets and in all operational environments that support network-centric operational warfare, as well as common networking services (interface standards, network managers, etc). Waveform developments (upgrading, developing, and maintaining) will generally be procured through full and open contract competitions. The JTN program is developing waveforms and Cryptographic Equipment Applications (CEAs) for use within the software-defined radio community."
                        },
                        "PerformanceMetrics": {
                            "val": "The Joint Tactical Networks (JTN) program is employing mature, software-defined radio technologies and have developed more than 10 million lines of code as part of the Increment 1 baseline.  Early on, a JTN enterprise software metrics requirements effort established a baseline of standard software metrics which are monitored on each JTN contract involving software development.  Example metrics are: the number of requirements and the number of use cases required for design are estimated during the requirement and design phase and analyzed for trend-actual vs. scheduled; the software lines of code (SLOC) counts are used to determine progress during the coding phase; and the execution of test cases as well as trouble reports are monitored during the integration and test phase.  Further, a software complexity product metric is collected which demonstrates the testability of the code and is an important criterion for software certification.  These software metrics are used to quantify the quality and progress of each software product's development over time.  Additionally, JTN employs Earned Value Metrics to monitor contract performance on its Prime Development Contracts."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3078"
                    },
                    "ProjectTitle": {
                        "val": "Digital Modular Radio"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "4.387"
                        },
                        "PriorYear": {
                            "val": "3.466"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "7.106"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.106"
                        },
                        "BudgetYearTwo": {
                            "val": "6.183"
                        },
                        "BudgetYearThree": {
                            "val": "1.732"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "22.874"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "In FY15, the Digital Modular Radio (DMR) program, previously funded under Project 3073, is transitioning to Project 3078. FY16-17 adds funding for the development of DMR High Frequency Automatic Link Establishment (HF ALE)."
                        },
                        "ProjectMissionDescription": {
                            "val": "Digital Modular Radio (DMR) is the Navy's technical solution for Mobile User Objective System (MUOS). Funds previously identified for JTRS AMF were realigned to support the development of DMR MUOS. The DMR AN\/USC-61(C), is the first software defined radio to have become a communications system standard for the U.S. Military. The compact, multi-channel DMR provides multiple waveforms and multi-level information security for voice and data communications. DMR radios currently operate aboard U.S. Navy surface and subsurface vessels, fixed-sites and other Department of Defense communication platforms using frequencies ranging from 2 MHz to 2 GHz. Certified to pass secure voice and data at Multiple Independent Levels of Security (MILS) over High Frequency (HF), Very High Frequency (VHF), Ultra High Frequency (UHF), and Satellite Communications (SATCOM) channels, the DMR system was developed to the U.S. Navy's specifications and meets all the stringent environmental, Electromagnetic Interference (EMI) and performance requirements for use in the U.S. Fleet. This task is to continue the development of the Integrated Waveform (IW), the MUOS waveforms for the DMR in accordance with Military Standards 188-181,2,3, and the High Frequency Distribution Amplifier Group (HFDAG). IW uses a Time Division Multiple Access (TDMA) communication system in an attempt to improve satellite bandwidth utilization over legacy SATCOM waveforms. This enables demand assigned services on UHF SATCOM networks to support new applications that require better performance and higher channel throughput. The MUOS waveform will enable MUOS satellites to provide worldwide communication satellite coverage for DoD requirements. MUOS will provide functionality comparable to commercial mobile phone systems. HFDAG is a follow-on HF solution to fulfill the HF communication capability from 2MHz - 30MHz (transmit) and 2MHz - 30MHz (receive) with ALE, Link 11, FSK, USB, LSB and ISB modes of operation for Navy Modernization Process (NMP) and platforms.  HFDAG will utilize the existing DMR as the exciter\/receiver. Funding in FY16-17 is to provide DMR with HF Automatic Link Establishment (ALE) Generation 3."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "DMR"
                                    },
                                    "Description": {
                                        "val": "Overall program efforts include investigation of emerging technologies through study, development and associated testing for feasibility of program insertion."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.466"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued DMR Integrated Waveform (IW) capability development, testing, integration and logistics efforts. Supported management and system engineering efforts towards completing IW System Requirements Review (SRR). Initiated efforts in support of IW design reviews. Continued effort on development of technical solution for Navy's MUOS requirement including integration and porting the MUOS waveform into the DMR."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.106"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.106"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue the development of the MUOS and IW capability for the DMR including system engineering, software development, testing, design reviews, integration, porting and logistics efforts and support acquisition documentation development. Continue HFDAG development and test & evaluation efforts."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPN\/3010"
                                    },
                                    "Title": {
                                        "val": "DMR OPN, PE:0303109N"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "14.410"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "14.410"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "32.324"
                                        },
                                        "BudgetYearThree": {
                                            "val": "39.273"
                                        },
                                        "BudgetYearFour": {
                                            "val": "55.308"
                                        },
                                        "BudgetYearFive": {
                                            "val": "66.363"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "207.678"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "General Dynamics C4 Systems (GDC4S) owns the technical data rights to the DMR. Due to this fact they are the only contractor with the unique capabilities and technical know how to perform the required design work to complete the IW upgrade and the MUOS interoperability efforts. This scope will be issued as the final increment to GDC4S under the sole source contract, N00039-10-C-0069, as authorized by SPAWAR J&A No. 16,976, signed 3 December 2012 by SPAWAR Executive Director and as authorized by SPAWAR J&A No. 16,351 signed 5 January 2010 by the Assistant Secretary of the Navy (ASN), Research Development and Acquisition (RD&A). SPAWAR Systems Center Pacific (SSC PAC) will continue performing HFDAG system test and evaluation."
                        },
                        "PerformanceMetrics": {
                            "val": "MIL-STD conformance to meet JITC Certification for IW\/UHF SATCOM waveform and the MUOS waveform."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0604280N_3078_FILE1.JPG"
                                }
                            }
                        ]
                    }
                }
            ]
        }
    }
}