{
    "id": "d1d9f8bd37e1af8bb8157aa0971297773a0a6c7e",
    "meta": {
        "filename": "dod-2015_RDTE_2015_AIRFORCE_V3A_RDTE_JustificationBook_Air_Force_PB_2015.zzz_unzipped_RDTE_JustificationBook_Air_Force_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0207444F"
        },
        "ProgramElementTitle": {
            "val": "Tactical Air Control Party-Mod"
        },
        "R1LineNumber": {
            "val": "158"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "14.444"
            },
            "CurrentYear": {
                "val": "10.223"
            },
            "BudgetYearOne": {
                "val": "5.891"
            },
            "BudgetYearOneBase": {
                "val": "5.891"
            },
            "BudgetYearTwo": {
                "val": "12.547"
            },
            "BudgetYearThree": {
                "val": "12.204"
            },
            "BudgetYearFour": {
                "val": "10.782"
            },
            "BudgetYearFive": {
                "val": "10.987"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Tactical Air Control Party-Modernization (TACP-M).  TACP members deploy with Army maneuver units and provide a Command and Control (C2) link for Close Air Support (CAS), Joint Fires Support, airlift, and Air Force surveillance\/reconnaissance missions.  TACPs are equipped with a variety of targeting and communications systems which interface with ground maneuver forces, CAS aircraft, joint fire assets, C2 aircraft\/agencies, and Intelligence, Surveillance, and Reconnaissance (ISR) platforms and agencies. TACPs detect targets, coordinate with C2 authorities, and pass precise targeting information to close air support aircraft and fires support units to ensure accurate and timely targeting in the employment of joint fires support.  The actions TACPs perform not only shorten the kill chain, but also reduce the potential for fratricide and collateral damage in civilian-occupied areas.  TACPs also provide ground communications during federal emergency relief operations and homeland defense initiatives. TACPs support Overseas Contingency Operations (OCO) and have seen significantly increased mission effectiveness during Operation Enduring Freedom and Operation New Dawn.  \n\nThe purpose of the TACP-M program is to provide net-centric data communications, battlespace awareness, and targeting capabilities to TACPs operating in operations centers, vehicles, and while conducting dismounted operations.   Data communications, including streaming video, reduce reliance on voice transmissions and enable machine-to-machine data exchange between TACPs and C2 nodes, CAS aircraft, Army units and other TACP units.  Reliable data communications support interoperability, improve battlespace awareness (BA), increase targeting accuracy, reduce kill chain decision time, improve data flow\/information exchange, and reduce the potential for fratricide and collateral damage in civilian occupied areas. TACPs use software communication architecture (SCA)-certified,Joint Interoperability Test Command (JITC) approved, software-defined radios and ancillary components that provide reliable voice and data communications on UHF SATCOM, UHF\/VHF LOS, SINCGARS, and will soon on evolving networking waveforms such as Soldier Radio Waveform (SRW) and Mobile User Objective System (MUOS)   \n\nTACP-M is a buy-to-budget program with requirements based on ACC's evolving combat needs and the capabilities available in the commercial market.  As a result, requirements are frequently adjusted to accommodate warfighter needs while working within available funding.  \n\nTACP-M is divided into three segments:  software, mounted capabilities, and dismounted capabilities. The mounted segment is further divided into stationary and mobile elements. \n\nThe software segment provides the Close Air Support System (CASS) software with interfaces to all TACP-M components and joint interoperability with CAS aircraft (A-10, F-16, F\/A-18, AV-8B, etc), remotely piloted aircraft (RPA), artillery fire support systems, network-enabled weapons, and C2 nodes.  To enable data communications with those systems \/ nodes, CASS incorporates several communications protocols including Variable Message Format (VMF), Link 16, Marine Tactical System (MTS), and U.S. Message Text Format (USMTF).   CASS versions 1.4.2 and 1.4.4 are currently fielded.  The contract for CASS v1.4.5 was awarded on 24 Oct 13 and will provide advanced communication and targeting capability on mobile computing devices for Dismounted TACPs, as well as provide significant interoperability improvements in software used in vehicles and operations centers.  Future upgrades necessary to maintain interoperability with CAS aircraft, joint fire support systems, and emerging data networking waveforms will be guided by the TACP CASS Information System Initial Capabilities Document(IS ICD),which was approved by the Air Force Requirement Oversight Council (AFROC), Functional Capabilities Board (FCB), and Joint Capabilities Board (JCB) in 1st Qtr FY14.\n\nThe dismounted segment consists of integrated, non-developmental, commercial-off-the-shelf (COTS) components carried by dismounted TACPs.  These include laser range finders, thermal imagers, laser designators,  manpack and handheld radios, ruggedized tactical computers, streaming video receivers, and other required equipment. \n\nThe Mounted (Fixed) segment integrates computer and communications equipment into re-locatable vehicle, rack, or transit-case mounted systems for use in Tactical Operations Center (TOC) or Air Support Operations Center (ASOC) locations.  It includes the ASOC Gateway mounted in a High Mobility, Multi-Wheeled Vehicle (HMMWV) shelter, the Gateway Lite mounted in relocatable racks or transit cases, and the Dismounted Communications Package (DCP) mounted in transit cases.\n\nThe Mounted (Mobile) segment integrates radios, computers, and ancillary equipment into mobile tactical vehicles such as new TACP M1145 and M1165 Armored HMMWV variations, the Army Stryker armored vehicle, and future Army vehicles.  Following the termination of the Vehicular Communications System (VCS) in FY11, existing capability gaps in TACP vehicle-mounted communications systems have grown. \n\nThe TACP-Modernization ICD, approved by the JROC in Sep 2012, identified significant on-the-move tactical voice, data, and video capability gaps in TACP tactical vehicles.  A subsequent DOTMLPF Study verified that Mounted (Mobile) data communications requirements can be provided by modular, non-developmental, COTS components integrated into TACP vehicles.  Current TACP-M team efforts are focused on incrementally providing new mounted capabilities as funding and technology allow. \n\nIn Mar 2011-Feb 2012, the TACP-M program fielded a Dismounted Communications Package which provided a robust and re-locatable, transit-case mounted communications system for TACPs operating in TOC locations.  In Mar 2011-Jun 2013, the TACP-M program integrated and fielded the GRC-259 mission equipment package, which provided improved on-the-move tactical communications and blue force tracking capabilities for the Army Stryker Light Armored Vehicles.  In August 2013, the TACP-M program fielded the Voice Communications Package (VCP), which provided TACPs \/ JTACs with limited, 2-channel, on-the-move, voice-only communications capabilities for M1165 HMMWVs.  The next increment, Mobile Communications System Increment 0, is planned to add data communications and video receiver capabilities to VCP-equipped M1165 HMMWVs.  This will be followed by a more robust capability that provide essential communications links to C2 and fire support systems on 4 or 5 channels using emerging \/ new Army and Joint Aerial Layer Networking waveforms to M1145 HMMWVs (MCS Inc 1).  Additional MCS increments will provide essential communications, datalinks and targeting capabilities for mounted systems to include current and future TACP vehicles.\n\nIn FY15, the TACP-M program is implementing a multi-award, Indefinite Delivery, Indefinite Quantity contract to aid in the competitive contracting of Mobile Communication System and other platform integration efforts.  The contract will also support studies and analysis, risk reduction, training and sustainment activities to support planning and execution of current and future program activities.\n\nThis program is in Budget Activity 07, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "16.226"
                },
                "CurrentYear": {
                    "val": "10.250"
                },
                "BudgetYearOne": {
                    "val": "10.077"
                },
                "BudgetYearOneBase": {
                    "val": "10.077"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "14.444"
                },
                "CurrentYear": {
                    "val": "10.223"
                },
                "BudgetYearOne": {
                    "val": "5.891"
                },
                "BudgetYearOneBase": {
                    "val": "5.891"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.782"
                },
                "CurrentYear": {
                    "val": "-0.027"
                },
                "BudgetYearOne": {
                    "val": "-4.186"
                },
                "BudgetYearOneBase": {
                    "val": "-4.186"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.021"
                    },
                    "CurrentYear": {
                        "val": "-0.027"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.428"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-1.333"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-4.186"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-4.186"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "In FY13 program was reduced by $1.333M sequestration.\nIn FY15 program was reduced by $4.186M due to higher AF priorities"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "676013"
                    },
                    "ProjectTitle": {
                        "val": "Equipment Modernizaton"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "14.444"
                        },
                        "CurrentYear": {
                            "val": "10.223"
                        },
                        "BudgetYearOne": {
                            "val": "5.891"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.891"
                        },
                        "BudgetYearTwo": {
                            "val": "12.547"
                        },
                        "BudgetYearThree": {
                            "val": "12.204"
                        },
                        "BudgetYearFour": {
                            "val": "10.782"
                        },
                        "BudgetYearFive": {
                            "val": "10.987"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Tactical Air Control Party-Modernization (TACP-M).  TACP members deploy with Army maneuver units and provide a Command and Control (C2) link for Close Air Support (CAS), Joint Fires Support, airlift, and Air Force surveillance\/reconnaissance missions.  TACPs are equipped with a variety of targeting and communications systems which interface with ground maneuver forces, CAS aircraft, joint fire assets, C2 aircraft\/agencies, and Intelligence, Surveillance, and Reconnaissance (ISR) platforms and agencies. TACPs detect targets, coordinate with C2 authorities, and pass precise targeting information to close air support aircraft and fires support units to ensure accurate and timely targeting in the employment of joint fires support.  The actions TACPs perform not only shorten the kill chain, but also reduce the potential for fratricide and collateral damage in civilian-occupied areas.  TACPs also provide ground communications during federal emergency relief operations and homeland defense initiatives. TACPs support Overseas Contingency Operations (OCO) and have seen significantly increased mission effectiveness during Operation Enduring Freedom and Operation New Dawn.  \n\nThe purpose of the TACP-M program is to provide net-centric data communications, battlespace awareness, and targeting capabilities to TACPs operating in operations centers, vehicles, and while conducting dismounted operations.   Data communications, including streaming video, reduce reliance on voice transmissions and enable machine-to-machine data exchange between TACPs and C2 nodes, CAS aircraft, Army units and other TACP units.  Reliable data communications support interoperability, improve battlespace awareness (BA), increase targeting accuracy, reduce kill chain decision time, improve data flow\/information exchange, and reduce the potential for fratricide and collateral damage in civilian occupied areas. TACPs use software communication architecture (SCA)-certified,Joint Interoperability Test Command (JITC) approved, software-defined radios and ancillary components that provide reliable voice and data communications on UHF SATCOM, UHF\/VHF LOS, SINCGARS, and will soon on evolving networking waveforms such as Soldier Radio Waveform (SRW) and Mobile User Objective System (MUOS)   \n\nTACP-M is a buy-to-budget program with requirements based on ACC's evolving combat needs and the capabilities available in the commercial market.  As a result, requirements are frequently adjusted to accommodate warfighter needs while working within available funding.  \n\nTACP-M is divided into three segments:  software, mounted capabilities, and dismounted capabilities. The mounted segment is further divided into stationary and mobile elements. \n\nThe software segment provides the Close Air Support System (CASS) software with interfaces to all TACP-M components and joint interoperability with CAS aircraft (A-10, F-16, F\/A-18, AV-8B, etc), remotely piloted aircraft (RPA), artillery fire support systems, network-enabled weapons, and C2 nodes.  To enable data communications with those systems \/ nodes, CASS incorporates several communications protocols including Variable Message Format (VMF), Link 16, Marine Tactical System (MTS), and U.S. Message Text Format (USMTF).   CASS versions 1.4.2 and 1.4.4 are currently fielded.  The contract for CASS v1.4.5 was awarded on 24 Oct 13 and will provide advanced communication and targeting capability on mobile computing devices for Dismounted TACPs, as well as provide significant interoperability improvements in software used in vehicles and operations centers.  Future upgrades necessary to maintain interoperability with CAS aircraft, joint fire support systems, and emerging data networking waveforms will be guided by the TACP CASS Information System Initial Capabilities Document(IS ICD),which was approved by the Air Force Requirement Oversight Council (AFROC), Functional Capabilities Board (FCB), and Joint Capabilities Board (JCB) in 1st Qtr FY14.\n\nThe dismounted segment consists of integrated, non-developmental, commercial-off-the-shelf (COTS) components carried by dismounted TACPs.  These include laser range finders, thermal imagers, laser designators,  manpack and handheld radios, ruggedized tactical computers, streaming video receivers, and other required equipment. \n\nThe Mounted (Fixed) segment integrates computer and communications equipment into re-locatable vehicle, rack, or transit-case mounted systems for use in Tactical Operations Center (TOC) or Air Support Operations Center (ASOC) locations.  It includes the ASOC Gateway mounted in a High Mobility, Multi-Wheeled Vehicle (HMMWV) shelter, the Gateway Lite mounted in relocatable racks or transit cases, and the Dismounted Communications Package (DCP) mounted in transit cases.\n\nThe Mounted (Mobile) segment integrates radios, computers, and ancillary equipment into mobile tactical vehicles such as new TACP M1145 and M1165 Armored HMMWV variations, the Army Stryker armored vehicle, and future Army vehicles.  Following the termination of the Vehicular Communications System (VCS) in FY11, existing capability gaps in TACP vehicle-mounted communications systems have grown. \n\nThe TACP-Modernization ICD, approved by the JROC in Sep 2012, identified significant on-the-move tactical voice, data, and video capability gaps in TACP tactical vehicles.  A subsequent DOTMLPF Study verified that Mounted (Mobile) data communications requirements can be provided by modular, non-developmental, COTS components integrated into TACP vehicles.  Current TACP-M team efforts are focused on incrementally providing new mounted capabilities as funding and technology allow. \n\nIn Mar 2011-Feb 2012, the TACP-M program fielded a Dismounted Communications Package which provided a robust and re-locatable, transit-case mounted communications system for TACPs operating in TOC locations.  In Mar 2011-Jun 2013, the TACP-M program integrated and fielded the GRC-259 mission equipment package, which provided improved on-the-move tactical communications and blue force tracking capabilities for the Army Stryker Light Armored Vehicles.  In August 2013, the TACP-M program fielded the Voice Communications Package (VCP), which provided TACPs \/ JTACs with limited, 2-channel, on-the-move, voice-only communications capabilities for M1165 HMMWVs.  The next increment, Mobile Communications System Increment 0, is planned to add data communications and video receiver capabilities to VCP-equipped M1165 HMMWVs.  This will be followed by a more robust capability that provide essential communications links to C2 and fire support systems on 4 or 5 channels using emerging \/ new Army and Joint Aerial Layer Networking waveforms to M1145 HMMWVs (MCS Inc 1).  Additional MCS increments will provide essential communications, datalinks and targeting capabilities for mounted systems to include current and future TACP vehicles.\n\nIn FY15, the TACP-M program is implementing a multi-award, Indefinite Delivery, Indefinite Quantity contract to aid in the competitive contracting of Mobile Communication System and other platform integration efforts.  The contract will also support studies and analysis, risk reduction, training and sustainment activities to support planning and execution of current and future program activities.\n\nThis program is in Budget Activity 07, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Close Air Support System (CASS)"
                                    },
                                    "Description": {
                                        "val": "The CASS Software program will modernize software for communications and C2 processing systems for multiple TACP mission areas, i.e., the Air Support Operations Centers (ASOC), Tactical Operation Centers (TOC), Mounted operations, and Dismounted operations.  The software, hosted on a variety of computers that are integrated with TACP radios, computers, and antennas, a.k.a. Communications and Support (C&S) equipment and employed across multiple echelons, provides a complete and standard communication and processing system across the TACP environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.444"
                                            },
                                            "Text": {
                                                "val": "Continued to develop and integrate Machine-to-Machine (MTM) data transfer,  Joint Air Ground Integration Cell, C2 nodes, indirect fires support, and integration and update aircraft across the USAF, joint (e.g. F-35) and coalition environment, as well as conduct risk reduction activities with weapons (e.g. Small Diameter Bomb II) in order to satisfy validated warfighter requirements. This effort also continued to support the Joint DACAS Block 1 initiative which provides a common CASS terminal execution phase capability across service and coalition forces.  CASS software focused on developing a simplified user interface which is user tailorable to specific TACP missions. This effort includes risk reduction activities focused on developing advanced user interfaces for software to be used in Dismounted TACP operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.223"
                                            },
                                            "Text": {
                                                "val": "Continuing to develop MTM interfaces with weapons (e.g. Small Diameter Bomb II), improve interfaces with Joint Air Ground Integration Cell, C2 Nodes, indirect fires integration, and aircraft across the USAF, joint (e.g. F-35) and coalition environment, and satisfy validated warfighter requirements.  This effort also continues to support the Joint DACAS Block 1 initiative which will provide a common CASS terminal execution phase capability across service and coalition forces. CASS software will also be focused on developing a simplified user interface which is tailorable to different TACP mission echelons(e.g ASOC Gateway, Vehicle mounted & Dismounted Joint Terminal Attack Controller (JTAC)) while maintaining a consistent s\/w operating engine across multiple platforms. The new effort will require an adaptable, flexible CASS architecture to enable modular upgrades and capability enhancements which are needed to develop terminal control interfaces of weapons in-flight and will reduce sustainment costs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.891"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.891"
                                            },
                                            "Text": {
                                                "val": "TACP will continue to develop and test MTM interfaces with weapons (e.g. Small Diameter Bomb II), enhance interfaces with Joint Air Ground Integration Cell, C2 Nodes, indirect fires integration, and aircraft across the USAF, joint (e.g. F-35) and coalition environment, and satisfy validated warfighter requirements. This effort will continue to support the Joint DACAS Block 1 initiative which will provide a common CASS terminal capability to connect with United States and coalition forces. CASS software will also be focused on developing a simplified user interface which is TACP mission tailorable e.g ASOC"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPAF: BA03: 837100"
                                    },
                                    "Title": {
                                        "val": "Tactical C-E Equipment"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "33.687"
                                        },
                                        "CurrentYear": {
                                            "val": "22.854"
                                        },
                                        "BudgetYearOne": {
                                            "val": "20.598"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "20.598"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "31.089"
                                        },
                                        "BudgetYearThree": {
                                            "val": "31.550"
                                        },
                                        "BudgetYearFour": {
                                            "val": "32.994"
                                        },
                                        "BudgetYearFive": {
                                            "val": "33.459"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "TACP-M is executing an incremental development for the TACP CASS software.  TACP CASS software systems engineering, design, integration, and fielding support is being provided under a cost plus fixed fee contract. JETS is an Army-managed joint interest development program the Air Force will continue to support."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "APPN_3600_BA_07_PE_0207444F_BPAC_676013_0.jpg"
                                }
                            }
                        ]
                    }
                }
            ]
        }
    }
}