{
    "id": "d24174266ba66ad0071fcf60392676780f380c7e",
    "meta": {
        "filename": "dod-2015_RDTE_2015_OSD_RDTE_JustificationBook_Office_of_Secretary_Of_Defense_PB_2015.zzz_unzipped_RDTE_JustificationBook_Office_of_Secretary_Of_Defense_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0604771D8Z"
        },
        "ProgramElementTitle": {
            "val": "Joint Tactical Information Distribution System (JTIDS)"
        },
        "R1LineNumber": {
            "val": "120"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "16.775"
            },
            "PriorYear": {
                "val": "18.336"
            },
            "CurrentYear": {
                "val": "17.423"
            },
            "BudgetYearOne": {
                "val": "17.562"
            },
            "BudgetYearOneBase": {
                "val": "17.562"
            },
            "BudgetYearTwo": {
                "val": "15.667"
            },
            "BudgetYearThree": {
                "val": "15.908"
            },
            "BudgetYearFour": {
                "val": "15.851"
            },
            "BudgetYearFive": {
                "val": "14.945"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Funds will be used to provide technical, systems engineering and acquisition management oversight of programs, projects and activities to maximize the Department’s return on investment in information technology resources and to effect a comprehensive approach for assessing and procuring critical information systems from initial design, through development to capability delivery in support of improved weapons systems performance and military operations. Resources will be allocated for architecture design and development, portfolio management, enterprise-wide systems engineering and operational impact analyses related to C3 and non-intelligence space systems. The Common Joint Tactical Information funding line responds to the Department's requirement for joint and combined network-enabled tactical data link (TDL) capabilities and for communications which meet net-centric standards to ensure interoperability and seamless integration with joint communication systems. It will be used to assess and promote competition across TDLs DoD-wide and to provide acquisition oversight of TDL-related activities such as CDL waveforms, Joint Aerial Layer Network (JALN) narrowband TDL gateways, Multifunction Advanced Data Link (MADL) and datalink roadmaps to guide future investments. This funding line provides resources for acquisition support and management oversight of critical command, control, communications (C3) and non-intelligence space capabilities as the Department migrates to netcentric operations.They will also be used to provide expertise required for exercising technical direction over design, performance and cost parameters of key systems and their dependencies. The goal of this funding is to eliminate redundancy, reduce time to the field, evaluate projects and concepts for adherence to net-centric guidelines, minimize performance and operational risk of developing and fielding complex major systems which rely on networks and supporting applications, ensure program dependencies are documented and included in acquisition decisions and address interoperability requirements, gaps and best value technical solutions. Typical deliverables associated with the instantiation of net-centric capabilities for these mission areas include network and vulnerability assessments, migration plans, investment strategies, roadmaps and technical guidance documentation."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "20.688"
                },
                "CurrentYear": {
                    "val": "19.475"
                },
                "BudgetYearOne": {
                    "val": "20.498"
                },
                "BudgetYearOneBase": {
                    "val": "20.498"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "18.336"
                },
                "CurrentYear": {
                    "val": "17.423"
                },
                "BudgetYearOne": {
                    "val": "17.562"
                },
                "BudgetYearOneBase": {
                    "val": "17.562"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.352"
                },
                "CurrentYear": {
                    "val": "-2.052"
                },
                "BudgetYearOne": {
                    "val": "-2.936"
                },
                "BudgetYearOneBase": {
                    "val": "-2.936"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Strategic Efficiency Reduction"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-2.352"
                                },
                                "CurrentYear": {
                                    "val": "-2.052"
                                },
                                "BudgetYearOne": {
                                    "val": "-2.936"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.936"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "1. Reductions reflect sequestration, taxes and other reductions to support program priorities within the USD(AT&L)."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "771"
                    },
                    "ProjectTitle": {
                        "val": "Link-16 Tactical Data Link (TDL) Transformation"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "16.775"
                        },
                        "PriorYear": {
                            "val": "18.336"
                        },
                        "CurrentYear": {
                            "val": "17.423"
                        },
                        "BudgetYearOne": {
                            "val": "17.562"
                        },
                        "BudgetYearOneBase": {
                            "val": "17.562"
                        },
                        "BudgetYearTwo": {
                            "val": "15.667"
                        },
                        "BudgetYearThree": {
                            "val": "15.908"
                        },
                        "BudgetYearFour": {
                            "val": "15.851"
                        },
                        "BudgetYearFive": {
                            "val": "14.945"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Funds will be used to provide technical, systems engineering and acquisition management oversight of programs, projects and activities to maximize the Department’s return on investment in information technology resources and to effect a comprehensive approach for assessing and procuring critical information systems from initial design, through development to capability delivery in support of improved weapons systems performance and military operations. Resources will be allocated for architecture design and development, portfolio management, enterprise-wide systems engineering and operational impact analyses related to C3 and non-intelligence space systems. The Common Joint Tactical Information funding line responds to the Department's requirement for joint and combined network-enabled tactical data link (TDL) capabilities and for communications which meet net-centric standards to ensure interoperability and seamless integration with joint communication systems. It will be used to assess and promote competition across TDLs DoD-wide and to provide acquisition oversight of TDL-related activities such as CDL waveforms, Joint Aerial Layer Network (JALN) narrowband TDL gateways, Multifunction Advanced Data Link (MADL) and datalink roadmaps to guide future investments. This funding line provides resources for acquisition support and management oversight of critical command, control, communications (C3) and non-intelligence space capabilities as the Department migrates to netcentric operations. They will also be used to provide expertise required for exercising technical direction over design, performance and cost parameters of key systems and their dependencies. The goal of this funding is to eliminate redundancy, reduce time to the field, evaluate projects and concepts for adherence to net-centric guidelines, minimize performance and operational risk of developing and fielding complex major systems which rely on networks and supporting applications, ensure program dependencies are documented and included in acquisition decisions and address interoperability requirements, gaps and best value technical solutions. Typical deliverables associated with the instantiation of net-centric capabilities for these mission areas include network and vulnerability assessments, migration plans, investment strategies, roadmaps and technical guidance documentation."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Common Joint Tactical Information Initiatives"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.336"
                                            },
                                            "Text": {
                                                "val": "– Cyber Investment Management: Synchronized and coordinated cyberspace acquisition activities, conducted quantitative assessments, and ensured cyberspace investments align with Department priorities, required capabilities and evolving cyber threats. Provided support of the Cyber Investment Management Board and develop implementation guidance and associated direction. Planned and conducted 4 Cyber Investment Management Boards (CIMBs) chaired by USD AT&L. Captured the cyber investment portfolio and identified strategic cyber issues that will need future funding enabling acquisition control on the rapidly increasing Cyber demand. \n- Conducted analysis and technical assessment of FY14 $4.561B DoD-wide Cyber investment structure, capabilities being developed and Cyber Mission Alignment through updated Cyber resource aggregation.\n- Completed investment analysis of the DoD-wide Cyber Special Access Program (SAP) portfolio.\n- Completed a cyber-rapid acquisition Process Pilot Plan to validate and refine the ‘Rapid’ and ‘Deliberate’ cyber acquisition processes stated in the Congressional Report Response to NDAA FY11, Section 933.\n- Developed initial Cybersecurity Guidebook for Program Managers. Documented mapping of the Risk Management Framework-related activities to the acquisition lifecycle. Assisted PM’s in successfully implementing Cybersecurity Requirements at the optimal points throughout the systems acquisition lifecycle.\n- Conducted technical analysis for the Cyber Situational Awareness Evaluation of Alternatives (SA EoA) to include senior systems engineering support to EoA study leadership, and analysis of applicable technologies and potential alternatives as well as acquisition programs and costs, to include metrics, methodology, and other associated activities.\n- Conducted a quantitative assessment of OCO capabilities for Phases 0\/1 of military operations.\n- Joint Tactical Network Center: Provided comprehensive technical assessments of waveform enhancement strategies for SRW, WNW, MUOS and TTNT. Analyzed requirements of new waveforms, achievable throughput, scalability, anti-jam, LIP\/LPD and spectral efficiency performance characteristics. Evaluated software communications architectures for relevance and support for waveform portability.\n– Beyond Line of Sight (BLOS) Analysis and Systems Engineering: Provided architectural guidance and technical analysis for BLOS communications in contested and denied environments consisting of a combination of SATCOM and aerial communications. Assessed communications performance in anti-jam, anti-access area denial environments.  Improved ability to predict performance of network architectures and technologies and assess performance of directional apertures. \n- Protected SATCOM AoA Technical Expertise: Provided analytic framework for assessing protected SATCOM options in support of AoAs and for use in Satellite Emulation Tools for modeling AEHF performance.\n- Aerial Networks Roadmaps and Systems Engineering: Developed technology roadmaps to guide the evolution of aerial networks so that DoD takes full advantage of 5th generation fighters and the force multiplier effects of networking aircraft. Aerial roadmaps developed for air-air high capability transport and air-air tactical domains.  Evaluated Army, Navy, Air Force system architectures for alignment with aerial networks roadmaps.\n– JTRS Waveform Assessments: Assessed waveforms (WNW, SRW, SINCGARS, HNW) for implementation and provided recommendations for ground force IP routing network architectures and interoperability with coalition partners. Provided technical risk analyses and test review recommendations for lowering cost and complexity and for ensuring tactical data link and ISR networks harmonization. \n- Ground Networking Roadmaps: Developed and maintained roadmaps to guide the evolution of ground networking radios and waveforms.  Maintained roadmaps for lower echelon and brigade\/backbone domains.  Developed roadmap to address ground to space domain. Analyzed Army and Marine system architectures for brigade and MEB networks to align with roadmaps.\n- Maritime Networks:  Developed roadmaps to guide the evolution of maritime radios, waveforms and networks. Addressed LOS ship-ship, ship-air and ship-space domains. Identified essential components, enabling technologies, program technology insertion opportunities and key investment decisions to achieve affordability and performance objectives.\n– Airborne Maritime Fixed (AMF) JTRS:  Assessed the AMF program to include the risk of vendor selected radios. Conducted independent technical reviews and recommend program performance improvement options to meet cost, schedule and performance objectives. Provided a technical assessment of the network effects of a WNW airborne node.\n-  FAB T:  Provided programmatic analysis, technical reviews, and assessments of the FAB-T program and Presidential and National Voice Conferencing (PNVC) program to reduce development, integration, and procurement risks. Provided assessments and prepared for staffing Acquisition Strategy, DAB preparation, ADMs, and RFPs.\n- MUOS System End-to-End Integration: Developed comprehensive systems engineering, test and terminal certification plans. Assessed military standard\/specifications and interface control documents for configuration management. Engineered the system to minimize efforts required to certify new MUOS end user terminals. Analyzed MUOS follow on alternatives in A2AD scenarios against sophisticated jamming adversaries.\n– SATCOM Common Systems Roadmap: Developed and Maintained roadmaps to guide the evolution of SATCOM common systems for a more resilient gateway infrastructure with lower operating costs and the ability to re-provision resources within minutes vice days and hours. Addressed gateway evolution and resource management domains. Developed a plan for integrating teleport, STEP and service gateway RF heads.\n-  CDL Technology and Competition Assessment: Performed an assessment of the acquisition, standardization, testing, and governance processes for Common Data Links (CDL) in response to Congressional and internal DoD inquiries regarding the lack of CDL vendor competition. Provided an assessment of the aspects of CDL standards that have precluded robust vendor competition. Provided recommendations for CDLs going forward to achieve best balance of performance, cost, competition, and standardization. Identified existing contracts to determine the as-is state of the marketplace and identified upcoming contracts that provide opportunities for improved acquisitions.    \n– Quantitative Capability Delivery Increments (QCDI)\/FLOWNET: Developed and implemented updates to QCDI and FlowNET models to include NxN demand and conduct analyses of future end-to-end networks residing in surface, aerial and space layers.\n– Network Integration Exercise (NIE) Technical Assessments:  Conducted analyses of the technical maturity, performance and interoperability of products and systems undergoing evaluation in the Army’s NIE. Evaluated the validity of formal test data from DoD sources and assess whether the data produce an accurate portrayal of the product and system’s capability. Recommended priority courses of action with emphasis on best cost\/performance delivery to the warfighter.\n- Joint C2 Portfolio Management: Supported development, integration and test activities across the Services, Agencies and Combatant Commands and deliver the FY14-19 version of the Joint C2 Sustainment and Modernization Plan.\n– Adaptive Planning and Execution (APEX):  Provided management oversight of APEX acquisition activities and authoritative data sources as the APEX technical integrator. Developed first draft of the APEX technical architecture to include logistics and intelligence planning. Updated APEX data architecture and standards and developed technical and systems standards for APEX framework for application across DoD. \n– C2 Data: Provided technical expertise for ensuring C2 data are visible, accessible, understandable, trustable and interoperable. Updated the C2 data model and standards for inclusion into the National Information Exchange Model (NIEM). Updated the C2 Authoritative Data Source roadmap and developed a C2 data architecture.\n- Joint C2 Architecture: Provided the technical expertise necessary to update the Joint C2 Architecture to guide Joint C2 capability area development activities across the Services, Agencies and Combatant Commands. \n– C2 Analyses: Developed strategy to operationalize the U.S. and Allied research on C2 Agility, which recognizes that Commanders must articulate their C2 approach for any given military operation.  Formed closer ties among the C2 research, analysis and operational communities and enhanced the state of C2 practice significantly.\n- Space Situational Awareness: Conducted Geo SSA architectural analysis and technical assessment of Alternative Sources of GEO SSA. Conducted technical analysis on emerging and existing technologies and capabilities that could be used to implement the GEO SSA strategy. Developed technology roadmaps and investment strategies. Provided Technical Analysis & Assessment of DoD Use of Foreign\/Non-traditional SSA Sensors in support of DoD SSA data strategy.\n– Space Access: Conducted technical assessment and developed DoD inputs to National Rocket Propulsion Strategy (NRPS). Conducted net centric review\/technical assessment of Space lift Range; Developed Space Ranges Roadmap & Enterprise Strategy for capabilities through 2025. Conducted technical assessment and net centric review of DoD Satellite Operations (SATOPS) enterprise.  \n– Environmental Monitoring: Developed DoD inputs for annual Federal Plan for Meteorological Services and Supporting Research; led METOC Data Denial Implementation team; conducted technical analysis in support of Defense Weather AoA; conducted assessment of USG weather satellite common ground system compliance with DoD Data Denial requirements; DoD lead on Antarctic treaty activities at McMurdo Station, Antarctica; develop METOC data strategy; develop DoD National Space Weather Strategy.\n- Non-Intelligence Space Programs Technical Assessments: Conducted non-intelligence space program technical reviews, to include data strategies, systems engineering, risks and mitigations. Supported acquisition decisions for weather satellite follow-on, JMS, and Launch Vehicle New Entrants. \n– PNT Technical Assessments:  Conducted technical reviews of all phases of the GPS enterprise programs to increase the likelihood of a successful MGUE MS B in FY14 so that DoD is compliant with congressional mandates. Assessed high risk areas and developed mitigation strategies for cost effective delivery of capabilities. Developed initial roadmap for better synchronization of PNT programs and capabilities and for implementation of GPSEM\/PNT Assurance AoA recommendations.\n- Space Control\/Space C2: Conducted Space Protection Architectural Analysis; Improved Strategy and Roadmap for Space Control Mission area through 2025. Supported IIPT, OIPT, and DAB decisions on the JSpOC Mission System (JMS) program. Directed increased cyber testing of JMS program.\n- Space Protection: Conducted Space Protection Architectural Analysis; Implemented Enterprise Strategy & Roadmap for Space Control Mission area through 2025, conducted analysis to support Biennial update to Space Protection Strategy.\n- Defensive Space Control: Conducted analysis on next generation RAIDRS to enhance the enterprise architecture."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.423"
                                            },
                                            "Text": {
                                                "val": "- Cyber Investment Management: Synchronize and coordinate cyberspace acquisition activities, conduct quantitative assessments, and ensure cyberspace investments align with Department priorities, required capabilities and evolving cyber threats. Provide support of the Cyber Investment Management Board and develop implementation guidance and associated direction.  Continue to plan and conduct CIMB\/CCT meetings to refine the cyber investment portfolio and to identify strategic cyber issues the DoD will face in the future.\n- Refine the Cyber investment portfolio results to include return on investment and risk ultimately leading to an optimization phase focusing on process improvement.\n- Conduct investment analysis of the DoD-wide Cyber Special Access Program (SAP) portfolio to include return on investment and risk.\n- Conduct Cyber Rapid Acquisition Process Pilots to allow insight into timelines and potential areas of improvement for new rapid cyber acquisition processes.\n- Utilize the results of the Process Pilots to implement the new rapid cyber acquisition processes across DoD.\n- Complete development and implementation of Cybersecurity Guidebook for Program Managers. Contribute to any follow on efforts to revise policy or guidance regarding Cybersecurity within the Acquisition process.\n- Complete the Cyber Situational Awareness EoA (phase I) and commence work on phase II with a focus on Defend the Nation (DTN). \n- Define future Cyber Range Enterprise and the need for an Executive Agent. Conduct technical analysis and assessment of cyber range capabilities and capacity versus need. Develop DoD Cyber Range strategy, working with T&E and DOT&E and JS.\n- Conduct technical analysis to determine tools necessary to help collect, measure, assess DCO\/OCO effectiveness and suitability in a Cyber Range Environment. \n- Complete a quantitative assessment of OCO capabilities for Phases 0\/1 of military operations; repeat process for phases 2 and 3.\n- Conduct OCO Requirements and Architecture Analysis: support flow of requirements from Cyber Attack ICD to more detailed requirements for OCO capabilities; develop and refine OCO architectures.\n- C4ISR Acquisition: Provide technical assessments and programmatic recommendations across C4ISR functional areas to address interoperability gaps and work early in the systems engineering and development processes to minimize gaps as systems are delivered and updated.\n- CDL Principal Staff Assistant: Coordinate with CDL Executive Agent to develop a technology roadmap and terminal database to improve interoperability, configuration management, and focused technology investments.  Develop documentation for Remote Video Terminal (RVT) waveforms to enable competition of CDL procurements.  Develop transition strategy to converge on a DoD standard for tactical ISR communications.\n- Protected SATCOM AoA: Conduct analysis necessary to ensure the Department of Defense (DoD) pursues the most suitable alternative for providing space-based protected satellite communications services.  The goal of the AoA is to facilitate high caliber analysis, fair treatment of options, and decision-quality outcomes to inform the MDA at the next Milestone and shape\/scope the RFP for the next acquisition phase- MUOS System End-to-End Integration: Develop comprehensive systems engineering, test and terminal certification plans. Assess military standard\/specifications and interface control documents for configuration management. Engineer the system to minimize efforts required to certify new MUOS end user terminals. \n- FAB T: Provide programmatic analysis, technical reviews, and assessments of the FAB-T program and Presidential and National Voice Conferencing (PNVC) program to reduce development, integration, and procurement risks. Provide assessments and prepared for staffing Acquisition Strategy, Milestone C DAB preparation, ADMs, ICE, APB, TEMP, and SEP as well as other acquisition documents.\n- Handheld, Manpack, and Small Form Fit (HMS) JTRS:  Assess the HMS program to include the risk of vendor selected radios (Modified Non-Developmental Item). Conduct independent technical reviews and recommend program performance improvement options to meet cost, schedule and performance objectives. Provide a technical assessment of full and open competition process for both Rifleman and Manpack radios.\n- Mid-Tier Networking Vehicular Radio (MNVR) JTRS:  Assess the AMNVR program to include the risk of vendor selected radios (Modified Non-Developmental Item). Conduct independent technical reviews and recommend program performance improvement options to meet cost, schedule and performance objectives. Provide a technical assessment of full and open competition process for MNVR radios.\n– Dismounted Tactical Edge Mobile Applications:  Characterize current performance (bandwidth, latency, jitter, persistence) of disadvantages intermittent low bandwidth tactical links based on measured SRW and narrowband SATCOM performance.  \n– Ground\/Air\/Space integrated Networks Performance Assessment:  Facilitate the development and analysis of waveform capabilities. Evaluate new waveform technologies, wireless communications waveform development and management. Perform technical assessments of onboard processing on UAS systems to reduce demand for communications link bandwidth and identify accelerated methods to achieve certified test data for non-developmental products.\n-  Aerial Networks Roadmaps and Systems Engineering: Develop roadmaps to address air-ground\/air-space domain. Evaluate Army, Navy, Air Force system architectures for alignment with aerial networks roadmaps. Develop detailed risk reduction and technology maturation investment plans to accelerate fielding of advanced TDLs to 5th generation fighters.\n- Ground Tactical Networks Advanced Capabilities:  Develop narrowband capability to enable dismounted troops to operate in jungle canopy, support agile division-wide task reorganization and close air support while reducing network management forward support footprint.\n- Integrated Electromagnetic Spectrum Operations (EMSO): Build technical development strategy for co-architecting Electronic Warfare (EW) and radio devices to enable integrated EMSO to improve EM battlespace awareness, ensure agile response to changing adversary threats and reduce costs of combined capabilities.\n- Warfighter Information Network - Tactical (WIN-T) Assess complexity of Soldier Network Extension (SNE) and Point of Presence (PoP) to address complexity and usability issues identified during operational testing.  Identify applications to improve the company commander's effectiveness in using SATCOM terminals in the SNE.\n- Joint C2 Portfolio Management: Support development, integration and test activities across the Services, Agencies and Combatant Commands and deliver the FY15-20 version of the Joint C2 Sustainment and Modernization Plan.\n– Adaptive Planning and Execution (APEX):  Provide management oversight of APEX acquisition activities and authoritative data sources as the APEX technical integrator. Update the APEX technical architecture to better integrate operational, logistics and intelligence planning with force projection and execution. Update APEX data architecture and standards and synchronize with APEX framework for application across DoD. \n- C2 Data: Provide technical expertise for ensuring C2 data are visible, accessible, understandable, trustable and interoperable. Provide technical assessment and assistance for implementation of National Information Exchange Model (NIEM)-based information exchanges across the DoD. Update the C2 Authoritative Data Source roadmap and update C2 data architecture.\n– Joint C2 Architecture: Provide technical direction and management oversight for the update the Joint C2 Architecture to guide Joint C2 capability area development activities across the Services, Agencies and Combatant Commands.\n– C2 Analyses: Provide conceptual foundation, metrics and empirical evidence to operationalize Agile C2. Provide technical support to US participation in NATO and other international C2 research efforts.\n– Acquisition Management: Provide technical assistance in developing IT related acquisition policy, including updates to DoD Series 5000 necessitated by changes in statue, regulation and management direction.\n-Space Access:  conduct limited review of National Security Space Access and Space Range Roadmap; conduct SATOPS modernization assessment; conduct AFSCN Event-driven Net Centric Review\/Technical Assessment.\n– Environmental Monitoring: Develop DoD inputs for annual Federal Plan for Meteorological Services and Supporting Research; Lead METOC Data Denial Implementation team; Develop METOC\/Weather Enterprise Strategy and Roadmap implementing results of Defense Weather Analysis of Alternatives (AoA); conduct assessment of USG weather satellite common ground system compliance with DoD Data Denial requirements; DoD Lead on Antarctic treaty activities at McMurdo Station, Antarctica; implement METOC data strategy; implement DoD National Space Weather Strategy\n– Space Control\/Space C2\/SSA: Complete GEO SSA Architectural\/Cost-Benefit Analysis;; Develop & publish Policy for use of civil and international sources of SSA data in military operations; conduct Joint Space Operations Center (JSpOC) Mission System (JMS) NCR\/Technical Assessment; conduct CCS NCR\/Technical Assessment;; Evaluate and update as necessary Enterprise Strategy & Roadmap for Space Control Mission Area.\n– Non-Intelligence Space Programs Technical Assessments:\nPerform cyber vulnerability assessments on space, PNT, and METOC programs, including JMS, GPS, OCX, AFSCN, MGUE and others. Review system design documents, control plans, remote management control ports and methods. Recommend corrective actions to specific space, PNT, and METOC programs to address cyber vulnerabilities and to inform milestone decisions. Conduct non-intelligence space program technical reviews on to include data strategies, systems engineering, risks and mitigations. Support acquisition milestone decisions for programs including weather satellite follow-on, Launch Vehicle New Entrants, and SSBS follow-on activities.\n– PNT Programs Technical Assessments:  Conduct deep dive technical analyses to understand all phases of the GPS enterprise programs. Review PNT programs for data strategies, systems engineering, risks and mitigations in support of milestone decisions. \n– PNT Portfolio Management:  Implement GPSEM\/PNT Assurance Investment Strategy and Roadmap, ensuring AoA recommendations are addressed. Implement NAVWAR Investment Strategy and Roadmap as well as material in support of major program milestones and internal OSD reviews."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.562"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.562"
                                            },
                                            "Text": {
                                                "val": "- Cyber Investment Management: Synchronize and coordinate cyberspace acquisition activities, conduct quantitative assessments, and ensure cyberspace investments align with Department priorities, required capabilities and evolving cyber threats. Provide support of the Cyber Investment Management Board and develop implementation guidance and associated direction.  Continue to plan and conduct CIMB\/CCT meetings to refine the cyber investment portfolio and to identify strategic cyber issues the DoD will face in the future.\n- Refine the Cyber investment portfolio results, ensuring return on investment and risk ultimately leading to an optimization phase focusing on process improvement is included.\n- Conduct investment analysis of the DoD-wide Cyber Special Access Program (SAP) portfolio to include return on investment and risk.\n- Utilize the results of the Cyber Rapid Acquisition Process Pilots to implement the new rapid cyber acquisition processes across DoD, ensuring DoD Acquisition Policy is updated to reflect processes.\n- Manage Cybersecurity Guidebook for Program Managers. Contribute to any follow on efforts to revise policy or guidance regarding Cybersecurity within the Acquisition process.\n- Oversee implementation of the Cyber Situational Awareness EoA (phase I and II) recommendations. \n- Implement DoD Cyber Range strategy, working with T&E and DOT&E and JS.\n- Conduct technical analysis to determine tools necessary to help collect, measure, assess DCO\/OCO effectiveness and suitability in a Cyber Range Environment. \n- Complete a quantitative assessment of OCO capabilities for Phases 0\/1 of military operations; repeat process for phases 2\/3.\n- Conduct OCO Requirements and Architecture Analysis: support flow of requirements from Cyber Attack ICD to more detailed requirements for OCO capabilities; develop and refine OCO architectures.\n- C4ISR Acquisition: Provide technical assessments and programmatic recommendations across C4ISR functional areas to address interoperability gaps and work early in the systems engineering \n– QCDI\/FLOWNET: Conduct an analysis in an approved A2AD scenario to understand investments in communications capabilities and ensure synchronization of the space, aerial, surface and terminal segments in order to provide communications in degraded communications environments. Conduct detailed analysis on Army TBCT tactical networks as well as extensions into airborne network structures to validate quantitatively the performance and projected benefits of different waveforms and networks.\n-  Acquisition Management: Provide technical assistance in developing IT related acquisition policy, including updates to DoD Series 5000 necessitated by changes in statue, regulation and management direction.\n– MUOS AoA Support:  Conduct MUOS follow-on study to determine potential courses of action for replacing the MUOS system in 2025. Develop study plan, architectural alternatives, detailed blue force demand profiles, threat laydowns and cost models as well as desired requirements for future narrowband access\n- Handheld, Manpack, and Small Form Fit (HMS) JTRS:  Assess the HMS program to include the risk of vendor selected radios (Modified Non-Developmental Item). Conduct independent technical reviews and recommend program performance improvement options to meet cost, schedule and performance objectives. Provide a technical assessment of full and open competition process for both Rifleman and Manpack radios.\n- Mid-Tier Networking Vehicular Radio (MNVR) JTRS:  Assess the AMNVR program to include the risk of vendor selected radios (Modified Non-Developmental Item). Conduct independent technical reviews and recommend program performance improvement options to meet cost, schedule and performance objectives. Provide a technical assessment of full and open competition process for MNVR radios.\n- All JTRS(HMS, MNVR, AMF, JTN)Programs - Provide assessments of program compliance with IT related acquisition policy, in accordance with DoD Series 5000 and applicable senior management direction.   Assess readiness for major acquisition program milestone reviews, to include adequate documentation of compliance with statute\/regulation\/policy associated with acquisition program oversight.   Provide programmatic recommendations regarding cost\/schedule\/performance tradeoffs.\n- Ground Tactical Networks Advanced Capabilities:  Mature narrowband dismounted communications capability with radio hardware prototype, robust modeling and simulation, and reusable software code.  Form industry engagement to promote transition into non-developmental item radios.\n- Integrated Electromagnetic Spectrum Operations (EMSO): Track implementation of iEMSO strategy in radio and EW device development plans.  Assess and down-select technical interoperability and architectural approaches.  Ensure adequate funding and testing to assess maturity of solutions.\n- Tactical Data Link Modernization:  Lay in Department governance structure to collectively guide modernization of key TDLs challenges in alignment with AT&L Aerial Networking communications technology roadmap to address A2AD and advanced threats.  Build joint system engineering organization structure to support deep technical analysis of performance and cost trades and promote more rapid adoption of TDL improvements across Components. \n- Warfighter Information Network – Tactical (WIN-T):  Provide analysis of WIN-T voice, video and data performance during final operational testing and evaluation.  Ensure system meets requirements thresholds and determine any external conditions or internal components that significantly affect packet completion ratios, throughput, latency and jitter. \n- C2 Technical Analysis: Provide technical analysis for the development of C2 Capability Delivery Increments to guide the evolution of joint and Service C2 programs and functional requirements. Synchronize C2 development efforts with Defense Intelligence Information Enterprise efforts, develop initial C2 CDI roadmap and update the C2 CDI roadmap with linkages to ISR programs for intelligence-operations information sharing.\n-  Joint C2 Portfolio Management: Support development, integration and test activities across the Services, Agencies and Combatant Commands and deliver the FY16-21 version of the Joint C2 Sustainment and Modernization Plan.\n– Adaptive Planning and Execution (APEX):  Provide management oversight of APEX acquisition activities and authoritative data sources as the APEX technical integrator. Update the APEX technical architecture to better integrate operational, logistics and intelligence planning with force projection and execution. Update APEX data architecture and standards and synchronize with APEX framework for application across DoD. \n- C2 Data: Provide technical expertise for ensuring C2 data are visible, accessible, understandable, trustable and interoperable. Provide technical assessment and assistance for implementation of National Information Exchange Model (NIEM)-based information exchanges across the DoD. Update the C2 Authoritative Data Source roadmap and update C2 data architecture.\n- Joint C2 Architecture: Provide technical direction and management oversight for the update the Joint C2 Architecture to guide Joint C2 capability area development activities across the Services, Agencies and Combatant Commands.\n– C2 Analyses: Provide conceptual foundation, metrics and empirical evidence to operationalize Agile C2. Provide technical support to US participation in NATO and other international C2 research efforts.\n- Friendly Force Tracking\/ Combat Identification: Provide technical assessment, assistance and recommendations for achieving Mode 5 IFF IOC and FOC. Provide technical support to NATO C3B Capability Panel on Combat Identification. Ensure that NATO Standardized Agreement (STANAG) 4193 incorporate changes necessary for compatibility \/ interoperability with DoD Mode 5 technical standards. \n– Acquisition Management: Provide technical assistance in developing IT related acquisition policy, including updates to DoD Series 5000 necessitated by changes in statue, regulation and management direction.\n- Space Access: Oversee implementation of for National Security Space Access & Space Range Roadmap; conduct SATOPS Modernization technical assessments; provide technical Oversight\/AFSCN Modernization Implementation.\n- Space Access: Develop EELV New Entrant Strategy\/Technical Assessment & Cost Benefit Analysis\/Potential AoA for EELV follow-on; develop implementation plan for National Security Space Access & Space Range Roadmap; conduct SATOPS Modernization technical assessments; provide technical Oversight\/AFSCN Modernization Implementation; conduct AFSCN Event Driven Net Centric Review\/Technical Assessment.\n– Environmental Monitoring: Develop DoD inputs for annual Federal Plan for Meteorological Services and Supporting Research; Lead METOC Data Denial Implementation team; Update as required METOC\/Weather Enterprise Strategy and Roadmap and oversee implementation of results of Defense Weather Analysis of Alternatives (AoA); conduct assessment of USG weather satellite common ground system compliance with DoD Data Denial requirements; DoD Lead on Antarctic treaty activities at McMurdo Station, Antarctica; implement METOC data strategy; implement DoD National Space Weather Strategy\n- Space Control\/Space C2\/SSA: Complete GEO SSA Architectural\/Cost-Benefit Analysis; Evaluate and update as necessary Enterprise Strategy & Roadmap for Space Control Mission Area.\n- Non-Intelligence Space Programs Technical Assessments:\nPerform cyber vulnerability assessments on space, PNT, and METOC programs, including EELV, SBSS Follow on, Space Fence, and others. Review system design documents, control plans, remote management control ports and methods. Recommend corrective actions to specific space, PNT, and METOC programs to address cyber vulnerabilities and to inform milestone decisions. Conduct non-intelligence space program technical reviews on to include data strategies, systems engineering, risks and mitigations. Support acquisition milestone decisions for programs including weather satellite follow-on, Launch Vehicle New Entrants, and SSBS follow-on activities.\n- PNT Programs Technical Assessments:  Conduct deep dive technical analyses to understand all phases of the GPS enterprise programs. Review PNT programs for data strategies, systems engineering, risks and mitigations in support of milestone decisions. \n- PNT Portfolio Management:  Implement GPSEM\/PNT Assurance Investment Strategy and Roadmap, ensuring AoA recommendations are addressed. Implement NAVWAR Investment Strategy and Roadmap as well as material in support of major program milestones and internal OSD reviews.\n– PNT NATO and Allied Interoperability: Ensure PNT capabilities are interoperable and supportable with other relevant commercial, civil and military Allied systems.\n-  PNT Strategy: Develop enterprise level acquisition strategies & policies in relation to PNT. Oversee implementation and compliance of the GPS Security Policy."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "In executing JTDL tasking, existing fixed-price and cost-plus contracts will be utilized.\n-Program reviews in support of the JCIDS, acquisition and PPBE processes."
                        },
                        "PerformanceMetrics": {
                            "val": "Enterprise-Wide Alignment: Accelerate DoD information age transformation to increase the effectiveness and efficiency of the warfighting, intelligence and business missions.\nMeasures:\n-  Timely development and issuance of policy and guidance\n-  Instantiation of enterprise-wide system engineering for the Global Information Grid across DoD\n\nPortfolio Management:  Provide for the timely and effective delivery of key Net-Centric capabilities through portfolio management of associated technology development and Major Defense Acquisition Programs (MDAPS) and Major Automated Information Systems (MAIS).\nMeasures:\n-  Key milestones completed for major net-centric acquisitions \n-  Number of major systems successfully completing net-centric critical performance reviews"
                        }
                    }
                }
            ]
        }
    }
}