{
    "id": "d2f05c3ea1d31f92ee6680cec76d14712ee129e1",
    "meta": {
        "filename": "dod-2015_RDTE_2015_OSD_RDTE_JustificationBook_Office_of_Secretary_Of_Defense_PB_2015.zzz_unzipped_RDTE_JustificationBook_Office_of_Secretary_Of_Defense_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605104D8Z"
        },
        "ProgramElementTitle": {
            "val": "Technical Studies Support and Analysis"
        },
        "R1LineNumber": {
            "val": "139"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "33.001"
            },
            "PriorYear": {
                "val": "30.951"
            },
            "CurrentYear": {
                "val": "21.930"
            },
            "BudgetYearOne": {
                "val": "24.501"
            },
            "BudgetYearOneBase": {
                "val": "24.501"
            },
            "BudgetYearTwo": {
                "val": "25.104"
            },
            "BudgetYearThree": {
                "val": "26.108"
            },
            "BudgetYearFour": {
                "val": "25.818"
            },
            "BudgetYearFive": {
                "val": "25.303"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program is a key source of funding for the Office of the Secretary of Defense and the Joint Staff to manage studies, analysis, management, and technical support efforts strategically to improve and support policy development, decision making, management and administration of DoD programs and activities. Studies and analysis will examine current and alternative policies, plans, operations, strategies and budgets, and are essential for managing and responding to the ever-changing complex international, political, technological, economic, military, and acquisition environments in which national security planning decisions are made.  The need for independent analysis has become particularly acute with the evolution of requirements for planning the strategic redeployment of forces in the face of technological challenges and resource constraints, and there is a strong need to incorporate the effects of operational analysis in force planning assessments. With the persistently complex security, threat, and economic environment, the need for objective analysis and forward looking planning for the mid and long-term is vital.\n\nIn FY 2014 the budget request for the Global Theater Security Cooperation Management Information Systems (TSCMIS) program will be transferred to the Defense Security Cooperation Agency.  TSCMIS is an existing program that will be executed by the Joint Staff separately from the Technical Studies, Support, and Analysis program. The Global Theater Security Cooperation Management Information Systems program responds to OSD's Guidance for Employment of the Force so that Combatant Commanders, Military Department Chiefs, CSA Directors, and applicable Defense Agency and Field Activity Directors are able to use a tracking mechanism to account for their steady-state activities that is accessible to other DoD components. Together these tracking mechanisms will provide a global view of all steady-state activities conducted by DoD components. The intent of this program is to encourage further development of tracking mechanisms in order to achieve full visibility of Defense Department activities."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "32.266"
                },
                "CurrentYear": {
                    "val": "24.379"
                },
                "BudgetYearOne": {
                    "val": "24.589"
                },
                "BudgetYearOneBase": {
                    "val": "24.589"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "30.951"
                },
                "CurrentYear": {
                    "val": "21.930"
                },
                "BudgetYearOne": {
                    "val": "24.501"
                },
                "BudgetYearOneBase": {
                    "val": "24.501"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.315"
                },
                "CurrentYear": {
                    "val": "-2.449"
                },
                "BudgetYearOne": {
                    "val": "-0.088"
                },
                "BudgetYearOneBase": {
                    "val": "-0.088"
                }
            },
            "AdjustmentDetails": {
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "-2.949"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "2.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.366"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Strategic Efficiency Savings"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.088"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.088"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FY 2014 Program Adjustments"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "-2.400"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "-0.049"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The reduction is a strategic efficiency approach to reduce funding and staffing.  As a result, we provide a better alignment of funding and provide support to a smaller military force.\n\nIn FY 2014 and beyond Global Theater Security Cooperation Management Information Systems was transferred to Defense Security Cooperation Agency.\n\nAs part of the Department of Defense reform agenda, the budget estimate trend reflects a reduction in the number and cost of reports and studies below the aggregate level reported in previous budget submissions."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P421"
                    },
                    "ProjectTitle": {
                        "val": "Technical Studies"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "33.001"
                        },
                        "PriorYear": {
                            "val": "30.951"
                        },
                        "CurrentYear": {
                            "val": "21.930"
                        },
                        "BudgetYearOne": {
                            "val": "24.501"
                        },
                        "BudgetYearOneBase": {
                            "val": "24.501"
                        },
                        "BudgetYearTwo": {
                            "val": "25.104"
                        },
                        "BudgetYearThree": {
                            "val": "26.108"
                        },
                        "BudgetYearFour": {
                            "val": "25.818"
                        },
                        "BudgetYearFive": {
                            "val": "25.303"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This program is a key source of funding for the Office of the Secretary of Defense and the Joint Staff for studies, analysis, management, and technical support efforts to improve and support policy development, decision making, management and administration of DoD programs and activities. Studies and analysis will examine current and alternative policies, plans, operations, strategies and budgets, and are essential for managing and responding to the ever-changing complex international, political, technological, economic, military, and acquisition environments in which national security planning decisions are made.  The need for independent analysis has become particularly acute with the evolution of requirements for planning the strategic redeployment of forces in the face of technological challenges and resource constraints, and there is a strong need to incorporate the effects of operational analysis in force planning assessments. With the persistently complex security, threat, and economic environment, the need for objective analysis and forward looking planning for the mid and long-term is vital.\n\nFrom FY 2010 through FY 2013 this program element included funding for the Global Theater Security Cooperation Management Information Systems (TSCMIS) Program, which is a separate program from the OSD Technical Studies, Support & Analysis program.  TSCMIS is an existing program which provides a global view of all steady-state activities conducted by DoD components and enables that information to be accessible by other DoD components.  Proposed enhancements to TSCMIS will enable all of the Services and Combatant Commands to access information in this system and will allow the incorporation of data provided by other interagency partners.    The budget request for the TSCMIS program was transferred to the Defense Security Cooperation Agency beginning in FY 2014."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Technical Studies and Analyses Support for the Office of the Secretary of Defense"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "23.942"
                                            },
                                            "Text": {
                                                "val": "Technical Support for the USD(Acquisition, Technology & Logistics):\nStudies and analyses of:\n\nStrengthening peacekeeping and counter-insurgency capabilities of allied states, strategic command and control, aircraft engine sustainment, air and missile defense capabilities integration, future vertical lift requirements, cybersecurity operational requirements, overhead infrared technology, space launch capabilities sustainment, Global Positioning System service capabilities, anti-counterfeiting strategy in the supply chain, foreign acquisitions in defense-related firms, commercial imaging industrial capabilities, strengthening allied cooperative efforts in weapons systems research and development, policy implications of changes in allied defense capabilities, anti-tampering technology safeguards, operational logistics requirements, strategic basing requirements, improving resource efficiency in DoD installations, energy requirements in contingency operations and conventional conflicts, logistics infrastructure requirements, NATO policy planning, identifying acquisition program risk, affordability of acquisition programs and preventing cost growth in investment programs, support to Defense Science Board task forces on various evolving technological and policy issues, small business investment and acquisition strategy, the effectiveness of the Small Business Innovation Research (SBIR) program, and DoD contracting policies toward small businesses\n\nTechnical Support for the Director, Cost Assessment and Program Evaluation:\nStudies and analyses regarding the following areas:\n\nAssessments of active and reserve force structure and weapons systems performance and cost effectiveness, communications infrastructure planning, technical studies and analyses to support independent cost estimates and economic research, scenario analyses, electronic warfare capabilities, military disability claims processing requirements, space tracking and surveillance capabilities, weapons system survivability, munitions industrial base capabilities, special operations force planning, execution of investment programs, comparative analyses of alternative strategic and conventional weapons systems configurations and force levels, unmanned aerial vehicle options, and continuation of development of critical management instruments for measuring the long-term trends, strength and affordability of the defense program\n\nTechnical Support for the USD(Policy):\nStudies, analyses, and activities in the following areas:\n\nWeapons of mass destruction defense, anti-access threat planning, Asia-Pacific strategic opportunities and challenges, space assurance, developing deterrence strategies, airpower force structure, U.S. - Russia defense policy engagement, cyber strategy, countering infiltration, resiliency of logistics capabilities, sub-Saharan Africa counterterrorism requirements, joint stability operations requirements, information operations force structure, and strategic-level simulations of areas of interest for legislative and executive branch decision-makers\n\nTechnical Support for the USD(Personnel & Readiness):\nStudies and analyses in the following areas:\n\nMilitary manpower requirements and compensation policy, cyberspace workforce requirements, unmanned aerial vehicle personnel planning, military sexual harassment and violence prevention, retirement benefit policy, equal opportunity policy, improving military applicant screening, retaining key officer and senior enlisted personnel, and reserve policy planning\n\nTechnical Support for the USD(Intelligence):\nStudies and analyses of:\n\nStrategic nuclear balance, cyber situational awareness, improving cyber support to intelligence operations, and cyber investment strategies\n\nTechnical Support for the Joint Staff conducting joint research with OSD:\n\nStudies and analyses with OSD supporting global operational energy infrastructure, air warfare, small arms requirements, logistics planning, weapons of mass destruction consequence management, geopolitical contingency policy planning, and joint contingency basing requirements"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "21.930"
                                            },
                                            "Text": {
                                                "val": "Technical Support for the USD(Acquisition, Technology & Logistics):\nStudies and analyses of:\n\nPersonal protection equipment from weapons of mass destruction, satellite ground control systems, space portfolio architectures, Allied technology and warfighting capability planning, strategic command and control recapitalization requirements, Arctic mission requirements, conventional munitions, network interoperability in the acquisition process, space and missile industrial base capabilities assessments, cyber infrastructure planning, technical requirements for arms control treaty compliance, future technology requirements in defense manufacturing, foreign investment in the defense industry, improving the use of commercial technology from small manufacturers, impacts of regulations on industry, the shipbuilding supplier industrial base, the effect of service life extension on support costs, measuring system reliability, modeling supply chain performance in the acquisition process, maintenance technology investment planning, strategic basing requirements, DoD installation sustainability, DoD energy and logistic strategic planning, NATO investment planning, identifying acquisition program risk, support to Defense Science Board task forces on various evolving technological and policy issues, small business investment and acquisition strategy, the effectiveness of the Small Business Innovation Research (SBIR) program, and DoD contracting policies toward small businesses\n\nTechnical Support for the Director, Cost Assessment and Program Evaluation:\nStudies and analyses regarding the following areas:\n\nContingency operations planning, aircraft and vertical lift system evaluation, force structure planning, active and reserve personnel force models, assessments in support of scenario analyses, cyber requirements, military healthcare cost growth, economic development effectiveness in counterinsurgency operations, technical studies and analyses to support independent cost estimates and economic research, comparative analyses of alternative strategic and conventional weapons systems configurations and force levels, and continuation of development of critical management instruments for measuring the long-term trends, strength and affordability of the defense program\n\nTechnical Support for the USD(Policy):\nStudies, analyses, and activities in the following areas:\n\nRegional and strategic defense posture, maintaining regional deterrence and counterproliferation, strengthening regional peacekeeping operations, NATO policy engagement, international defense trade relationships, European crisis coordination planning, missing personnel recovery capabilities, cyber consequence management, space strategic guidance planning and sensing capabilities, homeland defense and civil\/reserve support requirements, border security and evolving threats, and strategic-level simulations of areas of interest for legislative and executive branch decision-makers\n\nTechnical Support for the USD(Personnel & Readiness):\nStudies and analyses in the following areas:\n\nRecruiting and retention issues, strengthening veteran support programs and veteran civilian transition programs, controlling healthcare and manpower costs, forecasting the impacts and the development of mitigation strategies for impacts of potential force drawdowns, reserve component readiness and sustainability, military compensation policy, civilan workforce sustainability, improving outcomes in DoD education activities, sexual assault prevention, and the most efficient and effective uses of the Total Force\n\nTechnical Support for the USD(Intelligence):\nStudies and analyses of:\n\nCounterintelligence capabilities, military intelligence language specialties, technology in intelligence collection, improving allied surveillance interoperability, operational security effectiveness and countermeasures analyses, and risk management for the security enterprise\n\nTechnical Support for the Joint Staff conducting joint research with OSD:\n\nStudies and analyses with OSD addressing force projection capabilities, supportability of contingency operations, standoff attack capabilities, joint command and control, and joint maintenance capabilities improvement"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "24.501"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "24.501"
                                            },
                                            "Text": {
                                                "val": "Technical Support for the USD(Acquisition, Technology & Logistics):\nStudies and analyses of:\n\nJoint warfighting capability and technology planning, strategic and conventional system technology, counter WMD defense capabilities, space portfolio architectures, industrial base capabilities assessments, cyber operational requirements, defense manufacturing technology, acquisition policy effectiveness, global defense industry trends, technolgies for evolving mission requirements, allied defense capabilities, strategic basing requirements, DoD installations planning, logistics supply chain and energy requirements, NATO policy planning, treaty compliance requirements, identifying acquisition program risk, support to Defense Science Board task forces on various evolving technological and policy issues, small business investment and acquisition strategy, the effectiveness of the Small Business Innovation Research (SBIR) program, and DoD contracting policies toward small businesses\n\nTechnical Support for the Director, Cost Assessment and Program Evaluation:\nStudies and analyses regarding the following areas:\n\nStrategic tradeoffs and risk management, maintaining force readiness, personnel force models, assessments in support of scenario analyses, military health programs, technical studies and analyses to support independent cost estimates and economic research, comparative analyses of alternative strategic and conventional weapons systems configurations and force levels, and continuation of development of critical management instruments for measuring the long-term trends, strength and affordability of the defense program\n\nTechnical Support for the USD(Policy):\nStudies, analyses, and activities in the following areas:\n\nRegional and strategic defense posture, international defense policy planning, deterrence and counterproliferation requirements, international defense trade and industrial relationships, NATO requirements planning, technological and external effects on strategic requirements, space and cyber strategic guidance planning, contingency humanitarian operations, countering nascent terrorist development, and strategic-level simulations of areas of interest for legislative and executive branch decision-makers\n\nTechnical Support for the USD(Personnel & Readiness):\nStudies and analyses in the following areas:\n\nActive and reserve recruiting and retention issues, compensation and legacy costs, forecasting the impacts and the development of mitigation strategies for impacts of potential force drawdowns, reserve component readiness and sustainability, military family issues, sexual assault prevention, and new strategies for managing the Total Force\n\nTechnical Support for the USD(Intelligence):\nStudies and analyses of:\n\nSurveillance technologies and capabilities, risk management, and military intelligence capabilities\n\nTechnical Support for the Joint Staff conducting joint research with OSD:\n\nStudies and analyses with OSD addressing mobility capabilities, supply chain requirements, countering anti-access environments, force programming planning, and joint contingency basing requirements"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Global Theater Security Cooperation Management information Systems (TSCMIS) Program"
                                    },
                                    "Description": {
                                        "val": "Global Theater Security Cooperation Management Information Systems (TSCMIS) Program.  This item is a separate requirement from the Technical Studies, Support, and Analysis program beginning in FY 2010 and will be executed by the Joint Staff apart from the Technical Studies, Support, and Analysis program.\n\nOrganizations implementing TSCMIS include all of the Geographic Combatant Commands and the Army, and this program change will facilitate the inclusion of all of the Combatant Commands, all of the military services, DTRA, and DSCA.  Future years will result in the integration of other security cooperation databases, including foreign military sales, training databases, and other interagency partner databases into the TSCMIS portal."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.009"
                                            },
                                            "Text": {
                                                "val": "Program management ($1,026K); requirements management ($282K); software development ($2,340K); systems engineering ($1,760); testing ($450K); logistics management ($1,151K)"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "The budget request for the Global Theater Security Cooperation Management information Systems (TSCMIS) Program will be submitted by the Defense Security Cooperation Agency in FY 2014 and future fiscal years."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Program was transferred to the Defense Security Cooperation Agency in FY 2014."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "FY 2015 BA: $21.001    FY 2015 BA Assoc w\/Metrics: $21.001M    Percent FY 2015 BA Assoc w\/Metrics: 100%\n\nThis program conducts approximately one-hundred actions per fiscal year to support a wide variety of national security goals of the Department and is designed to encourage a collaborative research approach among the components of OSD and the Joint Staff.  The research and study projects supported by this program are closely integrated with the strategic goals of the Department of Defense.  The focus of studies varies across a wide spectrum including weapons systems cost analysis, strengthening and leveraging alliances, human resource and military personnel management, examination of innovative technologies, application of technology to operational doctrine, and many other issues of emerging importance.  Most of the actions are long to intermediate-range in outlook, and the program allows organizational leaders to plan and guide their research toward meeting their highest-priority goals and other high-level guidance such as executive branch performance management objectives, the Quadrennial Defense Review, and the National Security Strategy of the United States of America.\n\nIn following the program efficiencies guidance of the Secretary of Defense, the scope and detail of studies and analyses will be abridged in order to focus upon issues of the highest strategic importance to the Department of Defense while continuing to make every effort to support requirements from legislative direction."
                        }
                    }
                }
            ]
        }
    }
}