{
    "id": "d443d35c861c838fac5b51d025bcdb1355a660f2",
    "meta": {
        "filename": "dod-2015_RDTE_2015_DTIC_RDTE_JustificationBook_Defense_Technical_Information_Center_PB_2015.zzz_unzipped_RDTE_JustificationBook_Defense_Technical_Information_Center_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Defense Technical Information Center",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605801KA"
        },
        "ProgramElementTitle": {
            "val": "Defense Technical Information Center"
        },
        "R1LineNumber": {
            "val": "161"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Defense Technical Information Center"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "114.059"
            },
            "PriorYear": {
                "val": "50.839"
            },
            "CurrentYear": {
                "val": "56.024"
            },
            "BudgetYearOne": {
                "val": "50.789"
            },
            "BudgetYearOneBase": {
                "val": "50.789"
            },
            "BudgetYearTwo": {
                "val": "48.194"
            },
            "BudgetYearThree": {
                "val": "50.594"
            },
            "BudgetYearFour": {
                "val": "50.194"
            },
            "BudgetYearFive": {
                "val": "51.394"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Defense Technical Information Center’s (DTIC) unique mission is to provide rapid, accurate, and reliable access to essential research, development, test, and evaluation (RDT&E) information, supporting all DoD users.  DTIC, a DoD Field Activity, is the DoD’s singular executive agent and designated source for DoD-funded scientific, technical, engineering, and industry-related information.  DTIC operates DoD Information Analysis Centers focused on Defense Systems, Cyber Security, and Homeland Defense and Security.   DTIC captures, preserves, protects, and shares research and development (R&D) information assets and connects communities.   These activities and results advance research by providing department level mapping of activities and results to researchers, warfighters, research and engineering (R&E) management, and decision makers.  DTIC manages this mapping through five key areas:\n\n1) Document and preserve what works, what has promise (reuse and additional investments).\n2) Determine dead-ends that do not merit additional investment (avoid waste).\n3) Facilitate and encourage engagement among cross-cutting Communities of Interest (bring together experts across the Acquisition Enterprise and warfighter community driving requirements).\n4) Present overarching picture of activity that optimizes decision-makers’ ability to coordinate and orchestrate multiple efforts into integrated capabilities (employ assets to highest priority efforts and coordinate efforts across services).\n5) Protect intellectual property (IP) and industry proprietary data assets entrusted to DTIC’s stewardship (access to those DoD trusts, protection from those we don’t).\n\nDTIC must accomplish its mission in an environment of Department-wide budget reductions while increasing our value.  DTIC is leading the Department in efforts to provide Open Access to DoD funded journal articles and research data.  We must ensure our activities are efficient and effective, meet users’ expectations, and employ industry best practices and standards, while protecting from cyber threats.\n\nDoD’s $120 Billion annual investment in research, development and procurement, support current and future capabilities to defeat our adversaries and protect national security.  The results of these efforts are a national asset that DTIC preserves and facilitates their reuse across the Acquisition Enterprise.  Approximately 21% of the 4 million records in DTIC’s information holdings are sensitive DoD only, federal government only and industry proprietary.  DTIC is the only enterprise source for both publicly accessible and DoD sensitive material in a single location.\n\nThe Information Analysis Center (IAC) Program Office at DTIC provides core funding, management and oversight of the IACs.  The IACs are chartered by DoD to collect, analyze, and disseminate worldwide scientific and technical information in specialized fields.  The IAC program is in a multi-year restructuring from ten IACs to three, reducing customer costs and reflecting new DoD technical interest areas.  The new structure will focus on three technology groupings, to include Cyber Security and Information Systems, Homeland Defense and Security, and Defense Systems.  As part of the Department’s Better Buying Power initiative, new multi-award contracts are being put into place, improving competition, small-business presence, and reducing government costs.  The restructured IAC Program will improve affordability, productivity, and standardization within defense acquisition programs.  Providing the Acquisition Enterprise access to thousands of industry Subject Matter Experts, DTIC’s IACs perform well over a billion dollars of customer funded research and prototyping support annually.  The results of the work are a rich source of material in DTIC’s information asset collections and are available to users across the Department (and other federal agencies, e.g. Department of Energy, Department of Homeland Security).\n\nThis Program Element (PE) supports DTIC mission operations.  DTIC focuses on core mission, and buys space, Human Resources, Financial Management, and civilian payroll services from expert and efficient providers:  funding provides for salaries and benefits of government civilian personnel assigned to DTIC; training, professional development, and travel for DTIC personnel; support agreements for Defense Logistics Agency (DLA) facility-related services; Defense Finance and Accounting Service (DFAS) financial activities and Human Resource (HR) services; Defense Information Services Agency (DISA) communications support; annual maintenance and licensing requirements; supplies, equipment, hardware\/software; and support contracts for Information Technology services, Defense Agencies Initiative (DAI) system integration, and Chief Financial Officer (CFO) Act compliance efforts in concert with the Department’s Financial Improvement and Audit Readiness (FIAR) program.  In addition, this PE provides funding in support of the Small Business Innovation Research (SBIR) and Small Business Technology Transfer (STTR) programs, in accordance with Public Law 111-251 (Small Business Reauthorization Act) and Small Business Technology Transfer Program Reauthorization Act.  Within the PE, an annual set-aside contribution totaling approximately $400,000 is provided to the DoD's Commercialization Pilot Program, as directed by the Department's Office of Small Business Programs (OSBP)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "55.454"
                },
                "CurrentYear": {
                    "val": "56.024"
                },
                "BudgetYearOne": {
                    "val": "55.577"
                },
                "BudgetYearOneBase": {
                    "val": "55.577"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "50.839"
                },
                "CurrentYear": {
                    "val": "56.024"
                },
                "BudgetYearOne": {
                    "val": "50.789"
                },
                "BudgetYearOneBase": {
                    "val": "50.789"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-4.615"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-4.788"
                },
                "BudgetYearOneBase": {
                    "val": "-4.788"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.046"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "-4.496"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "-0.073"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Changes"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-4.788"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-4.788"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Specific changes to the FY 2015 program (net reduction of $4.788 Million from the previous PB) are outlined below:\n\nProgram Changes (-$4.788 Million):  This program change represents the results of the Department’s Fiscal Guidance, and reflects the Defense Strategic Guidance (DSG), as informed by the Strategic Choices and Management Review (SCMR).  \n- Restructure Information Analysis Center (IAC) contract to create efficiencies and reduce costs to both DTIC and IAC customers.\n- Curtail operating activities across the enterprise, and defer modernization and development of DTIC tools and applications slated for DTIC’s various user communities.\n- Reorganize the web-hosting program.  Reduce DTIC appropriated funding support to necessary oversight activities, and pass all other web-hosting direct costs (to the extent allowed) to the customer organization.  DTIC will work with customers in their transition from the DTIC web-hosting environment, and assist them in the migration to other approved facilities.  During this divestiture process, DTIC’s appropriated support will be limited to less than $500,000.\n- Reduce DTIC HQ Management staff by 22 percent in FY 2015.\n- Adjust Continuity of Operations (COOP) plans and investments in light of the Data Center Consolidation initiative and the Department’s cloud services initiative. \n- Work to meet the Department’s audit readiness milestones while assuming additional program risk in FY 2015."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "001"
                    },
                    "ProjectTitle": {
                        "val": "Defense Technical Information Center"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "97.715"
                        },
                        "PriorYear": {
                            "val": "43.786"
                        },
                        "CurrentYear": {
                            "val": "48.971"
                        },
                        "BudgetYearOne": {
                            "val": "45.041"
                        },
                        "BudgetYearOneBase": {
                            "val": "45.041"
                        },
                        "BudgetYearTwo": {
                            "val": "42.446"
                        },
                        "BudgetYearThree": {
                            "val": "44.846"
                        },
                        "BudgetYearFour": {
                            "val": "44.446"
                        },
                        "BudgetYearFive": {
                            "val": "45.646"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "DTIC leads the DoD scientific and technical information (STINFO) program, and is responsible for developing, coordinating and enabling a strong STINFO program for the Assistant Secretary of Defense for Research and Engineering (ASD(R&E)) and the DoD scientific & technical (S&T) enterprise.  In this role, DTIC sets policy for scientific and technical information (STI) exchanges for the research and engineering (R&E) community.  DTIC’s aim is to maximize the availability and use of technical information and products resulting from Defense-funded technical activities while ensuring restrictions to safeguard national security, export control, and intellectual property rights.\n\nRecognizing the common elements across budget justification documents, progress reports, completed work reports, studies, and journal articles, DTIC is mapping relationships to enable users to access the life cycle of research projects from planning to final results. DTIC employs technology to verify and validate information submitted and improve user confidence in DoD research documentation.\n\nDTIC is leading the Department’s efforts to implement Open Access to published journal articles, and digital data from research funded by taxpayers. In this role, DTIC is actively working with partners across the Services and components.  Consistent with the Administration’s emphasis for open standards and machine readable formats, DTIC initiated the transition from paper and Portable Document Format (PDF) based information to WebService XML standard data submission and machine readable delivery.  DTIC partnered with the OSD Comptroller to collect investment account budget justification documentation in XML and embed this XML in PDF for justification books delivered to Congress.  We employed this same technology in collecting S&T progress reports from the Services and Agencies, and IR&D from industry. We are planning migration of completed technical reports collection to the same open standards – machine readable formats.\n\nThrough the use of commercial search technology, DTIC provides an industry leading search capability that is combined with its knowledge of the DoD domain and metadata that supports both text searches and data mining.  DTIC continually works to enable additional features within our search capabilities and from commercial partners to improve information discovery and relevance.\n\nWith the September 2013 initial operating capability (IOC) release of the commercial product based R&E Gateway, DTIC provides the means to connect 60,000+ members in the Acquisition Enterprise (DoD Labs, Federally Funded Research and Development Centers (FFRDCs), Program Executive Officers, Acquisition, Technology, and Logistics (AT&L) and Combatant Commands (CCMD).  In an access controlled environment all of DTIC’s unclassified assets, tools and community interaction capabilities foster innovation, competition and identification of solutions.  DoD conducts research at its 60+ labs, in the FFRDC’s, DTIC’s Information Analysis Centers (IACs), and across over a dozen distinct priority area communities of interest; all of this work is available through the R&E Gateway.\n\nTo protect data, DTIC maintains a database of registered users.  DTIC utilizes commercial software and follows DoD Identity Management Standards, while providing CAC users instant registration and authenticated access.  We are working with the Office of Personnel Management (OPM) to give users more control of their online profile and extend immediate access to federal government employees and contractors holding valid credentials. \n\nFocus on User Communities and Distribution Points:  DTIC supports user communities on the network where they work, NIPRNET, SIPRNET and Internet, and uniquely provides access controls within unclassified and classified material to protect intellectual property in our search, distribution, and collaboration tools.\n\n- DoD’s Acquisition Enterprise:  As a Field Activity to ASD(R&E)\/AT&L, DTIC’s priority is the Acquisition Enterprise, hosting information assets and tools on the NIPRNET (the primary network for the community).  During a time of sequestration and furloughs, DTIC has seen a 10% increase from FY12 to FY13 in registered user activity.   \n- Warfighter:  Improving coordination between the Acquisition Enterprise and warfighter communities, DTIC hosts as subset of information assets and tools on the SIPRNET.  DTIC is building these out.\n- Industry and Academia via Internet:  Engaging Industry outside the NIPRNET “firewall” to support Better Buying Power initiatives and encourage the introduction of innovation, DTIC hosts unclassified “public” information and tools accessible to all users on the Internet.  Open Access initiatives add importance to this distribution point.\n\nSummary.  DTIC protects and preserves DoD’s multi-billion dollar investment in research, which empowers the Acquisition Enterprise through innovative tools, information systems, and decision support capabilities.  The benefits can be enormous; each 1% increase in reuse of S&T, elimination of inefficient redundancy, increased community interaction, results in a more capable military and gives the DoD the opportunity to redirect >$100 Million.  DTIC is uniquely positioned to unleash the value of DoD’s R&D portfolio."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Defense Technical Information Center"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "43.786"
                                            },
                                            "Text": {
                                                "val": "- Launched the R&E Gateway.\n-- Created a uniform look with consistent navigation across DTIC’s suite of products (DoDTechSpace, DoDTechipedia, and Search).\n-- Provided a central search capabilities across all DTIC online products and services including (but not limited to) Technical Reports, DoDTechSpace, URED, and IR&D.\n-- Introduced a social business platform to enhance collaboration and networking across the Acquisition Enterprise.\n- Implemented additional search features and content on the Defense Innovation Marketplace to enable DoD to examine the state of industry R&D.\n-- Established web-based information exchanges for 2 of 14 Communities of Interest (COIs), to include Space and Human Systems.\n- Continued the multi-year effort to restructure the DTIC workforce to meet technical challenges.\n- Updated DoD Scientific and Technical Information Program (STIP) Instructions in collaboration with DoD agencies and Services; provided advice and guidance to DoD activities on policy interpretation and implementation.\n- Continued outreach to Combatant Commands, providing research of access controlled and classified resources and offering customized training."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "48.971"
                                            },
                                            "Text": {
                                                "val": "- Expand and enhance community support, search and analytic capability of DoD Research & Engineering (R&E) Gateway (formerly DoDTechSpace).\n-- Expanding access controls protecting industry proprietary data.\n-- Bring SIPRNET instance to same underlying commercial software version as NIPRNET.\n- Operate and enhance the Defense Innovation Marketplace, a key component of the Better Buying Power 2.0 initiative.\n-- Continue to develop and foster Communities of Interest (COIs) with the Services, to include C4ISR (C2, ISR, CyberSpace), Nuclear Weapons Enterprise, and Aero Enterprise.\n-- Enhance search capability by adding new sources of data, such as small business information, in one federated search.\n-- Develop “year-to-year” comparison metrics to improve analysis capabilities, and improve data quality of submitted Independent Research and Development (IR&D) data.\n-- Add DoD S&T project summaries status to give users a more complete picture of research activity.\n- As DoD’s lead activity to manage and implement the primary objectives associated with Open Access to Publications and Digital Data\n-- Continue to develop implementation plan and rules to implement.\n-- Develop rules covering grants, contracts, and internal research.\n-- Work with other DoD and federal agencies to deliver consistent guidelines, identify best practices.\n- In order to address increasing Open Access, Cyber, and Data Consolidation requirements, begin the replacement of a 20+ year old library content management system.\n- Meet DoD audit readiness milestones and requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "45.041"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "45.041"
                                            },
                                            "Text": {
                                                "val": "- Continue efforts as DoD’s lead activity to manage and implement the primary objectives associated with Open Access to Publications and Digital Data.\n-- Identify facilities for DoD digital data repositories.\n-- Continue the development of a monitoring and compliance mechanism.\n-- Develop an improvement plan.\n- Continue to expand and enhance collaboration, search and analytic capability of the DoD Research & Engineering (R&E) Gateway.\n-- Provide capability to collect and access classified research summaries.\n-- Continue to engage DoD communities and subject matter experts; work with partners to expand user-provided content and materials.\n- Deliver new library content management system for both classified and unclassified environments.\n-- Modify and enhance DoD research summaries to capture information related to Open Access of journal articles and digital data.\n- Continue to refine, evolve and improve Defense Innovation Marketplace capabilities in alignment with the Department’s Better Buying Power 2.0 initiative.\n-- Capture industry’s classified Independent Research and Development (IR&D).\n-- Continue to expand the number of Communities of Interest (COIs) within the Marketplace, to include Human Systems, Joint Service Autonomy, and Space.\n-- Work with industry partners to develop a project update capability, enabling users to modify and refresh project content.\n- Meet DoD’s audit readiness milestones and requirements.\n- Offer non-DoD federal employees Smart Card (e.g., Common Access Card, External Certificate Authority (ECA) card) access to DTIC’s products.\n- Begin the planning and implementation of Data Center migration to a DoD-CIO approved facility and\/or cloud service.\n- Continue activities to align with DoD’s Joint Information Environment (JIE)."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Community Interaction\n1) New Registered Users\n2) Total Active Users\n\nResearch Support and Library Repository\n1) Total Scientific and Technical Information (STI) Collected, to include competed work reports, work-in-progress summaries, and industry Independent Research and Development (IR&D)\n2) Total STI Disseminated, to include competed work reports, work-in-progress summaries, and industry Independent Research and Development (IR&D), Digitization Requests, and Web Inquiries\n3) Total STI holdings"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "002"
                    },
                    "ProjectTitle": {
                        "val": "Information Analysis Centers"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "16.344"
                        },
                        "PriorYear": {
                            "val": "7.053"
                        },
                        "CurrentYear": {
                            "val": "7.053"
                        },
                        "BudgetYearOne": {
                            "val": "5.748"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.748"
                        },
                        "BudgetYearTwo": {
                            "val": "5.748"
                        },
                        "BudgetYearThree": {
                            "val": "5.748"
                        },
                        "BudgetYearFour": {
                            "val": "5.748"
                        },
                        "BudgetYearFive": {
                            "val": "5.748"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "DoD Information Analysis Centers (IACs), established under DoD Instruction 3200.14, serve as a vital resource in providing timely, relevant information directly to users when and where it is needed. IACs serve as a bridge between the warfighter and the Acquisition\/Research community, providing essential technical analysis and data support to a diverse customer base, to include the Combatant Commands (CCMDs), the Office of the Secretary of Defense, Defense Agencies, and the Military Services. IACs actively partner and collaborate with Defense Research & Engineering focus groups and communities of interest in areas of specialized fields or specific technologies. The IACs create and maintain comprehensive knowledge analysis centers that include historical, technical, scientific, and other data and\ninformation collected worldwide. They are staffed with scientists, engineers and information specialists to provide research and analysis to customers with diverse, complex and challenging requirements. IAC operations directly support the warfighter, and play an ongoing and critical role in solving key CCMD operational issues such as cyber security, improvised explosive device (IED) defeat and helicopter survivability. \n\nThe IAC Program Management Office at DTIC performs contract acquisition, management, and operational support for IAC contract operations and the technical information that is generated as a result of research and studies.  In a time of shrinking budgets and increasing responsibility, IACs are a valuable resource for accessing Scientific and Technical Information culled from efforts to solve new and historic challenges. Direct IAC customer support activities, such as Technical Area Task (TAT) order processing, Basic Center Operations (BCO) support, Defense Finance and Accounting Service (DFAS) activities, contracting\/acquisition related activities, etc., are funded in part through partnerships with the Defense Research & Engineering community and the annual collection of customer reimbursements for shared direct costs, in accordance with the IAC Reimbursable Review Board (IRRB) recommendations, with OSD-COMPT and Office of General Counsel concurrence. This represents the maximum cost-sharing with IAC customers allowable, per guidance from the OSD Office of General Counsel. Annual IAC efforts and accomplishments are dependent on the level of participation and collaboration by the R&E community at large."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Information Analysis Centers"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.053"
                                            },
                                            "Text": {
                                                "val": "- Provided administrative oversight and basic core contract operations for DoD IACs to collect, analyze, synthesize and disseminate worldwide Scientific and Technical Information (STI) in support of DoD's critical technologies and the warfighter.\n- Responded to technical inquiries and provided in-depth S&T analysis; created and provided STI results via IAC websites; captured STI products from new\/on-going analysis tasks; and supported the exchange of information among members of the operational and technical communities.\n-  Executed acquisition strategy for BCO contracts for the IAC Program.\n- Awarded a small business set-aside contract for Homeland Defense and Security BCO.\n- Continued transition to new IAC Program contract structure utilizing Indefinite Delivery Indefinite Quantity (IDIQ) Multiple Award contracts.\n- Managed and supported Technical Area Tasks (TAT) ordered by DoD and non-DoD customers; provided program strategy and ensured alignment with Department goals\/direction."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.053"
                                            },
                                            "Text": {
                                                "val": "- Support the DTIC mission to provide technical information to DoD.\n- Provide administrative oversight and basic core contract operations for DoD IACs to collect, analyze, synthesize and disseminate worldwide Scientific and Technical Information (STI) in support of DoD's critical technologies and the warfighter.\n- Respond to technical inquiries and provide in-depth S&T analysis; create and provide STI results via IAC websites; capture STI products from new\/on-going analysis tasks; and support the exchange of information among members of the operational and technical communities.\n- Complete IAC Program restructuring to achieve the following objectives:\n-- Create and sustain a focus on the Better Buying Power initiatives to improve affordability, productivity, and standardization within defense acquisition programs.\n-- Expand scope to cover areas of emerging importance for the DoD (including Energetics, Autonomous Systems, Biometrics, Alternative Energy, and medical research).\n-- Increase participation of small business in supporting exchanges of technical and operational information across the DoD.\n-- Expand the industrial base – from single vendors to multiple vendors in each technical focus area, lowering cost and improving quality through enhanced competition.\n- Award small business set-aside contract for Defense Systems Basic Center Operations (BCO), as well as multiple award IDIQ contracts for Homeland Defense and Security Technical Area Tasks (TATs) and Defense Systems TATs.\n- Manage and support TATs ordered by the DoD and non-DoD customers; provide program strategy and ensure alignment with Department goals\/direction."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.748"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.748"
                                            },
                                            "Text": {
                                                "val": "- Support the DTIC mission to provide technical information to DoD.\n- Provide administrative oversight and basic core contract operations for DoD IACs to collect, analyze, synthesize and disseminate worldwide Scientific and Technical Information (STI) in support of DoD's critical technologies and the warfighter.\n- Respond to technical inquiries and provide in-depth S&T analysis; create and provide STI results via IAC websites; capture STI products from new\/on-going analysis tasks; and support the exchange of information among members of the operational and technical communities.\n- Manage and support TATs ordered by the DoD and non-DoD customers; provide program strategy and ensure alignment with Department goals\/direction.\n- Plan for the acquisition and re-compete of the Software, Networks, Information, Modeling and Simulation (SNIM) contract."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Number of:\n- IAC web inquiries:  6,033,502 for FY13\n- IAC technical inquiries 5,820 for FY13\n- STI documents added to IAC collection:  27,030 for FY13 \n- STI documents generated by Technical Area Task (TAT) activities:  9,037 for FY13 \n- Training or meeting events:  960 for FY13 \n- Number of training attendees:  17,673 for FY13 \n- Documents uploaded to DTIC's online repository:  20,431 for FY13\n\nAmount of funding:\n- Provided by external customer requesting IAC technical analysis (TAT Funding):  $1.541 billion for FY13 \n- Provided by external customers purchasing IAC information products (Non-TAT funding):  $740,843 for FY13\n\nCustomer satisfaction regarding:\n- IAC products and technical inquiry support (scale of 1 to 5, 5 being best): 4.8 for FY13\n- IAC TATs and training (scale of 1 to 5, 5 being best): 4.8 for FY13"
                        }
                    }
                }
            ]
        }
    }
}