{
    "id": "d878e5b25d2fdb2cfba0d96e0b9fa15a82fb4b2f",
    "meta": {
        "filename": "dod-2015_RDTE_2015_NAVY_BA1_3_RDTE_JustificationBook_Navy_PB_2015.zzz_unzipped_RDTE_JustificationBook_Navy_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603640M"
        },
        "ProgramElementTitle": {
            "val": "MC Advanced Technology Demo"
        },
        "R1LineNumber": {
            "val": "18"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "117.288"
            },
            "CurrentYear": {
                "val": "132.336"
            },
            "BudgetYearOne": {
                "val": "128.397"
            },
            "BudgetYearOneBase": {
                "val": "128.397"
            },
            "BudgetYearTwo": {
                "val": "137.562"
            },
            "BudgetYearThree": {
                "val": "140.416"
            },
            "BudgetYearFour": {
                "val": "142.407"
            },
            "BudgetYearFive": {
                "val": "142.368"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The efforts described in this Program Element (PE) are based on investment directions as defined in the Naval Science and Technology (S&T) Strategic Plan approved by the S&T Corporate Board (June 2012).  This strategy is based on needs and capabilities from Navy and Marine Corps guidance and input from the Naval Research Enterprise (NRE) stakeholders (including the Naval enterprises, the combatant commands, the Chief of Naval Operations (CNO), and Headquarters Marine Corps).  It provides the vision and key objectives for the essential S&T efforts that will enable the continued supremacy of United States Naval forces in the 21st century.  The Strategy focuses and aligns Naval S&T with Naval missions and future capability needs that address the complex challenges presented by both rising peer competitors and irregular\/asymmetric warfare.\n\nAs a key component of naval expeditionary forces, the Marine Corps has unique and technologically stressing requirements because of its expeditionary mission and intensive operational tempo, Marine Air-Ground Task Force (MAGTF) structure, and conduct of maneuver warfare.  Critical requirements in this PE are: Command, Control, Communications, Computers (C4); Intelligence, Surveillance, and Reconnaissance (ISR); maneuver techniques and means; force protection; logistic sustainment; human performance, training and education; and firepower. There are ongoing actions to develop and demonstrate advanced technologies and concepts in operational environments. Joint service efforts are aligned with Defense Technology Objectives and Joint Warfighting Capability Objectives. In addition, there is funding for experimentation in warfighting concepts as well as operational assessment of emerging technologies, to include technical support of operating forces to assess military utility of selected technologies. This PE specifically supports: continued development of enhanced warfighting capabilities through field experiments with Marine operating forces; rapid response to low-, mid-, and high-intensity conflicts in the Overseas Contingency Operation (OCO); methods for countering irregular threats; and expansion of seabasing and naval force packaging capabilities. The investment directly assists in fulfilling the forward presence requirements of Sea Shield and the transformational capabilities prescribed by Sea Strike. The Future Naval Capability (FNC) process is supported and funds are programmed accordingly. This PE is largely focused on demonstration of products and capabilities from the knowledge base and Discovery and Invention (D&I) phases of Naval S&T. As Naval partners, the Navy and Marine Corps S&T Team strive to transition technologies that will implement objectives outlined in the Naval Operations Concept. This PE also funds technical solutions designed to increase Naval force capability, such as the Naval Expeditionary Combat Command. Investments in S&T provide the opportunities for future capabilities and will prevent technological surprise. The PE as a whole will advance the amphibious and expeditionary capabilities for the Combatant Commanders helping to meet their emerging challenges by enhancing Naval S&T contributions to the long commitment to the OCO. The Marine Corps Service Campaign Plan (MCSCP) is the lens through which USMC S&T priorities are acted upon in order to support the future development of the Total Force.\n\n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "130.598"
                },
                "CurrentYear": {
                    "val": "132.400"
                },
                "BudgetYearOne": {
                    "val": "135.244"
                },
                "BudgetYearOneBase": {
                    "val": "135.244"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "117.288"
                },
                "CurrentYear": {
                    "val": "132.336"
                },
                "BudgetYearOne": {
                    "val": "128.397"
                },
                "BudgetYearOneBase": {
                    "val": "128.397"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-13.310"
                },
                "CurrentYear": {
                    "val": "-0.064"
                },
                "BudgetYearOne": {
                    "val": "-6.847"
                },
                "BudgetYearOneBase": {
                    "val": "-6.847"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.064"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.343"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-6.847"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-6.847"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-10.967"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Not applicable.\n\nSchedule: Project 2297, Worldwide contingency and combat operations (e.g., Operation Enduring Freedom (OEF) and humanitarian efforts) have increased the operations tempo of the operating forces to the extent that their support of, and participation in, the Marine Corps Warfighting Laboratory (MCWL) experimentation was\/remains challenging to coordinate and often directly impacts planned projects.  Additionally, rapid responses to emergent warfighter needs impacts planned projects.  Also, experimentation itself is not a precise business and information gained throughout the process can also effect program plans.  Thus, executing planned projects becomes \"an art\" in an effort to balance complicated and competing needs."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "2223"
                    },
                    "ProjectTitle": {
                        "val": "Marine Corps ATD"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "78.455"
                        },
                        "CurrentYear": {
                            "val": "88.318"
                        },
                        "BudgetYearOne": {
                            "val": "85.623"
                        },
                        "BudgetYearOneBase": {
                            "val": "85.623"
                        },
                        "BudgetYearTwo": {
                            "val": "91.450"
                        },
                        "BudgetYearThree": {
                            "val": "93.355"
                        },
                        "BudgetYearFour": {
                            "val": "94.664"
                        },
                        "BudgetYearFive": {
                            "val": "94.925"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Critical Marine Corps requirements\/imperatives addressed in this Project are: Maneuver; Force Protection; Human Performance, Training and Education; Logistics; Command, Control, Communications and Computers (C4); Intelligence, Surveillance and Reconnaissance (ISR) and Firepower.   These are ongoing efforts to develop and demonstrate advanced technologies and system concepts in an operational environment.  Multiple transitions into the Sub-system\/Component Advanced Development Phase are planned, as well as fieldable prototyped to reduce risk in System Concept Development and Demonstration.  A tactically effective Mine Countermeasures (MCM) capability is vital to Force Protection and necessary if Maneuver on land is to become a functional component of Naval Expeditionary Maneuver Warfare.  Maneuver, supported by MCM provides synchronization and speed of detection, breaching, clearance, proofing, and marking operations.  This project supports: 1) engaging regional forces in decisive combat on a global basis; 2) responding to all other contingencies and missions in the full spectrum of combat operations (high, middle, and low intensity), in Military Operations in Urban Terrain (MOUT), and in Operations other than War (OOTW); and 3)  warfighting experimentation.  By providing the technologies to enable these capabilities, this project supports the goals and objectives of the Strike, Littoral Warfare and Surveillance Joint Mission Areas.  These are ongoing efforts to develop and demonstrate advanced technologies and system concepts in an operational environment. \n\nIn addition, this project supports the goals and objectives of the Littoral Combat\/Power Projection related Enabling Capability (EC) within the Future Naval Capabilities (FNC) portfolio.  The focus of the EC within this PE is technology related to Urban, Asymmetric, and Expeditionary Operations (UAEO).  The UAEO Capability Gap is a science and technology developmental area that is of the highest importance to Marine Corps operations in Iraq and Afghanistan and is one of the highest ranked Capability Gaps prioritized by the Chief of Naval Operations and the Marine Corps Combat Development Command (MCCDC).  The UAEO technology gap is being pursued as part of an overall effort that addresses the Sea Strike Capability Gap."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "COMMAND, CONTROL, COMMUNICATIONS, COMPUTERS (C4)"
                                    },
                                    "Description": {
                                        "val": "This activity integrates and demonstrates enhanced communications and situational awareness in warfighting environments and communication and situational awareness technologies for near term USMC operations. The focus is on development and leveraging advanced C4 technologies to enable enhanced Distributed Operations, Irregular Warfare, and Marine Corps Expeditionary Warfare.  Specifically, the C4 Thrust intends to demonstrate markedly improved capabilities in over-the-horizon (OTH), beyond line-of-sight, and restricted environment communications; mobile networking; tactical decision making; tactical situational awareness; and small unit position location and navigation.  Advanced technology resources will be applied to complement commercial, other service, and defense agency investments to produce a technology base to address identified Marine Corps technology gaps.\n\nThe increase in the Command, Control, Communications, Computers (C4) funding from FY 2013 to FY 2014 is due to expanded development efforts and demonstrations of technologies that enhance urban communications capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.278"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued urban navigation with limited Global Positioning System availability demonstrations.\n- Continued demonstrations of improved urban communications capabilities.\n- Continued creating a service oriented sensor network for expeditionary forces' current and future tactical sensors.\n- Continued developing tailored tactical Human to Machine Interfaces aligned to primary operational functions and non-intrusive within the battlespace.\n- Continued creating services for the tactical network that are fully operable with DCGS and the DCGS Integration Backbone.\n- Continued Application-Network Architectures, Conformal Antenna Integration and Demonstration Spiral 2 and C3 for the Individual Marine Spiral Two.\n- Continued Application Network Architecture (reprioritized from FY11) and Automated Small. \n- Completed Application Network Architecture and Advanced Software Reconfigurable Relay.\n- Initiated Advanced Communications Systems and Small Unit C3."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.132"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts from FY2013, except those noted as completed.\n- Continue urban navigation with limited Global Positioning System availability demonstrations.\n- Continue demonstrations of improved urban communications capabilities.\n- Continue creating a service oriented sensor network for expeditionary forces' current and future tactical sensors.\n- Continue developing tailored tactical Human to Machine Interfaces aligned to primary operational functions and non-intrusive within the battlespace.\n- Continue creating services for the tactical network that are fully operable with DCGS and the DCGS Integration Backbone.\n- Continue Application-Network Architectures, Conformal Antenna Integration and Demonstration Spiral 2 and C3 for the Individual Marine Spiral Two.\n- Continue Application Network Architecture (reprioritized from FY11) and Automated Small.\n- Continue Advanced Communications Systems and Small Unit C3.\n- Initiate smart radio efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.266"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.266"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue urban navigation with limited Global Positioning System availability demonstrations.\n- Continue demonstrations of improved urban communications capabilities.\n- Continue developing tailored tactical Human to Machine Interfaces aligned to primary operational functions and non-intrusive within the battlespace.\n- Continue creating services for the tactical network that are fully operable with DCGS and the DCGS Integration Backbone.\n- Continue Application-Network Architectures, Conformal Antenna Integration and Demonstration Spiral 2 and C3 for the Individual Marine Spiral Two.\n- Continue Application Network Architecture (reprioritized from FY11) and Automated Small.\n- Continue Advanced Communications Systems and Small Unit C3.\n- Continue smart radio efforts.\n- Complete creating a service oriented sensor network for expeditionary forces' current and future tactical sensors.\n- Initiate Tactical Cyber Warfare.\n- Initiate mobile security.\n- Initiate NNetworking On-The-Move Technology insertion."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FIREPOWER"
                                    },
                                    "Description": {
                                        "val": "This activity develops technology for application on current and future expeditionary weapons and elements of the kill chain.  It includes, but is not limited to, the following technologies: fuze, fire control, launch\/propulsion, lethality, and accuracy.\n\nThe increase in the Firepower funding from FY 2013 to FY 2014 is due to the Exploitation and Development (E&D) phase activities of the Awareness for Lightweight Engagements and Remote Targeting (ALERT) Program which is developing large aperture, lightweight lens with enhanced fields of view."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.784"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued scalable effects conventional warhead concept development.\n- Continued improved mortar munition integration and demonstrations.\n- Continued development of targeting and engagement technologies for distributed operations collaborative fires integration and demonstrations.\n- Continued design, development, prototyping and testing of lightweight technologies that provide individual Marines enhanced capabilities to detect and identify man-size targets out to at least the maximum effective range of their personal weapons during all conditions (daylight, limited visibility, & darkness) by integrating multiple capabilities into a single system.\n- Continued a Flight Control Kinematic Unit effort (effort renamed Flight Control Mortar). Design & develop technology that provides guidance, navigation, and controls (GNC) to 81mm mortar rounds to enable trajectory shaping in urban environment to precisely & accurately strike specific targets.\n- Continued Non-Magnetic Azimuth Sensing (NMAS previously identified as completed in PB 2011).\n- Continued development of Miniature Urban Missile, leveraging technology from MEMS, designation, guidance and control, and warhead design, to develop a shoulder launched missile capable of defeating a variety of targets.\n- Continued development of precision 60mm mortar system, to demonstrate increased precision, range, and lethality in a light mortar, providing indirect fire support through projectile flight trajectory shaping.\n- Continued Exploitation and Development (E&D) portion of Non-Magnetic Azimuth Sensing (NMAS), with transition of mature technologies to newly initiated PE 0602750N Azimuth and Inertial Micro-electromechanical System (MEMS) Navigation System (AIM) to develop low cost, precision, inertial navigation systems for use in highly accurate handheld targeting systems, shoulder launched missiles, and munitions. \n- Continued development, prototyping, and testing of lightweight technologies that provide individual Marine enhanced capabilities to detect and identify man-size targets out to maximum effective ranges of individual weapons during all visibility conditions (daylight, limited visibility, and darkness) by integrating multiple capabilities into a single system.\n- Completed MEMS Initiation Safety Device (ISD) development and testing, for MilStd 1901A compliant igniters, to incorporate into current and developmental weapons propulsion systems.\n- Completed development of MEMS S&A.\n- Completed development of Caseless (CL) Ammunition.(Caseless (CL) Ammunition Effort."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.018"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts from FY2013, except those noted as completed.\n- Continue scalable effects conventional warhead concept development.\n- Continue improved mortar munition integration and demonstrations.\n- Continue development of targeting and engagement technologies for distributed operations collaborative fires integration and demonstrations.\n- Continue design, development, prototyping and testing of lightweight technologies that provide individual Marines enhanced capabilities to detect and identify man-size targets out to at least the maximum effective range of their personal weapons during all conditions (daylight, limited visibility, & darkness) by integrating multiple capabilities into a single system.\n- Continue a Flight Control Kinematic Unit effort (effort renamed Flight Control Mortar). Design & develop technology that provides guidance, navigation, and controls (GNC) to 81mm mortar rounds to enable trajectory shaping in urban environment to precisely & accurately strike specific targets.\n- Continue Non-Magnetic Azimuth Sensing (NMAS previously identified as completed in PB 2011).\n- Continue development of Miniature Urban Missile, leveraging technology from MEMS, designation, guidance and control, and warhead design, to develop a shoulder launched missile capable of defeating a variety of targets.\n- Continue development of precision 60mm mortar system, to demonstrate increased precision, range, and lethality in a light mortar, providing indirect fire support through projectile flight trajectory shaping.\n- Complete Exploitation and Development (E&D) portion of Non-Magnetic Azimuth Sensing (NMAS), with transition of mature technologies to newly initiated PE 0602750N Azimuth and Inertial Micro-electromechanical System (MEMS) Navigation System (AIM) to develop low cost, precision, inertial navigation systems for use in highly accurate handheld targeting systems, shoulder launched missiles, and munitions.\n- Complete development, prototyping, and testing of lightweight technologies that provide individual Marine enhanced capabilities to detect and identify man-size targets out to maximum effective ranges of individual weapons during all visibility conditions (daylight, limited visibility, and darkness) by integrating multiple capabilities into a single system.\n- Initiate E&D portion of Awareness for Lightweight Engagements and Remote Targeting (ALERT) to develop large aperture, lightweight lens with enhanced fields of view.\n- Initiate E&D portion of Semi-Autonomous Fires Technology (SAFT) to develop semi-autonomous fire control systems for use in next generation remote weapons systems, to enhance performance and minimize gunner\/operator burden.\n- Initiate Weapons Spectral Signature Characterization and Mitigation (WSSCM) to develop pigments, dyes, and polymers to mitigate Short Wave Infrared (SWIR) signature for weapons systems applications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.205"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.205"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue development of targeting and engagement technologies for distributed operations collaborative fires integration and demonstrations.\n- Continue design, development, prototyping and testing of lightweight technologies that provide individual Marines enhanced capabilities to detect and identify man-size targets out to at least the maximum effective range of their personal weapons during all conditions (daylight, limited visibility, & darkness) by integrating multiple capabilities into a single system.\n- Continue E&D portion of Awareness for Lightweight Engagements and Remote Targeting (ALERT) to develop large aperture, lightweight lens with enhanced fields of view.\n- Continue E&D portion of Semi-Autonomous Fires Technology (SAFT) to develop semi-autonomous fire control systems for use in next generation remote weapons systems, to enhance performance and minimize gunner\/operator burden.\n- Complete scalable effects conventional warhead concept development.\n- Complete improved mortar munition integration and demonstrations.\n- Complete Flight Control Kinematic Unit effort (effort renamed Flight Control Mortar). Design & develop technology that provides guidance, navigation, and controls (GNC) to 81mm mortar rounds to enable trajectory shaping in urban environment to precisely & accurately strike specific targets.\n- Complete Non-Magnetic Azimuth Sensing (NMAS previously identified as completed in PB 2011) technology.\n- Complete development of Miniature Urban Missile, leveraging technology from MEMS, designation, guidance and control, and warhead design, to develop a shoulder launched missile capable of defeating a variety of targets.\n- Complete development of precision 60mm mortar system, to demonstrate increased precision, range, and lethality in a light mortar, providing indirect fire support through projectile flight trajectory shaping.\n- Complete Weapons Spectral Signature Characterization and Mitigation (WSSCM) to develop pigments, dyes, and polymers to mitigate Short Wave Infrared (SWIR) signature for weapons systems applications.\n- Initiate investigation of the scalability of variable effects conventional munitions, gun, and propulsion technologies for improving firepower effectiveness while increasing affordability and decreasing logistics burden in support of expeditionary warfare.\n- Initiate development of precision fires engagement technologies, to include trajectory shaped 81mm mortars, 83mm missiles, and smaller precision munitions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FORCE PROTECTION"
                                    },
                                    "Description": {
                                        "val": "This activity supports the Force Protection Thrust's Advanced Technology Demonstration efforts in the areas of individual Marine platforms, equipment and autonomous systems.  This includes technologies to enable detection, neutralization, breaching, and clearing of explosive hazards from the beach exit to inland objectives.  Efforts supported under Force Protection also include the demonstration of technologies such as Air Defense\/Counter Rocket, Artillery, and Mortar (CRAM) and counter tactical surveillance and targeting, including pre-shot sniper detection, technologies in support of maneuver warfare, small unit distributed operations, and technologies for improved Personnel Protective Equipment for individual protection against blast, ballistic, and blunt impact threats.  \n\nThe increase in the Force Protection funding from FY 2013 to FY 2014 is due the initiation of a fusion of technologies project that will detect and classify optics, such as sniper scopes, from a moving platform."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.168"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued development of technologies to defeat side\/top attack and advanced fuze mines through signature reduction and advanced signature duplication.\n- Continued development of technologies to locate and defeat IEDs.\n- Continued development of technologies to defeat advanced mine fuzes (seismic, acoustic, and infrared).\n- Continued efforts to detect IEDs using radio frequency sources.\n- Continued technology development programs to address force protection capability gaps.\n- Continued new Explosives Hazard Defeat to address the Suicide-Bomber threat. This effort will combine multiple sensor modalities, analysis algorithms, and data fusion to demonstrate high Pd, low FAR detection of suicide bombers from standoff distances from multiple aspect angles.\n- Continued a new Anti-Tank Guided Missile (ATGM) effort to defeat ATGMs in complex urban environment.\n- Continued Warfighter modeling and simulation efforts for the Warfighter-as-a-System analysis approach and methodology combining survivability, mobility, and warfighter performance parameters.\n- Continued the Urgent Theater Warfighting Requirement for countering Improvised Explosive Devices (IED) and vehicle bourne IED.\n- Continued high-power solid state source development for IED neutralization.\n- Continued vulnerability assessment of threat targeting sensors to directed energy.\n- Continued efforts to neutralize incoming rocket, artillery, and mortar threats via non-kinetic means.\n- Continued development and evaluation of landmine detection utilizing ground penetrating radar from an airborne platform.\n- Continued development and evaluation of landmine detection utilizing synthetic aperture radar from an airborne platform.\n- Continue to develop and demonstrate technologies that will detect RPGs and ATGMs prior to launch and countermeasures after launch. \n- Initiated the development of detecting and locating sniper weapons using the return of their unique radar signatures.\n- Initiated the development automated human detection via spectral imaging during low-light level operation conditions (e.g. dusk\/dawn\/moonlit\/starlit night). \n- Initiated fusion of technologies that will detect and classify optics (sniper scopes, ccds, eyeball, etc) from a moving platform. \n- Initiated the demonstration of the feasibility of a deployable mission package consisting of technologies capable of screening multiple individuals rapidly over a wide area to detect, classify and track suicide bombers at relevant distances within a critical time frame for action. \n- Initiated demonstration of laser technology readiness for battlefield employment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.467"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts from FY2013, except those noted as completed.\n- Continue development of technologies to defeat side\/top attack and advanced fuze mines through signature reduction and advanced signature duplication.\n- Continue development of technologies to locate and defeat IEDs.\n- Continue development of technologies to defeat advanced mine fuzes (seismic, acoustic, and infrared).\n- Continue a new Anti-Tank Guided Missile (ATGM) effort to defeat ATGMs in complex urban environment.\n- Continue Warfighter modeling and simulation efforts for the Warfighter-as-a-System analysis approach and methodology combining survivability, mobility, and warfighter performance parameters.\n- Continue the development of detecting and locating sniper weapons using the return of their unique radar signatures.\n- Continue the development automated human detection via spectral imaging during low-light level operation conditions (e.g. dusk\/dawn\/moonlit\/starlit night). \n- Continue fusion of technologies that will detect and classify optics (sniper scopes, ccds, eyeball, etc) from a moving platform. \n- Continue the demonstration of the feasibility of a deployable mission package consisting of technologies capable of screening multiple individuals rapidly over a wide area to detect, classify and track suicide bombers at relevant distances within a critical time frame for action. \n- Continue demonstration of laser technology readiness for battlefield employment.  \n- Complete technology development programs to address force protection capability gaps.\n- Complete new Explosives Hazard Defeat to address the Suicide-Bomber threat. This effort will combine multiple sensor modalities, analysis algorithms, and data fusion to demonstrate high Pd, low FAR detection of suicide bombers from standoff distances from multiple aspect angles.\n- Complete the Urgent Theater Warfighting Requirement for countering Improvised Explosive Devices (IED) and vehicle bourne IED.\n- Complete high-power solid state source development for IED neutralization.\n- Complete vulnerability assessment of threat targeting sensors to directed energy.\n- Complete development and evaluation of landmine detection utilizing ground penetrating radar from an airborne platform.\n- Complete efforts to neutralize incoming rocket, artillery, and mortar threats via non-kinetic means.\n- Complete development and evaluation of landmine detection utilizing synthetic aperture radar from an airborne platform.\n- Complete to develop and demonstrate technologies that will detect RPGs and ATGMs prior to launch and countermeasures after launch. \n- Complete efforts to detect IEDs using radio frequency sources.\n- Initiate physics-based characterization of signatures of proud\/buried targets\/EH Indicators across the spectrum of applicable detection modalities using knowledge\/investigation of target physics.\n- Initiate a program to demonstrate the fusion of multiple modes of detection of explosive hazards into a single system.\n- Initiate development of advance modular and scalable personal protective equipment utilizing advances in mobility\/survivability modeling and simulation, materials, and bio-fidelic surrogates.\n- Initiate development of materials and helmet systems that absorb\/dissipate blast shock waves."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.613"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.613"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue development of technologies to defeat side\/top attack and advanced fuze mines through signature reduction and advanced signature duplication.\n- Continue development of technologies to locate and defeat IEDs.\n- Continue development of technologies to defeat advanced mine fuzes (seismic, acoustic, and infrared).\n- Continue Anti-Tank Guided Missile (ATGM) effort to defeat ATGMs in complex urban environment.\n- Continue Warfighter modeling and simulation efforts for the Warfighter-as-a-System analysis approach and methodology combining survivability, mobility, and warfighter performance parameters.\n- Continue demonstration of laser technology readiness for battlefield employment. \n- Continue physics-based characterization of signatures of proud\/buried targets\/explosive hazard indicators across the spectrum of applicable detection modalities using knowledge\/investigation of target physics.\n- Continue a program to demonstrate the fusion of multiple modes of detection of explosive hazards into a single system.\n- Continue development of advance modular and scalable personal protective equipment utilizing advances in mobility\/survivability modeling and simulation, materials, and bio-fidelic surrogates.\n- Continue development of materials and helmet systems that absorb\/dissipate blast shock waves\n- Complete the demonstration of the feasibility of a deployable mission package consisting of technologies capable of screening multiple individuals rapidly over a wide area to detect, classify and track suicide bombers at relevant distances within a critical time frame for action. \n- Complete the development of detecting and locating sniper weapons using the return of their unique radar signatures.\n- Complete fusion of technologies that will detect and classify optics (sniper scopes, ccds, eyeball, etc) from a moving platform. \n- Complete the development of automated human detection via spectral imaging during low-light level operation conditions (e.g. dusk\/dawn\/moonlit\/starlit night). \n- Initiate an integrated technology demonstration to develop a system of systems that addresses route reconnaissance and clearance for a MEU.\n- Initiate a project to develop organic technology solutions for the detection and clearance of explosive hazards and obstacles encountered by Marine Corps forces during amphibious operations.\n- Initiate a project to investigate the detection and neutralization of explosive hazards in multiple, diverse, environments\n- Initiate a program to fuse multiple technologies that will detect and classify tactical surveillance and targeting threats before engagement from a moving platform. \n- Initiate projects to develop Personnel Protection Equipment (PPE) through novel Modular, Tailorable and scalable design concepts which increase survivability and operational suitability to the warfighter.\n- Initiate broad based material (ceramics, fiber and Fiber Re-Enforced Plastics) to demonstrate the possibility of significant weight reductions (greater than 50%) can be achieved."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HUMAN PERFORMANCE, TRAINING & EDUCATION"
                                    },
                                    "Description": {
                                        "val": "This activity addresses the applied research effort of the Human Performance Training and Education thrust (HPT&E).  The HPT&E thrust investment profile is directed at two technology investment areas, Warrior Resilience, and Decision Making and Expertise Development. The funding aligned to Warrior Resilience is focused on advanced training technologies and methodologies that enhance neural, cognitive, and physical readiness.  Those funds aligned to Decision Making and Expertise Development refers to training and education technologies and methodologies that accelerate the development and improve the retention of skills in decision making, situation awareness, and individual and team adaptability and coordination on decentralized, dynamic and dispersed battlefields. \n\nThe increase in the Human Performance, Training & Education funding from FY 2013 to FY 2014 is due to expanded emphasis by the Marine Corps on development of technologies and methodologies for integrated mental skills resilience training."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.510"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued development of \"Warfighter as a System\" modeling tools. (Effort renamed to Enhancing warfighter psycho-physical performance).\n- Continued development of adaptive experiential learning tools for Distributed Operations Training. (Effort renamed to Real-time adaptive training environments).\n- Continued evaluations and validations of applications geared towards peak neural and cognitive performance-in distributed operations.\n- Continued development of early prototype systems for Human Performance and Training efforts (Cognitive and physical enhancement, modeling and simulation, and virtual reality and mixed reality squad level training in support of Distributed Operations).\n- Continued efforts to apply learning theories for language and culture training. \n- Continued team immersive language and cultural learning in simulation environments.\n- Continued classroom\/field testing of learning theories extended to complex tasks for a range of expertise levels; training mitigation strategies triggered by neurophysiological markers of learning, cognition and expertise; and principles of expertise development on a continuum of novice to expert. (Rename effort Algorithms Physiologically-derived to Promote Learning Efficiency (APPLE)).\n- Continued field evaluations of training mitigation strategies triggered by behavioral and neurophysiological markers of learning, cognition, and expertise.\n- Continued effectiveness and validation studies of Advanced Mobile Field Assessment and Readiness Technologies to improve the capability to assess situational awareness in the field and predict physical performance by developing mobile and rugged tools, algorithms, and models.\n- Continued development of sleep deprivation mitigations (phase II) to enhance warfighter performance during extended operations (initial phase completed in FY10).\n- Continued development of technologies supporting peak cognitive performance of warfighters. \n- Continued development of physical conditioning assessment and training optimization methods to improve warfighter performance (previous efforts related to physical conditioning impacts on combat readiness resourced by PE 0602131M).  \n- Continued development of applied training technologies for Squad Immersive Training Environments (SITE). \n- Continued evaluation of neurological symptoms of performance at altitude to reduce the incidences of acute mountain sickness (AMS). \n- Continued development and demonstrate immersive training communication analysis systems to support instructor assessment of infantry units. \n- Continued the assessment and validation of an injury prevention methodology for use in-theater (CoRE)\n- Continued the demonstration of the utility of Integrated Learning Management System (LMS).\n- Continued the development of Integrated Models for Warfighter Performance Enhancement. \n- Continued effectiveness and validation studies of Advanced Mobile Field Assessment and Readiness Technologies to improve the capability to assess situational awareness in the field and predict physical performance by developing mobile and rugged tools, algorithms, and models. \n- Continued research into heat stress mitigations for the individual Warfighter, and develop intervention strategies to improve performance in hot environments. \n- Continue development of an autonomous robotic adversarial target system to extend simulation marksmanship training to live-fire ranges with the use of robotic targets (all-terrain, mobile, tactical, return fire) and integrate with simulation feedback and scoring for transition to Marine Corps Systems Command (PM-Training Systems). \n- Completed the demonstration of the utility of a comprehensive instructional strategies framework that takes as input learner and knowledge characteristics and then provides as output recommended strategies to developers for enhancing training within simulation based training environments (APPLE).\n- Completed development of automated capture, measurement, performance assessment & after-action-review (AAR) for small team communications during training, showing improved situational awareness and team coordination among warfighters in a MOUT training environment (Relates to FY09 initiated effort to demonstrate and field studies of mitigation \/augmentation capabilities that enhance squad communications).\n- Completed studies into next generation physical performance enhancement methodologies and technologies (enhanced warfighter psycho-physical performance). \n- Initiated mobile field technologies for predicting readiness and performance into more advanced development and demonstration of utility. \n- Initiated development of technologies and methodologies for integrated mental skills resilience training (previous efforts neural mechanisms of mental skills resilience)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.178"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts from FY2013, except those noted as completed.\n- Complete development of \"Warfighter as a System\" modeling tools. (Effort renamed to Enhancing warfighter psycho-physical performance). \n- Complete development of adaptive experiential learning tools for Distributed Operations Training. (Effort renamed to Real-time adaptive training environments).\n- Complete evaluations and validations of applications geared towards peak neural and cognitive performance-in distributed operations.\n- Complete efforts to apply learning theories for language and culture training. \n- Continue team immersive language and cultural learning in simulation environments.\n- Continue development of physical conditioning assessment and training optimization methods to improve warfighter performance (previous efforts related to physical conditioning impacts on combat readiness resourced by PE 0602131M).\n- Continue mobile field technologies for predicting readiness and performance into more advanced development and demonstration of utility. \n- Continue development of technologies and methodologies for integrated mental skills resilience training (previous efforts neural mechanisms of mental skills resilience).\n- Complete development of early prototype systems for Human Performance and Training efforts (Cognitive and physical enhancement, modeling and simulation, and virtual reality and mixed reality squad level training in support of Distributed Operations).\n- Complete classroom\/field testing of learning theories extended to complex tasks for a range of expertise levels; training mitigation strategies triggered by neurophysiological markers of learning, cognition and expertise; and principles of expertise development on a continuum of novice to expert. (Rename effort Algorithms Physiologically-derived to Promote Learning Efficiency (APPLE)).\n- Complete field evaluations of training mitigation strategies triggered by behavioral and neurophysiological markers of learning, cognition, and expertise.\n- Complete development of an autonomous robotic adversarial target system to extend simulation marksmanship training to live-fire ranges with the use of robotic targets (all-terrain, mobile, tactical, return fire) and integrate with simulation feedback and scoring for transition to Marine Corps Systems Command (PM-Training Systems). \n- Complete evaluation of neurological symptoms of performance at altitude to reduce the incidences of acute mountain sickness (AMS). \n- Complete development and demonstrate immersive training communication analysis systems to support instructor assessment of infantry units.\n- Complete development of sleep deprivation mitigations (phase II) to enhance warfighter performance during extended operations (initial phase completed in FY10). \n- Complete development of technologies supporting peak cognitive performance of warfighters.\n- Complete the demonstration of the utility of using Tyrosine supplementation for reducing stress in irregular warfare, asymmetric environments.\n- Complete the development of the utility of analyzing neural mechanisms for affecting mental skills resilience.(- Complete the development of Integrated Models for Warfighter Performance Enhancement.\n- Complete development of applied training technologies for Squad Immersive Training Environments(SITE). \n- Complete the demonstration of the utility of Integrated Learning Management System (LMS). \n- Complete the assessment and validation of an injury prevention methodology for use in-theater (CoRE).\n- Complete effectiveness and validation studies of Advanced Mobile Field Assessment and Readiness Technologies to improve the capability to assess situational awareness in the field and predict physical performance by developing mobile and rugged tools, algorithms, and models. \n- Complete research into heat stress mitigations for the individual Warfighter, and develop intervention strategies to improve performance in hot environments. \n- Initiate the development of small-unit training for adaptability and resiliency in decision making (STAR-DM), to enhance the Marine Air Ground Task Force's capabilities by training and equipping small-unit leaders to handle the demanding complexities and possess the adaptive mindset necessary to operate across the spectrum of conflict; empowering our strategic corporals as well as all of our junior leaders to fight, operate, and win in this challenging security environment.\n- Initiate the development of rapid auto cognitive task analysis(AutoCTA), to address the problems associated with accurately determining training system requirements, to develop a standardized, theory driven and JCIDS aligned, rapid CTA technique for extracting knowledge from experts and efficiently modeling tasks. \n- Initiate development of technology to improve the transfer and maintenance of resilience training in the Marine Corps, to include measures of climate for Warfighter resilience, and small unit leader and team member training to enhance climate resilience, social support, and relapse prevention modules for deployment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.538"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.538"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue the development of small-unit training for adaptability and resiliency in decision making (SUDM), to enhance the Marine Air Ground Task Force's capabilities by training and equipping small-unit leaders to handle the demanding complexities and possess the adaptive mindset necessary to operate across the spectrum of conflict; empowering our strategic corporals as well as all of our junior leaders to fight, operate, and win in this challenging security environment. (previous efforts related to SUDM resourced by PE 0602131M). \n- Complete team immersive language and cultural learning in simulation environments.\n- Complete development of physical conditioning assessment and training optimization methods to improve warfighter performance (previous efforts related to physical conditioning impacts on combat readiness resourced by PE 0602131M). \n- Complete mobile field technologies for predicting readiness and performance into more advanced development and demonstration of utility.\n- Complete development of technologies and methodologies for integrated mental skills resilience training (previous efforts neural mechanisms of mental skills resilience).\n- Complete the development of rapid auto cognitive task analysis(AutoCTA), to address the problems associated with accurately determining training system requirements, to develop a standardized, theory driven and JCIDS aligned, rapid CTA technique for extracting knowledge from experts and efficiently modeling tasks. \n- Complete development of technology to improve the transfer and maintenance of resilience training in the Marine Corps, to include measures of climate for Warfighter resilience, and small unit leader and team member training to enhance climate resilience, social support, and relapse prevention modules for deployment.\n\n- Initiate and complete development of better enhanced simulation and training (BEST) by applying a dynamic tailoring framework to create adaptive training. This effort initiated in FY 2014 due to urgent operational requirements.\n- Initiate design and development of a Marine augmented classroom environment (ACE) that will enhance instructors' teaching performance and student learning outcomes. This effort initiated in FY 2014 due to operational requirements.\n- Initiate design and development of a test-bed and conduct The Basic School evaluation to test the efficacy of simulation based training in that curriculum. This effort initiated in FY 2014 due to urgent operational requirements.\n- Initiate development and demonstrate an agent-based surrogate instructor development environment (ASIDE) to allow USMC to field small-team focused intelligent training solutions. This effort initiated in FY 2013 due to operational requirements.\n- Initiate development of training to optimize the use of resilience skills (TOURS), specifically develop and iterate training modules for relapse prevention, deployable refresher training, supports for transfer climate and social support for small unit leaders. This effort initiated in FY 2013 due to operational requirements.\n- Initiate development of an individualized fatigue countermeasure training tool for Marines that will provide increased fatigue resilience training effectiveness, improved fatigue management and reduced fatigue-related operational errors. This effort initiated in FY 2013 due to operational requirements.\n- Initiate development of a master instructor development system (MIND) which will provide measurement framework to support the develop of master instructors by creating a developmental model of instructor mastery.. This effort initiated in FY 2013 due to operational requirements.\n- Initiate design and development of methods for establishing optimal training intervals for the Marine Corps Martial Arts Program (MCMAP) for improvement in physical performance and warrior mindset.  This effort initiated in FY 2014 due to operational requirements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "INTELLIGENCE, SURVEILLANCE, AND RECONNAISSANCE (ISR)"
                                    },
                                    "Description": {
                                        "val": "This activity supports the demonstration of technologies to enhance situational awareness and tactical decision making through automated analysis, fusion of data, rapid integration of information, and acquired knowledge resulting in actionable intelligence at the lower command levels. The activity includes the demonstration of ISR efforts involving enhanced reconnaissance and persistent surveillance, and sensors for unmanned ground and aerial vehicles.   Advanced Technology demonstrations also include the collection of information [monitoring, sensing, and locating] in the 3D urban battlespace as well as exploiting information [identifying and classifying data] as part of the intelligence preparation of the battlespace in order to facilitate operational maneuver and distributed operations.\n\n\nThe increase in the Intelligence, Surveillance, and Reconnaissance funding from FY 2013 to FY 2014 is due to accelerated development of a workflow manager capable of cloud service discovery and configuration."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.927"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued development of advanced tactical sensor nets that localize mobile detection of threats in a complex environment.\n- Continued development and demonstration of measurement and signature intelligence data management and integration capability.\n- Continued integration and demonstration of naval tactical warfighting applications and network connectivity.\n- Continued tagging, tracking, and locating efforts to demonstrate the effectiveness of tactically relevant tag readers which support track classification algorithms.\n- Continued efforts to refine enemy course of action prediction software to adapt to stimuli.\n- Continued new Actionable Intelligence for Expeditionary and Irregular Warfare efforts which include Human Network Decision Modeling and the fusion across modeling approaches to increase prediction accuracy.\n- Continued development of tactical sensor nets with organic unattended multi-level security processing and information dissemination.\n- Continued new Relevant and Situational Information on Demand such as Identity Dominance Enabled by an Integrated Biometric\/Tag Track and Locate (TTL) Capability, providing human tracking algorithms based on models of biometric (face, voice and soft) and TTL (optical taggant) capabilities and modeling a biometric\/optical taggant system relevant to human tracking across an urban 5 km x 2 km area.\n- Continued new Sensor Fields efforts such as Nanotechnology Enabled Witness Fields, development of sensors that provide near real time decision support to distributed operations by detecting specific interactions, and nanotechnology efforts which offer the potential to revolutionize tactical sensors. To enable this capability, nanomaterials that change state in the presence of another nanomaterial will be developed.\n- Continued algorithm development for base classification on context, similarity to clutter, and nearness to suspicion.\n- Continued efforts to develop methods and techniques for investigating open source information on the Internet to form a human terrain map indicating space and time features to aid network identification and prediction of enemy activity.\n- Continued efforts to incorporate social models for human decision making with statistical models. \n- Continued efforts to extend the utility of track classification algorithms to sparse data.\n- Continued efforts to automatically fuse data across all identifiers (TTL, biometrics, symbols) based on similarity measures.\n- Continued efforts to show entity tracking using disparate ground and air sensors and tools that automatically compute latent area atmospheric measures.\n- Continued development of model based own force decision tools based on adversarial decision making models. \n- Continued development of an active layered sensing capability.\n- Completed development of an active dynamic resource manager to make collected data better available to decision makers.\n- Completed Operational Adaptation Enablers effort to provide one analysis framework for the incorporation of interdisciplinary techniques related to addressing contextual questions. \n- Completed efforts to analyze and expose enemy networks using close observations of entity to entity associations and social network analysis. This includes development of audio tools which enable automated understanding of analog and digital recordings, as well as text files. \n- Initiated research on the development of automated data tagging algorithms that enable connected graphs of structured and unstructured data.\n- Initiated research to develop more audio exploitation algorithms that can be used on audio files with a low signal to noise.\n- Initiated technology development required to enable tactical UAS on-board processing of terabytes of data in real time.\n- Initiated development of a user composable search and display capability enabled by map reduce technology.\n- Initiated Tagging, Tracking, and Locating efforts to demonstrate a system that will automatically translate large amounts of wide area surveillance data into tracks, useful to expose entity to entity associations; build urban context, as well as detect events and anomalies; and associate objects, tasks, locations and events for creating actionable intelligence."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.551"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts from FY2013, except those noted as completed.\n- Continue development of advanced tactical sensor nets that localize mobile detection of threats in a complex environment.\n- Continue development and demonstration of measurement and signature intelligence data management and integration capability.\n- Continue efforts to refine enemy course of action prediction software to adapt to stimuli.\n- Continue new Actionable Intelligence for Expeditionary and Irregular Warfare efforts which include Human Network Decision Modeling and the fusion across modeling approaches to increase prediction accuracy.\n- Continue development of tactical sensor nets with organic unattended multi-level security processing and information dissemination.\n- Continue new Relevant and Situational Information on Demand such as Identity Dominance Enabled by an Integrated Biometric\/Tag Track and Locate (TTL) Capability, providing human tracking algorithms based on models of biometric (face, voice and soft) and TTL (optical taggant) capabilities and modeling a biometric\/optical taggant system relevant to human tracking across an urban 5 km x 2 km area.\n- Continue tagging, tracking, and locating efforts to demonstrate a system that will automatically translate large amounts of wide area surveillance data into tracks, useful to expose entity to entity associations; build urban context, as well as detect events and anomalies; and associate objects, tasks, locations and events for creating actionable intelligence.\n- Continue efforts to develop methods and techniques for investigating open source information on the Internet to form a human terrain map indicating space and time features to aid network identification and prediction of enemy activity.\n- Continue efforts to incorporate social models for human decision making with statistical models. \n- Continue efforts to extend the utility of track classification algorithms to sparse data.\n- Continue efforts to automatically fuse data across all identifiers (TTL, biometrics, symbols) based on similarity measures.\n- Continue efforts to show entity tracking using disparate ground and air sensors and tools that automatically compute latent area atmospheric measures.\n- Continue development of model based own force decision tools based on adversarial decision making models.\n- Continue development of an active layered sensing capability.\n- Continue research to develop more audio exploitation algorithms that can be used on audio files with a low signal to noise. \n- Continue technology development required to enable tactical UAS on-board processing of terabytes of data in real time.\n - Continue development of a user composable search and display capability enabled by map reduce technology. \n- Complete new Sensor Fields efforts such as Nanotechnology Enabled Witness Fields, development of sensors that provide near real time decision support to distributed operations by detecting specific interactions, and nanotechnology efforts which offer the potential to revolutionize tactical sensors. To enable this capability, nanomaterials that change state in the presence of another nanomaterial will be developed.\n- Complete algorithm development for base classification on context, similarity to clutter, and nearness to suspicion.\n- Complete integration and demonstration of naval tactical warfighting applications and network connectivity.\n- Complete tagging, tracking, and locating efforts to demonstrate the effectiveness of tactically relevant tag readers which support track classification algorithms.\n- Initiate the development of a workflow manager capable of cloud service discovery and configuration."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.650"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.650"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue new Actionable Intelligence for Expeditionary and Irregular Warfare efforts which include Human Network Decision Modeling and the fusion across modeling approaches to increase prediction accuracy.\n- Continue the development of a workflow manager capable of cloud service discovery and configuration.\n- Continue research on the development of automated data tagging algorithms that enable connected graphs of structured and unstructured data.\n- Continue technology development required to enable tactical UAS on-board processing of terabytes of data in real time.\n- Continue development of a user composable search and display capability enabled by map reduce technology.\n- Continue Tagging, Tracking, and Locating efforts to demonstrate a system that will automatically translate large amounts of wide area surveillance data into tracks, useful to expose entity to entity associations; build urban context, as well as detect events and anomalies; and associate objects, tasks, locations and events for creating actionable intelligence.\n- Complete development of advanced tactical sensor nets that localize mobile detection of threats in a complex environment. \n- Complete development and demonstration of measurement and signature intelligence data management and integration capability. \n- Complete efforts to refine enemy course of action prediction software to adapt to stimuli.\n- Complete development of tactical sensor nets with organic unattended multi-level security processing and information dissemination.\n- Complete new Relevant and Situational Information on Demand such as Identity Dominance Enabled by an Integrated Biometric\/Tag Track and Locate (TTL) Capability, providing human tracking algorithms based on models of biometric (face, voice and soft) and TTL (optical taggant) capabilities and modeling a biometric\/optical taggant system relevant to human tracking across an urban 5 km x 2 km area.\n- Complete efforts to develop methods and techniques for investigating open source information on the Internet to form a human terrain map indicating space and time features to aid network identification and prediction of enemy activity.\n- Complete efforts to incorporate social models for human decision making with statistical models.\n- Complete efforts to extend the utility of track classification algorithms to sparse data.\n- Complete efforts to automatically fuse data across all identifiers (TTL, biometrics, symbols) based on similarity measures.\n- Complete efforts to show entity tracking using disparate ground and air sensors and tools that automatically compute latent area atmospheric measures.\n- Complete development of model based own force decision tools based on adversarial decision making models. \n- Complete development of an active layered sensing capability.\n- Complete research to develop more audio exploitation algorithms that can be used on audio files with a low signal to noise.\n- Initiate research to develop concept based information retrieval from unstructured data sources based on structured grammars or intensity vectors.\n- Initiate research to develop a capacity to run tracklett fusion, track analysis and data to track or track to track correlation as a distributed service run as a map-reduce job, both forensically and in real time.  \n- Initiate research to develop a prototype system capable of maintaining the entity models needed for entity co referencing during real time natural language processing workflows.\n- Initiate research on the development of a capability to automate the extraction of video events relevant to mission information needs in real time on power efficient hardware.\n- Initiate research on implementing orchestrated advanced analytics running across cloud and non-cloud based architectures."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "LITTORAL COMBAT\/POWER PROJECTION (LC\/PP)"
                                    },
                                    "Description": {
                                        "val": "This activity addresses the advanced technology development associated with associated with the Marine Corps participation in the Department of the Navy's (DoN) Science and Technology Future Naval Capabilities (FNC) Program.  The FNC Program represents the requirements-driven, delivery-oriented portion of the DoN Science and Technology (S&T) portfolio.  FNC investments respond to Naval S&T Gaps that are generated by the Navy and Marine Corps after receiving input from Naval Research Enterprise (NRE) stakeholders.  The funding is aligned with the Naval challenges associated with projecting power despite anti-access and area denial, specifically the Sea Shield, Power and Energy, FORCEnet, and the Naval Expeditionary Maneuver Warfare warfighting capability gaps. The funding profile reflects the alignment of the FNC program investments into Enabling Capabilities (ECs); ECs respond to priority Naval warfighting capability gaps.  Funding for each EC is aligned to a 6.2 or 6.3 Budget Activity (BA) as appropriate.  Concurrent funding for Naval expeditionary warfare capability ECs is also provided from Navy PE0602750N and PE0603673N. Both of the Navy PE's were included in the FY 2013 President's Budget Request and are now the only Navy program elements funding Navy FNC work.  In previous submissions 7 Navy 6.2 PEs and 8 Navy 6.3 PEs funded FNC efforts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.616"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued development of modular scalable effects prototype weapon. (Concurrent funding from PE 0602131M).\n- Continued development of tactical urban breaching technologies.\n- Continued development of counter improvised explosive devices technologies. (Concurrent funding from PE 0602131M).\n- Continued development of advanced survivability and mobility technologies for Marine Corps tactical and combat vehicles. (Concurrent funding in PE 0602131M; funding will also be provided by PE 0603236N in FY 2010).\n- Continued development of technologies to lighten the load of warfighters by 1) reducing the weight of and improving the capability of the day\/night weapon sight, 2) eliminating battery incompatibility, and 3) providing Graphical User Interface (GUI-based) software for tradeoff analyses based on Military Operational Posture. (Previous FY10 effort resourced by PE 0602236N and PE 0603236N. Concurrent FY11 funding provided by PE 0602131M and PE 0603236N).\n- Continued development of wide area surgical and persistent surveillance technologies. (Concurrent funding in PE 0602271N and PE 0602131M).\n- Completed development of improved lightweight computational fire control interface technology. \n- Completed development of improved fire control systems technologies to Expeditionary Fire Support System artillery and mortar systems. \n- Completed development of transparent urban structures technologies. \n- Completed development of individual Warfighter protection technologies. \n- Initiated development of precision urban mortar attack technologies in FY11 due to operation contingencies. (Concurrent funding in PE 0602131M).\n- Initiated development of fuel efficient Medium Tactical Vehicle Replacement (MTVR) technologies. (Concurrent funding in PE 0602131M).\n- Initiated development of the Ground Based Air Defense On-the-move high energy laser demonstrator.  (Concurrent funding in PE0602750N and PE0603673N)"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.988"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts from FY 2013, except those noted as completed.\n- Continue development of modular scalable effects prototype weapon. (Concurrent funding from PE 0602131M).\n- Continue development of tactical urban breaching technologies.\n- Continue development of counter improvised explosive devices technologies. (Concurrent funding from PE 0602131M).\n- Continue development of advanced survivability and mobility technologies for Marine Corps tactical and combat vehicles. (Concurrent funding in PE 0602131M; funding will also be provided by PE 0603236N in FY 2010).\n- Continue development of technologies to lighten the load of warfighters by 1) reducing the weight of and improving the capability of the day\/night weapon sight, 2) eliminating battery incompatibility, and 3) providing Graphical User Interface (GUI-based) software for tradeoff analyses based on Military Operational Posture. (Previous FY10 effort resourced by PE 0602236N and PE 0603236N. Concurrent FY11 funding provided by PE 0602131M and PE 0603236N).\n- Continue development of wide area surgical and persistent surveillance technologies. (Concurrent funding in PE 0602271N and PE 0602131M).\n- Continue development of precision urban mortar attack technologies in FY11 due to operation contingencies. (Concurrent funding in PE 0602131M).\n- Continue development of fuel efficient Medium Tactical Vehicle Replacement (MTVR) technologies. (Concurrent funding in PE 0602131M).\n- Continue development of the Ground Based Air Defense On-the-move high energy laser demonstrator.  (Concurrent funding in PE0602750N and PE0603673N) \n- Complete development of technologies to lighten-the-load of warfighters by 1) reducing the weight and improving the capability of the day\/night weapon sight 2) eliminating battery incompatibility, 3) providing Graphical User Interface (GUI)-based software for tradeoff analyses based on Military Operational Posture. \n- Complete development of precision universal mortar attack technologies. (Concurrent funding in PE 0602131M)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.368"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.368"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue development of wide area surgical and persistent surveillance technologies. (Concurrent funding in PE 0602131M).\n- Continue development of the Ground Based Air Defense On-the-move high energy laser demonstrator.  (Concurrent funding in PE 0602131M.) \n- Continue development of modular scalable effects prototype weapon. (Concurrent funding from PE 0602131M).\n- Continue development of tactical urban breaching technologies.\n- Continue development of counter improvised explosive devices technologies. (Concurrent funding from PE 0602131M).\n- Continue development of advanced survivability and mobility technologies for Marine Corps tactical and combat vehicles. (Concurrent funding in PE 0602131M; funding will also be provided by PE 0603236N in FY 2010).\n- Continue development of technologies to lighten the load of warfighters by 1) reducing the weight of and improving the capability of the day\/night weapon sight, 2) eliminating battery incompatibility, and 3) providing Graphical User Interface (GUI-based) software for tradeoff analyses based on Military Operational Posture. (Previous FY10 effort resourced by PE 0602236N and PE 0603236N. Concurrent FY11 funding provided by PE 0602131M and PE 0603236N).\n- Continue development of precision urban mortar attack technologies in FY11 due to operation contingencies. (Concurrent funding in PE 0602131M).\n- Complete development of fuel efficient Medium Tactical Vehicle Replacement (MTVR) technologies. (Concurrent funding in PE 0602131M).\n- Initiate development of an azimuth and inertial navigation system.  (Effort was previously funded by PE 0602750N and PE 0603673N; concurrent funding in PE 0602131M.) \n- Initiate and complete development of spectral and reconnaissance imagery for tactical exploitation (SPRITE). (Previous and follow-on funding provided by PE 0602750N and PE 0603673N; concurrent funding in PE 0602131M.)\n- Initiate development of Target Processing Center (TPC) sensor correlation and fusion technology; specifically, context fusion, and radar fusion and false track mitigation. (Concurrent funding in PE 0602131M.)\n- Initiate development of technologies to enable the exchange of actionable information at the tactical edge; specifically, actionable information tactical applications, data conditioning and network adaptive communication services. (Effort was previously funded by PE 0602750N and PE 0603673N; concurrent funding in PE 0603640M.)"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "LOGISTICS"
                                    },
                                    "Description": {
                                        "val": "This activity supports Marine Corps Expeditionary Logistics which is the practical discipline and real world application of the deployment, sustainment, reconstitution, and re-deployment of forces engaged in expeditionary operations.  Expeditionary Logistics replaces mass with assured knowledge and speed, is equally capable ashore or afloat in austere environments, and is fully scalable to meet uncertain requirements.  Expeditionary Logistics logically divides into five pillars:  deployment support, force closure, sustainment, reconstitution\/redeployment, and command and control.  These pillars are thoroughly integrated and perpetually related in execution.\n\nThe increase in the Logistics funding from FY 2013 to FY 2014 is due to expanded field demonstrations for the Marine Corps of renewable energy devices and deployable equipment.\n\nThe FY 2014 to FY 2015 decrease in the Logistics Thrust Activity is due to a reduction in the scope and size of anti-fouling and non-fouling water purification components to enable enduring performance of small water purification systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.537"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued exploring the development of portable fuel cell technologies capable of providing Power in the 100 Watt to 500 Watt power range.\n- Continued efforts to develop a micro turbine generator capable of 100W average power.\n- Continued research into developing a replaceable electrode battery power source that consists of a metallic structure that is consumed during power generation and then easily replaced with a new metallic component that restores a full charge. (Realigned from PE 0602131M).\n- Continued analysis of material alternatives for automated vehicle health monitoring and reporting.\n- Continued development of a backpack that prevents oscillatory and transient peak loading forces from causing skeletal injury while enhancing human mobility with heavy loads.\n- Continued development of advanced lightweight fuel to energy conversion concepts.  This includes development of power management electronics for reducing power requirements for military radios.\n- Continued demonstration of advanced concepts for mobile infrastructure.\n- Completed the development and demonstration of advanced materials for corrosion prevention and wear reduction for USMC vehicles and equipment. \n- Initiated integration and demonstration of electrochemical ultracapacitors into hybrid electric power systems. \n- Initiated efforts to improve advanced electrical power generation from fuel cells and renewable sources as well as to improve the efficiency of conventional generation via hybridization and smart-grid technologies.\n- Initiated integration and demonstration of advanced materials to reduce maintenance into selected vehicle and machinery components.\n- Initiated the development of robotic systems to facilitate the packaging and handling of logistic supplies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.364"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts from FY 2013, except those noted as completed.\n- Continue exploring the development of portable fuel cell technologies capable of providing Power in the 100 Watt to 500 Watt power range.\n- Continue efforts to develop a micro turbine generator capable of 100W average power.\n- Continue research into developing a replaceable electrode battery power source that consists of a metallic structure that is consumed during power generation and then easily replaced with a new metallic component that restores a full charge. (Realigned from PE 0602131M).\n- Continue analysis of material alternatives for automated vehicle health monitoring and reporting.\n- Continue development of a backpack that prevents oscillatory and transient peak loading forces from causing skeletal injury while enhancing human mobility with heavy loads.\n- Continue development of advanced lightweight fuel to energy conversion concepts.  This includes development of power management electronics for reducing power requirements for military radios.\n- Continue demonstration of advanced concepts for mobile infrastructure.\n- Continue integration and demonstration of electrochemical ultracapacitors into hybrid electric power systems. \n- Continue efforts to improve advanced electrical power generation from fuel cells and renewable sources as well as to improve the efficiency of conventional generation via hybridization and smart-grid technologies.\n- Continue integration and demonstration of advanced materials to reduce maintenance into selected vehicle and machinery components.\n- Continue the development of robotic systems to facilitate the packaging and handling of logistic supplies.\n- Initiate a field demonstration of renewable energy devices and deployable equipment showing fewer liabilities when delivering expensive fuel, thereby lowering Marine Corps operational costs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.298"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.298"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue exploring the development of portable fuel cell technologies capable of providing Power in the 100 Watt to 500 Watt power range.\n- Continue analysis of material alternatives for automated vehicle health monitoring and reporting.\n- Continue demonstration of advanced concepts for mobile infrastructure.\n- Continue integration and demonstration of electrochemical ultracapacitors into hybrid electric power systems. \n- Continue efforts to improve advanced electrical power generation from fuel cells and renewable sources as well as to improve the efficiency of conventional generation via hybridization and smart-grid technologies.\n- Continue integration and demonstration of advanced materials to reduce maintenance into selected vehicle and machinery components.\n- Continue the development of robotic systems to facilitate the packaging and handling of logistic supplies.\n- Continue a field demonstration of renewable energy devices and deployable equipment showing fewer liabilities when delivering expensive fuel, thereby lowering Marine Corps operational costs.\n- Complete efforts to develop a micro turbine generator capable of 100W average power.\n- Complete research into developing a replaceable electrode battery power source that consists of a metallic structure that is consumed during power generation and then easily replaced with a new metallic component that restores a full charge. (Realigned from PE 0602131M).\n- Complete development of a backpack that prevents oscillatory and transient peak loading forces from causing skeletal injury while enhancing human mobility with heavy loads.\n- Complete development of advanced lightweight fuel to energy conversion concepts.  This includes development of power management electronics for reducing power requirements for military radios.\n- Initiate operations research and analysis efforts to enhance seabased expeditionary supply chain concepts and technologies. (Some analyses fall under PE0602131M, while more mature efforts fall under PE0603640M)\n- Initiate development of alternative (non-electrochemical) energy storage technologies for hybrid power system load management.\n- Initiate development of low energy desalination technologies to allow for efficient salt-water purification at the small\/individual scale.\n- Initiate the development of anti-fouling and non-fouling water purification components to enable enduring performance of small water purification systems.\n- Initiate the development of real-time water quality monitoring systems for use with small scale water purification systems.\n- Initiate the development of efficient water packaging and distribution technologies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MANEUVER"
                                    },
                                    "Description": {
                                        "val": "The Maneuver Thrust Technology Area focuses on the development, demonstration, and transition of technologies that will increase the warfighting capabilities and effectiveness of current and future Marine Corps maneuver systems.  This Thrust aims at capturing emerging and \"leap ahead\" technologies in the areas of mobility, materials, propulsion, survivability, durability, signature reduction, modularity, and unmanned systems.  Beginning in FY 2009, Mine Countermeasures (MCM) efforts are funded under the Force Protection activity.  Presently, MCM supports and enhances the maneuver and force protection Marine landing forces with the development of technologies to enable detection, neutralization, breaching, and clearing of mines, Improvised Explosive Devices (IEDs), and unexploded ordnance from the beach exit to inland objectives.  MAGTF MCM is a functional component of Naval Expeditionary Maneuver Warfare and includes Ship to Objective Maneuver (STOM), Expeditionary Operations from a Sea Base, sustained Operations Ashore, Urban and Asymmetric Operations, and OOTW.\n\nThe increase in the Maneuver Activity funding from FY 2013 to FY 2014 is due to higher costs associated with the development of autonomy technologies and system concepts that will enable unmanned ground vehicles (UGVs) to be used as autonomous logistic connector vehicles. \n\nThe FY 2014 to FY 2015 decrease in the Maneuver Thrust Activity is due to a reduction in scope of development of a vehicle demonstrator that focuses on enhanced crew survivability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.635"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued Advanced Electromagnetic Armor technology development efforts.\n- Continued development of fuel efficiency and battlefield power systems for improved performance.\n- Continued development of a Combat S&T Vehicle demonstrator to enhance crew survivability and vehicle fuel efficiency.\n- Continued survivability improvements and technologies to mitigate acceleration and traumatic brain injuries to occupants to enhance tactical mobility and survivability.\n- Continued advanced suspension systems development with ride height adjustment, ride quality adjustment, rollover prevention, and load equalizing systems for USMC tactical wheeled platforms to enhance tactical mobility in support of Distributed Operations.\n- Continued a Survivability\/ Active Protection Systems Improvement effort to increase effectiveness of defeat (Pdefeat) of shoulder launched (RPG) type threats and ATGM threats on light platforms utilizing non-kinetic kill technologies.\n- Continued new mobility efforts for On-Board Vehicle Power to increase mobile exportable power for Diesel Electric Propulsion Concepts and a Fuels effort to investigate future fuel alternatives for internal combustion engines to include Fischer-Tropsch and coal gasification processes for use in military tactical wheeled vehicles.\n- Continued Maneuver Enabling Technologies such as Vehicle Stabilization to improve vehicle suspension and control technologies to stabilize the platforms themselves to improve ride quality, shoot on the move capability and human systems integration.\n- Continued studies to identify technology development plans to close identified force protection capability gaps.\n- Continued a Vehicle Demonstrator program to design and fabricate an Integrated Power Demonstrator platform capable of producing the power needs for mobility and survivability concept demonstrations.\n- Continued efforts to evaluate current ground fleet platforms for their mobility and control capabilities as they relate to potential inclusion of an autonomous vehicle capability that will provide mobility and logistics support to the dismounted Marine during Enhanced Company Operations (ECO).\n- Continued efforts to demonstrate Integrated Armor Solutions that provide lighter weight armor materials with enhanced protection to vehicle occupants thereby enhancing tactical Mobility and Survivability in support of Distributed Operations.\n- Continued programs to address and enhance maneuver capability gaps in mobility such as efforts, transitioned from 6.2, aimed at the development of an autonomous vehicle capability that will provide mobility and logistics support to the dismounted Marine during Enhanced Company Operations (ECO)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.620"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts from FY2013, except those noted as completed.\n- Continue Advanced Electromagnetic Armor technology development efforts.\n- Continue development of fuel efficiency and battlefield power systems for improved performance.\n- Continue development of a Combat S&T Vehicle demonstrator to enhance crew survivability and vehicle fuel efficiency.\n- Continue survivability improvements and technologies to mitigate acceleration and traumatic brain injuries to occupants to enhance tactical mobility and survivability.\n- Continue advanced suspension systems development with ride height adjustment, ride quality adjustment, rollover prevention, and load equalizing systems for USMC tactical wheeled platforms to enhance tactical mobility in support of Distributed Operations.\n- Continue a Survivability\/ Active Protection Systems Improvement effort to increase effectiveness of defeat (Pdefeat) of shoulder launched RPG type threats and ATGM threats on light platforms utilizing non-kinetic kill technologies.\n- Continue new mobility efforts for On-Board Vehicle Power to increase mobile exportable power for Diesel Electric Propulsion Concepts and a Fuels effort to investigate future fuel alternatives for internal combustion engines to include Fischer-Tropsch and coal gasification processes for use in military tactical wheeled vehicles.\n- Continue Maneuver Enabling Technologies such as Vehicle Stabilization to improve vehicle suspension and control technologies to stabilize the platforms themselves to improve ride quality, shoot on the move capability and human systems integration.\n- Continue studies to identify technology development plans to close identified force protection capability gaps.\n- Continue a Vehicle Demonstrator program to design and fabricate an Integrated Power Demonstrator platform capable of producing the power needs for mobility and survivability concept demonstrations.\n- Continue efforts to evaluate current ground fleet platforms for their mobility and control capabilities as they relate to potential inclusion of an autonomous vehicle capability that will provide mobility and logistics support to the dismounted Marine during Enhanced Company Operations (ECO).\n- Continue efforts to demonstrate Integrated Armor Solutions that provide lighter weight armor materials with enhanced protection to vehicle occupants thereby enhancing tactical Mobility and Survivability in support of Distributed Operations.\n- Continue programs to address and enhance maneuver capability gaps in mobility such as efforts, transitioned from 6.2, aimed at the development of an autonomous vehicle capability that will provide mobility and logistics support to the dismounted Marine during Enhanced Company Operations (ECO).\n- Initiate the development of autonomy technologies and system concepts that will enable unmanned ground vehicles (UGVs) to be used as autonomous logistic connector vehicles.\n- Initiate the development of fuel saving vehicle technologies, including advanced transmission, power train, and electrical power system technologies.\n- Initiate mobility technologies that enable improved vehicle agility and stability.\n- Initiate lightweight armor, material, and structural technologies that enable maneuver and survivability of small, light expeditionary platforms.\n- Initiate survivability technologies that enable defeat of all unitary and tandem RPG and select ATGM threats, and the demonstration of survivable vehicles.\n- Initiate the development of technologies that enable vehicle component modularity and reduce life cycle costs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.685"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.685"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue advanced electromagnetic armor technology development efforts.\n- Continue development of fuel efficiency and battlefield power systems for improved performance.\n- Continue survivability improvements and technologies to mitigate acceleration and traumatic brain injuries to occupants to enhance tactical mobility and survivability.\n- Continue advanced suspension systems development with ride height adjustment, ride quality adjustment, rollover prevention, and load equalizing systems for USMC tactical wheeled platforms to enhance tactical mobility in support of Distributed Operations.\n- Continue a survivability\/ active protection systems improvement effort to increase effectiveness of defeat (Pdefeat) of shoulder launched RPG type threats and ATGM threats on light platforms utilizing non-kinetic kill technologies.\n- Continue efforts evaluating the current ground fleet platforms for their mobility and control capabilities as they relate to inclusion of an autonomous vehicle capability that will provide support to the dismounted Marine during Enhanced Company Operations (ECO).\n- Continue efforts to demonstrate integrated armor solutions that provide lighter weight armor materials with enhanced protection to vehicle occupants thereby enhancing tactical mobility and survivability. \n- Continue programs to address and enhance maneuver capability gaps in mobility such as efforts, transitioned from 6.2, aimed at the development of an autonomous vehicle capability that will provide mobility and logistics support to the dismounted Marine during Enhanced Company Operations (ECO).\n- Continue the development of autonomy technologies and system concepts that will enable unmanned ground vehicles (UGVs) to be used as autonomous logistic connector vehicles.\n- Continue the development of fuel saving vehicle technologies, including advanced transmission, power train, and electrical power system technologies.\n- Continue mobility technologies that enable improved vehicle\/warfighter agility and stability.\n- Continue lightweight armor, material, and structural technologies that enable maneuver and survivability of small, light expeditionary platforms.\n- Continue survivability technologies that enable defeat of all unitary and tandem RPG and select ATGM threats, and the demonstration of survivable vehicles.\n- Continue the development of technologies that enable vehicle component modularity and reduce life cycle costs.\n- Continued development of a Combat S&T Vehicle demonstrator to enhance crew survivability and vehicle fuel efficiency. \n- Continue new mobility efforts for On-Board Vehicle Power to increase mobile exportable power for Diesel Electric Propulsion Concepts and a Fuels effort to investigate future fuel alternatives for internal combustion engines to include Fischer-Tropsch and coal gasification processes for use in military tactical wheeled vehicles. \n- Continued Maneuver Enabling Technologies such as Vehicle Stabilization to improve vehicle suspension and control technologies to stabilize the platforms themselves to improve ride quality, shoot on the move capability and human systems integration. \n- Continue studies to identify technology development plans to close identified force protection capability gaps. \n- Continue a Vehicle Demonstrator program to design and fabricate an Integrated Power Demonstrator platform capable of producing the power needs for mobility and survivability concept demonstrations. \n- Initiate development of a vehicle demonstrator that focuses on enhanced crew survivability. \n- Initiate the development of autonomous perception technologies to enable operations under adverse atmospheric conditions."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "The primary objective of this PE is the development of technologies to meet unique Marine Corps needs in conducting Expeditionary Maneuver Warfare.  The program consists of a collection of projects categorized by critical warfighting function.  Individual project metrics reflect the technical goals of each specific project.  Typical metrics include the advancement of related Technology Readiness Levels, the degree to which project investments are leveraged with other performers, reduction in life cycle cost upon application of the technology, and the identification of opportunities to transition technology to higher categories of development."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2297"
                    },
                    "ProjectTitle": {
                        "val": "Marine Corps Warfighting Lab - Core"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "38.833"
                        },
                        "CurrentYear": {
                            "val": "44.018"
                        },
                        "BudgetYearOne": {
                            "val": "42.774"
                        },
                        "BudgetYearOneBase": {
                            "val": "42.774"
                        },
                        "BudgetYearTwo": {
                            "val": "46.112"
                        },
                        "BudgetYearThree": {
                            "val": "47.061"
                        },
                        "BudgetYearFour": {
                            "val": "47.743"
                        },
                        "BudgetYearFive": {
                            "val": "47.443"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "As part of the Futures Directorate (FD), of Combat Development and Integration (CD&I), the Commanding General (CG) of the Marine Corps Warfighting Laboratory (MCWL) also serves as the United States Marine Corps (USMC) Executive Agent for Marine Corps Science and Technology (S&T).  MCWL's mission is to enhance the current and determine the future Marine Corps strategic landscape.  This is accomplished by assessing the Marine Corps' next warfighting concepts and capabilities via development and evaluation of innovative tactics, techniques, procedures, organizations, and technologies using an integral combination of concept based experimentation, technology assessments, wargaming, and analysis which will provide the strategic axis of advance for the Corps' entire enterprise.  The FD also serves as the Marine Corps' liaison to the Joint Staff for Joint Concept Development and Experimentation; thereby facilitating service-specific experiments as well as participation in joint service experimentation.\n\nWargames are conducted to frame emerging warfighting concepts, establish the Joint context for the Marine Corps Force Development System, and establish priorities for development of experimental and non-experimental capabilities.\n\nModeling and Simulation (M&S)-based events allow MCWL to examine capabilities with larger scale venues and forces than is practical with live forces at lower cost in terms of funding and in terms of operating force personnel and equipment.  M&S also enables assessment of proposed capabilities before making investments in costly concept demonstrator technologies required in live force experiments. \n\nTechnology investigations, investments, and assessments are conducted to identify, modify where appropriate, and evaluate technological capabilities that support advanced warfighting concepts, and to explore the military utility of promising new commercial or government technologies in support of urgent and compelling needs.\n\nLive force experimentation permits exploration of prototype and surrogate technologies, as well as Tactics, Techniques, and Procedures (TTPs), in order to better refine equipment requirements and to identify Doctrine, Organization, Training, Materiel, Leadership, Personnel, and Facilities (DOTMLPF) initiatives needed to produce future capabilities.  Experimentation encompasses inquiries into multiple warfighting areas, including:  Combat Service Support (CSS) and Force Protection; Command, Control, Communications, and Computers (C4); Intelligence, Surveillance, and Reconnaissance (ISR); Fires, Targeting, and Maneuver; and Warfighting Excellence.\n\nUsing operational forces, MCWL conducts Advanced Warfighting Experiments (AWEs) supported by Limited Objective Experiments (LOEs), Limited Technical Assessments (LTAs), Wargames, and Studies.  These events are planned and scheduled as part of a series of experimentation campaigns focused on one or more central warfighting concepts.  These campaigns are executed under the guidance of the Commandant of the Marine Corps (CMC) and under the auspices of the Deputy Commandant (DC), CD&I.\n\nThe current Futures Directorate Campaign Plan (FDCP), formerly the MCWL Campaign Plan (MCP) addresses the challenges associated with the Enhanced Marine Air-Ground Task Force (MAGTF) Operations (EMO), Ship To Objective Maneuver (STOM), and Seabasing concepts.  This campaign began in FY 2011 and is projected to culminate with an Advanced Warfighting Experiment (AWE) in 2014.  EMO experimentation seeks to capitalize on the enhancements achieved during the previous MCWL campaign, Enhanced Company Operations (ECO), completed in FY 2010, which centered on expanding the combat capabilities of the Marine Infantry Company.  EMO experimentation examines and develops the capabilities of other elements of the MAGTF beyond the infantry company.  Focus areas for this effort are Logistics, Command and Control (C2), and Fires, Targeting, and Maneuver.\n\nUpon completion of EMO experimentation in FY 2014, MCWL will shift focus in FY 2015 to experimentation based on the challenges associated with achieving the goals expressed in the Secretary of the Navy's \"Cooperative Strategy 21\" and the Marine Corps' follow-on \"Expeditionary Force 21\" (EF21) concept.  MCWL will pursue experimentation that support flexible and sustainable MAGTFs employing distributed tactical formations across the range of military operations.  MCWL will also examine future enhancements in training, organization, and equipment for immediate crisis response, with projects such as such as Fly-in Integrated Command Element (FICE).  The goal of this concept-based line of experimentation is to support the continued operationalization of the concepts of Distributed Operations (DO), Operational Maneuver From The Sea (OMFTS), STOM, and Seabasing.\n\nFinally, the CMC designated MCWL as the lead agency for all USMC Counter Improvised Explosive Device (CIED) activities, thereby extending MCWL's responsibilities in this critical area.  MCWL continues to support the immediate needs of deployed forces and exploit opportunities presented by promising emerging technologies."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "COMBAT SERVICE SUPPORT (CSS) AND FORCE PROTECTION"
                                    },
                                    "Description": {
                                        "val": "This activity includes MCWL CSS and force protection experimentation efforts including assessment of equipment, new TTPs, training programs, and proposed organizational changes associated with enhanced capabilities.  Although this category covers several small (less than $500K per FY) efforts being pursued by MCWL, most programs listed below are considered major (valued at $500K or more) or have near real-time operational impact."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.141"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued to develop and experiment with bio-sciences (medical) technologies.\n- Continued assessment of unmanned ground logistics delivery technologies that support infantry small unit operations.\n- Continued assessment of technologies for sustainment of tactical level units from the sea-base. \n- Continued a MCWL-Defense Advanced Research Projects Agency (DARPA) partnership for the development and demonstration of a MCWL centric legged robot in an effort to \"Lighten the Load\" of individual Marines.\n- Continued research and assessment of technologies that reduce the demand required to support the MAGTF by completing development and assessment of a Marine Corps version of an Adaptive Logistics System as an operational as well as tactical level logistics decision support tool.\n- Continued testing and evaluation of blast sensors that may improve the medical treatment for potential Traumatic Brain Injury casualties.\n- Completed development, and testing of unmanned versions of current cargo vehicles."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.392"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2013, less those noted as completed above.  \n- Complete assessment of technologies for sustainment of tactical level units from the sea-base.\n- Complete testing and evaluation of blast sensors that may improve the medical treatment for potential Traumatic Brain Injury casualties. \n- Initiate development and assessment of counter-unmanned aerial systems (UAS) and unmanned ground vehicle (UGV) systems and TTPs. \n- Initiate testing and assessment of logistics enablers in support of EF21 experimentation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.211"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.211"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2014, less those noted as complete above.\n- Initiate assessment and experimentation with technologies that provide enhanced medical care over a distributed battlefied, to include \"virtual\" care and the use of autonomous systems in support of medical evacuation over ground, surface (water), or air.\n- Initiate evaluation and assessment of emerging technologies that support energy demand reduction.\n- Initiate investigation and assessment of logistics related emerging autonomous and robotic technologies and capabilities that further enhance current Programs of Record (PORs) and influence future planning and decision making."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FIRES, TARGETING, AND MANEUVER"
                                    },
                                    "Description": {
                                        "val": "This activity includes MCWL experimentation efforts in the areas of fires, targeting, and maneuver including assessment of equipment, new TTPs, training programs, and proposed organizational changes associated with enhanced capabilities.  Although this category covers several small (less than $500K per FY) efforts being pursued by MCWL, most programs listed below are considered major (valued at $500K or more) or have near real-time operational impact. \n\nThe increase in MCWL Fires, Targeting, and Maneuver activity funding from FY 2013 to FY 2014 is due to the pursuit of investigations into weaponized unmanned ground robotic and autonomous systems as well as ship-to-shore connectors."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.156"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued investigation, development, and testing of concept demonstrator technologies and TTPs for enhanced fire support and fire support coordination associated with the EMO concept. \n- Continued development and assessment of weaponized unmanned ground robotic systems.  \n- Completed assessment of concept demonstrator precision targeting devices.\n- Initiated and completed development and evaluation of an enhanced sniper sighting system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.321"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts from FY 2013, less those noted as completed above.\n- Complete investigation, development, and testing of concept demonstrator technologies and TTPs for enhanced fire support and fire support coordination associated with the EMO concept.\n- Initiate development of technologies that enhance the utility of autonomous systems.\n- Initiate test and assessment of future ship to shore connectors that support EF21."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts from FY 2014, less those noted as completed above. \n- Initiate investigation of innovative technologies to enhance squad-level capabilities.\n- Initiate evaluation and experimentation with technologies that can identify, neutralize, or destroy unmanned systems (aerial, ground, or surface).\n- Initiate evaluation and assessment of both airborne and ground weaponized autonomous\/semi-autonomous \"man-in-the-loop\" systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "COMMAND, CONTROL, COMMUNICATIONS, AND COMPUTERS (C4)"
                                    },
                                    "Description": {
                                        "val": "This activity encompasses all MCWL C4 related experimentation efforts including assessment of equipment, new TTPs, training programs, and proposed organizational changes associated with enhanced C4 capabilities.  Although this category covers several small (less than $500K per FY) efforts being pursued by MCWL, most programs listed below are considered major (valued at $500K or more) or have near real-time operational impact."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.005"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued C4 extended user assessments of selected prototype technologies in support of forces engaged in Operation Enduring Freedom (OEF). \n- Continued assessment of enhanced MAGTF communications concept demonstrators. \n- Continued development and assessment of Internally Transportable Vehicle (ITV) based C4 concept demonstrator. \n- Continued investigation and assessment of a MAGTF C2 architecture and an integrated C2 application in support of the EMO concept.\n- Continued development and assessment of a MAGTF network management system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.919"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2013.\n- Complete C4 extended user assessments of selected prototype technologies in support of forces engaged in OEF. \n- Complete assessment of enhanced MAGTF communications concept demonstrators. \n- Complete development and assessment of ITV based C4 concept demonstrator. \n- Complete investigation and assessment of a MAGTF C2 architecture and an integrated C2 application in support of the EMO concept.\n- Initiate development and assessment of a configurable C2 suite that enables operations from alternate seabased platforms in support of Expeditionary Force 21 (EF21) experimentation. \n- Initiate development and assessment of a configurable C2 suite that enhances operations from L-Class shipping in support of EF21 experimentation.\n- Initiate a follow-on effort to continue test and evaluation of an integrated C2 application in support of EF21 experimentation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.611"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.611"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued all efforts of FY 2014, less those notes as completed above.\n- Initiate development and assessment of systems that permit UAS operations in a global positioning system (GPS) denied environment. \n- Initiate development and assessment of a configurable C2 suite that enhances operations from aviation platforms in support of  EF21 experimentation.\n- Initiate investigations and assessment of technologies that support C2 enablers for shore deployed MAGTF elements that is platform agnostic and capable of deployment from the sea, air, or ground.\n- Initiate evaluation and experimentation with emerging technologies that support future maritime C2 capabilities\/EF21.\n- Initiate development and assessment of technologies that support a maritime FICE capable of operating from the sea-base during the conduct of immediate crisis response operations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "INTELLIGENCE, SURVEILLANCE, AND RECONNAISSANCE (ISR)"
                                    },
                                    "Description": {
                                        "val": "This activity includes MCWL ISR related experimentation efforts including assessment of equipment, new TTPs, training programs, and proposed organizational changes associated with enhanced ISR capabilities.  Although this category covers several small (less than $500K per FY) efforts being pursued by MCWL, most programs listed below are considered major (valued at $500K or more) or have near real-time operational impact. \n\nThe increase in MCWL ISR activity funding from FY 2013 to FY 2014 is due to an increased investment in technologies that integrate MAGTF level C4 ISR network abilities.  This investment level decreases between FY 2014 and FY 2015."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.941"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued additional IED investigations into promising detect and neutralize technologies.\n- Completed investigations into rotary wing\/hovering tactical level UAS concept demonstrators. \n- Initiated assessment of integrated MAGTF level C4 ISR network in support of EMO efforts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.294"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2013, less those noted as completed above.\n- Complete assessment of integrated MAGTF level C4 ISR network in support of EMO efforts.\n- Initiate development and assessment of seabased and landing force ISR capabilities that enable Expeditionary Force 21 (EF21) experimentation. \n- Initiate development and assessment of counter-UAS and unmanned ground vehicle (UGV) systems and TTPs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.558"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.558"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2014, less those noted as completed above.\n- Complete IED investigations into promising detect and neutralize technologies.\n- Initiate development and assessment of enhanced UAS sensor packages. \n- Initiate examination and assessment of technologies that support future employment of UAS operations from sea-based platforms."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MARINE CORPS WARFIGHTING LABORATORY (MCWL) OPERATIONS (SUPPORT)"
                                    },
                                    "Description": {
                                        "val": "MCWL Operations (Support) efforts include overall MCWL experimentation doctrine, planning, analysis, data collection, as well as technology transition tracking efforts.  Although this category covers several small (less than $500K per FY) efforts being pursued by MCWL, most programs listed below are considered major (valued at $500K or more) or have near real-time operational impact."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.409"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued to synthesize results and lessons learned into proposed DOTMLPF recommendations for the Marine Corps. \n- Continued to provide technical, strategic, and managerial support to Marine Corps experimentation. \n- Continued to provide overall analysis and reporting of experimentation efforts, analytical assistance during experiment design, and maintenance of an ad-hoc analysis capability."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.109"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2013."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.151"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.151"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2014.\n- Initiate deliberate broad-based commercial technology forecasting in support of experimentation long-range planning and combat development.\n- Initiate technical, strategic, and managerial support for operations with advanced technology utilizing autonomy, robotics, and cyber capabilities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "WARFIGHTING EXCELLENCE"
                                    },
                                    "Description": {
                                        "val": "This activity includes MCWL efforts in the development and assessment of joint and service warfighting concepts, joint and service missions, analysis of emerging threats and opportunities, and joint capability experimentation.  It also includes MCWL service experimentation in areas that impact multiple warfighting functions.  Although this category covers several small (less than $500K per FY) efforts being pursued by MCWL, most programs listed below are considered major (valued at $500K or more) or have near-real-time operational impact. \n\nThe increase in MCWL Warfighting Excellence activity funding from FY 2013 to FY 2014 is due to increased focus on M&S based training, to include investment into improving Wargaming abilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.181"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued executive agent responsibilities for Joint Title Ten (X) programs, such as Unified Quest, Unified Course, and Unified Engagement.  Title X war games address future capabilities in the context of Title X readiness responsibilities. \n- Continued management and oversight of non-Title X Wargaming, including the highly visible Office of the Secretary of Defense Net Assessment Transformation War Game series and the Special Operations Command wargaming series. \n- Continued to support the Center for Emerging Threats and Opportunities (CETO) mission:  1) prevent operational and tactical surprises to senior Warfighting Commanders by assessing future security environments in light of emerging threats and potential conceptual and technological opportunities; 2) help focus science, technology, and experimental efforts by appraising promising concepts and technologies; 3) serve as a catalyst to stimulate thought and debate on issues of importance to the Marine Corps. \n- Continued funding contributions to Joint Concept Technology Demonstrations (JCTDs) and Advanced Concept Technology Demonstrations (ACTDs).  Both JCTDs and ACTDs are intended to rapidly field needed capabilities by using emergent mature technologies matched with innovative operational concepts. \n- Continued experimentation of simulation based training technologies to enhance individual and small unit combat task proficiency and decision making."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.983"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2013.\n- Complete experimentation of simulation based training technologies to enhance individual and small unit combat task proficiency and decision making."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.243"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.243"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2014, less those noted as completed above.\n- Initiate development and assessment of modeling and simulation hardware, software, and training capabilities that support planning\/experimentation processes."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "The primary objective of this PE is the development of technologies to meet unique Marine Corps needs in conducting Expeditionary Maneuver Warfare. The program consists of a collection of projects categorized by critical warfighting function. Individual project metrics reflect the technical goals of each specific project. Typical metrics include the advancement of related Technology Readiness Levels, the degree to which project investments are leveraged with other performers, reduction in life cycle cost upon application of the technology, and the identification of opportunities to transition technology to higher categories of development."
                        }
                    }
                }
            ]
        }
    }
}