{
    "id": "d90e8cf90c0cbbc46cedb5aec6e82ed5e71e9996",
    "meta": {
        "filename": "dod-2015_RDTE_2015_CDBP_RDTE_JustificationBook_Chemical_and_Biological_Defense_Program_PB_2015.zzz_unzipped_RDTE_JustificationBook_Chemical_and_Biological_Defense_Program_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Chemical and Biological Defense Program",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605384BP"
        },
        "ProgramElementTitle": {
            "val": "CHEMICAL\/BIOLOGICAL DEFENSE (RDT&E MGT SUPPORT)"
        },
        "R1LineNumber": {
            "val": "150"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Chemical and Biological Defense Program"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "89.100"
            },
            "CurrentYear": {
                "val": "89.346"
            },
            "BudgetYearOne": {
                "val": "105.944"
            },
            "BudgetYearOneBase": {
                "val": "105.944"
            },
            "BudgetYearTwo": {
                "val": "108.472"
            },
            "BudgetYearThree": {
                "val": "109.443"
            },
            "BudgetYearFour": {
                "val": "109.956"
            },
            "BudgetYearFive": {
                "val": "110.443"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Budget Activity includes research, development, testing and evaluation management support for the Department of Defense (DoD) Chemical and Biological Defense Program (CBDP).\n\nProgram Element 0605384BP supports Joint Doctrine and Training (Project DT6), sustains the technical test capability at West Desert Test Center (WDTC) (Project DW6); sustains the core Department of Defense (DoD) Science and Technology (S&T) laboratory infrastructure (Project LS6), provides for program management and financial management support (Project MS6), and supports the Joint Concept Development and Experimentation (JCDE) program (Project O49).   \n\nThe Joint Training and Doctrine Support (DT6) project funds development of Joint Doctrine and Tactics, Techniques, and Procedures (TTPs) for developing CB defense systems.  This project also funds CB modeling and simulation to support the Warfighter.\n\nThe Major Range and Test Facility Base (MRTFB) is a set of test installations, facilities, and ranges which are regarded as \"national assets\".  These assets are sized, operated, and maintained primarily for DoD test and evaluation missions.  However, the MRTFB facilities and ranges are also available to commercial and other users on a reimbursable basis.  WDTC is designated as the primary element of the MRTFB to primarily conduct CB Defense test and evaluation.  The DW6 Project provides operating funds to WDTC to ensure that DoD test customers are only charged direct costs of testing and that overhead expenses are centrally funded.  It finances the required institutional test operating costs.  Institutional test operating costs include institutional civilian and contractor labor; repair and maintenance of test instrumentation, equipment, and facilities; and replacement of test equipment.\n\nThe Laboratory Support (LS6) project funds laboratory infrastructure to maintain and enhance DoD infrastructure capabilities to counter an expanding threat space, exploit advances in technology; and develop and transition CB defense equipment and countermeasures to the Warfighter.\n\nThe management support (MS6) project, provides management support for the DoD CBDP to allow program overview and integration of overall medical and non-medical programs by the Assistant to the Secretary of Defense for Nuclear, Chemical, and Biological Defense Programs (ATSD(NCB)), through the Deputy Assistant to the Secretary of Defense for Chemical Biological Defense and Chemical Demilitarization Programs (DATSD(CBD\/CD)); funds management by the Defense Threat Reduction Agency (DTRA); integration of Joint requirements, management of training and doctrine by the Joint Requirements Office (JRO); Joint RDA planning, input to the Annual Report to Congress and Program Objective Memorandum (POM) development by the Program Analysis and Integration Office (PAIO); review of Joint plans and the consolidated CB Defense POM Strategy by Army in its Executive Agent role.  \n\nThe management support project also funds the Test and Evaluation (T&E) Executive mission to establish test infrastructure investment strategy and adequate testing for Developmental Testing (DT) and Operational Testing (OT) of Department of Defense (DoD) Chemical Biological Defense (CBD) systems and components throughout the systems' acquisition life cycle, as required in the RDA Plan under the JTIWG program.  The JTIWG program funds T&E Early Involvement, test threat planning, Fielded Equipment Assessments, T&E studies, and T&E Standards planning and development to support testing the CBD systems for all services to include radiological, nuclear, medical T&E efforts.  \n\nThe Joint Concept Development and Experimentation (O49) project funds the planning, conduct, evaluation, and reporting on Joint tests (for other than developmental hardware) and accomplishment of operational research assessments in response to requirements received from the Services and the Combatant Commanders for already fielded equipment and systems.\n\nThis Budget Activity also funds Program Element 0605502BP, which supports the Small Business Innovative Research (SBIR) program. The overall objective of the Chemical and Biological Defense (CBD) SBIR program is to improve the transition or transfer of innovative CBD technologies between DoD components and the private sector for mutual benefit. The CBD program includes those technology efforts that maximize a strong defensive posture in a CB environment using passive and active means as deterrents. These technologies include CB detection; information assessment (identification, modeling, and intelligence); contamination avoidance; and protection of both individual soldiers and equipment."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "92.849"
                },
                "CurrentYear": {
                    "val": "92.046"
                },
                "BudgetYearOne": {
                    "val": "97.668"
                },
                "BudgetYearOneBase": {
                    "val": "97.668"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "89.100"
                },
                "CurrentYear": {
                    "val": "89.346"
                },
                "BudgetYearOne": {
                    "val": "105.944"
                },
                "BudgetYearOneBase": {
                    "val": "105.944"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-3.749"
                },
                "CurrentYear": {
                    "val": "-2.700"
                },
                "BudgetYearOne": {
                    "val": "8.276"
                },
                "BudgetYearOneBase": {
                    "val": "8.276"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.123"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "-7.755"
                    },
                    "CurrentYear": {
                        "val": "-2.700"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "5.359"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.230"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "8.276"
                                },
                                "BudgetYearOneBase": {
                                    "val": "8.276"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funding: FY13: Reductions of $7.8M delayed T&E execution and weakened Dugway Proving Grounds capability to provide realistic threat representation\/replication, dissemination, and assessment. Reduced support to early test involvement and T&E standards development across the Interagency and Internationally. \n\nFY14: Reductions of $2.7M impact Dugway Proving Ground T&E execution potentially increasing program test costs and timelines. \n\nFY15: Increases of $8.3M ensure sustainment and modernization of core chemical biological defense infrastructure, specifically for modernization efforts at the Edgewood Chemical Biological Center.  These additional resources ensure key systems are upgraded to the current state-of-the-art capabilities necessary for surety operations to be conducted effectively and safely.\n\nSchedule: N\/A\n\nTechnical: N\/A"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "DT6"
                    },
                    "ProjectTitle": {
                        "val": "JOINT DOCTRINE AND TRAINING SUPPORT (RDT&E MGT SUPPORT)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.262"
                        },
                        "CurrentYear": {
                            "val": "4.724"
                        },
                        "BudgetYearOne": {
                            "val": "4.868"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.868"
                        },
                        "BudgetYearTwo": {
                            "val": "5.028"
                        },
                        "BudgetYearThree": {
                            "val": "5.170"
                        },
                        "BudgetYearFour": {
                            "val": "5.306"
                        },
                        "BudgetYearFive": {
                            "val": "5.306"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The activities of this project directly support the Joint Service CB defense program; in particular, the development of Joint Chemical, Biological, Radiological, and Nuclear (CBRN) defense capability requirements and the improvement of CBRN defense related doctrine, education, training, and awareness at the Joint and Service levels.  This effort provides for: (1) Development, coordination, and integration of Joint CBRN defense capability requirements; (2) Development\/revision of medical and non-medical CBRN defense Multi-Service Tactics, Techniques, and Procedures (MTTP) and development\/revision of Joint Doctrine and Tactics, Techniques, and Procedures (JTTP); (3) The CBDP Joint Senior Leader Course (JSLC); (4) Assistance in correcting training and doctrine deficiencies covered in the lessons learned process, combat operations, capability development studies and Department of Defense Inspector General (DODIG) and Government Accountability Office (GAO) reports and; (5) Support of current and planned CBRN defense studies, analysis, training, exercises, and war games; determine overlaps, duplication, and shortfalls; and build and execute programs to correct shortfalls in all aspects of CBRN defense across all DoD mission areas."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) JRO DT"
                                    },
                                    "Description": {
                                        "val": "The purpose of this requirement is to provide technical and subject matter expert (SME) support in the areas of: related CBRN Defense\/Countering Weapons of Mass Destruction (CWMD); Joint and Multi-Service doctrine development; Joint and Service training, leadership development, education, and exercises. \n\nSpecifically, support is needed to:\n1.  Conduct technical reviews of Joint and Multi-service CBRN Defense\/CWMD doctrinal materials and develop CBRN defense\/CWMD related MTTP manuals.\n2.  Plan and conduct CBRN defense\/CWMD Joint Professional Military Education (JPME).\n3.  Provide CBRN defense\/CWMD planning, execution and SME support to Combatant Command (CCMD) and Joint Task Force (JTF) level exercises.\n4.  Conduct staff and leader CBRN defense\/CWMD training for CCMD and JTF level commands.\n\nProvides support to the National Defense University (NDU) Center for the Study of Weapons of Mass Destruction (WMD) to support their efforts as the Chairman's focal point for CWMD JPME."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.262"
                                            },
                                            "Text": {
                                                "val": "Supported revisions of Joint Publications (JP) 3-27, 3-28 and 3-29.  JP 3-11 is currently in the development process and anticipate completion during FY14.  Initiated JP 3-40 revision.  Revised many MTTPs for Military CBRN Hazards and CBRN Passive Defense.  Supported JPME and training at: the Eisenhower School, Army, Navy, Marine Corps, Air Force, and National War Colleges; Joint Special Operations University; Army Command & General Staff School; Air Force & Marine Corps Command & General Staff Colleges; Joint & Combined Warfighting Schools; Military Police (MP) school; CBRN school; Engineers (Eng) Captain's Career Course (CCC); Reserve CCC; Joint Forces Staff College; and the United States Air Force (USAF) Counter Proliferation Center.  Provided support to Exercises Ardent Sentry, Vigilant Shield, Able Response, Talisman Saber, Ulchi Freedom Guardian, Key Resolve, Regional Cooperation, Special Operations Command (SOCOM) CBRN Table Top Exercise (TTX), Vibrant Response, Global Thunder and Sudden Response."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.724"
                                            },
                                            "Text": {
                                                "val": "Will continue to provide support to Joint and Multi-service doctrine development.  Doctrine work will include: completion of JP 3-11 and JP 3-40; MTTPs for Military CBRN Hazards; and MTTPs for CBRN Passive Defense.  Will begin work on MTTP manual for the Treatment of Chemical Agent Casualties and Conventional Injuries. \n\nWill continue to provide support in the areas of: scenario development; and controller\/evaluator training.  Will provide SMEs to annual exercises such as Ardent Sentry, Vigilant Shield, Able Response, Talisman Saber, Ulchi Freedom Guardian, Key Resolve, Regional Cooperation, SOCOM CBRN TTX, Vibrant Response, Global Thunder, and Sudden Response.\n\nWill continue to support JPME and other training efforts at: the Eisenhower School; Army, Navy, Marine Corps, and Air Force War Colleges; National War Colleges; Joint Special Operations University; Army Command & General Staff School; Air Force & Marine Corps Command & General Staff Colleges; Joint & Combined Warfighting Schools; MP School; CBRN School; Eng CCC; Reserve CCC; Joint Forces Staff College; and the USAF Counter Proliferation Center."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.868"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.868"
                                            },
                                            "Text": {
                                                "val": "Will continue to provide support in the areas related to: CBRN defense; CWMD; Joint and Multi-Service doctrine development; Joint and Service training; leadership development and education; and exercises."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "DW6"
                    },
                    "ProjectTitle": {
                        "val": "MAJOR RANGE AND TEST FACILITY BASE (MRTFB)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "51.914"
                        },
                        "CurrentYear": {
                            "val": "53.270"
                        },
                        "BudgetYearOne": {
                            "val": "56.166"
                        },
                        "BudgetYearOneBase": {
                            "val": "56.166"
                        },
                        "BudgetYearTwo": {
                            "val": "52.431"
                        },
                        "BudgetYearThree": {
                            "val": "53.031"
                        },
                        "BudgetYearFour": {
                            "val": "52.704"
                        },
                        "BudgetYearFive": {
                            "val": "52.720"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Project provides the technical and operational capability for testing Department of Defense (DoD) Chemical and Biological (CB) defense materiel, equipment, and systems from concept through production at West Desert Test Center (WDTC), a Major Range and Test Facility Base (MRTFB) located at Dugway Proving Ground (DPG).  Project provides overhead (institutional) funding required to operate WDTC in compliance with Section 232 of the National Defense Authorization Act (NDAA) for FY03 (Public Law 107-314 - December 2002). \n\nWDTC is the reliance center for all DoD CB defense testing and provides the United States' only combined range, chamber, toxic chemical lab, and bio-safety level (BSL) three test facility.  Total institutional test operating costs are to be provided by the Service component IAW DoD 3200.11.\n\nWDTC uses state-of-the-art chemical and life sciences test facilities and test chambers to perform CB defense testing of protective gear, decontamination systems, detectors, and equipment while maintaining safety, security, and surety of chemical agents and biological pathogens.  WDTC also provides a fully instrumented outdoor range capability for testing with simulants that can be correlated to the laboratory testing with live agents to ensure reliable and repeatable data is generated to support acquisition decisions of CB defense equipment."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) WDTC, MRTFB"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "32.483"
                                            },
                                            "Text": {
                                                "val": "Maintained WDTC technical test capability and operations to include institutional civilian labor costs.  These civilian personnel ensure the safe and efficient operations of the MRTFB and include safety, security, resource management, surety operations, range control, environmental oversight, workload management, and training.  This represents the civilian labor and MRTFB operating costs required to support operations, which cannot be directly tied to a single test customer."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "35.486"
                                            },
                                            "Text": {
                                                "val": "Maintains WDTC technical test capability and operations to include institutional civilian labor costs.  These civilian personnel ensure the safe and efficient operations of the MRTFB and include safety, security, resource management, surety operations, range control, environmental oversight, workload management, and training.  This represents the civilian labor and MRTFB operating costs required to support operations, which cannot be directly tied to a single test customer."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "36.327"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "36.327"
                                            },
                                            "Text": {
                                                "val": "Maintains WDTC technical test capability and operations to include institutional civilian labor costs.  These civilian personnel ensure the safe and efficient operations of the MRTFB and include safety, security, resource management, surety operations, range control, environmental oversight, workload management, and training.  This represents the civilian labor and MRTFB operating costs required to support operations, which cannot be directly tied to a single test customer."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "2) WDTC, MRTFB"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.477"
                                            },
                                            "Text": {
                                                "val": "Provided for ongoing sustainment of existing test instrumentation and equipment at WDTC, in support of their operations.  Supports annual service contracts for equipment operation, diagnostics, and calibration, as well as routine life-cycle and use-related replacement of existing field, administrative, and analytical instrumentation components and systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.925"
                                            },
                                            "Text": {
                                                "val": "Provides for ongoing sustainment of existing test instrumentation and equipment at WDTC, in support of their operations.  Supports annual service contracts for equipment operation, diagnostics, and calibration, as well as routine life-cycle and use-related replacement of existing field, administrative, and analytical instrumentation components and systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.125"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.125"
                                            },
                                            "Text": {
                                                "val": "Provides for ongoing sustainment of existing test instrumentation and equipment at WDTC, in support of their operations.  Supports annual service contracts for equipment operation, diagnostics, and calibration, as well as routine life-cycle and use-related replacement of existing field, administrative, and analytical instrumentation components and systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "3) WDTC, MRTFB"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.137"
                                            },
                                            "Text": {
                                                "val": "Provided WDTC with a dedicated and specially trained, 24-hour, support staff who operate and maintain all critical control systems, such as highly complex heating, ventilation, and air conditioning (HVAC) system, and decontamination systems within WDTC's Materiel Test Facility (MTF), Combined Chemical Test Facility (CCTF), and the Life Science Test Facility (LSTF) Complex."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.300"
                                            },
                                            "Text": {
                                                "val": "Provides WDTC with a dedicated and specially trained, 24-hour, support staff who operate and maintain all critical control systems, such as highly complex HVAC system, and decontamination systems within WDTC's MTF, CCTF, LSTF Complex."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.341"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.341"
                                            },
                                            "Text": {
                                                "val": "Provides WDTC with a dedicated and specially trained, 24-hour, support staff who operate and maintain all critical control systems, such as highly complex HVAC system, and decontamination systems within WDTC's MTF, CCTF, LSTF Complex."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "4) WDTC, MRTFB"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.587"
                                            },
                                            "Text": {
                                                "val": "Supported the WDTC defense mission by funding contractor labor overhead costs.  This is the institutional cost of providing contractual effort to this MRTFB including chemical and biological analysis, field support, planning, and report documentation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.799"
                                            },
                                            "Text": {
                                                "val": "Supports the WDTC defense mission by funding contractor labor overhead costs.  This is the institutional cost of providing contractual effort to this MRTFB including chemical and biological analysis, field support, planning, and report documentation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.386"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.386"
                                            },
                                            "Text": {
                                                "val": "Supports the WDTC defense mission by funding contractor labor overhead costs.  This is the institutional cost of providing contractual effort to this MRTFB including chemical and biological analysis, field support, planning, and report documentation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "5) NTA TEST"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.230"
                                            },
                                            "Text": {
                                                "val": "Provided initial phase of upgrade of current test capabilities to establish a Non-Traditional Agent (NTA) Developmental and Operational Test capability at WDTC, including tests to correlate agents to simulants performance, leveraging Science & Technology (S&T) for initial set of NTAs.  Includes continued instrumentation and methodology modifications for field Operational Testing with NTA simulants and for chamber Developmental Testing with initial NTAs: developing design and integration approaches for individual test fixtures and equipment for containment levels and surety operations; modify field test capability and referee systems to measure NTA simulants."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.760"
                                            },
                                            "Text": {
                                                "val": "Continues to maintain current synthesis capability (personnel expertise and existing instrumentation) and analytical processes and methods developed through FY13.  Limited technology transfers between DPG and Edgewood Chemical Biological Center (ECBC).  This capability is critical to facilitate successful transition between S&T and Test and Evaluation (T&E) for NTA and evolving threats."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.987"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.987"
                                            },
                                            "Text": {
                                                "val": "Continues to maintain synthesis capability (personnel expertise and existing instrumentation) and analytical processes and methods developed through FY13.  Limited technology transfers between DPG and ECBC.  This capability is critical to facilitate successful transition between S&T and T&E for NTA and evolving threats."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "LS6"
                    },
                    "ProjectTitle": {
                        "val": "LABORATORY SUPPORT"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.000"
                        },
                        "CurrentYear": {
                            "val": "0.742"
                        },
                        "BudgetYearOne": {
                            "val": "12.132"
                        },
                        "BudgetYearOneBase": {
                            "val": "12.132"
                        },
                        "BudgetYearTwo": {
                            "val": "12.290"
                        },
                        "BudgetYearThree": {
                            "val": "12.436"
                        },
                        "BudgetYearFour": {
                            "val": "12.657"
                        },
                        "BudgetYearFive": {
                            "val": "12.894"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project (LS6) provides for the sustainment and modernization of the DoD laboratory infrastructure capabilities to counter an expanding threat space, exploit advances in technology, and develop and transition chemical and biological (CB) defense equipment and countermeasures to the Warfighter.  This laboratory infrastructure project upgrades key systems to the current state-of-the-art capabilities.  Key systems include: gas filters, mechanical\/electrical, fume hoods and duct work and structural systems.  Also provides for the initial equipment outfitting of new facilities.  This project will ensure that the necessary surety operations can be conducted effectively and safely in support of Chemical and Biological Defense Program (CBDP) RDTE programs.  As a force multiplier, this project will provide more robust capabilities to the CBDP and ensure continuity of operations and environmental compliance."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) LABINF - Edgewood Chemical Biological Center Surety Facility Sustainment"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Performed general facility sustainment in key surety facilities.  Includes general safety, structural, exterior, interior, and utility sustainment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.742"
                                            },
                                            "Text": {
                                                "val": "Performing general facility sustainment in key surety facilities.  Includes general safety, structural, exterior, interior, and utility sustainment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.132"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.132"
                                            },
                                            "Text": {
                                                "val": "Perform general facility sustainment and modernization in key surety facilities that support the Chemical Biological Defense Program (CBDP)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "2) LABINF - Facility Operations, Sustainment, and Regulatory Compliance"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Provided laboratory infrastructure project upgrades for key systems to the current state-of-the-art capabilities.  Key enabling activities to support the medical chemical and biological defense research and development infrastructure at USAMRIID and USAMRICD include: support for veterinary medicine; regulatory affairs and quality assurance compliance activities; chemical surety costs; occupational health issues; maintenance of the vivarium; and maintenance of the neat (chemical) agent facility for medical countermeasure development."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MS6"
                    },
                    "ProjectTitle": {
                        "val": "RDT&E MGT SUPPORT"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "29.516"
                        },
                        "CurrentYear": {
                            "val": "27.019"
                        },
                        "BudgetYearOne": {
                            "val": "28.799"
                        },
                        "BudgetYearOneBase": {
                            "val": "28.799"
                        },
                        "BudgetYearTwo": {
                            "val": "34.345"
                        },
                        "BudgetYearThree": {
                            "val": "34.829"
                        },
                        "BudgetYearFour": {
                            "val": "35.230"
                        },
                        "BudgetYearFive": {
                            "val": "35.464"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project provides management support for the DoD CBDP.  It includes program oversight and integration of overall non-CBRN Defense Equipment (non-CDE) and CBRN Defense Equipment (CDE) programs by the Assistant to the Secretary of Defense for Nuclear and Chemical and Biological Defense Programs (ATSD(NCB)) defense programs through the Deputy Assistant to the Secretary of Defense for Chemical and Biological Defense\/Chemical Demilitarization (ODATSD(CBD\/CD)).  Funds execution management is provided by DTRA. \n\nThe project also provides for the development, coordination and integration of Joint Chemical, Biological, Radiological and Nuclear (CBRN) defense capability requirements, including assistance and support to the Combatant Commanders (COCOMs) and Services to improve CBRN defense related doctrine, education, training, and awareness by the Joint Requirements Office (JRO); preparation of Joint Capability Integration and Development System (JCIDS) documents in accordance with Chairman of The Joint Chiefs of Staff Instruction CJCSI 3170.01H dated 10 January 2012; Joint CBRN Defense Research, Development, and Acquisition (RDA) planning; input to the CBD Annual Report to Congress; and program guidance development by the Program Analysis and Integration Office (PAIO).\n\nThe project includes programming support for the Joint Service CB Information System (JSCBIS) which serves as a budgetary and informational database for the DoD CBDP.  Also included within the project is financial management services to include fund distribution, execution reporting, and fiscal financial statements.\n\nThis project also supports the Chemical, Biological, Radiological and Nuclear Defense (CBRND) Test and Evaluation (T&E) Executive, who is responsible for the planning, balancing, and oversight of test infrastructure and test technology requirements to support Developmental Testing (DT) and Operational Testing (OT) of DoD CBRND systems, as outlined in the RDA Plan.  The CBRND T&E Executive oversees the Enterprise processes to develop and sustain standardized T&E methodologies and validated instrumentation and infrastructure to ensure the adequacy of test for CBRND systems in alignment with acquisition milestones and associated decision points.  The JTIWG program funds T&E Early Involvement, test threat planning, fielded equipment assessments, T&E studies, and T&E standards planning and development to support CBRN Defense testing for all Services to include medical T&E efforts.  \n\nThe CBRND T&E Executive directly supports OSD T&E oversight acquisition programs and provides the mechanism for early T&E involvement in the acquisition process.  The CBRND T&E Executive provides the T&E infrastructure investment strategy and coordinates investment planning and T&E capabilities validation among the Joint Service Community to ensure that program needs are met.  The CBRND T&E Executive oversees the T&E processes to include fielded equipment assessments to ensure end to end feedback loops to support to the Warfighter."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) JRO MGT"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.755"
                                            },
                                            "Text": {
                                                "val": "Implemented CBRN Defense medical and non-medical capabilities development.  This consisted of representing the Services and COCOMs in JCIDS by acting as their proponent for coordinating and integrating CBRND operational capabilities.  Reviewed and updated the CBRND Modernization Plan and the CBRND Joint Priority List.  Chaired and operated the Countering Weapons of Mass Destruction (CWMD) Working Group for the Protection Functional Control Board (FCB).  Served as the Joint Staff focal point for CBRN Survivability and the Joint Staff principal to the Biodefense Policy Coordinating Committee, Homeland Security Council.  Updated CB Defense Modernization Plan.  Coordinated Defense Department CBDP Annual Report to Congress.  Coordinated Capabilities Gap Assessment actions.  Coordinated Counter-proliferation Program Review Committee.  Participated in multi-national agreements with international organizations such as NATO.  Produced operational architecture for systems in development and maintained over-arching CBRND operational architecture.  Monitored and abetted Advanced Technology Demonstrations (ATDs) and Joint Concept Technology Demonstrations (JCTDs).  Developed Joint Staff positions on demonstration proposals.  Led CBDP Enterprise Program Objective Memorandum (POM) development.  Coordinated CWMD Working Group.  Provided and coordinated liaison office support to Combatant Commands.  Created the Radiological\/Nuclear Integrated Concept Team (ICT) to support the expanding mission portfolio. \n\nInitiated and completed Analysis of Alternatives (AoA) for Western Eastern Venezuelan Encephalitis Vaccine.  Initiated: AoAs for Next Generation Chemical Detection (NGCD) and for Next Generation Diagnostics System (NGDS) Increment 2.\n\nInitiated Capability Development Documents (CDDs) for: Hemorrhagic Fever Virus (HFV); Common Analytical Laboratory System (CALS); and NGDS Increment 1.  \n\nInitiated and completed Capability Production Document (CPD) for CBRN Uniform Integrated Protection Ensemble (UIPE) Increment 1.  Initiated CPD for Botulinum Vaccine (VAC BOT)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.363"
                                            },
                                            "Text": {
                                                "val": "Will continue to implement CBRN Defense medical and non-medical capabilities development.  This will consist of representing the Services and COCOMs in JCIDS by acting as their proponent for coordinating and integrating CBRND operational capabilities.  Will review and update the CBRND Modernization Plan and the CBRND Joint Priority List.  Will chair and operate the CWMD Working Group for the Protection FCB.  Will serve as the Joint Staff focal point for CBRN Survivability and the Joint Staff principal to the Biodefense Policy Coordinating Committee, Homeland Security Council.  Will coordinate the Defense Department CBDP Annual Report to Congress.  Will coordinate Capabilities Gap Assessment actions.  Will participate in multi-national agreements with international organizations such as NATO.  Will produce operational architecture for systems in development and will maintain over-arching CBRND operational architecture.  Will monitor and assist ATDs and JCTDs.  Will develop Joint Staff positions on demonstration proposals.  Will lead the CBDP Enterprise Program Objective Memorandum (POM) development.  Will provide and coordinate liaison office support to COCOMs.  Will support the Radiological\/Nuclear ICT.\n\nWill complete AoAs: for NGCD and NGDS Increment 2.  \n\nWill initiate a CDD for Joint Biological Tactical Detection System (JBTDS).  Will initiate and complete a CDD for Joint Effects Model (JEM) Increment 2.  Will complete CDDs for HFV, NGDS Increment 1, and CALS.  \n\nWill initiate and complete CPDs for Joint Service Aircrew Mask Fixed Wing (JSAM FW) and Joint Service Aircrew Mask Rotary Wing (JSAM RW).  Will initiate CPDs for Plague Vaccine (VAC PLG)and NGDS Increment 1."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.550"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.550"
                                            },
                                            "Text": {
                                                "val": "Will continue to implement CBRN Defense medical and non-medical capabilities development.  This will consist of representing the Services and COCOMs in JCIDS by acting as their proponent for coordinating and integrating CBRND operational capabilities.  Will review and update the CBRND Modernization Plan and the CBRND Joint Priority List.  Will chair and operate the CWMD Working Group for the Protection FCB.  Will serve as the Joint Staff focal point for CBRN Survivability and the Joint Staff principal to the Biodefense Policy Coordinating Committee.  Will coordinate the Defense Department CBDP Annual Report to Congress.  Will coordinate Capabilities Gap Assessment actions.  Will participate in multi-national agreements with international organizations such as NATO.  Will produce operational architecture for systems in development and will maintain over-arching CBRND operational architecture.  Will monitor and assist ATDs and JCTDs.  Will develop Joint Staff positions on demonstration proposals.  Will lead the CBDP Enterprise Program Objective Memorandum (POM) development.  Will provide and coordinate liaison office support to COCOMs.  Will support the Radiological\/Nuclear ICT.\n\nWill complete CDD for JBTDS. \n\nWill complete CPD for VAC PLG."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "2) JTIWG"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.019"
                                            },
                                            "Text": {
                                                "val": "Continued T&E Executive mission support to ensure credible testing, T&E Early Involvement, Fielded Equipment Assessments, T&E Studies, evaluation and decision support for CBDP systems; supported the DOT&E for OSD T&E Oversight; and supported the Assistant to the Secretary of Defense (NCB) in infrastructure planning, input to the Program Objective Memorandum (POM) process, and establishing T&E Standards to support the White House Subcommittee on Standards and other interagency groups.  Continued direct support to the Joint Program Executive Office for Chemical Biological Radiological Nuclear Defense (JPEO-CBRND) and the JRO IPTs and ICTs providing technical assistance to structure acquisition programs, plan for Analysis of Alternatives (AoAs) and develop test scopes.  Continued early involvement of the OTAs and other T&E organizations in T&E infrastructure planning, development, and validation.  Continue development of threat test support documentation to support developmental and operational tests in which an operational threat must be realistically presented.  Programs supported include NTA detector; Joint Biological Tactical Detection System (JBTDS); Joint Biological Point Detector System (JBPDS); Joint Chemical Agent Detector (JCAD); Improved Point Detection System (IPDS); Next Generation Chemical Detector (NGCD) and all detectors; Uniform Individual Protection Ensemble (UIPE); Dismounted Reconnaissance Sets, Kits, and Outfits (DR-SKO); Joint Expeditionary Collective Protection (JECP); Next Generation Diagnostic Systems (NGDS); Decontamination Decon Family of Systems (DFoS); JSGPM; JECP; NBCRV Sensor Suite Integration (SSI); JSAM; CALS; and WMD CSTs, Special Purpose Units - CB Equipment.  Continue support to JPEO-CBD and JSTO-CB regarding specific test methodology and test technology needs, technology transition planning, approval of T&E Strategies (TES), and participation in scientific review panels.  Continue to provide guidance to improve the TES and TEMP for acquisition programs, threat support documentation, and validation of T&E Capabilities and associated standards.  Continued to support OTAs in coordination of Lead OTA assignment, integration of test planning, issue resolution, and facilitation of OSD approval of test documents.  Continued to lead the International T&E methodology development and standardization efforts to support the Australia, Canadian, UK, and US MOU.  Provided T&E infrastructure input to the POM process and support JRO, PAIO, and OASD(NCB\/CB) in development and defense of POM and Budget submissions.  Supported tri-lateral international CBD Exercises."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.967"
                                            },
                                            "Text": {
                                                "val": "Continue T&E Executive mission support to ensure credible testing, T&E Early Involvement, Fielded Equipment Assessments, T&E Studies, evaluation and decision support for CBDP systems; support the DOT&E for OSD T&E Oversight; and support the Assistant to the Secretary of Defense (NCB) in infrastructure planning, input to the Program Objective Memorandum (POM) process, and establishing T&E Standards to support the White House Subcommittee on Standards and other interagency groups.  Continue direct support to the Joint Program Executive Office for Chemical Biological Radiological Nuclear Defense (JPEO-CBRND) and the JRO IPTs and ICTs providing technical assistance to structure acquisition programs, plan for Analysis of Alternatives (AoAs) and develop test scopes.  Continue early involvement of the OTAs and other T&E organizations in T&E infrastructure planning, development, and validation.  Continue development of threat test support documentation to support developmental and operational tests in which an operational threat must be realistically presented.  Programs supported include NTA detector; Joint Biological Tactical Detection System (JBTDS); Joint Biological Point Detector System (JBPDS); Joint Chemical Agent Detector (JCAD); Improved Point Detection System (IPDS); Next Generation Chemical Detector (NGCD) and all detectors; Uniform Individual Protection Ensemble (UIPE); Dismounted Reconnaissance Sets, Kits, and Outfits (DR-SKO); Joint Expeditionary Collective Protection (JECP); Next Generation Diagnostic Systems (NGDS); Decontamination Decon Family of Systems (DFoS); JSGPM; JECP; NBCRV Sensor Suite Integration (SSI); JSAM; CALS; and WMD CSTs, Special Purpose Units - CB Equipment.  Continue support to JPEO-CBD and JSTO-CB regarding specific test methodology and test technology needs, technology transition planning, approval of T&E Strategies (TES), and participation in scientific review panels.  Continue to provide guidance to improve the TES and TEMP for acquisition programs, threat support documentation, and validation of T&E Capabilities and associated standards.  Continue to support OTAs in coordination of Lead OTA assignment, integration of test planning, issue resolution, and facilitation of OSD approval of test documents.  Continue to lead the International T&E methodology development and standardization efforts to support the Australia, Canadian, UK, and US MOU.  Provide T&E infrastructure input to the POM process and support JRO, PAIO, and OASD(NCB\/CB) in development and defense of POM and Budget submissions.  Support tri-lateral international CBD Exercises."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.152"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.152"
                                            },
                                            "Text": {
                                                "val": "Continue T&E Executive mission support to ensure credible testing, T&E Early Involvement, Fielded Equipment Assessments, T&E Studies, evaluation and decision support for CBDP systems; support the DOT&E for OSD T&E Oversight; and support the Assistant to the Secretary of Defense (NCB) in infrastructure planning, input to the Program Objective Memorandum (POM) process, and establishing T&E Standards to support the White House Subcommittee on Standards and other interagency groups.  Continue direct support to the Joint Program Executive Office for Chemical Biological Radiological Nuclear Defense (JPEO-CBRND) and the JRO IPTs and ICTs providing technical assistance to structure acquisition programs, plan for Analysis of Alternatives (AoAs) and develop test scopes.  Continue early involvement of the OTAs and other T&E organizations in T&E infrastructure planning, development, and validation.  Continue development of threat test support documentation to support developmental and operational tests in which an operational threat must be realistically presented.  Programs supported include NTA detector; Joint Biological Tactical Detection System (JBTDS); Joint Biological Point Detector System (JBPDS); Joint Chemical Agent Detector (JCAD); Improved Point Detection System (IPDS); Next Generation Chemical Detector (NGCD) and all detectors; Uniform Individual Protection Ensemble (UIPE); Dismounted Reconnaissance Sets, Kits, and Outfits (DR-SKO); Joint Expeditionary Collective Protection (JECP); Next Generation Diagnostic Systems (NGDS); Decontamination Decon Family of Systems (DFoS); JSGPM; JECP; NBCRV Sensor Suite Integration (SSI); JSAM; CALS; and WMD CSTs, Special Purpose Units - CB Equipment.  Continue support to JPEO-CBD and JSTO-CB regarding specific test methodology and test technology needs, technology transition planning, approval of T&E Strategies (TES), and participation in scientific review panels.  Continue to provide guidance to improve the TES and TEMP for acquisition programs, threat support documentation, and validation of T&E Capabilities and associated standards.  Continue to support OTAs in coordination of Lead OTA assignment, integration of test planning, issue resolution, and facilitation of OSD approval of test documents.  Continue to lead the International T&E methodology development and standardization efforts to support the Australia, Canadian, UK, and US MOU.  Provide T&E infrastructure input to the POM process and support JRO, PAIO, and OASD(NCB\/CB) in development and defense of POM and Budget submissions.  Support tri-lateral international CBD Exercises."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "3) OSD MGT"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.154"
                                            },
                                            "Text": {
                                                "val": "Performed program reviews\/assessments, provided programmatic PPBE oversight\/analysis, and provided congressional issue analysis and support.  Supported financial management services provided by DTRA, such as funding distribution and execution reporting."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.871"
                                            },
                                            "Text": {
                                                "val": "Perform program reviews\/assessments, provide programmatic PPBE oversight\/analysis, and provide congressional issue analysis and support.  Support financial management services provided by DTRA, such as funding distribution and execution reporting."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.674"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.674"
                                            },
                                            "Text": {
                                                "val": "Perform program reviews\/assessments, provide programmatic PPBE oversight\/analysis, and provide congressional issue analysis and support.  Support financial management services provided by DTRA, such as funding distribution and execution reporting."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "4) PAIO MGT"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.588"
                                            },
                                            "Text": {
                                                "val": "Developed assessments to support RDA Planning.  Provided analytic programmatic support for development of program guidance, the Program, Budget and Execution Reviews, and the President's Budget submissions.  Responded to specialized evaluation studies throughout the PPBE process.  Provided JSCBIS database management."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.818"
                                            },
                                            "Text": {
                                                "val": "Develop assessments to support RDA Planning.  Provide analytic programmatic support for development of program guidance, the Program, Budget and Execution Reviews, and the President's Budget submissions.  Respond to specialized evaluation studies throughout the PPBE process.  Provide JSCBIS database management."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.423"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.423"
                                            },
                                            "Text": {
                                                "val": "Develop assessments to support RDA Planning.  Provide analytic programmatic support for development of program guidance, the Program, Budget and Execution Reviews, and the President's Budget submissions.  Respond to specialized evaluation studies throughout the PPBE process.  Provide JSCBIS database management."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "O49"
                    },
                    "ProjectTitle": {
                        "val": "JOINT CONCEPT DEVELOPMENT AND EXPERIMENTATION PROGRAM"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.408"
                        },
                        "CurrentYear": {
                            "val": "3.591"
                        },
                        "BudgetYearOne": {
                            "val": "3.979"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.979"
                        },
                        "BudgetYearTwo": {
                            "val": "4.378"
                        },
                        "BudgetYearThree": {
                            "val": "3.977"
                        },
                        "BudgetYearFour": {
                            "val": "4.059"
                        },
                        "BudgetYearFive": {
                            "val": "4.059"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The objectives of the Joint Concept Development and Experimentation (JCDE) program are to support the Joint Requirements Office to develop, coordinate, and execute CBRND studies, experiments, analyses and architecture, in order to develop future operational concepts and support the efficient and effective generation of CBRN requirements.\n\nSpecific lines of effort across the Future Years Defense Program (FYDP) include: qualitatively characterizing emerging CBRN threats and operational risks to the Joint Force; conducting innovative approaches to deal with technical studies; analyzing Concepts of Operations for employing and developing capabilities; and analyzing specific issues that contribute to POM development."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) JCDE"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.408"
                                            },
                                            "Text": {
                                                "val": "Continued JCDE analysis.  Conducted Advanced Biological Threat Analysis.  Conducted Forcible Entry Sea-based and Amphibious Operations Module 1 Experiment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.591"
                                            },
                                            "Text": {
                                                "val": "Will continue JCDE analysis.  Will continue to perform Advanced Threat Analysis.  Will continue to perform Elimination and Forcible Entry Modules Experiments.  Will conduct Biological Operational Risk Analysis.  Will continue to provide concept-of-use experiments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.979"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.979"
                                            },
                                            "Text": {
                                                "val": "Will continue JCDE analysis.  Will continue to perform Advanced Threat Analysis.  Will perform Unified Land Ops Experiments.  Will continue Operational Risk Analysis.  Will continue to provide concept-of-use experiments.  Will establish architecture warehouse."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}