{
    "id": "e3ffa6a11fc6e990943d3f3971c0b7f5284dda04",
    "meta": {
        "filename": "dod-2015_RDTE_2015_ARMY_BA3_RDTE_JustificationBook_Army_PB_2015.zzz_unzipped_RDTE_JustificationBook_Army_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603313A"
        },
        "ProgramElementTitle": {
            "val": "Missile and Rocket Advanced Technology"
        },
        "R1LineNumber": {
            "val": "45"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "80.379"
            },
            "CurrentYear": {
                "val": "83.975"
            },
            "BudgetYearOne": {
                "val": "44.957"
            },
            "BudgetYearOneBase": {
                "val": "44.957"
            },
            "BudgetYearTwo": {
                "val": "53.312"
            },
            "BudgetYearThree": {
                "val": "59.974"
            },
            "BudgetYearFour": {
                "val": "64.907"
            },
            "BudgetYearFive": {
                "val": "64.154"
            }
        },
        "ProgramElementNote": {
            "val": "FY13 adjustments attributed to Congressional General Reductions (-124 thousand); Congressional Add funding (19.0 million); SBIR\/STTR transfers (-2.480 million) and Sequestration reductions (-7.128 million)\nFY14 adjustments attributed to FFRDC reduction (-34 thousand) and Congressional Add funding (20.0 million)"
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) matures, fabricates, and demonstrates advanced rocket, missile, interceptor, and guided munition technologies to enhance weapon system lethality, survivability, agility, deployability, and affordability. Project 206 develops high fidelity simulations for advanced tactical missiles and interceptors. Project 263 demonstrates missile and interceptor systems with capabilities to provide protection against rockets, artillery, and mortars; provide precision weapons for small units in close combat; provide precision long-range fires; and provide minimum smoke propulsion for aviation missiles. Project 704 demonstrates the capability to detect and track rocket, artillery, mortar, and unmanned air vehicles threats. Project G03 demonstrates missile-based deployable force protection and fire control systems as well as defense against unmanned aerial vehicles and rotary wing aircraft. NA6 is a congressional increase.\n \nWork in this PE is complimentary to PE 0602303A (Missile Technology), and is fully coordinated with PE 0602618A (Ballistics Technology), PE 0602624A (Weapons and Munitions Technology), PE 0603003A (Aviation Advanced Technology), PE 0603004A (Weapons and Munitions Advanced Technology), PE 0603005A (Combat Vehicle and Automotive Advanced Technology), PE 0603125A (Combating Terrorism Technology Development), PE 0603270A (Electronic Warfare Technology), PE 0603734A (Combat Engineering Systems), and PE 0708045A (Manufacturing Technology). \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.   \n \nWork in this PE is performed by the Aviation and Missile Research, Development, and Engineering Center (AMRDEC) located at Huntsville, AL."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "71.111"
                },
                "CurrentYear": {
                    "val": "64.009"
                },
                "BudgetYearOne": {
                    "val": "42.647"
                },
                "BudgetYearOneBase": {
                    "val": "42.647"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "80.379"
                },
                "CurrentYear": {
                    "val": "83.975"
                },
                "BudgetYearOne": {
                    "val": "44.957"
                },
                "BudgetYearOneBase": {
                    "val": "44.957"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "9.268"
                },
                "CurrentYear": {
                    "val": "19.966"
                },
                "BudgetYearOne": {
                    "val": "2.310"
                },
                "BudgetYearOneBase": {
                    "val": "2.310"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.124"
                    },
                    "CurrentYear": {
                        "val": "-0.034"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "19.000"
                    },
                    "CurrentYear": {
                        "val": "20.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.480"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "2.310"
                                },
                                "BudgetYearOneBase": {
                                    "val": "2.310"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Sequestration"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-7.128"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "206"
                    },
                    "ProjectTitle": {
                        "val": "Missile Simulation"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.906"
                        },
                        "CurrentYear": {
                            "val": "2.298"
                        },
                        "BudgetYearOne": {
                            "val": "1.765"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.765"
                        },
                        "BudgetYearTwo": {
                            "val": "1.744"
                        },
                        "BudgetYearThree": {
                            "val": "1.702"
                        },
                        "BudgetYearFour": {
                            "val": "1.742"
                        },
                        "BudgetYearFive": {
                            "val": "1.757"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates advanced modeling and simulation technologies for missile design and analysis. Evaluation of missile technology by means of modeling and simulation provides a cost-effective method that supports missile maturation throughout the weapon system life cycle. This effort permits a reduction in the number of flight tests required for programs of record as well as improves the confidence of flight test readiness and probability of flight test success.  \n\nThis project support efforts in the Army science and technology Ground portfolio.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.  \n \nWork in this project is performed by the Aviation and Missile Research, Development, and Engineering Center, (AMRDEC) Huntsville, AL."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Missile Simulation"
                                    },
                                    "Description": {
                                        "val": "This effort designs, matures, and demonstrates advanced simulation technologies and uses those technologies to support missile design, analysis, and evaluation including Hardware-in-the-Loop (HWIL) simulation, missile component and system simulations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.906"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Improved simulation fidelity, run-time, integration time, and visualization capabilities including: reuse and validation of HWIL simulation modules to reduce integration time and cost; reduced the run-time required for higher fidelity scene generation, and completed HWIL modifications to allow for varying radio frequency waveforms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.298"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete scene generation technology for improved fidelity and runtime of complex millimeter wave (MMW) scenes; improve fidelity of complex modeling and simulation through the leveraging of advancements in microprocessor speed and throughput; enhance endgame lethality modeling to evaluate the effectiveness of complex shaping of integrated blast fragmentation warheads; conduct component and system level analysis simulations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.765"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.765"
                                            },
                                            "Text": {
                                                "val": "Will design a radio frequency scene generation algorithm and begin hardware\/software integration into hardware-in-the-loop to support testing of advanced MMW sensors.  Will design an integrated, cohesive sensor development modeling and simulation environment to significantly reduce seeker design and development timeline.  Will complete missile life-cycle cost model tool, optimized for use during the S&T phase of technology development to design in cost saving features."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "263"
                    },
                    "ProjectTitle": {
                        "val": "Future Msl Tech Integr(FMTI)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "51.902"
                        },
                        "CurrentYear": {
                            "val": "54.916"
                        },
                        "BudgetYearOne": {
                            "val": "32.403"
                        },
                        "BudgetYearOneBase": {
                            "val": "32.403"
                        },
                        "BudgetYearTwo": {
                            "val": "31.274"
                        },
                        "BudgetYearThree": {
                            "val": "37.494"
                        },
                        "BudgetYearFour": {
                            "val": "41.973"
                        },
                        "BudgetYearFive": {
                            "val": "42.235"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures, fabricates, and demonstrates advanced missile and interceptor technologies, such as seekers, guidance and controls, propulsion, and airframes. The project goal is to reduce the life-cycle costs and cost per kill of precision guided missiles and interceptors. \n\nThis project support efforts in the Army science and technology Ground portfolio.\n\nThis project matures technologies from PE 0602303A and directly supports systems managed by the Program Executive Officer for Missiles and Space. Work in this project is in collaboration with PE 0602618A (Ballistics Technology), PE 0602624A (Weapons and Munitions Technologies), PE 0603004A (Weapons and Munitions Advanced Technology), PE 0603005A (Combat Vehicle and Automotive Advanced Technology) and PE 0708045A (Manufacturing Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.  \n \nWork in this project is performed by the Aviation and Missile Research, Development, and Engineering Center (AMRDEC), Huntsville, AL."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Small Organic Precision Munition Integrated Technology"
                                    },
                                    "Description": {
                                        "val": "This effort designs, fabricates, integrates, and flight demonstrates critical components to enhance system-level performance of a small precision munition.  The effort provides a soldier portable, 5.5 pound, precision guided munition to enable small units to organically dominate asymmetric threats in complex terrain.  The goals include improved:  target tracking that distinguishes soft targets (to include personnel), effects against soft targets, communication with munition in flight, and power sources for increased flight and storage time.  This effort matures and demonstrates technology from PE 0602303A, PE 0602624 Project H28, and the Applied Smaller, Lighter, and Cheaper Munition Components effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.563"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued to integrate image stabilization and people tracking algorithms with small seeker, conducted flight demonstration in surrogate munition to demonstrate improved tracking performance, then completed algorithm optimization based on demonstration results; integrated small form-factored laser ranging height of burst sensor, less sensitive omni-directional warhead, and fuze optimized for lethal effects against personnel and soft targets, then evaluated effectiveness in obscured environments; integrated secure digital data link in surrogate munition and conducted hardware-in-the-loop evaluation; evaluated form-factored power source over operating temperature range to demonstrate increased shelf-life."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.223"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Implement and flight test enhanced image stabilization and people tracking algorithms in, form-factored modular hardware architecture; complete packaged design, fabricate, and flight test final form-factored digital data link hardware."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Technical Fire Control Technology"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates Technical Fire Control technology necessary to generate and execute a firing solution for defeat of rocket, artillery, and mortar (RAM), Unmanned Aerial Systems (UAS), and\/or Cruise Missile threats in the required timeline to protect ground forces.  This effort develops Technical Fire Control technology to complement the interceptor development performed in the Guided Interceptor Technology for Defense against RAM, UAS and\/or Cruise Missile, Hit-to-Kill Interceptor Technology for Defense against RAM, UAS and\/or Cruise Missile, and Counter RAM, UAS and\/or Cruise Missile Tracking and Fire Control (PE 0603313 Project 704) efforts.  These combined efforts will conduct multiple interceptor Hardware-in-the-Loop (HWIL) and flight demonstrations each year.  The technologies demonstrated will be applicable to the Indirect Fire Protection Capability (IFPC) and other Air and Missile Defense programs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.882"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Increased the software capability and updated the Technical Fire Control nodes based on analysis from the guided flight demonstrations of single RAM threats and supported multiple flight demonstrations for both interceptor concepts; integrated updated Technical Fire Control components with interceptor guidance sections and Tracking and Fire Control system components for pre-flight evaluation in HWIL; conducted additional guided flight demonstrations using Technical Fire Control nodes to control each of the counter RAM interceptors through live-fire shoot down of single and dual RAM threats; and updated system simulation based on HWIL evaluation and flight demonstration results."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.560"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue refinements and enhancements of Technical Fire Control nodes for the Counter RAM, UAS and\/or Cruise Missile interceptors based on analysis of flight test performance; integrate updated Technical Fire Control node test articles with interceptor guidance sections and fire control systems in HWIL set-ups; conduct virtual and flight tests against single RAM, UAS and\/or Cruise Missile targets using Technical Fire Control nodes to control each."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.732"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.732"
                                            },
                                            "Text": {
                                                "val": "Will continue refinements and enhancements of Technical Fire Control nodes for Counter RAM, UAS, and Cruise Missile interceptors based on current threat analysis.  Will use these Technical Fire Control nodes to conduct virtual flight tests against emerging threats in HWIL."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Guided Interceptor Concept Technology for defense against Rockets, Artillery, and Mortars (RAM), Unmanned Aerial Systems (UAS), and Cruise Missiles"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates a Guided missile-based Interceptor concept  initially focused to defeat UAS, and Cruise Missile threats with the potential for precision ground-to-ground applications.  This effort designs, fabricates, evaluates, and flight demonstrates a guided missile-based interceptor and launch system.  The complementary effort, Technical Fire Control Technology, provides the interceptor with a firing solution and launch command, , UAS and\/or Cruise Missile Tracking and Fire Control, in PE 0603313A Project 704, tracks the UAS, and Cruise Missile threat.  This effort will support the design, fabrication, integration, Hardware-in-the-Loop (HWIL) tests, and flight demonstration of multiple guided interceptors.  The technologies demonstrated will be applicable to the Indirect Fire Protection Capability (IFPC),and other Air and Missile Defense programs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.349"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued the fabrication and integration of command Guided Interceptors for flight demonstration; integrated with the Technical Fire Control node and Tracking and Fire Control System; and updated the interceptor design and system simulation based on HWIL evaluation and flight test results."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.496"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Fabricate, integrate, and test the alternative components for Guided interceptors; perform Hardware-In-The-Loop tests and pre-flight predictions to prepare for flight tests and reduce risk; conduct interceptor flight-test demonstrations against single RAM, UAS and\/or Cruise Missile targets; analyze test results and correlate to predicted and HWIL performance; update the Battle Element system; and refine the system simulation based on performance demonstrated through preflight predictions and flight tests. Will complete preliminary designs of affordable propulsion and advanced seeker technologies to extend CUAS\/CCM interceptor effective range, enabling the defeat of both current and emerging threats."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.342"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.342"
                                            },
                                            "Text": {
                                                "val": "Complete Critical Design Reviews for alternative components for Guided interceptors to defeat UAS and Cruise Missile.  Will test form-factor components in HWIL to provide pre-flight predictions and reduce risk Updates and refinements of the system simulation will be performed based on performance demonstrated in HWIL pre-flight predictions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Hit-to-Kill Interceptor Concept Technology for Defense against Rockets, Artillery, and Mortars (RAM), Unmanned Aerial Systems (UAS), and Cruise Missiles"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates a compact, very light weight, radar and alternative frequency guided Hit-to-Kill (HTK) missile-based Interceptor concept initially focused to defeat RAM threats in flight with the potential for use on air launched platforms, small weapons platforms, and ground-to-ground applications.  This effort designs, fabricates, evaluates, and flight demonstrates a Hit-to-Kill counter RAM system consisting of interceptors and a launch system. Complementary efforts include: Technical Fire Control Technology provides the firing solution and launch command and Counter RAM, UAS and\/or Cruise Missile Tracking and Fire Control, PE 0603313A Project 704, provides tracking of the threat for intercept.  This effort will support the design, fabrication, integration, Hardware-in-the-Loop (HWIL) tests, and flight demonstration of multiple hit-to-kill interceptors.  The technologies demonstrated will be applicable to the Indirect Fire Protection Capability (IFPC)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.108"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued fabrication and integration of Hit-to-Kill Interceptors and launch systems; integrated with the Technical Fire Control and Tracking and Fire Control system; conducted pre-flight HWIL evaluation of each Hit-to-Kill interceptor to ensure successful flight demonstration; performed multiple guided flight demonstrations of live-fire shoot down of single and dual RAM threat targets; and updated the system simulation based on HWIL evaluation and flight demonstration results."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.884"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue flight tests of the Hit-To-Kill interceptor; continue Hardware-In-The-Loop tests and pre-flight predictions to prepare for additional guided flight tests and to reduce risk; conduct additional interceptor flight-test demonstrations against single and multiple RAM, UAS, and\/or Cruise Missile targets; analyze test results and correlate to predicted and HWIL performance; update the Battle Element system; and refine the system simulation based on performance demonstrated through preflight predictions and flight tests."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.001"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.001"
                                            },
                                            "Text": {
                                                "val": "Will continue flight tests of the semi-active Hit-to-Kill (HTK) interceptor.  Will complete the testing of the components for an active seeker for HTK to provide a Fire Control independent solution.  Will complete the fabrication and HWIL testing of the active seeker for HTK."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Javelin Command Launch Unit (CLU) with External Far Target Locator (FTL)"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on the designs, fabrication, and demonstration of technology for a highly accurate, externally-mounted Javelin FTL that integrates with the CLU and provides a means to significantly lighten the load of the Javelin close-combat missile system.  The system-technology construct comprises an externally mounted FTL connected to the Javelin Command Launcher Units.  This construct will reduce the weight and volume of the FTL capability for close-combat weaponry carried by the individual Soldiers while increasing lethality, survivability, and situational awareness for Small Unit operations. This effort transitions, integrates, and demonstrates technology from PE 0602303A, Project 214, \"Smaller, Lighter, Cheaper Tactical Missile Technologies\" and \"Micro Inertial Navigation Sensor for Networked Javelin Command Launch Unit (CLU) with Far Target Locator (FTL)\"."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.200"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete FTL-sensor lightweight-composite housing design, the initial design and fabrication of miniaturized electronics, development and integration of first-build software for the Javelin CLU."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Low-cost Extended Range Air Defense"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on developing key enabling technologies for a lower-cost interceptor system for a low- to medium-altitude, medium- to long-range capability. Resulting technologies will enable interceptor integration into a net-enabled Air and Missile Defense Task Force and protection of assets within a 150km diameter Area of Operations.  Technologies will be designed for the defeat of tactical UAS and Cruise Missile threats with secondary capability against Large Caliber Rockets (LCR), Short Range Ballistic Missiles (SRBM), and Tactical Air-to-Surface Missiles (TASMS) at extended range and to be interoperable with existing Integrated Air and Missile Defense (IAMD) Force. This effort continues in FY15 in PE 0603313A, Project 704."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.553"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete systems and operational analysis of medium- to long-range missile-based interceptor given anticipated area of operations and anticipated force structure. Begin detailed design of integrated missile system."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Low Cost Tactical Extended Range Missile"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on design, fabrication, and demonstration of technologies for low-cost precision fires missile capable of deep strike engagements.  The aim is to provide extended range and expanded target set capability through advanced propulsion, new payload technology, and maintain effectiveness in Global Positioning System (GPS) challenged environments through new and novel navigation technologies."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.200"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.200"
                                            },
                                            "Text": {
                                                "val": "Will conduct trade studies through simulation to determine subsystem requirements for delivery of enhanced lethal effects to long range targets; evaluate the target sets at various ranges and match payload technologies with the threat sets; match propulsion technologies with range and missile size; evaluate emerging navigation technologies for GPS challenged environments; evaluate requirements for compatibility with both current and future long range launch systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Active Protection System Interceptor Demonstration"
                                    },
                                    "Description": {
                                        "val": "This effort matures, integrates and demonstrates modular hard-kill APS technologies with the Hit Avoidance Architecture and APS Common Controller. Specifically the hard kill APS portion and modeling and simulation efforts will be addressed by AMRDEC.  This effort supports the Army's Active Protection System (APS) program to mature and demonstrate APS technologies to reduce vehicle weight while reducing reliance on armor through the use of other means such as sensing, warning, hostile fire detection, and active countermeasures to achieve increased protection against current and emerging threats.  This effort supports the development of an APS Common Architecture enabling adaptable APS solutions that can be integrated across Army vehicle platforms as required.  Work being accomplished under PE 0602601A\/Project C05, PE 0602618A\/Project H80, PE 0603004A\/Project 232, PE 0603005A\/Project 221, and PE 0603270A\/Project K16 compliments this effort."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.125"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.125"
                                            },
                                            "Text": {
                                                "val": "Will begin integration of a modular hard-kill active protection sub-system (including countermeasures, detection sensors, and tracking sensors) with a common controller through a common architecture for use in an integrated survivability suite on a combat vehicle."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Hunter Killer Missile Demonstration"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on the designs, fabrication, integration, Hardware-in-the-Loop (HWIL) tests, and flight demonstration of technology for an affordable discriminate extended range precision missile to include critical component technologies such as advanced propulsion, seekers, fire control, datalink, guidance and controls, and airframes will be matured for demonstration."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.003"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.003"
                                            },
                                            "Text": {
                                                "val": "Will conduct trade studies to determine subsystem requirements.  Will identify critical components and begin designing and maturation of those critical components such as propulsion, datalink, and tracker.  Will begin development of system-level modeling and simulation necessary to mature and evaluate concepts for prediction of system capability across a broad spectrum of missions.  Will evaluate fire control requirements and identify key technologies."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "704"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Missile Demo"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.722"
                        },
                        "CurrentYear": {
                            "val": "6.761"
                        },
                        "BudgetYearOne": {
                            "val": "10.789"
                        },
                        "BudgetYearOneBase": {
                            "val": "10.789"
                        },
                        "BudgetYearTwo": {
                            "val": "20.294"
                        },
                        "BudgetYearThree": {
                            "val": "20.778"
                        },
                        "BudgetYearFour": {
                            "val": "21.192"
                        },
                        "BudgetYearFive": {
                            "val": "20.162"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures advanced missile system concepts and related hardware to enhance weapon system lethality, survivability, agility, versatility, deployability, and affordability for defense against future air and ground, armored and non-armored threats.    \n \nThis project support efforts in the Army science and technology Ground portfolio.\n\nWork in this project is in collaboration with PE 0602624A (Weapons and Munitions Technologies).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.  \n \nWork in this project is performed by the Aviation and Missile Research, Development, and Engineering Center (AMRDEC), Huntsville, AL."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Counter Rockets, Artillery, Mortars (RAM), unmanned aerial systems (UAS), and Cruise Missile Tracking and Fire Control"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates system technology to provide 360 degree, near hemispherical coverage for tracking and intercept of RAM, UAS, and\/or Cruise Missile threats.  This effort determines the trajectory and location of the incoming RAM, UAS, and\/or Cruise Missile threat and feeds that information to the technical fire control node to generate a firing solution provided to the guidance section of each of the missile interceptors. Complementary work is conducted in the Technical Fire Control Technology, Guided Interceptor Technology for defense against Rockets, Artillery, and Mortars, and Hit-to-Kill Interceptor Technology for Defense against Rockets, Artillery, and Mortars and Unmanned Aerial Systems, and Cruise Missiles efforts in PE 0603313A Project 263. These efforts will be evaluated through Hardware-in-the-Loop (HWIL) tests and multiple interceptor flights.  The technologies demonstrated will be applicable to the Indirect Fire Protection Capability (IFPC) and other Air and Missile Defense programs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.722"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "This effort matures and demonstrates system technology to provide 360 degree, near hemispherical coverage for tracking and intercept of RAM, UAS, and\/or Cruise Missile threats.  This effort determines the trajectory and location of the incoming RAM, UAS, and Cruise Missile threat and feeds that information to the technical fire control node to generate a firing solution provided to the guidance section of each of the missile interceptors. Complementary work is conducted in the Technical Fire Control Technology, Guided Interceptor Technology for defense against Rockets, Artillery, and Mortars, and Hit-to-Kill Interceptor Technology for Defense against Rockets, Artillery, and Mortars and Unmanned Aerial Systems, and Cruise Missiles efforts in PE 0603313A Project 263. These efforts will be evaluated through Hardware-in-the-Loop (HWIL) tests and multiple interceptor flights.  The technologies demonstrated will be applicable to the Indirect Fire Protection Capability (IFPC) and other Air and Missile Defense programs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.761"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Use final test bed and\/or existing counter RAM, UAS, and Cruise Missile tracking and fire control systems for interceptor flight tests against RAM, UAS, and Cruise Missile targets, and verify tracking and fire control simulations based on results of Hardware-In-the-Loop and flight tests."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.503"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.503"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate and assess performance utilizing existing counter RAM, UAS, and Cruise Missile tracking and fire control systems networked information against the full range of target types (RAM, UAS, Cruise Missile), scenarios and multiple engagements utilizing simulations and HWIL."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Low-cost Extended Range Air Defense"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on developing key enabling technologies for a lower-cost interceptor system for a low- to medium-altitude, medium- to long-range capability to enable interceptor integration into a net-enabled Air and Missile Defense Task Force and protection of assets. Technologies will be designed for the defeat of tactical UAS and Cruise Missile threats with secondary capabilities against Large Caliber Rockets (LCR), Short Range Ballistic Missiles (SRBM), and Tactical Air-to-Surface Missiles (TASMS) and to be interoperable with existing Integrated Air and Missile Defense (IAMD) System. This effort continues from 0603313A, Project 263 in FY14."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.286"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.286"
                                            },
                                            "Text": {
                                                "val": "Will complete initial design of a medium- to long-range interceptor including identifying critical interceptor technology and component performance requirements.  Will begin development of interceptor component technologies to include propulsion, seeker, guidance, navigation and controls and begin development of an interceptor simulation."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "G03"
                    },
                    "ProjectTitle": {
                        "val": "Area Defense Advanced Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.897"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates Deployable Force Protection missile technology for small command outposts and air defense missile technology to protect against: unmanned aerial vehicles, rotary wing aircraft large caliber rockets, and cruise missiles as well as expands the protection envelope to a division\/corps area. \n\nThis project support efforts in the Army science and technology Ground portfolio.\n \nWork in this project is in collaboration with PE 0603734A (Combat Engineering Systems) and PE 0603125 (Combating Terrorism - Technology Development).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.  \n \nWork in this project is performed by the Aviation and Missile Research, Development, and Engineering Center (AMRDEC), Huntsville, AL."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Deployable Force Protection Missile Technology"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates affordable missile technology to provide force protection for smaller forward operating bases (FOBs).  This effort will integrate existing and developmental missile technology and design novel fire control, guidance, and control systems to use missiles in a force protection role."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.897"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed integration of missile systems with fire control technologies to demonstrate an integrated base protection system; and conducted demonstration of integrated fire control, missile systems, sensor systems, and other systems in a base protection role."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "NA6"
                    },
                    "ProjectTitle": {
                        "val": "Missile and Rocket Initiatives (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "16.952"
                        },
                        "CurrentYear": {
                            "val": "20.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding for Missile and Rocket advanced technology development."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "Description": {
                                        "val": "This is a Congressional Interest Item"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.952"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Matured, fabricated, and demonstrated advanced rocket, missile, interceptor, and guided munition technologies to enhance weapon system lethality, survivability, agility, deployability, and affordability."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Mature, fabricate, and demonstrate advanced rocket, missile, interceptor, and guided munition technologies to enhance weapon system lethality, survivability, agility, deployability, and affordability."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}