{
    "id": "e66e0d045f36df2337fbdd6290e1ea161bf4a06a",
    "meta": {
        "filename": "dod-2015_RDTE_2015_DLA_RDTE_JustificationBook_Defense_Logistics_Agency_PB_2015.zzz_unzipped_RDTE_JustificationBook_Defense_Logistics_Agency_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Defense Logistics Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605080S"
        },
        "ProgramElementTitle": {
            "val": "Defense Agency Initiatives (DAI) - Financial System"
        },
        "R1LineNumber": {
            "val": "128"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Defense Logistics Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "46.489"
            },
            "BudgetYearOne": {
                "val": "41.465"
            },
            "BudgetYearOneBase": {
                "val": "41.465"
            },
            "BudgetYearTwo": {
                "val": "28.800"
            },
            "BudgetYearThree": {
                "val": "25.380"
            },
            "BudgetYearFour": {
                "val": "9.950"
            },
            "BudgetYearFive": {
                "val": "2.606"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program supports the Defense Agencies Initiative (DAI), an Acquisition Category I program. Previous funding for DAI was documented in the Defense Enterprise Business Systems program element 0605070S. \n\n \nThe DAI mission is to deliver auditable Chief Financial Officer (CFO) Act compliant business environments for Defense Agencies providing accurate, timely, authoritative financial data supporting the DoD goal of standardizing financial management practices improving financial decision support, and supporting audit readiness. Currently, Defense Agencies use more than 10 different non-compliant financial management systems supporting diverse operational functions and the warfighter in decision making and financial reporting. These disparate, non-integrated systems do not meet statutory requirements to produce timely, auditable reports."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "51.689"
                },
                "BudgetYearOne": {
                    "val": "33.345"
                },
                "BudgetYearOneBase": {
                    "val": "33.345"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "46.489"
                },
                "BudgetYearOne": {
                    "val": "41.465"
                },
                "BudgetYearOneBase": {
                    "val": "41.465"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "-5.200"
                },
                "BudgetYearOne": {
                    "val": "8.120"
                },
                "BudgetYearOneBase": {
                    "val": "8.120"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-5.200"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Secretary of Defense Initiatives"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "8.120"
                                },
                                "BudgetYearOneBase": {
                                    "val": "8.120"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2014 Secretary of Defense Initiatives: $51.689 million - increase due to DAI establishing a new program element in FY2014.\n\nFY2015 Secretary of Defense Initiatives: $8.120 - increase due to audit readiness."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "1"
                    },
                    "ProjectTitle": {
                        "val": "Defense Agency Initiatives (DAI) - Financial System)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "46.489"
                        },
                        "BudgetYearOne": {
                            "val": "41.465"
                        },
                        "BudgetYearOneBase": {
                            "val": "41.465"
                        },
                        "BudgetYearTwo": {
                            "val": "28.800"
                        },
                        "BudgetYearThree": {
                            "val": "25.380"
                        },
                        "BudgetYearFour": {
                            "val": "9.950"
                        },
                        "BudgetYearFive": {
                            "val": "2.606"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This program is to support the Defense Agencies Initiative (DAI), an Acquisition Category I program.  Previous funding for DAI was documented in the Defense Enterprise Business Systems program element 0605070S.\n\n\nThe DAI mission is to deliver auditable Chief Financial Officer (CFO) Act compliant business environments for Defense Agencies providing accurate, timely, authoritative financial data supporting the DoD goal of standardizing financial management practices improving financial decision support, and supporting audit readiness.  Currently, Defense Agencies use more than 10 different non-compliant financial management systems supporting diverse operational functions and the warfighter in decision making and financial reporting.  These disparate, non-integrated systems do not meet statutory requirements to produce timely, auditable reports.\n\n\nThe DAI program modernizes the Defense Agencies’ financial management processes by streamlining financial management capabilities, addressing financial reporting material weaknesses, and supporting financial statement auditability for the majority of  agencies and field activities across the DoD.  DAI will support a transformation of budget, finance, and accounting processes across participating defense agencies to help improve the quality of financial information, supporting financial auditability and decision making.   The DAI business solution, once implemented, will provide a near real-time, web-based system from a “.mil” environment of integrated business processes that will enable in excess of 84,000 Defense Agency financial managers, program managers, auditors, and Defense Finance and Accounting Service (DFAS) representatives to make sound financial business decisions.\n\n\nThe DAI implementation approach is to deploy a standardized system solution that is consistent with requirements in the Federal Financial Management Improvement Act (FFMIA) and the DoD Business Enterprise Architecture (BEA), while leveraging the out-of-the-box capabilities of the selected Commercial-Off-the-Shelf (COTS) product, Oracle e-Business Suite (EBS), version 11i (R11).  DAI implemented an Office of Management and Budget Financial Systems Integration Office (FSIO) qualified COTS financial management business solution with common business processes and data standards.   The Program Management Office (PMO) will not develop any objects that are included in core COTS software or services (i.e. vendor data from Federal authoritative source).  \n\n\nDAI supports the Quadrennial Defense Review (QDR) Strategy 5, “Reform the business and support functions of the Defense enterprise”.  DAI is also aligned to the FY 2012\/FY 2013 DOD Strategic Management Plan Business Goal 2: “Strengthen DoD financial management to respond to warfighter needs and sustain public confidence through auditable financial statements”. The objective of the Defense Agencies Initiative is to achieve auditable, CFO Act compliant business environments for the Defense Agencies with accurate, timely, authoritative financial data. \n\n\nThe primary goal is to deploy a standardized system solution to improve overall financial management and comply with BEA, Standard Financial Information Structure (SFIS), and Office of Federal Financial Management (OFFM) requirements. Common business functions within budget execution include  the Department’s BEA End to End (E2E) business processes: Cost Management; Budget to Report; Procure to Pay;  Acquire to Retire (real property lifecycle accounting only); Hire to Retire (Time and Labor reporting only); and Order to Cash.  Future capabilities will support Defense Working Capital Fund accounting, Budget Formulation, Grants Financial Management, and Re-Sale Accounting (for Defense Commissary Agency (DeCA)) as well as a Contract Writing capability.\n\n\nDAI is currently implemented at 11 Defense Agencies and the Office of the Under Secretary of Defense, Comptroller, (OUSD(C)) (Time and Labor only) and supporting over 9,200 users.  In addition, since Oracle is phasing out maintenance of Oracle EBS, Release 11i, the program is required to migrate to EBS Release 12 (R12). The program office is also responsible for operational sustainment of the system.  Funds are required for additional government and contractor support, licenses, maintenance, and hardware to accomplish the remaining capability developments and organizational deployments, complete the R12 upgrade, initiate the annual Statement on Standards for Attestation Engagements (SSAE 16) assertion packages, and sustain the system.  \n\n\nThe benefits of DAI are:\n- Common business processes and data standards;\n- Access to real-time financial data transactions;\n- Significantly reduced data reconciliation requirements;\n- Enhanced analysis and decision support capabilities; Standardized line of accounting with the use of SFIS; and\n- Use of United States Standard General Ledger (USSGL) Chart of Accounts to resolve DoD material weaknesses and deficiencies.\n\n\nThe DAI PMO will provide the R12 Upgrade system integration services that include: acquisition management, project management; blueprinting; design, build, and unit test; developing required Reports, Interfaces, Conversions, Extensions, Forms and Workflows (RICEFW) objects; testing (information assurance, integration, functional, performance, conversion, security, user acceptance, operational); end-user training (train the trainer\/change management preparing the users for the cross functional skills and awareness needed to perform well with an integrated enterprise resource planning system); system deployment; conversion; information assurance; sustainment; data service; help desk support; as well as studies and analysis support."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Defense Agency Initiatives (DAI) - Financial System"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "46.489"
                                            },
                                            "Text": {
                                                "val": "In FY 2014, the PMO will do the following.\n*\tUpgrade DAI to the Oracle E-Business Suite (EBS) Release 12 (R12) software in a new Test and Development (T&D) environment at the DISA DECC in Mechanicsburg, PA.  No new Agencies will be deployed in FY 2014 and existing Agencies will migrate in FY 2015.  \n*\tObtain the hardware, software and services necessary to establish a T&D environment at DISA DECC Mechanicsburg, PA for the R12 Upgrade on Sun Solaris.\n*\tIdentify and track the Statement on Standards for Attestation Engagements No. 16 (SSAE 16) audit’s Notices of Finding (NOFs) in the Federal Information Systems Controls Audit Manual (FISCAM), Federal Financial Management Improvement Act (FFMIA) and other compliance areas.  \n*\tConfigure DAI to incorporate changes to the BEA SFIS in view of the Government-Wide Treasury Account Symbol Adjusted Trial Balance System Requirements.\n*\tDevelop updates to the DAI portion of the DLA component plan to update the Department of Defense Standard Financial Information Structure (SFIS) and Standard Line of Accounting (SLOA)\/Account Classification in accordance with the joint Under Secretary of Defense, Comptroller\/Deputy Chief Management Officer Memo of September 14, 2012.  The target date for SLOA implementation (with data stored as discrete data elements) is September 2014. This effort will affect the underlying COTS configuration of the system and several RICEFW objects in the current environment.  \n*\tIncorporate additional changes to interfaces as Enterprise systems adopt the SLOA\/Account Classification and System for Award Management (SAM) absorbs the functionality of other target Federal Integrated Acquisition Environment Systems.  \n*\tDevelop any material and non-material resolutions to SSAE 16 NOFs and other compliance areas.   \n*\tDevelop the following for Increment 2:\n*\tProject Management Process including Project Performance Plan and reporting; \n*\tR12 Initial Baseline Review; \n*\tPMO R12 Upgrade staffing plan; \n*\tR12 Concept of Operations; \n*\tIntegrated Master Plan (IMP) update; \n*\tIntegrated Master Schedule (IMS) update; \n*\tProgram Milestone Briefs, Bi-Weekly Status Reports,  Quarterly Executive Project Status Briefing; \n*\tPMO Risk Management Plan including Issues & Risk Management Process; \n*\tPosition Papers\/Whitepapers; \n*\tMonitor efforts by Contractors Quality Assurance Surveillance Plans (QASP); \n*\tDAI Internal Controls Guide; \n*\tDAI Data Management Plan; \n*\tR12 detailed templates – blueprinting & related deliverables with linkage to Business Enterprise Architecture (BEA) version 11, the SLOA and SFIS; \n*\tR12 Scenarios, Test Scripts, Regression Testing tool updates, and final status of testing; \n*\tR12 Baseline Configuration including functional, technical, and configuration documentation matured, reviewed, and approved in the Configuration Management (CM) tool; \n*\tCM plan update; \n*\tDISA DECC Hosting Plan including an operating & tested Sandbox\/Test & Development Environment in the Hosting Environment; \n*\tApplication, database and server configuration management process including the instance management process & plan; \n*\tContinuity of Operations (COOP) plan to address production in both an R11 production baseline and a new R12 production baseline (at DECC Mechanicsburg) for an extended period; \n*\tR12 baseline instance available for use as a demonstration and sandbox; \n*\tR12 Global Model Development Strategy and Plan; \n*\tR12 Quality Assurance Plan and Materials; \n*\tCybersecurity Plan update; \n*\tDIACAP POA&M; \n*\tR12 Requirements Management & Traceability Plan (GOLD Requirements Traceability Matrix (RTM) with cross reference to BEA, SFIS, FFMIA, and FISCAM requirements; \n*\tCompliance Management Plan and process updates; \n*\tChange Management process, plan, & materials updates; \n*\tPMO Communications Plan & materials updates; \n*\tWorkforce Preparation (training) Plan\/Strategy updates for the core team, current users and new agency staff including schedules, materials and media; \n*\tDAI Lifecycle Sustainment Plan update; \n*\tDAI R12 Global Workflows; \n*\tDAI R12 EBS Configuration Settings Documents; \n*\tDAI R12 RICEFW Inventory identifying the existing current R11 and R12 version of the identifying artifact and\/or that the DAI R11 RICEFW object will be retired in the upgrade; \n*\tR12 Internal Controls\/Segregation of Duties testing; \n*\tOverarching test plan (formerly the Test & Evaluation Master Plan (TEMP)) update and other test plans for System Integration Testing (SIT), Information Assurance (IA) Testing, User Acceptance Testing (UAT) and System Acceptance Testing (SAT); \n*\tDevelop Test Reports; \n*\tDevelop any R12 Upgrade related documentation for certifications and compliances; \n*\tDevelop a data conversion plan if the Oracle upgrade tool does not work sufficiently to certify the migrated data from DAI in R11 to DAI in R12; and\n*\tR12 Information Support Plan (ISP) update including signed copies of revised user Agency agreements and Interface support agreements; \n \nConduct:\n•A review or exercise an intrusion test in concert with the Office of the Secretary of Defense staff; •BEA Version 11.0 compliance review; •Section 508 Compliance review; •Production Readiness Review; •In-Service Review; •Preliminary Design Review; •Critical Design Review; •Test Readiness Reviews; and •System Verification Review.\n \nAcquire and integrate: \n•New Oracle EBS modules that are not currently included in DAI in R11; and •Any required third party tools to facilitate the upgrade from R11 to R12."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "41.465"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "41.465"
                                            },
                                            "Text": {
                                                "val": "In FY2015, the PMO will:\n•\tConduct Business Process Re-engineering.  \n•\tResolve critical software errors and critical statutory\/regulatory enhancements that impact operations and incorporate changes identified during BPR and the Audit generated corrective action plans. \n•\tConduct BEA version 12.0 compliance assessment.\n•\tSupport the DIACAP process maintaining activity to support actions included in the DAA required POA&M resulting in a decision to award an Authority to Operate.   \n•\tConduct testing to include: unit testing on developed items; monthly release testing that includes regression; annual release development testing that includes a SIT and UAT; Oracle R12 upgrade developmental testing including a SIT and UAT; as well as an operational test event in conjunction with DOT&E following the annual release at using Defense Agencies.\n•\tDevelop ability to send\/receive the Department’s Purchase Request and Procurement Data Standards (PRDS\/PDS).\n•\tConduct contract renewal competitions and exercise options on existing contracts and monitor contractor performance and billing.\n•\tMigrate all existing DAI users and their data to the DAI Increment 2 DAI production baseline in 2Q FY 2015.\n•\tComplete migration of some of the October 2016 deploying Defense Agencies users to DAI Time and Labor.\n•\tConduct October 2016 deploying Defense Agencies implementation activities including data conversion.\n•\tConduct development lifecycle for internal controls automation and Treasury Disbursing.\n•\tDevelop, test and release Electronic Funds Distribution (EFD) to DAI production.\n•\tSupport the Audit Readiness Office in developing service provider assertion packages supporting the SSAE 16 Service SOC 1 Report and resolve any NOFs pertaining to DAI.\n•\tConfigure Grants Financial Management capability;  \n•\tConduct new Agencies implementation activities including data conversion.\n•\tConduct development lifecycle for internal controls automation and Treasury Disbursing.\n•\tPrepare to migrate and stabilize DAI user base during upgrade to Oracle R12.\n•\tMonitor the operations of the DISA DECCs at Ogden, UT (Production and T&D to include training); Columbus, OH (COOP) and Mechanicsburg (T&D).  The PMO operates database servers, application servers and web servers, leveraging the DECC for infrastructure support and host site related IA and internal controls.  DECC services are governed by an annually negotiated SLA.  The DAI PMO will use the DECC SSAE 16 SOC 1 Report as the basis for its input for the annual DLA SOC 1 Report that Agencies will use in their audits. DECCs maintain all the operations software and hardware in the suite.\n•\tMaintain currency with existing Federal, DFAS and target Enterprise systems including the SAM web services, as SAM assumes the functionality of the Federal Integrated Acquisition Environment (IAE) systems.  \n•\tMaintain the DAI master data leveraging feeds from the authoritative data sources.\n•\tMaintain a sufficient Information Assurance posture and support the DIACAP process maintaining activity to support actions included in the Designated Approval Authority required actions included in the POA&M including maintaining currency of documentation in EMASS and the VMS.   This includes maintaining the operational and application software currency and security patches.\n•\tMaintain the program’s DODAF views in accordance with DLA guidance and in DLA systems. \n•\tAdminister all of the databases: production; T&D\/training; and COOP.\n•\tMaintain the system configuration leveraging the best of DLA’s Gold Standard for documentation.\n•\tMaintain currency with functional policy with regard to function and data standards.\n•\tMaintain the technical side of the system including the internal processes and the operation of several interfaces with external systems leveraging DLA Transaction Services as well as established Federal Enterprise system web services.\n•\tMaintain and monitor user roles and responsibilities at the system level and guide using Agencies at the Component level."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "DAI is being developed and implemented using an evolutionary\/incremental strategy including major annual software releases to accommodate upgrades as required by changes to the Department’s BEA including new laws, regulations and policies as governed by its Functional Sponsor and Milestone Decision Authority (MDA).  DAI anticipates receiving an Acquisition Decision Memorandum establishing DAI as a MAIS in the DoD Acquisition Lifecycle.  The DAI PMO will establish an Acquisition Program Baseline with the Program Executive Officer (PEO) and MDA.  The PMO will also prepare for an Acquisition Milestone B review.   \n\nThe PMO is responsible for all aspects of program control and execution. The DAI PMO will use a combination of contract types to support the development of required capabilities.  Since the DAI PMO serves as the system integrator, the PMO will use a collaborative team of support contractors that will provide expertise in critical\/functional areas.  The PMO will re-compete services as they expire.  The PMO will seek to increase small business involvement.  The PMO does not intend to bundle services or obtain a system integrator."
                        },
                        "PerformanceMetrics": {
                            "val": "The following performance metrics will be performed on the DAI system:  \n\nFunctionality: Financial system performance.  PEO will determine substantial compliance with the annual Investment Review of PMO assertion of compliance with the latest version of the Department’s BEA in scope requirements for Defense Financial Management Improvement Guidance (DFMIG) and other laws regulations and policy. Objective: Substantial compliance.\n\nProgram Conformance to BEA Processes, Data Standards, and Business Rules.  The PEO will determine substantial compliance with the annual Investment Review of PMO assertion of compliance with the latest version of the Department’s BEA. Objective: Substantial compliance.\n\nNet Ready Key Performance Parameter (NR-KPP) \nAttribute (Att) A - Support net-centric DoD military operations\nMission: Transform the budget, finance, and accounting operations of the DoD Agencies to achieve accurate and reliable financial information in support of financial accountability and effective and efficient decision making throughout the Defense Agencies in support of the missions of the warfighter.\n\nA.1. Budget to Report (B2R).  DAI provides General Ledger, Trial Balance, Budget Execution, and Financial Reporting Capabilities.  \nDAI will measure the percentage of successful attempts to:\n*   Generate and transmit Trial Balance Reports. Objective-95%;\n*   Receive budget information from agency-specific systems, to support budget execution.  Objective-95%; and \n*   Generate and transmit reports to support period end processing procedures.  Objective-95%\n\nA.2 Procure to Pay (P2P).  DAI provides the capability to Order Materials and Services (Commitments), Record Purchases and Contract Information (Obligations) Pay Bills (Accounts Payable), and Create Ready to Pay File.\nDAI will measure the percentage of successful attempts to:\n*   Exchange contract, obligation, receipt and invoice information with external systems to support procurement processes. Objective-95%;\n*   Receive Purchase Card information from external systems to manage government purchase cards (P-Cards). Objective-95%;\n*   Exchange data across agencies to support intergovernmental Purchase Request (PR) processes.  Objective-95%;\n*   Receive travel related data from external systems to support travel financial accounting events. Objective-95%; and \n*   Exchange miscellaneous payment information with trading partners. Objective-95%.\n\nA.3. Order to Cash (O2C).  DAI provides the capability to Receive Customer Orders, Record Work Performed on the orders, Bill Customers, and Track Accounts Receivable.  \nDAI will measure the percentage of successful attempts to:\n*   Exchange data with external systems to support management of customer orders. Objective-95%;\n*   Exchange receivables data with external systems. Objective-95%; and \n*   Manage exchange collections data with external systems.  Objective-95%.\n\nA.4. Acquire to Retire (A2R). DAI provides the capability to record Asset Acquisition, Depreciation, and Disposal DAI will measure the percentage of successful attempts to:\n*   Receive asset creation information from external systems. Objective-95%;\n*   Accumulate and transmit costs incurred for Capital Assets on Construction in Progress (CIP) and Work in Progress (WIP) projects. Objective-95%;\n*   Generate and transmit property accounting information. Objective-95%;\n*   Receive property maintenance data from external systems. Objective-95%; and\n*   Receive disposal of assets information from external systems. Objective-95%.\n\nA.5. Cost Management (formerly Cost Accounting).  DAI provides Cost Accounting and Allocation Capabilities\nDAI will measure the percentage of successful attempts to:\n*   Receive Project Budgets from external systems. Objective-95%; and \n*   Receive cost data to support cost collection processes. Objective-95%.\n\nA. 6. Hire to Retire (H2R). DAI provides Civilian, Military, and Contractor Time and Labor capabilities DAI will measure the percentage of successful attempts to:\n*   Exchange employee and timekeeping information with external systems. Objective-95%; and \n*   Process and send payroll data to external systems. Objective-95%.\n\nNR-KPP Att B - Managed in the Network\t\n1) Type of Networks that are connected: \n- The DAI application supports multiple Defense Agencies, and thus is accessible from multiple network points. A typical user accesses the application via the web browser from his\/her agency specific LAN\/WAN and\/or local site firewall configurations, traversing through the Non-Classified Internet Protocol Routing Network (NIPRNet) to reach the secure DAI application hosted within the DoD Demilitarized  Zone (DMZ) which is controlled and managed by DISA.\n- The DAI production application is hosted in a DISA DECC environment located in Ogden, UT and is managed by DAI Program Management Office\n\n\n2) MOPs to measure network entrance and management performance:\na) Network related (DISA) – as per DISA Catalog of Services \n-Interactive Availability - Portion of network\/system controlled by DISA CSD available to the partner during the interactive window\n-Batch Throughput – Completion rate and delivery by specified time during batch window specified in SLA\nb) Database related (DAI Program Management Office)\n-System Availability \n-On Line user system response\n\n\n3) Network Management:\n-The Agency (user) being supported is responsible for the communications infrastructure necessary for leaving their location to connect users to the NIPRNet \n-DISA is responsible for communications on NIPRNet between the end user and the main DAI environment\n-DAI Program Management Office is responsible for activities occurring within the application and the Oracle Database\n\n4) Systems Management \n-NIPRNet and Infrastructure  - Centralized within DISA CSD \n-DAI System – centralized within DAI Program Management Office\n\n\n5) Network Configuration Parameters – N\/A (within the realm of DISA management) DAI will measure the percentage of success for:\n*   Supports secure Internet\/NIPRNET access to solution. Interactive Availability. Objective-98.5%;\n*   Supports secure Internet\/NIPRNET access to solution.  Batch Throughput. Objective-95%;\n*   Provides adequate system response and availability to support operations.\tSystem Availability.  (Condition: 5000 users\/hour)  Objective-95%; and\n*   Provides adequate system response and availability to support operations. On-line system response. (Condition: 5000 users\/hour) Objective-95%.\n\nNR-KPP Att C - Effectively Exchange Information.  \nDAI will satisfy all top-level critical Information Exchange Requirements (IERs) with all required DoD Enterprise, DFAS, Defense Agencies, and Federal Systems, as documented in SV-6.   There are 47 data exchanges with other systems.  The objectives are 100% for accuracy and ten seconds to 1 day for timeliness.  Additional details available upon request.  \n\nMajor Performers\nDISA\nDECC Ogden, Utah\nProduction Support \n\nDISA\nDECC Columbus, OH\nTest and Development, and COOP Hosting Support\n\nDISA\nDECC Mechanicsburg, PA\nTest and Development  \n\nDISA, Joint Interoperability Test Command (JITC)\nIndian Head, MD and Fort Huachuca, AZ\nTest Management and ITT Lead Services, Test tool, Information Exchange\/Interfaces, DLA Transaction Services Instance and limited Operational Assessment Support.\n\nNorthrop Grumman\nMcLean, VA\nInterface management and oversight\n\nDLT Solutions\nHerndon, VA\nApplication and database management support (FY 2012- 2nd Quarter (Q2) FY 2013)\n\nIBM\nBethesda, MD\nGlobal Model Development-Procure to Pay; Budget to Report; and Order to Cash\n\nCACI Inc., Federal\nChantilly, VA\nGlobal Model Development-Cost Accounting; Time and Labor; Acquire to Retire; and Infrastructure Support (Application and database management support (Q2 FY 2013 and beyond). \n\nComputer Sciences Corp\nFalls Church, VA\nGlobal Model Development-Reports, Interfaces, Conversions and Information Assurance"
                        }
                    }
                }
            ]
        }
    }
}