{
    "id": "ea20e4c6881a77d0986020ec49041bd57dd54b46",
    "meta": {
        "filename": "dod-2015_RDTE_2015_ARMY_BA2_RDTE_JustificationBook_Army_PB_2015.zzz_unzipped_RDTE_JustificationBook_Army_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602720A"
        },
        "ProgramElementTitle": {
            "val": "Environmental Quality Technology"
        },
        "R1LineNumber": {
            "val": "22"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "18.259"
            },
            "CurrentYear": {
                "val": "20.304"
            },
            "BudgetYearOne": {
                "val": "15.659"
            },
            "BudgetYearOneBase": {
                "val": "15.659"
            },
            "BudgetYearTwo": {
                "val": "19.087"
            },
            "BudgetYearThree": {
                "val": "20.596"
            },
            "BudgetYearFour": {
                "val": "21.278"
            },
            "BudgetYearFive": {
                "val": "21.552"
            }
        },
        "ProgramElementNote": {
            "val": "FY 13 decrease attributed to General Congressional Reductions for (-37 thousand); SBIR\/STTR transfers (-376 thousand); and Sequestration reductions (-1.423 million)\n)FY15 funding realigned to support higher Army priorities."
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) investigates and evaluates enabling tools and methodologies that support the long-term sustainment of Army training and testing activities.  Specific focus is on maintaining regulatory compliance while limiting future Army liability in operations and training, and maintaining resilient and adaptive ranges. Project 048 improves the Army's ability to comply with requirements mandated by federal, state and local environmental\/health laws and reducing the cost of this compliance. Project 835 develops enabling technologies for advanced life cycle analysis, advanced sensing, and advanced remediation of Army unique hazardous and toxic wastes at sites containing waste ammunition, explosives, heavy metals, propellants, smokes, chemical munitions, and other organic contaminants. Project 895 focuses on reducing hazardous waste generation through process modification and control, materials recycling and substitution and developing technologies to predict and mitigate range and maneuver constraints associated with current and emerging weapon systems, doctrine, and regulations.  Project 896 investigates technologies for ecosystem vulnerability assessment, and ecosystem analysis, monitoring, modeling and mitigation to support sustainable use of Army lands and airspace to reduce or eliminate environmental constraints to military missions.   \n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy and supports the Army Strategy for the Environment.  \n\nTechnologies developed in this PE are transitioned to PE 0603728A (Environmental Quality Technology Demonstrations).  \n\nWork in this PE is performed by the US Army Engineer Research and Development Center, Vicksburg, MS, and the US Army Research, Development and Engineering Command, Aberdeen Proving Ground, MD."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "20.095"
                },
                "CurrentYear": {
                    "val": "20.316"
                },
                "BudgetYearOne": {
                    "val": "20.616"
                },
                "BudgetYearOneBase": {
                    "val": "20.616"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "18.259"
                },
                "CurrentYear": {
                    "val": "20.304"
                },
                "BudgetYearOne": {
                    "val": "15.659"
                },
                "BudgetYearOneBase": {
                    "val": "15.659"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.836"
                },
                "CurrentYear": {
                    "val": "-0.012"
                },
                "BudgetYearOne": {
                    "val": "-4.957"
                },
                "BudgetYearOneBase": {
                    "val": "-4.957"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.037"
                    },
                    "CurrentYear": {
                        "val": "-0.012"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.376"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-4.957"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-4.957"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments 1"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-1.423"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "048"
                    },
                    "ProjectTitle": {
                        "val": "Ind Oper Poll Ctrl Tec"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.971"
                        },
                        "CurrentYear": {
                            "val": "2.123"
                        },
                        "BudgetYearOne": {
                            "val": "1.567"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.567"
                        },
                        "BudgetYearTwo": {
                            "val": "2.353"
                        },
                        "BudgetYearThree": {
                            "val": "2.531"
                        },
                        "BudgetYearFour": {
                            "val": "2.660"
                        },
                        "BudgetYearFive": {
                            "val": "2.711"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item"
                        },
                        "ProjectMissionDescription": {
                            "val": "This project designs and develops tools and methods to enable the Army to reduce or eliminate environmental impacts both in the United States and abroad.  These technologies reduce the impact of legal and regulatory environmental restrictions on installation facilities, training and testing lands and ranges, as well as provide a means to avoid fines and facility shutdowns within the United States and reduce environmental impacts to the Warfighter abroad.  New and innovative technologies are essential for the effective control and reduction of military unique hazardous and non-hazardous wastes on military installations and associated with contingency operations bases worldwide.  Efforts focus on the impacts of new materiel that will enter the Army inventory within the next decade and beyond.  This project focuses on developing sustainable environmental protection technologies that help the Army maintain environmental compliance for sources of pollution such as production facilities, facility contamination and other waste streams.  Efforts abroad include a focus on designing and developing technologies for deployed forces with environmentally safe, operationally enhanced and cost effective technologies and\/or processes to achieve maximum diversion, minimization, or volume reduction of base camp and field waste.  This project focuses on Army-unique ecosystem vulnerability assessment, and ecosystem analysis, modeling, adaptation and mitigation technologies for installations associated with air quality and endangered species management and their impacts on training and testing mission.\n\nThe work in this project supports the Army S&T Innovation Enablers (formerly Enduring Technologies) Portfolio.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy and supports the Army Strategy for the Environment.  \n\nWork in this project is performed by the US Army Engineer Research and Development Center, Vicksburg, MS."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Sustainable Ranges and Lands"
                                    },
                                    "Description": {
                                        "val": "This effort supports management of operations on ranges and training lands with the intent to reduce constraints and restrictions resulting from environmental regulations. Technologies are targeted both toward solutions for environmental compliance and associated requirements, as well as solutions that will enhance training and testing operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.971"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued effort to assess, predict, and mitigate the consequences of altered fire regimes on concurrent management of threatened and endangered species (TES) and air quality at installations; completed mechanistic models of the role of multiple stressors in governing plant physiological responses to fire; began integration of vegetation response models with prescribed-fire emission and management models to provide foundation for integrated installation air quality and endangered species management."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.123"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete field studies and analysis of physiological consequences of wound closure of trees and woody vegetation after burning; compartmentalization and rot resistance for woody species persistence under variable fire regimes; complete characterization and forecasting capabilities to assess multi-scale ecological response to altered fire regimes and the consequences for sustainable military land management; complete prescribed fire planning and scenario analysis capabilities to identify burn regime prescriptions that support emissions management; complete a predictive framework for assessing community and ecosystem response to changes in fire regime; refine net zero energy installation optimization algorithms to reduce environmental impacts and to incorporate in the installation energy, water, and waste modeling development in PE 0602784, project T41."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.567"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.567"
                                            },
                                            "Text": {
                                                "val": "Will investigate technologies\/methods for national, regional and installation Threatened and Endangered Species management strategies to enable fielding of materiel systems, minimize adverse training and testing impacts, and reduce compliance costs associated with currently listed and anticipated increases in federally listed species."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "835"
                    },
                    "ProjectTitle": {
                        "val": "Mil Med Environ Crit"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.599"
                        },
                        "CurrentYear": {
                            "val": "6.225"
                        },
                        "BudgetYearOne": {
                            "val": "5.457"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.457"
                        },
                        "BudgetYearTwo": {
                            "val": "6.651"
                        },
                        "BudgetYearThree": {
                            "val": "7.159"
                        },
                        "BudgetYearFour": {
                            "val": "7.360"
                        },
                        "BudgetYearFive": {
                            "val": "7.407"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item"
                        },
                        "ProjectMissionDescription": {
                            "val": "This project investigates a quantitative means to determine the environmental effects resulting from exposure to Army-unique explosives, propellants, smokes and products containing nanomaterials and new and emerging compounds and materials across the Army training and operations. This research provides the basis for tools and methods to respond to regulatory constraints, and to protect the health of the Soldier and the extended Army community. Results of this research will be integrated into the life cycle analysis of all new Army materials and chemicals. The specific results of this research include: determination of acceptable contaminant concentration levels for residual Army-unique chemicals and materials of concern that minimize adverse effects on the environment and human health. This includes development of methods that guide the design of nanomaterials and other new and emerging materials such that adverse effects on the environment are minimized in their designed state and when they enter the environment where they may break down. Example areas of research include genomics analysis, cutting edge nanomaterial analysis, and computational\/molecular modeling.  Interim projects are used by PEO Ammo and IEW&S for use in life cycle analysis, risk assessment, and cleanup. Interim products are also US Environmental Protection Agency approved criteria documents to be used in risk assessment procedures and establishing regulatory limits. The Army uses these criteria during negotiations with regulatory officials to set scientifically and economically appropriate cleanup and discharge limits on Army lands.\n\nWork in this project supports the Army S&T Innovation Enablers (formerly Enduring Technologies) Portfolio.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy and supports the Army Strategy for the Environment.  \n\nWork in this project is performed by the US Army Engineer Research and Development Center, Vicksburg, MS."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Life Cycle of Military Materials in the Environment"
                                    },
                                    "Description": {
                                        "val": "This effort provides a quantitative means to determine the environmental and human health effects resulting from exposure to existing and emerging compounds and materials produced in Army industrial, field and battlefield operations or disposed of through past activities. Results of this research will be integrated into the life cycle analysis process."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.446"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Began to assess the impact of climate change on Army relevant contaminants and develop a screening level vulnerability assessment for the planning and life cycle analyses processes for Army lands."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.721"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop a web-based visualization tool that provides a framework for assessing multi-stressor climate change impacts to current military installations management objectives; develop new analytical techniques to detect and identify contaminants in the battlefield providing quantitative or semi-quantitative chemical and biological values for operational decision-making (in FY13 this work was funded under PE 0602720 Project 896)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.321"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.321"
                                            },
                                            "Text": {
                                                "val": "Will develop tools to provide near real-time data for identification and semi-quantification of environmental chemical hazards to support life cycle analysis, expeditionary operations, and computational tools to predict potential environmental hazards of existing and emerging munitions and pyrotechnics."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Materials and Nanotechnology: Environmental Effects\npreviously called Nanotechnology-Environmental Effects"
                                    },
                                    "Description": {
                                        "val": "This effort enables the Army's ability to field advanced nano-based technologies by appropriate identification and assessment of the environmental impacts of nanomaterials.  The end result of this research is the development of tools that guide and influence the design of nanomaterials based on such factors as adverse effects on human health or the environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.248"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed quantitative models for fate and uptake of select military relevant nanomaterials to predict impacts and inform decision analysis techniques; began environmental assessment of products containing nanomaterials as fielded in Army relevant items (i.e, textiles, machinery, vehicles) to inform the development of regulations and life cycle analysis for nanomaterials."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.472"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop a risk-based process to quantitatively assess benefit and impact of nanomaterial-based Army products in the environment and computational approaches for the smart design of functional nanomaterials. Results of this research will inform nanomaterial remediation technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.136"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.136"
                                            },
                                            "Text": {
                                                "val": "Will develop methodologies to evaluate Army-unique materials comprised of nanomaterials for environmental health and safety impacts throughout their lifecycle.  These methodologies are needed to make risk informed decisions and enable rapid fielding of advanced nanomaterial based products."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Remediation Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort enables the Army to predict and understand the fate and transport of Army-unique compounds and materials which improves the capability to detect, control, and remediate. This effort develops advanced engineering concepts utilizing advanced materials, biological processes, and nanomaterials in remediation processes."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.905"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigated technologies\/methods for the cost effective & environmentally protective stabilization, containment and management of depleted Uranium and residues on test and training ranges; developed scenarios exploiting fate and transport knowledge of range contaminants in order to control and remediate in a continuous process allowing for remediation activities while avoiding an impact to training."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.032"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Examine green remediation technologies for common range contaminants (i.e., RDX, TNT, and metals); investigate innovative wastewater treatment technologies for munitions production to improve water quality of surface water and wetlands impacted by development and use of new munitions compounds; develop standardized protocols and analytical methods to generate high quality environmental, biological and chemical risk values for acquisition decision processes."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "895"
                    },
                    "ProjectTitle": {
                        "val": "Pollution Prevention"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.616"
                        },
                        "CurrentYear": {
                            "val": "4.141"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item"
                        },
                        "ProjectMissionDescription": {
                            "val": "The project develops pollution prevention technologies required to reduce\/eliminate the environmental footprint resulting from the manufacture, maintenance, use and surveillance of Army ordnance and other weapon systems. This project researches and develops revolutionary technologies to eliminate or significantly reduce the environmental impacts that threaten the sustainment of production and maintenance facilities, training ranges and operational areas. The project supports the transformation of the Army by ensuring that advanced energetic materials required for high-performance munitions (gun, rocket, missile propulsion systems, and warhead explosives) are devised to meet weapons lethality\/survivability stretch goals in parallel with, and in compliance to, foreseeable sustainment requirements. Specific technology thrusts include environmentally-benign explosives developed with computer modeling using Department of Defense high-performance computing resources; novel energetics that capitalize on the unique behavior of nano-scale structures; chemically engineered explosive and propellant formulations produced with minimal environmental waste, long-storage lifetime, rapid\/benign environmental degradation properties, and efficient extraction and reuse; and fuses, pyrotechnics, and initiators that are free from toxic chemicals. Other focus areas include base camp energy reduction initiatives, elimination of waste streams in contingency operations and toxic metal reductions from surface finishing processes. \n\nWork in this project supports the Army S&T Innovation Enablers (formerly Enduring Technologies) Portfolio.  \n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering science and technology priority focus areas and the Army Modernization Strategy and supports the Army Strategy for the Environment.\n\nTechnologies developed in this project are fully coordinated and complementary to PE 0603728A, Project 025. \n\nWork in this project is performed by the Research, Development and Engineering Command Army Research Laboratory, Aberdeen Proving Ground, MD, the Armaments Research, Development, and Engineering Center, Picatinny Arsenal, NJ, the Aviation and Missile Research, Development, and Engineering Center, Huntsville, AL, the Natick Soldier Research, Development and Engineering Center, Natick, MA, and the Tank Automotive Research, Development and Engineering Center, Warren, MI."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Pollution Prevention Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort develops pollution prevention technologies to reduce\/eliminate the environmental footprint resulting from the manufacture, maintenance, use and surveillance of Army ordnance and other weapon systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.616"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conventional Ammunition: developed model for binder interaction and performance in energetic formulations; Pyrotechnics: conducted limited performance evaluation of environmentally sustainable white smoke; Toxic Metal Reduction: evaluated hexavalent chromium-free pretreatments in a laboratory environment for use on mixed metal substrates; Zero Footprint Camp: evaluated promising approaches to reducing water demand and wastewater generation in contingency bases, including demand reduction options, wastewater reuse options and wastewater treatment options."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.141"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conventional Ammunition: conduct limited performance evaluation of novel lead-free primer formulations; Rocket and Missile Propellants: explore lead-free alternatives for minimum signature applications; Toxic Metal Reduction: evaluate emerging hexavalent chromium-free processes for generating wear resistant surface coatings."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "896"
                    },
                    "ProjectTitle": {
                        "val": "Base Fac Environ Qual"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7.073"
                        },
                        "CurrentYear": {
                            "val": "7.815"
                        },
                        "BudgetYearOne": {
                            "val": "8.635"
                        },
                        "BudgetYearOneBase": {
                            "val": "8.635"
                        },
                        "BudgetYearTwo": {
                            "val": "10.083"
                        },
                        "BudgetYearThree": {
                            "val": "10.906"
                        },
                        "BudgetYearFour": {
                            "val": "11.258"
                        },
                        "BudgetYearFive": {
                            "val": "11.434"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item"
                        },
                        "ProjectMissionDescription": {
                            "val": "This project designs and develops tools and identification and assesment methodologies for ecosystem vulnerability assessment, analysis, monitoring, modeling and mitigation to support sustainable use of Army facilities, training lands, firing ranges and airspace to reduce or eliminate environmental constraints to military missions.  This project provides the Army the technical capability to manage, protect and improve the biophysical characteristics of training and testing areas needed for realistic and sustainable ranges and training lands.  Technologies within this project enable users to match mission events and training schedules with the resource capabilities of specific land areas and understand how the use of those resources effect mission support and environmental compliance.  The project investigates, designs, and develops novel methods and technologies to adapt and restore lands damaged during training activities and allow sustained use of Army resources.  The project supports readiness and full use of training lands through development of invasive, threatened, and endangered species monitoring technology and management technologies for species at risk.  The project also designs and develops tools and technologies to avoid training restrictions and reduce constraints on training lands associated with potential impacts from climate change. \n\nWork in this project supports the Army S&T Innovation Enablers (formerly Enduring Technologies) Portfolio.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy and supports the Army Strategy for the Environment.  \n\nWork in this project is performed by the US Army Engineer Research and Development Center, Vicksburg, MS."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Sustainable Ranges and Lands"
                                    },
                                    "Description": {
                                        "val": "This effort provides ecosystem vulnerability assessment, analysis, monitoring, modeling and mitigation technologies to support sustainable use of Army facilities, training lands, firing ranges, and airspace to reduce or eliminate environmental constraints to military missions. This effort targets integrated military land appropriate management and control technologies for selected high priority Army land management issues including Threatened and Endangered Species (TES), Species at Risk (SAR), and invasive species. This effort enables effective management of training lands by understanding the cumulative impacts of training and non-training land use activities on critical natural resources under current and potential future climate conditions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.654"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed optimal allocation of land for training and non-training uses for rapid analysis and quantification of impacts of natural resources decisions on training land capacity, and developed a preliminary network model for analysis of potential ecological response to changing weather intensity and climate. Network model incorporated high priority Army land management issues including Threatened and Endangered Species (TES), Species at Risk (SAR), and invasive species."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.246"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop predictive models and analytical approaches for natural infrastructure response and installation adaptation planning to climate change; investigate novel sensor networks for adaptable installation noise management and mitigation practices; integrate Installation energy, water, and waste modeling algorithms for net zero energy installation optimization efforts in PE 0602784, project T41."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.536"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.536"
                                            },
                                            "Text": {
                                                "val": "Will investigate new analytical methods for incorporating the direct impacts of climate change, and related dynamic processes such as urban encroachment, into Army enterprise long-term planning processes that enable Army transformation and materiel fielding; will develop advanced decision metrics that quantify climate uncertainty on mission relevant m-made and natural infrastructure and processes in a manner that is consistent with current Army plans and planning processes: will investigate the underlying fundamental physical and ecological processes of these advanced decision metrics and their response to projected climate change. Will initiate development of next generation real-time noise management technologies to provide the ability to adaptively manage and reduce noise impacts to live training for installations experiencing existing and emerging encroachment impacts on training lands."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Military Materials in the Environment"
                                    },
                                    "Description": {
                                        "val": "This effort develops models to predict chemical behavior in simple and complex environmental media (e.g. soils, water).  These models will allow for improved understanding of how compounds and materials will move, bind and degrade when introduced into the environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.419"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed predictive models of chemical behavior with information on how military relevant contaminants interact with basic soil components with emphasis on the new insensitive munitions compounds; expanded predictive models for complex surfaces such as typical mineral and soil particles."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.569"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop new technologies to predict the environmental fate and transport of contaminants on complex surfaces to improve operational intelligence; characterize and fuse data from ecological parameters, environmental conditions and social dynamics in locations critical for Army missions and operations in support of Combatant Command requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.099"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.099"
                                            },
                                            "Text": {
                                                "val": "Will design tools for detecting and modeling the source of emerging threat agents in areas of denied access. This capability will identify and predict fate of unique contaminant threats and provide information about the quality and spatial distribution of water sources at a landscape scale within an operational area. Will begin the development of tools to predict soil characteristics and contaminant behavior in soil using remote sensing and sparse data extrapolation techniques in areas of limited access to improve initial entry operations and expeditionary force movement and maneuver."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}