{
    "id": "eb21038e5fe2fbfa820cb962263f086e8307e594",
    "meta": {
        "filename": "dod-2015_RDTE_2015_ARMY_BA2_RDTE_JustificationBook_Army_PB_2015.zzz_unzipped_RDTE_JustificationBook_Army_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602307A"
        },
        "ProgramElementTitle": {
            "val": "ADVANCED WEAPONS TECHNOLOGY"
        },
        "R1LineNumber": {
            "val": "11"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "23.140"
            },
            "CurrentYear": {
                "val": "26.148"
            },
            "BudgetYearOne": {
                "val": "28.528"
            },
            "BudgetYearOneBase": {
                "val": "28.528"
            },
            "BudgetYearTwo": {
                "val": "29.641"
            },
            "BudgetYearThree": {
                "val": "29.015"
            },
            "BudgetYearFour": {
                "val": "29.439"
            },
            "BudgetYearFive": {
                "val": "29.999"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) investigates enabling technologies for High Energy Laser (HEL) weapons.  Project 042 develops component technologies such as efficient, high energy, solid state lasers; advanced beam control components; and lethality \/ effectiveness measurements that enable better models and simulations for future HEL weapon designs.   \n\nWork in this project is related to, and fully complements, efforts in PE 0601101A (In-House Laboratory Independent Research), PE 0602120A (Sensors and Electronic Survivability) Project EM8, PE 0603004A (Weapons and Munitions Advanced Technology) Project L96 and Air Force PE 0602890F (HEL Research).\n  \nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.   \n  \nWork is performed by the U.S. Army Space and Missile Defense Command\/Army Forces Strategic Command (USASMDC\/ARSTRAT), in Huntsville, AL, the U.S. Army Aviation and Missile Research, Development, and Engineering Center (AMRDEC) in Huntsville, AL, and the High Energy Laser Systems Test Facility, at White Sands Missile Range, NM."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "25.999"
                },
                "CurrentYear": {
                    "val": "26.162"
                },
                "BudgetYearOne": {
                    "val": "28.376"
                },
                "BudgetYearOneBase": {
                    "val": "28.376"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "23.140"
                },
                "CurrentYear": {
                    "val": "26.148"
                },
                "BudgetYearOne": {
                    "val": "28.528"
                },
                "BudgetYearOneBase": {
                    "val": "28.528"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.859"
                },
                "CurrentYear": {
                    "val": "-0.014"
                },
                "BudgetYearOne": {
                    "val": "0.152"
                },
                "BudgetYearOneBase": {
                    "val": "0.152"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.034"
                    },
                    "CurrentYear": {
                        "val": "-0.014"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.733"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "0.152"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.152"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Sequestration"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-2.092"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "042"
                    },
                    "ProjectTitle": {
                        "val": "High Energy Laser Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "23.140"
                        },
                        "CurrentYear": {
                            "val": "26.148"
                        },
                        "BudgetYearOne": {
                            "val": "28.528"
                        },
                        "BudgetYearOneBase": {
                            "val": "28.528"
                        },
                        "BudgetYearTwo": {
                            "val": "29.641"
                        },
                        "BudgetYearThree": {
                            "val": "29.015"
                        },
                        "BudgetYearFour": {
                            "val": "29.439"
                        },
                        "BudgetYearFive": {
                            "val": "29.999"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project investigates and develops advanced technologies for High Energy Laser (HEL) weapon systems to enable more efficient lasers with greater power output. This includes technologies to support development of alternate laser sources, precision optical pointing and tracking components, adaptive optics to overcome laser degradation due to atmospheric effects, and thermal management systems to remove excess heat.  In addition, this effort conducts laser lethality demonstrations and analysis against a variety of targets and investigates the impact of low-cost laser countermeasures.  Solid State Laser (SSL) efforts continue to leverage other funds provided by the HEL Joint Technology Office (JTO), the Air Force, and the Navy to develop multiple technical approaches that reduce program risk and maintain competition.  \n \nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.  \n \nWork is performed by the U.S. Army Space and Missile Defense Command\/Army Forces Strategic Command (USASMDC\/ARSTRAT), in Huntsville, AL, the U.S. Aviation and Missile Research, Development, and Engineering Center (AMRDEC) in Huntsville, AL, and the HELSTF at White Sands Missile Range, NM."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Solid State Laser (SSL) Effects"
                                    },
                                    "Description": {
                                        "val": "This effort provides the underlying data required to support system engineering designs, lethality analysis, and modeling and simulation (M&S) tools for laser weapon systems.  Beginning in FY13, this effort includes the operation of the Solid State Laser Testbed (SSLT), a 100kW class laser testbed located at the HELSTF for conducting SSL effects experiments in an open air environment. Beginning in FY13, multiple SSLT related project tasks were reorganized and are now captured in this planned program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.016"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued to conduct static and dynamic experiments using the SSLT infrastructure to investigate SSL performance against RAM, UAS, and other selected targets; and used data from experiments to validate M&S codes to predict SSL weapon system effectiveness in operational scenarios."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.978"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Return SSLT laser and clean room to fully operational standards to complete transfer of SSLT operations and maintenance responsibility to White Sands Missile Range (WSMR) HELSTF; continue static and dynamic experiments to investigate performance of the SSLT against Man Portable Air Defense Systems (MANPADS) and use data collected from experiments to refine and validate M&S codes to predict SSL weapon system effectiveness against MANPADS."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.807"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.807"
                                            },
                                            "Text": {
                                                "val": "Will upgrade SSLT lethality data collection capability to collect better represented lethality data to improve lethality models and better predict integrated high energy laser demonstration performance;  use lethality data to improve laser weapon system battle management capability against RAM and UAS targets; begin collecting lethality data on targets to support planning for the upcoming High Energy Laser Mobile Demonstrator (HEL MD) 50kW class demonstration, modeling, and effects simulation analysis; continue validation and analysis of atmospheric effects on the propagation of a 1.06 micron solid state laser."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Beam Control Component Development"
                                    },
                                    "Description": {
                                        "val": "This effort investigates technologies to enable lighter, more agile beam control systems that are robust enough to be used in Army ground platforms. This work is done in collaboration with the HEL JTO and other Services. Beginning in FY13, support activities were redistributed across all planned programs rather than solely captured in this activity."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.769"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued to mature components of a light weight beam director, including a shared aperture system and beam control algorithms to support the ability to precisely point a HEL through a beam control system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.267"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Demonstrate performance of an off-axis light weight beam director and use data to update and validate models for component maturity; complete development of the aperture sharing element of the light weight beam director and demonstrate the jitter performance and track stability required for a mobile HEL weapon system; begin the integration of an Adaptive Optics (AO) system that will allow for improved beam propagation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.063"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.063"
                                            },
                                            "Text": {
                                                "val": "Will begin joint advanced beam control effort with the Air Force and the HEL JTO to develop beam control component technology that is capable of meeting desired performance requirements;  continue development of an All Weather Tracker with the goal to be able to track RAM and UAS targets in adverse weather to augment the tracking and aim point maintenance of a High Energy Laser Weapon System; complete analysis and subscale experiments using segmented mirrors to demonstrate improved ability to correct wavefront errors in a high energy laser."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Efficiency Laser Development"
                                    },
                                    "Description": {
                                        "val": "This effort develops component technologies that lead to increased SSL wall-plug efficiencies, which will lead to reductions in size and weight for multiple subsystems that greatly improve the ability to integrate SSL systems onto mobile Army weapon platforms. This work is done in collaboration with the HEL JTO and other Services. Selected laser design will be fabricated and integrated with the High Energy Laser Mobile Demonstrator (HEL MD) developed in 0603006A, Project L96."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.733"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "In concert with the HEL JTO and the other services, evaluated and selected one or more high efficiency laser approaches to mature the design, determined interface specifications, purchased hardware items, and began assembly of a 25-50kW class robust electric laser that is compatible with the mobile beam control system and vehicle payload weight and volume constraints; conducted experiments as components mature to validate performance and efficiency specifications; evaluated high efficiency laser technology approaches for ruggedness, reliability, and affordability; and investigated methods for using high efficiency lasers against sensors."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.667"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete environmental testing on fiber laser subcomponents to support the rugged 50kW efficient laser critical design and conduct subscale experiments and analysis to ensure it will be compatible with the HEL MD ruggedness, reliability, and affordability factors; complete high efficient laser component design requirements and risk reduction testing of the rugged fiber laser amplifier, fiber array holder, and the Multi-Layer Dielectric (MLD) grating and holder; complete the rugged fiber laser component development and begin the purchase of long lead items for laser fabrication, such as high efficient laser diode pumps, efficient high power ytterbium doped fibers, and laser control electronics; and complete the design and fabrication of the rugged, high power beam combination optical element."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.965"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.965"
                                            },
                                            "Text": {
                                                "val": "Will complete critical design review on efficient high power rugged laser for future integration into HEL MD; purchase long lead items, including the multi-dielectric grating, 112 channel fiber array holder, polarization-maintaining high power fibers, fiber coupled pump diodes, fiber isolators and pump combiner, and narrow line-width seed sources; complete design and spectral beam combiner component risk reduction experiments to support scaling up to 100kW; begin initial subcomponent integration; conduct improved laser thermal management risk reduction experiments and verify performance of two-phase cooling approach to improve magazine depth; complete fabrication of one double-density Fiber Laser Module (FLM) and two additional fiber laser modules to support the manufacture readiness review; complete maintenance concept plan for the high power rugged laser line replaceable units."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HEL Research and Development and Concepts Analysis Laboratories"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on developing in-house expertise through SSL assessments and other SMDC\/ARSTRAT technical core competencies starting in FY15."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.622"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conducted experiments using Adaptive Optics (AO) components to develop and validate algorithms for correction of atmospheric distortions to improve effective range."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.236"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete the analysis of an Adaptive Optics (AO) system and transition the hardware and algorithms to the light weight beam director effort for integrated tactical performance assessments; begin performance demonstrations using hardware and algorithms for correcting laser propagation in deep turbulence; begin development of an all weather tracker that is compatible with a laser weapon system."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.693"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.693"
                                            },
                                            "Text": {
                                                "val": "Will complete Adaptive Optics (AO) performance demonstrations of advance AO algorithms for transition to the HEL MD AO system; purchase pump diodes and scaled electric\/Radio Frequency discharge sources and begin diode pump gas laser scaling experiments; develop models of space environment effects on small spacecraft; perform orbital assessments of nanosatellite spacecraft and constellation concepts; and investigate concepts in support of space, missile, rocket, and mortar defense."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}