{
    "id": "ec6985044af596b00315d51d8e1e2f1dd9671f80",
    "meta": {
        "filename": "dod-2015_RDTE_2015_SOCOM_RDTE_JustificationBook_United_States_Special_Operations_Command_PB_2015.zzz_unzipped_RDTE_JustificationBook_United_States_Special_Operations_Command_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "United States Special Operations Command",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "1160483BB"
        },
        "ProgramElementTitle": {
            "val": "Maritime Systems"
        },
        "R1LineNumber": {
            "val": "262"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "United States Special Operations Command"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "136.135"
            },
            "PriorYear": {
                "val": "66.263"
            },
            "CurrentYear": {
                "val": "28.534"
            },
            "BudgetYearOne": {
                "val": "57.905"
            },
            "BudgetYearOneBase": {
                "val": "57.905"
            },
            "BudgetYearTwo": {
                "val": "19.624"
            },
            "BudgetYearThree": {
                "val": "13.214"
            },
            "BudgetYearFour": {
                "val": "7.543"
            },
            "BudgetYearFive": {
                "val": "7.340"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "Beginning in FY 2014 Maritime Systems represents the approved consolidation of Special Operations Forces (SOF) Surface Craft, Program Element (PE)1160484BB and SOF Underwater Systems, PE 1160483BB.  The consolidated PE 1160483BB has been renamed Maritime Systems."
        },
        "ProgramElementMissionDescription": {
            "val": "This consolidated PE provides for engineering & manufacturing development and operational development of SOF Surface and Undersea Mobility platforms.  This program element also provides for pre-acquisition activities to quickly respond to new requirements for SOF surface and undersea mobility, looking at multiple alternatives to include cross-platform technical solutions, service common solutions, Commercial-Off-The-Shelf (COTS) technologies and new development efforts.  \n\nThe Underwater Systems project provides for engineering and manufacturing development and operational systems development of combat underwater submersibles and underwater support systems and equipment.  This project also provides for pre-acquisition activities (materiel solutions analysis, advanced component development and prototypes) to respond to emergent requirements.  These submersibles, systems, and equipment are used by SOF in the conduct of infiltration\/extraction, hydrographic\/inland reconnaissance, beach obstacle clearance, underwater ship attack, and other missions.  The capabilities of the submersible systems and unique equipment provides small, highly trained forces the ability to successfully engage the enemy and conduct clandestine operations associated with SOF maritime missions.  This program received a FY 2013 Congressional Add.\n\nThe Surface Craft project provides for engineering & manufacturing development and operational systems development of light, medium, and heavy surface combatant craft and selected items of specialized equipment to meet the unique requirements of SOF.  This project element also provides for pre-acquisition activities (materiel solutions analysis, advanced component development & prototypes) to quickly respond to new requirements for surface craft and equipment, such as the light and heavy combatant crafts. The craft capabilities and unique equipment provide small, highly trained forces the ability to successfully engage the enemy and conduct operations associated with SOF maritime missions."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "26.405"
                },
                "CurrentYear": {
                    "val": "18.325"
                },
                "BudgetYearOne": {
                    "val": "43.795"
                },
                "BudgetYearOneBase": {
                    "val": "43.795"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "66.263"
                },
                "CurrentYear": {
                    "val": "28.534"
                },
                "BudgetYearOne": {
                    "val": "57.905"
                },
                "BudgetYearOneBase": {
                    "val": "57.905"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "39.858"
                },
                "CurrentYear": {
                    "val": "10.209"
                },
                "BudgetYearOne": {
                    "val": "14.110"
                },
                "BudgetYearOneBase": {
                    "val": "14.110"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-5.866"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "-0.098"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "49.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "CurrentYear": {
                        "val": "11.156"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-2.500"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.678"
                    },
                    "CurrentYear": {
                        "val": "-0.947"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "14.110"
                                },
                                "BudgetYearOneBase": {
                                    "val": "14.110"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funding:   \n\nFY 2013: Net increase of $39.858 million is due to sequestration reductions (-$5.866 million), congressional rescissions (-$0.098 million), congressional add for Dry Combat Submersible ($35.000 million) and congressional transfer from procurement for Shallow Water Combat Submersible ($14.000 million), a reprogramming to higher command priorities (-$2.500 million), and a transfer of funds to Small Business Innovative Research (-$0.678 million).\n\nSequestration Impacts: Delays development efforts for Next Generation Combatant Craft Forward Looking Infrared (CCFLIR), Next Generation Surface System studies, and increases weapons and communications integration risk onto surface programs. Reduces test support for undersea programs. \n\nFY 2014: Net increase of $10.209 million is due to congressional transfer from procurement for Shallow Water Combat Submersible ($10.000 million), a congressional transfer from procurement for Next Generation CCFLIR  ($1.156 million) and a transfer of funds to Small Business Innovation Research (SBIR) and Small Business Technology Transfer (STTR) of (-$.947 million).\n\nFY 2015:  Increase of $14.110 million supports the product development of Underwater Systems programs. \n\nSchedule:  Delays in Shallow Water Combat Submersible Block 1 design challenges by prime contractor resulted in a program schedule slip. \n\nTechnical:  None."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "S0417"
                    },
                    "ProjectTitle": {
                        "val": "Underwater Systems"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "136.135"
                        },
                        "PriorYear": {
                            "val": "66.263"
                        },
                        "CurrentYear": {
                            "val": "22.849"
                        },
                        "BudgetYearOne": {
                            "val": "45.823"
                        },
                        "BudgetYearOneBase": {
                            "val": "45.823"
                        },
                        "BudgetYearTwo": {
                            "val": "10.955"
                        },
                        "BudgetYearThree": {
                            "val": "8.261"
                        },
                        "BudgetYearFour": {
                            "val": "3.070"
                        },
                        "BudgetYearFive": {
                            "val": "4.947"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project provides for engineering and manufacturing development and operational systems development of small combat underwater submersibles and underwater support systems and equipment.  This project also provides for pre-acquisition activities (materiel solutions analysis, advanced component development and prototypes) to respond to emergent requirements.  These submersibles, systems, and equipment are used by Special Operations Forces (SOF) in the conduct of infiltration\/extraction, hydrographic\/inland reconnaissance, beach obstacle clearance, underwater ship attack, and other missions.  The capabilities of the submersible systems and unique equipment provides small, highly trained forces the ability to successfully engage the enemy and conduct clandestine operations associated with SOF maritime missions.  Sub-projects include:   \n\n•   Combat Submersibles:  Includes incorporating obsolescence solutions and conducting product improvement efforts for the in-service SEAL Delivery Vehicle MK 8 and conducting technology development and engineering and manufacturing development for the follow-on combat submersibles such as the various types of shallow water combat submersibles.  The Shallow Water Combat Submersibles (SWCS) use an evolutionary acquisition approach to develop a family of submersibles, to include a new wet submersible capable of operating from existing Dry Deck Shelters (DDS), and more capable wet and\/or dry submersibles that will operate from future large submarine shelters\/systems and\/or surface ships.  The combat submersible sub-project leverages existing SEAL Delivery Vehicle components, develops new state-of-the-art components where appropriate, and leases or purchases commercial components and vehicles for test and evaluation and operational assessment.  \n\n•   SWCS (Block 1):  This project provides for the engineering, manufacturing, and development of one Engineering Development Model (EDM) to replace the SEAL Delivery System, (SDV).  The EDM is being developed due to obsolescence of the SDV system.  This project will utilize mature technologies, which include electric propulsion along with upgraded navigation, communication, and sensor suites.  It also provides for integration efforts with the current DDS and other diving technologies to meet SOF requirements.  \n\n•   Dry Combat Submersible (DCS):  This project provides for the advanced engineering, manufacturing, and qualification efforts for a SOF DCS System.  Current efforts are using commercial dry submersible technology to assess submersible capabilities and reduce risk in a future DCS program.  The DCS is planned to operate from surface ships and potentially a future large submarine shelter.  User Operational Evaluations of two commercially built dry submersible prototypes are being manufactured and tested, as well as evaluation of a third leased vehicle.  Significant risk reduction initiatives were added in FY 2013 which will allow for validation of test processes and commercial classification processes, as well as test and integration concepts for improved power and energy sources and emergent technologies.  Technologies include, but are not limited to Safe Li-Ion batteries, Silver Zinc batteries, Improved Sonar Systems, advanced battery management system, and a three-dimensional Electro Optical Infrared (EO\/IR) Periscope. \n\n•   Dry Deck Shelter (DDS):  This project provides for an analysis of alternatives for Undersea Clandestine Insertion (UCI) of SOF forces for next generation system development and pre-planned product improvements, testing, and integration of specialized underwater systems to meet the unique requirements of SOF, and compatibility with the submarine fleet.  The current DDS is a certified diving system which attaches to modified host submarines that provides for insertion of SOF forces and platforms.  Future needs may include conducting product improvement efforts for the current DDS, as well as associated diver equipment for in-service submarine support systems, unmanned underwater vehicles, and diver equipment and follow on development effort for next generation system."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "SWCS (Block 1)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.703"
                                            },
                                            "Text": {
                                                "val": "Conducted Critical Design Review for the SWCS and completed program rebaseline."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.844"
                                            },
                                            "Text": {
                                                "val": "Complete design and manufacturing of Engineering Development Model (EDM)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.801"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.801"
                                            },
                                            "Text": {
                                                "val": "Engineering Development Model (EDM) continues into the system-level development testing program phases."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Dry Combat Submersibles (DCS)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "45.411"
                                            },
                                            "Text": {
                                                "val": "Completed Phase I, Concept Design, and contract award for Phase II, Design and Build of User Operational Evaluation System (UOES) 3. Continued design and build efforts for UOES2.  Initiated efforts to lease a commercial vehicle, the S301I for technical analysis and engineering evaluation to refine and validate SOF Embarkation Authority; commenced development of engineering and early operational assessment processes of test team and facilities; commenced development of UOES test strategy; commenced assessment of government furnished equipment maturity and SOF training and qualification for DCS. Procured power and energy technologies for risk reduction for DCS."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.005"
                                            },
                                            "Text": {
                                                "val": "Continue to design, construct, and test of commercial prototype submersibles. Initiate developmental test on UOES3."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "34.022"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "34.022"
                                            },
                                            "Text": {
                                                "val": "Commences developmental testing of UOES2 and Early Operational Assessment of UOES2 & 3.  Continues development of acquisition documentation for MS B\/C."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Dry Deck Shelter (DDS)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.149"
                                            },
                                            "Text": {
                                                "val": "Continued the UCI of SOF Analysis of Alternatives (AOA) for Large Volume Submarine Hosts and Submarine Large Ocean Interfaces to replace the DDS."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "PROC 1"
                                    },
                                    "Title": {
                                        "val": "Underwater Systems"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "5.936"
                                        },
                                        "CurrentYear": {
                                            "val": "15.439"
                                        },
                                        "BudgetYearOne": {
                                            "val": "25.459"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "25.459"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "67.124"
                                        },
                                        "BudgetYearThree": {
                                            "val": "21.083"
                                        },
                                        "BudgetYearFour": {
                                            "val": "51.419"
                                        },
                                        "BudgetYearFive": {
                                            "val": "50.948"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "•   SWCS (Block 1) used full and open competition, with a down select to a single contractor.  The full spectrum of contracting activities is being utilized for any integration and subsystem requirements, using existing contracts where appropriate, government agencies and new contracts as necessary.\n\n•   DCS used Broad Agency Announcements for Research and Development contracts leveraging commercial technologies, practices and standards to design, build, test and deliver developmental vessels to refine and validate potential key performance parameters and attributes for the DCS requirements baseline.  A combined MS B\/C for a production contract in FY 2016 is planned.  The full spectrum of contracting activities is being utilized for risk reduction efforts, using existing contracts where appropriate, government agencies and new contracts as necessary.\n\n•   DDS:  An AoA strategy will utilize a combination of in-house work, other government agency support, and \/or existing contracts."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Shallow Water Combat Submersible (Block 1)"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Engineering & Manufacturing Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2013"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Developmental Test"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2013"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Operational Test"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Milestone C"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Dry Combat Submersibles"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Analysis, Component Development and Prototypes"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2013"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Developmental Test"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Early Operational Assessment"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Milestone B\/C"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Dry Deck Shelter"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Undersea Clandestine Insertion of SOF Analysis of Alternatives"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2013"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "S1684"
                    },
                    "ProjectTitle": {
                        "val": "Surface Craft"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "MdapCode": {
                        "val": "ont"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "5.685"
                        },
                        "BudgetYearOne": {
                            "val": "12.082"
                        },
                        "BudgetYearOneBase": {
                            "val": "12.082"
                        },
                        "BudgetYearTwo": {
                            "val": "8.669"
                        },
                        "BudgetYearThree": {
                            "val": "4.953"
                        },
                        "BudgetYearFour": {
                            "val": "4.473"
                        },
                        "BudgetYearFive": {
                            "val": "2.393"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project provides for engineering and manufacturing development, and operational systems development of light, medium, and heavy surface combatant craft and selected items of specialized equipment to meet the unique requirements of Special Operations Forces (SOF).  This project also provides for pre-acquisition activities (materiel solutions analysis, advanced component development and prototypes) to quickly respond to new requirements for surface craft and equipment. The craft capabilities and unique equipment provide small, highly trained forces the ability to successfully engage the enemy and conduct clandestine operations associated with SOF maritime missions.  Sub-projects include: \n\nThe Combatant Craft Medium (CCM) replaces the current rigid inflatable boat (RIB) and the MKV (Retired in FY12). This craft will be a reconfigurable, multi-mission surface tactical mobility craft with a primary mission of insertion and extraction of SOF in a medium threat environment.  It will incorporate additional performance capabilities above current platform capabilities such as shock mitigation, low observability, improved maneuverability and SOF warfighting capabilities required to operate in future threat environments.  \n\nThe Combatant Craft Heavy (CCH) sub-project represents a family of solutions that will provide engineering support for design and specification of a development combatant craft for movement and maneuver of SOF personnel.  Requirements include maneuverability, reduced detectability with enhanced shock mitigation, and human systems integration. The current solution for Combatant Craft Heavy is the Sea, Air, and Land Insertion, Observation and Neutralization (SEALION) that was developed as an advanced technology demonstrator by the United States Navy and has been modified and tested for transition to SOF operations. The CCH will provide medium range insertion capability for SOF personnel in a low to high threat environment. Additional studies may be performed to support analysis of SOF-peculiar needs for an Afloat Forward Staging Base to command, control, sustain, launch and recover Joint SOF.\n\nThe Next Generation Combat Craft Forward Looking Infrared Radar (CCFLIR) Program provides SOF with day\/night, high resolution, and additional spectrum imaging capabilities to augment existing optical and radar sensors.  Technology insertion is needed to enhance the detection, recognition, identification, and tracking of small and near surface targets and ships.\n\nThe Next Generation Surface Systems (NGSRF) sub-project provides a rapid response capability to support SOF Combatant Craft Systems and subsystems.  The NGSRF will explore solutions to support emerging requirements in support of SOF exercises and training for future missions.  It provides technology refresh efforts to correct system deficiencies, improve asset life, and enhance mission capability through the means of feasibility studies, analyses of alternatives, pre-developmental risk reduction, and engineering analyses.  Demonstrations and modifications may be made to support emerging capability enhancements such as but not limited to, Maritime Craft Air Deliverable System BLOCK II, weapons mounts, sensors, enhanced communications and navigation subsystems, and other minor modifications to craft in support of future missions.  Solutions may be Commercial-Off-The-Shelf (COTS) solutions, other agency solutions or new solutions."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Combatant Craft Medium (CCM)"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.296"
                                            },
                                            "Text": {
                                                "val": "Integrate newest weapon and sensor technologies into the CCM craft."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.898"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.898"
                                            },
                                            "Text": {
                                                "val": "Completes Operational Testing and continues development and integration of sub-systems including weapons and situational awareness systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Combatant Craft Heavy (CCH)"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.750"
                                            },
                                            "Text": {
                                                "val": "Continue studies with craft design, development, and testing. Continue to test SEALION and perform modifications necessary to field an operational craft."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.215"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.215"
                                            },
                                            "Text": {
                                                "val": "Continues development and integration of advanced technologies including situational awareness, survivability, weapons, navigation, communication."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Next Generation Combatant Craft Forward Looking Infrared Radar (CCFLIR)"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.328"
                                            },
                                            "Text": {
                                                "val": "Complete market research and initiate plans to develop, test, and evaluate commercial-off-the-shelf (COTS) solution for Next Generation CCFLIR systems. Develop acquisition strategy and initiate program with plan to incrementally fund purchase of prototypes."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.799"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.799"
                                            },
                                            "Text": {
                                                "val": "Continues required documentation and completes purchase of up to three prototype units for development testing.  Conducts testing, plans and initiates integration with combatant craft systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Next Generation Surface System (NGSRF)"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.311"
                                            },
                                            "Text": {
                                                "val": "Initiate studies and advanced technology development, conduct risk reduction activities, and refine requirements and potential solutions for next generation of combatant craft systems and subsystems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.170"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.170"
                                            },
                                            "Text": {
                                                "val": "Identifies and evaluates candidate solutions for capability enhancements and insertion into Combatant Craft Systems. Prioritizes and plans, technology development efforts via Cooperative Research and Development Agreements, SBIR, and JCTD.  Conducts technology demonstration and development for the advancement\/enhancement of SOF Combatant Craft Systems, subsystems, and technologies such as, but not limited to: Maritime Craft Air Delivery System Block II, Weapons integration, survivability, signatures, and shock and vibration systems."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "PROC 1"
                                    },
                                    "Title": {
                                        "val": "Combatant Craft Systems"
                                    },
                                    "Funding": {
                                        "CurrentYear": {
                                            "val": "32.753"
                                        },
                                        "BudgetYearOne": {
                                            "val": "51.937"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "51.937"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "42.750"
                                        },
                                        "BudgetYearThree": {
                                            "val": "66.595"
                                        },
                                        "BudgetYearFour": {
                                            "val": "11.692"
                                        },
                                        "BudgetYearFive": {
                                            "val": "17.270"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "N\/A"
                        },
                        "AcquisitionStrategy": {
                            "val": "CCM acquisition strategy is a competition using a two-phase source selection process.  Phase I involved a Small Business Set-Aside competition for two vendors to design, build and deliver test articles.  Phase II will select a single vendor to provide a fully integrated baseline craft system for test and evaluation with options for production, engineering support and contractor logistic support.  Acquisition strategies for other craft may be based on the rapid acquisition of available non-developmental COTS\/Government-Off-The-Shelf craft.   \n\nCCH acquisition strategy is to transition the two advanced technology craft from Navy to SOF operations. SOF modifications are being performed and operational testing will be completed before fielding the SEALION craft in FY 2014. These efforts will be performed in-house with some support from other government agencies for engineering experts. Feasibility studies will continue in-house with support from other government agencies or existing contract services to pursue SOF-peculiar requirements for other CCH variants. \n\nSole source contract was awarded with original equipment manufacturer for developmental modification to SEALION. Developing long term sustainment strategy to and procure additional craft in future years. \n\nNext Generation CCFLIR acquisition strategy will conduct full and open competition for next generation systems to support the Combatant Craft Assault, CCM and CCH systems. \n\nNGSRF will provide for efforts of technology insertion and upgrades of craft systems, subsystems, and future craft acquisition planning.  This effort will consider all acquisition strategies available while applying Better Buying Power practices."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Combatant Craft Medium"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Developmental Test\/Operational Test"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2013"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Proposal, Source Selection & Final Down Select"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2013"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Low Rate Initial Production"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Operational Evaluation"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Initial Operational Capability"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Weapons Development, Survivability"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Combatant Craft Heavy"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Refurbish SEALION II"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2013"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2013"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Test and Evaluation"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2013"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Fielding & Deployment Release"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "C4I and Weapons Integration"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Next Generation FLIR"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Risk Reduction Activities"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Program Planning & Documentation"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Market Research"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Request for Proposal"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Development Down Select\/Test"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Production Award"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Next Generation Surface Systems"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Risk Reduction Activities"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Market Research"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Prioritize\/Plan NG Technologies"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Subsystem Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Integration"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2015"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Technology Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}