{
    "id": "ed2bbf11365033baff3c4b02db2ac89e7cc5b075",
    "meta": {
        "filename": "dod-2015_RDTE_2015_OSD_RDTE_JustificationBook_Office_of_Secretary_Of_Defense_PB_2015.zzz_unzipped_RDTE_JustificationBook_Office_of_Secretary_Of_Defense_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Office of Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602751D8Z"
        },
        "ProgramElementTitle": {
            "val": "Software Engineering Institute (SEI) Applied Research"
        },
        "R1LineNumber": {
            "val": "24"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Office of Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "11.106"
            },
            "BudgetYearOne": {
                "val": "9.156"
            },
            "BudgetYearOneBase": {
                "val": "9.156"
            },
            "BudgetYearTwo": {
                "val": "9.158"
            },
            "BudgetYearThree": {
                "val": "9.325"
            },
            "BudgetYearFour": {
                "val": "9.857"
            },
            "BudgetYearFive": {
                "val": "10.682"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "To ensure that the Department of Defense (DoD) retains a differential advantage over potential adversaries, the Department split funding for Defense-wide software research at the Software Engineering Institute (SEI) Federally Funded Research and Development Center (FFRDC) across two program elements (PEs): this new Budget Activity (BA) 2 PE 0602751D8Z and the continuing BA 3 PE 0603781D8Z.  The goals are to address both longer-term challenges in software technology and engineering (PE 0602751D8Z) and to continue to benefit from the proven experience the SEI FFRDC has with developing and transitioning advanced technology (PE 0603781D8Z)."
        },
        "ProgramElementMissionDescription": {
            "val": "Software is key to meeting the DoD’s increasing demand for high-quality, affordable, and timely national defense systems.  With growing global parity in software engineering, the DoD must maintain leadership to avoid strategic surprise.  To assist the DoD in retaining a long-term differential advantage over potential adversaries, the SEI Applied Research PE will develop and evaluate the feasibility and practicality of software and computer science concepts with the potential to improve future DoD systems. \n\nThis PE represents a pivot toward more fundamental research that will enable the DoD to address longer-term challenges in software technology and engineering.  The SEI Applied Research PE will fund the SEI Federally Funded Research and Development Center (FFRDC) as the leading DoD center for addressing these longer term challenges.  The SEI Applied Research PE will bolster the organic research at the SEI FFRDC, enable stronger collaborations between the SEI FFRDC and academia, attract top researchers to the SEI, give DoD access to top experts in information science, and generally enhance the DoD’s ability to benefit from the military applications of research in software and computer science."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "11.107"
                },
                "BudgetYearOne": {
                    "val": "11.330"
                },
                "BudgetYearOneBase": {
                    "val": "11.330"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "11.106"
                },
                "BudgetYearOne": {
                    "val": "9.156"
                },
                "BudgetYearOneBase": {
                    "val": "9.156"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "-0.001"
                },
                "BudgetYearOne": {
                    "val": "-2.174"
                },
                "BudgetYearOneBase": {
                    "val": "-2.174"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FFRDC Adjustments"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "-0.001"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Strategic Efficiency Savings"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-2.174"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.174"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The reduction is a strategic efficiency approach to reduce funding and staffing.  As a result, we provide a better alignment of funding and provide support to a smaller military force."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P278"
                    },
                    "ProjectTitle": {
                        "val": "Software Engineering Institute (SEI) Applied Research"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "11.106"
                        },
                        "BudgetYearOne": {
                            "val": "9.156"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.156"
                        },
                        "BudgetYearTwo": {
                            "val": "9.158"
                        },
                        "BudgetYearThree": {
                            "val": "9.325"
                        },
                        "BudgetYearFour": {
                            "val": "9.857"
                        },
                        "BudgetYearFive": {
                            "val": "10.682"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Software is key to meeting the Department of Defense’s (DoD’s) increasing demand for high-quality, affordable, and timely national defense systems.  With growing global parity in software engineering, the DoD must maintain leadership to avoid strategic surprise.  To assist the DoD in retaining a long-term differential advantage over potential adversaries, the Software Engineering Institute (SEI) Applied Research Program Element (PE) seeks to establish a program of applied research that will develop and evaluate the feasibility and practicality of software and computer science concepts with the potential to improve future DoD systems. \n\nThe SEI Applied Research PE will initially have four main research thrusts:  (1) measurement techniques for the effectiveness of software technologies and methods; (2) design principles and tools for evolvable, scalable ecosystems; (3) models of computational behaviors; and (4) cyber-tradecraft and analytics.  These thrusts have known military applications and can be associated with active areas of basic research.  The SEI Applied Research PE seeks to translate this promising basic research into solutions for broadly defined military needs.  This PE will leverage the expertise of the SEI Federally Funded Research and Development Center (FFRDC) in advanced technology development and technology transition to design, develop, and improve tools, prototypes, and new processes that meet general requirements for software-intensive DoD systems.\n\nThe SEI Applied Research PE will also conduct research in multicore computing, architecture-led iterative incremental development (Agile at scale); and emerging software and computer science areas that can act as catalysts for acquiring DoD systems with improved performance."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Software Engineering Institute Applied Research"
                                    },
                                    "Description": {
                                        "val": "Research projects at the SEI FFRDC will be awarded under this PE on a competitive basis across the SEI.  Funding levels in each thrust area may vary from year to year.  Research will address the goal of assisting the DoD to retain a long-term differential advantage over potential adversaries in the area of software-intensive systems.  The four main thrust areas are:\n\n1) Measurement techniques for the effectiveness of software technologies and methods.  Modern tools, integrated development environments, and software engineering processes have captured large data sets about development activities.  This thrust seeks to study the metrics that affect cost, schedule, quality, and performance based on real-world observation and experiment.  \n\n2) Design principles and tools for evolvable, scalable ecosystems.  The commercial world has many successful examples of software ecosystems, but the DoD has not capitalized on these to the same extent.  This thrust looks beyond implementing ecosystems in a DoD context and seeks to implement the underlying principles in a way that makes automated creation, evolution, and scaling of ecosystems easier.\n\n3) Models of Computational Behaviors.  System performance depends on end-to-end models of computational behavior that include the user, architecture, source and object code, firmware components, and processor hardware.  This thrust seeks to study emerging ideas that better model end-to-end computational behavior.  \n\n4) Cyber-tradecraft and analytics.  Cyberwarfare is an increasingly important and rapidly evolving dimension on the modern battlefield.  This thrust seeks to investigate methods that will give the DoD enduring advantages in the cyber battlespace such as reverse software engineering, automated code & malware analysis, code-level software resiliency (e.g., randomizing and time variant techniques), and other techniques such as those found in the Software Security Assurance State-of-the-Art Report.  \n\nThe SEI Applied Research PE will also conduct research in multicore computing, architecture-led iterative incremental development (Agile at scale); and emerging software and computer science areas that can act as catalysts for acquiring DoD systems with improved performance."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.106"
                                            },
                                            "Text": {
                                                "val": "• Make competitive awards within the SEI for novel research. \n• Begin research on measurement techniques for the effectiveness of software technologies and methods.  This effort creates an applied research component to complement the measurable analysis of value-driven incremental development started under the SEI PE (0603781D8Z).\n• Begin research on assurance-at-scale.  This effort creates an applied research component to complement work started under the SEI PE (0603781D8Z).\n• Begin research on quality-attribute analyses for high-confidence timing of multicore software systems with greater scalability.  This effort creates an applied research component to complement work started under the SEI PE (0603781D8Z).\n• Begin research on the design principles and tools for evolvable, scalable ecosystems.  \n• Advance research on measurement techniques for measuring the effectiveness of software technologies and methods.\n• Begin research on models of computational behaviors.  \n• Develop advanced analytics techniques for identified patterns, trends, and indicators in the software and systems vulnerability and exploitation ecosystem. Explore concepts in 'counter-analytics' for building more understanding bias and robustness of analytic techniques.\n• Develop specific insider threat mitigations that form an architectural foundation for next-generation DoD enterprise systems and technologies\n• Develop approaches and techniques to discover vulnerabilities automatically in compiled applications\n• Develop generalized techniques for vulnerability discovery in low-power, low-bandwidth networked systems\n• Develop malware analysis techniques aimed at improving scalability and enabling correlation with network analysis\n• Investigate the integration of architecture fault model framework with confidence maps for incremental qualification and certifications of safety-critical cyber-physical DoD systems.\n• Extend the architecture, algorithms, and prototypes that support rapid analysis of social networks; rapidly-deployable and scalable autonomous sensor networks; and the mobile component strategy to other scenarios and environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.156"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.156"
                                            },
                                            "Text": {
                                                "val": "• Improve software security throughout the entire DoD supply chain by improving the security of programming language standards.\n• Investigate and improve approaches to the detection and quantification of cyber threats to the DoD.\n• Research the capabilities of various operating systems to understand how to better integrate Insider Threat controls and monitoring such that it is transparent to users, and low maintenance for administrators.\n• Continue research on measurement techniques for the effectiveness of software technologies and methods.\n• Continue investigation of the integration of the architecture fault model framework with confidence maps for incremental qualification and certifications of safety-critical software-reliant DoD systems.\n• Develop quality-attribute analyses for distributed, autonomous cyber-physical systems to ensure correctness of timing, functionality, and distributed coordination of the computational and physically-related aspects of DoD systems.\n• Extend the architecture, algorithms, and prototypes that support rapid analysis of social networks to include voice, image and video data; rapidly-deployable and scalable autonomous sensor networks; and the mobile component strategy to other scenarios and environments.\n• Extend work in group-context-awareness to include additional sensors and more sophisticated context models in support of new scenarios and environments.\n• Extend work in cloudlets to create a federated cloudlet capability.\n• Continue early lifecycle cost estimation research for pre-Milestone A decisions.\n• Integrate architecture-level dependency metrics and rework analysis with architecture fault model framework to characterize technical debt in certification of safety-critical software-reliant DoD systems."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "BA 3, PE# 0603781D8Z"
                                    },
                                    "Title": {
                                        "val": "Software Engineering Institute (SEI)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "28.619"
                                        },
                                        "CurrentYear": {
                                            "val": "19.006"
                                        },
                                        "BudgetYearOne": {
                                            "val": "15.776"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "15.776"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "15.778"
                                        },
                                        "BudgetYearThree": {
                                            "val": "15.799"
                                        },
                                        "BudgetYearFour": {
                                            "val": "16.292"
                                        },
                                        "BudgetYearFive": {
                                            "val": "16.792"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "Together with PE 0603781D8Z, Software Engineering Institute (SEI), the SEI Applied Research PE represents a pivot toward more fundamental research that will enable the DoD to address longer-term challenges in software technology and engineering.  The SEI Applied Research PE will fund the SEI FFRDC as the leading DoD center for addressing these longer term challenges.  The SEI Applied Research PE will bolster the organic research at the SEI FFRDC, enable stronger collaborations between the SEI FFRDC and academia, attract top researchers to the SEI, and generally enhance the DoD’s ability to benefit from the military applications of research in software and computer science."
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "• Transition of tools, methods, and practices for use in DoD technology development programs and programs of record.  \n• Transition of tools, methods, and practices to the Defense Industrial Base to support DoD technology development programs and programs of record.\n• Number of citations in peer reviewed journals and reports.\n• Number of external research collaborations and interactions with the broader software and computer science community."
                        }
                    }
                }
            ]
        }
    }
}