{
    "id": "edae9fa05e404e237f7b28a2fc06b41fa2e07b38",
    "meta": {
        "filename": "dod-2015_RDTE_2015_ARMY_BA1_RDTE_JustificationBook_Army_PB_2015.zzz_unzipped_RDTE_JustificationBook_Army_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0601101A"
        },
        "ProgramElementTitle": {
            "val": "In-House Laboratory Independent Research"
        },
        "R1LineNumber": {
            "val": "1"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Basic Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "18.836"
            },
            "CurrentYear": {
                "val": "21.792"
            },
            "BudgetYearOne": {
                "val": "13.464"
            },
            "BudgetYearOneBase": {
                "val": "13.464"
            },
            "BudgetYearTwo": {
                "val": "13.762"
            },
            "BudgetYearThree": {
                "val": "13.953"
            },
            "BudgetYearFour": {
                "val": "14.187"
            },
            "BudgetYearFive": {
                "val": "14.459"
            }
        },
        "ProgramElementNote": {
            "val": "FY15 funding reduced to support higher Army priorities."
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) supports basic research at the Army laboratories through the In-House Laboratory Independent Research (ILIR) program.  Basic research lays the foundation for future developmental efforts by identifying fundamental principles governing various phenomena and appropriate pathways to exploit this knowledge.  The ILIR program serves as a catalyst for major technology breakthroughs by providing laboratory directors flexibility in implementing novel research ideas, by nurturing promising young scientists and engineers, and is used to attract and retain top doctoral degreed scientists and engineers.  The ILIR program also provides a source of competitive funds for peer reviewed efforts at Army laboratories to stimulate high quality, innovative research with significant opportunity for payoff to Army warfighting capability.  \n\nThis PE supports ILIR at the Army Materiel Command's (AMC) six Research, Development, and Engineering Centers (Project 91A); at the six U.S. Army Medical Research and Material Command Laboratories (Project 91C); the seven laboratories within the Corps Of Engineers' US Army Engineer Research and Development Centers (Project 91D); and at the Space and Missile Defense Command (SMDC) Technical Center (Project F16).\n\nWork in the PE provides a foundation for applied research initiatives at the Army laboratories and research, development and engineering centers.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n\nWork in this PE is performed by the AMC, Aberdeen Proving Grounds, MD,and the SMDC, Huntsville, AL."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "20.860"
                },
                "CurrentYear": {
                    "val": "21.803"
                },
                "BudgetYearOne": {
                    "val": "21.202"
                },
                "BudgetYearOneBase": {
                    "val": "21.202"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "18.836"
                },
                "CurrentYear": {
                    "val": "21.792"
                },
                "BudgetYearOne": {
                    "val": "13.464"
                },
                "BudgetYearOneBase": {
                    "val": "13.464"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.024"
                },
                "CurrentYear": {
                    "val": "-0.011"
                },
                "BudgetYearOne": {
                    "val": "-7.738"
                },
                "BudgetYearOneBase": {
                    "val": "-7.738"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.037"
                    },
                    "CurrentYear": {
                        "val": "-0.011"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.434"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-7.738"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-7.738"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments 1"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-1.553"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "91A"
                    },
                    "ProjectTitle": {
                        "val": "ILIR-AMC"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "13.086"
                        },
                        "CurrentYear": {
                            "val": "17.495"
                        },
                        "BudgetYearOne": {
                            "val": "12.616"
                        },
                        "BudgetYearOneBase": {
                            "val": "12.616"
                        },
                        "BudgetYearTwo": {
                            "val": "12.845"
                        },
                        "BudgetYearThree": {
                            "val": "13.023"
                        },
                        "BudgetYearFour": {
                            "val": "13.241"
                        },
                        "BudgetYearFive": {
                            "val": "13.495"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item"
                        },
                        "ProjectMissionDescription": {
                            "val": "This project funds basic research within the Army Materiel Command's (AMC) Research, Development, and Engineering Centers and lays the foundation for future developmental efforts by identifying the fundamental principles governing various phenomena and appropriate pathways to exploit this knowledge. \n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Edgewood Chemical and Biological Center, Aberdeen Proving Grounds, MD within AMC, the Armaments Research, Development, and Engineering Center, Picatinny, NJ, the Tank and Automotive Research, Development, and Engineering Center, Warren, MI, the Natick Soldier Research, Development, and Engineering Center, Natick, MA, the Aviation and Missile Research, Development, and Engineering Center, Huntsville, AL, and the Communications and Electronics Research, Development, and Engineering Center, Ft. Monmouth, NJ."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Edgewood Chemical Biological Center"
                                    },
                                    "Description": {
                                        "val": "Funds basic research in chemistry, biology, biotechnology, and aerosol for counter improvised explosive devices (IEDs), obscurants, and\/or target defeat.\n\nWork in this project provides theoretical underpinnings for PE 0602622A (Chemical, Smoke, and Equipment Defeating Technologies)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.847"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conducted fundamental research to develop an understanding of: rational molecular and nano-system design; synthetic biology; nano-scale chemical and biological sensing and signaling; molecular toxicology; interfacial phenomena of particulate matter (solid\/liquid) with chemical surfaces; synthesis of new materials for protection, decontamination, and detection; and the mathematics involved in data processing and interpretation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.968"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct fundamental research to develop an understanding of rational molecular and nano-system design, synthetic biology, nano-scale chemical and biological sensing and signaling, molecular toxicology, interfacial phenomena of particulate matter (solid\/liquid) with chemical surfaces, and synthesis of new materials for protection, decontamination, and detection, as well as research the mathematics involved in data processing and interpretation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.002"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.002"
                                            },
                                            "Text": {
                                                "val": "Will conduct fundamental research to develop an understanding of rational molecular and nano-system design, synthetic biology, nano-scale chemical and biological sensing and signaling, molecular toxicology, interfacial phenomena of particulate matter (solid\/liquid) with chemical surfaces, and synthesis of new materials for protection, decontamination, and detection, as well as research the mathematics involved in data processing and interpretation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Armaments Research, Development and Engineering Center"
                                    },
                                    "Description": {
                                        "val": "Funds basic research in weapons component development, explosives synthesis\/detection and area denial.\n\nWork in this project provides theoretical underpinnings for PE 0602307A (Advanced Weapons Technology)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.507"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued to solicit on a yearly basis new efforts to further basic research in areas such as advanced materials and nanotechnologies, more powerful energetics including those with insensitive munition (IM) properties, counter terrorism technologies, power and energy systems, smaller more lethal warheads and composite materials."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.707"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to solicit on a yearly basis new efforts to further basic research in areas such as advanced materials and nanotechnologies, more powerful energetics including those with insensitive munition (IM) properties, counter terrorism technologies, power and energy systems, smaller more lethal warheads and composite materials."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.702"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.702"
                                            },
                                            "Text": {
                                                "val": "Will continue to solicit on a yearly basis new efforts to further basic research in areas such as advanced materials and nanotechnologies, more powerful energetics including those with insensitive munition (IM) properties, counter terrorism technologies, power and energy systems, smaller more lethal warheads and composite materials."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tank-Automotive Research, Development and Engineering Center"
                                    },
                                    "Description": {
                                        "val": "Funds basic research in ground vehicle technologies to include power, mobility, and unmanned systems.\n\nWork in this project provides theoretical underpinnings for PE 0602601A (Combat Vehicle and Automotive Technology)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.171"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued to research models for nanofluid coolants and lubricants. Researched functionally graded structures exposed to shock, will investigate statistical theories and algorithms for reliability based design optimization.   Researched the combustion properties of JP-8, diesel and other fuels."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.220"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Research novel nanofluid coolants and lubricants; investigate statistical theories and algorithms for multi-disciplinary design optimization; research the combustion properties of new fuels; explore novel on-chip microwave nonreciprocal devices; research manned\/unmanned teaming and cooperative mobility behaviors; and study electromagnetic wave reflection from nano-structured non-reciprocal metamaterials for non-reflective, cloak-type coatings."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.502"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.502"
                                            },
                                            "Text": {
                                                "val": "Will investigate shock wave localization and propagation in layered media; will research the combustion properties of new fuels; will investigate discrete element modeling for granular terrain – vehicle interaction; will study on-wafer microwave nonreciprocal devices (isolators and circulators) based on artificial magnetic metamaterials and naturally anisotropic ferrite materials; will research manned\/unmanned teaming and cooperative mobility behaviors; will research incremental learning for autonomous systems; and will research optical limiter techniques and materials for laser protection."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Natick Soldier Research, Development and Engineering Center"
                                    },
                                    "Description": {
                                        "val": "Funds basic research in food sciences, textiles, and lightweight materials with potential for individual protection.\n\nWork in this project provides theoretical underpinnings for PE 0601102A (Defense Research Sciences), Project H52 (Equipment for the Soldier)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.287"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed novel biochemical functionalization strategies to tether bio-recognition elements and antibodies onto graphene;  investigated covalent and non-covalent methods for attachment of antibodies to native graphene; measured physical and transport properties and demonstrated a functionalized Graphene Field Effect Transistor (FET) for analyte detection to identify visual information derived from the movements of individuals in crowds that specifies threatening or suspicious behaviors;  validated experimental paradigms;  continued experiments to refine the use of immersive virtual reality technologies for use with Soldier-volunteers."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.341"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Explore the unique physics of photonic nanomaterials for revolutionizing the performance and size of systems such as infrared (IR) detectors, power generation and remote imaging; continue to explore the relationship between peptide structure on tailored structures for controlling and optimizing the destructive efficacy of antimicrobial peptides for multiple applications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.402"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.402"
                                            },
                                            "Text": {
                                                "val": "Will explore the unique physics of photonic nanomaterials for revolutionizing the performance and size of systems such as infrared (IR) detectors, power generation and remote imaging; continue to explore the relationship between peptide structure on tailored structures for controlling and optimizing the destructive efficacy of antimicrobial peptides for multiple applications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aviation and Missile Research, Development and Engineering Center: Missile Efforts"
                                    },
                                    "Description": {
                                        "val": "Funds basic research in guided missile and rocket systems, directed energy weapons, unmanned vehicles, and related components.\n\nWork in this project provides theoretical underpinnings for PE 0602303A (Missile Technology)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.832"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Experimentally explored infrared emissivity \/ absorptivity enhancement of polar materials by surface phonon coupling; analyzed nonlinear effects in nanostructure devices; experimentally investigated excitation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.273"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigate paucity of attractors phenomenon in dynamical systems; develop theory of harmonic generation and Raman scattering from surfaces in nano-cavity environments; study optical propagation phenomena in the plasmonic regime in semiconductor and metal-based nanostructures and metamaterials; explore remote sensing of trace gases in the atmosphere using infrared\/terahertz double resonance active interrogation; assess enhancement of infrared emissivity\/absorptivity of polar materials near optical phonon resonances by surface phonon coupling and metamaterial effects."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.803"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.803"
                                            },
                                            "Text": {
                                                "val": ": Will perform a pioneering demonstration of surface-enhanced analyte sensing and damage using plasmonic metal nanostructures; perform experimental test of analytic density matrix models in pump-probe spectroscopy; demonstrate chaotic dynamics in hybrid and non-smooth systems; pioneer innovative terahertz (THz) imaging techniques by combining state-of-the-art coherent imaging hardware and computational imaging methodologies; identify novel propagation phenomena that can dramatically modify\/enhance linear and nonlinear interactions with artificial, metal-based plasmonic materials and semiconductors; perform an experimental study of plasmonic nanostructures in the enhanced transmission regime for applications to beam steering."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aviation and Missile Research, Development and Engineering Center: Aviation Efforts"
                                    },
                                    "Description": {
                                        "val": "Funds basic research for aviation enabling technologies in the areas of aerodynamics, structural dynamics, and material science.\n\nWork in this project provides theoretical underpinnings for PE 0602211A (Aviation Technology)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.422"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed initial testing on trailed wake vorticity and spanwise loading; completed Particle Image Velocimetry (PIV) data analysis for dynamic stall test case; and completed project on high advance ratio theory including all reporting."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.647"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue basic aerodynamic science research in the areas of vorticity dynamics, compressible dynamic stall, bluff body flow separation and flow physics; and investigate advanced boundary layer flow control phenomenon including fluidic oscillators and plasma devices."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.602"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.602"
                                            },
                                            "Text": {
                                                "val": "Will continue basic fluid dynamic research in the areas of vorticity dynamics, unsteady flow separation, and flow control to identify fundamental governing principles; will complete analysis of wing\/vortex interaction; will conduct detailed measurements of boundary layer response to flow control; and will continue work to increase control authority of plasma devices."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Communications-Electronics Research, Development, and Engineering Center"
                                    },
                                    "Description": {
                                        "val": "Funds basic research for communication and network enabling technologies in the areas of antenna design, network management, power generation and storage, and also sensors.\n\nWork in this project provides theoretical underpinnings for PE 0602705A (Electronics and Electronic Devices)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.314"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Performed research in III-V component detector materials, advanced non-contact biometrics, nano engineered methods for explosive detection, and novel semiconductor growth processes and process monitoring; investigated novel electromagnetic polymer nanocomposites to gain a fundamental understanding of the underlying physics for potential antenna applications; continued investigations into alternative separator and electrolytes for high energy\/power electrochemical couples by concentrating on reducing the parasitic (non-electrochemical) reactions between synthesized separator and electrolyte and high energy electrode components and  initiated research into halogenated mixed metal oxides cathode material for advanced lithium electrochemical systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.509"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conduct research into signals exploitation techniques by investigating algorithms for intelligently and rapidly searching wide bands of radio frequency (RF) spectrum for short duration signals by mathematically representing the shape of a specific RF signals; Research new algorithms based on mathematical models and new routing schemes for scalable and secure mobile ad hoc network (MANET)-based Real-Time Peer-to-Peer (P2P) Voice-over-IP (VoIP)\/Multimedia Network;  Synthesize and evaluate high energy cathode materials for application to electrochemical capacitors for increased energy density and longer cycle life; Investigate the feasibility of real-time, in-vacuo band edge thermometry for heteroepitaxy of II-VI thin films on semiconductor substrates for advanced IR detectors.  Research the synthesis of dense Bismuth Selenide thin films, maximizing the material properties of conduction on the surface and insulating properties in the bulk, for use in RF front end electronics."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.603"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.603"
                                            },
                                            "Text": {
                                                "val": "Will conduct research on a novel class of quasi-orthogonal waveforms that will allow radar systems to perform their primary target detection mission while simultaneously allowing data sharing with other systems; Will investigate a new compressive sensing approach to adaptive target detection, which can potentially ease antenna integration requirements for future multi-band\/multi-aperture systems and improve the spatial resolution for target detection; Will investigate the fundamental distributed reformation reactions which affects species production, soot (coke) formation with more favorable reformed product gases; Will investigate the fundamental electrochemical properties of applied composite solid electrolyte interface for lithium electrochemical cells;  Will investigate how Compressive Sensing (CS) affects image quality and develop metrics and model for CS; Will investigate how carrier transport phenomenology in epitaxial multilayer structures contribute to the performance of infrared focal plane arrays (FPAs); Will investigate graph anomaly detection to identify network intrusions using traffic flow graph analysis and anomaly detection."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Peer Reviewed Proposal Efforts"
                                    },
                                    "Description": {
                                        "val": "Funds peer reviewed proposals in basic research to provide increased quality and responsiveness in exploring new technological concepts that are highly relevant to Army needs. This funding also enhances recruitment, development, and retention of outstanding scientists and engineers engaged in high quality basic research for the Army, which provides a constant flow of new knowledge to Army laboratories."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.706"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Solicited new basic research efforts aimed at developing and maintaining a cadre of active research scientists who can distill and extend results from worldwide research in areas of interest to the Army."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.830"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Will solicit new basic research proposals aimed at developing and maintaining a cadre of active research scientists who can distill and extend results from worldwide research in areas of interest to the Army."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "91C"
                    },
                    "ProjectTitle": {
                        "val": "ILIR-Med R&D Cmd"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.689"
                        },
                        "CurrentYear": {
                            "val": "2.885"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project fosters investigator-driven medical and force-health protection basic research initiatives performed at the six U.S. Army Medical Research and Materiel Command laboratories. Research areas address countermeasures against infectious diseases, defense against environmental extremes and operational hazards to health, mechanisms of combat trauma and innovative treatment and surgical procedures, and medical chemical\/biological warfare threats.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Walter Reed Army Institute of Research, Silver Spring, MD; U.S. Army Medical Research Institute of Chemical Defense, Aberdeen Proving Ground, MD; US Army Medical Research Institute of Infectious Diseases, Fort Detrick, MD; U.S. Army Institute of Environmental Medicine, Natick, MA; U.S. Army Institute of Surgical Research, Fort Sam Houston, TX; U.S. Aeromedical Research Laboratory, Fort Rucker, AL; and the Telemedicine and Advanced Technology Research Center, Fort Detrick, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Independent Research Efforts"
                                    },
                                    "Description": {
                                        "val": "Funds basic research in medical and force health protection."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.689"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The program funded innovative in-house basic research proposals that focused on research to explore treatments and countermeasures against militarily relevant infectious diseases; defense against environmental extremes and operational hazards to health; mechanisms of combat trauma and innovative treatment and surgical procedures; and medical chemical\/biological warfare threats. Examples of research efforts are as follows: Host and Wound Adaptations in Acinetobacter baumannii (a highly infectious bacteria) - this research enables novel methods to detect pathogens (germs) in the operating environment and predict their capacity to colonize or contaminate wounds in Soldiers and contaminate equipment to reduce infection with aggressive and drug resistant pathogens; explore the psychology of fear conditioning and learning to combat stimuli, to better understand psychopathology (causes of abnormal psychology) associated with combat experience; develop rodent models to study stress effects on brain cells, and use those models to identify nutritional measures conferring neuroprotection (brain protection) and resilience."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.885"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The program funds innovative in-house basic research proposals that will focus on research to explore treatments and countermeasures against militarily relevant infectious diseases; defense against environmental extremes and operational hazards to health; mechanisms of combat trauma and innovative treatment and surgical procedures; and medical chemical\/biological warfare threats."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "91D"
                    },
                    "ProjectTitle": {
                        "val": "ILIR-Corps Of Engr"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.413"
                        },
                        "CurrentYear": {
                            "val": "0.586"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item"
                        },
                        "ProjectMissionDescription": {
                            "val": "This project funds In-house Laboratory Independent Research (ILIR) in the areas of geospatial research and engineering, military engineering, and environmental quality\/installations at the seven laboratories within the Corps of Engineer's US Army Engineer Research and Development Center (ERDC).    \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the U.S. Army ERDC, Vicksburg, MS."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Geospatial Research and Engineering\/Military Engineering\/Environmental Quality and Installations"
                                    },
                                    "Description": {
                                        "val": "Funds basic research in the areas of geospatial research and military engineering as well as environmental quality and installations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.413"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Created a numerical physics-based model of dynamic geologic-material contact behavior with buried sensors; created a methodology to rapidly characterize the near-ground atmospheric and instantaneous sound field between sensor nodes for a large region; compared experimental ground-penetrating radar data with models of the Maxwell Wagner process to understand if Maxwell Wagner processes are responsible for the variety of dielectric constants that appear in any soil at any water content."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.586"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Quantify the fundamental coupling effects and transfer functions of fiber optic cable sensors inside of protective conduit within realistic and variable geologic media; determine parameters and build physics-based seismic propagation models for fiber, conduit, and geomaterial interaction."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "F16"
                    },
                    "ProjectTitle": {
                        "val": "ILIR-SMDC"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.648"
                        },
                        "CurrentYear": {
                            "val": "0.826"
                        },
                        "BudgetYearOne": {
                            "val": "0.848"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.848"
                        },
                        "BudgetYearTwo": {
                            "val": "0.917"
                        },
                        "BudgetYearThree": {
                            "val": "0.930"
                        },
                        "BudgetYearFour": {
                            "val": "0.946"
                        },
                        "BudgetYearFive": {
                            "val": "0.964"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project provides In-house Laboratory Independent Research (ILIR) at the US Army Space and Missile Defense Command\/Army Forces Strategic Command (USASMDC\/ARSTRAT), Technical Center.  This basic research on lasers and directed energy lays the foundation for future developmental efforts on high energy lasers and directed energy systems by identifying the fundamental principles governing various directed energy phenomena.  \n\nWork in this project is related to, and fully coordinated with, efforts in PE 0602307A (Advanced Weapons Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n\nWork is performed by the USASMDC\/ARSTRAT, Technical Center, Huntsville, AL"
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "SMDC In-house Laboratory Independent Research (ILIR)"
                                    },
                                    "Description": {
                                        "val": "Funds basic research to investigate laser propagation phenomenology for application in modeling and simulation and future directed energy weapons design. Activities in this program transition to High Energy Laser Technology in PE 0602307A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.648"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": ":  Continued to conduct laser beam propagation experiments and spectroscopic research to improve modeling and simulation capabilities and improve high energy laser systems design."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.826"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete laser beam propagation experiments and provide data for model anchoring.  Continue spectroscopic research and improve modeling and simulation capabilities and begin design for flowing rare earth laser."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.848"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.848"
                                            },
                                            "Text": {
                                                "val": "Will  demonstrate a diode pumped rare earth gas laser and begin assessing scalability and potential for very high efficiency operation; complete spectroscope research on Xenon as a potential rare earth gas laser for transition to advanced beam control efforts; complete 1.06 micron laser atmospheric propagation research for transition to solid state laser effects; and complete initial assessment of all-weather tracker phenomenology for transition to advanced beam control efforts."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}