{
    "id": "ee72c555ace67e56afbcc1e413bca1b5221421b3",
    "meta": {
        "filename": "dod-2015_RDTE_2015_ARMY_BA2_RDTE_JustificationBook_Army_PB_2015.zzz_unzipped_RDTE_JustificationBook_Army_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602782A"
        },
        "ProgramElementTitle": {
            "val": "Command, Control, Communications Technology"
        },
        "R1LineNumber": {
            "val": "23"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "26.200"
            },
            "CurrentYear": {
                "val": "34.191"
            },
            "BudgetYearOne": {
                "val": "33.817"
            },
            "BudgetYearOneBase": {
                "val": "33.817"
            },
            "BudgetYearTwo": {
                "val": "36.423"
            },
            "BudgetYearThree": {
                "val": "38.681"
            },
            "BudgetYearFour": {
                "val": "38.802"
            },
            "BudgetYearFive": {
                "val": "39.224"
            }
        },
        "ProgramElementNote": {
            "val": "FY 13 decreases attributed to sequestration (-2.251 million), Congressional general reductions (-63 thousand) and SBIR\/STTR transfers (-338 thousand)"
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) researches and investigates communications, command and control (C2), and electronics components, sub-components, software and protocols that provide the Army with enhanced capabilities for secure, mobile, networked communications, assured information delivery, and presentation of information that enables decision-making. Commercial technologies are continuously investigated and leveraged where possible. Project 779 researches and develops C2 software, algorithms, protocols and devices that enable management of information across the tactical and strategic battle space; provides automated cognitive reasoning and decision making aids; and allows timely distribution, presentation\/display and use of C2 data on Army platforms. Project H92 supports research in communications components, software, algorithms and protocols which potentially allow field commanders to communicate on-the-move to\/from virtually any location, through a seamless, secure, self-organizing, self-healing network.\n\nWork in this PE is complimentary of PE 0602705A (Electronics and Electronic Devices), PE 0603008A (Electronic Warfare Advanced Technology), and PE 0603772A (Advanced Tactical Computer Science and Sensor Technology), and is fully coordinated with PE 0602120A, (Sensors and Electronic Survivability), PE 0602783A (Computer and Software Technology), and PE 0602874A (Advanced Concepts and Simulation).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this PE is performed by the Army Research, Development, and Engineering Command (RDECOM), Communications -Electronics Research, Development, and Engineering Center (CERDEC), Aberdeen Proving Ground, MD."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "28.852"
                },
                "CurrentYear": {
                    "val": "34.209"
                },
                "BudgetYearOne": {
                    "val": "36.580"
                },
                "BudgetYearOneBase": {
                    "val": "36.580"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "26.200"
                },
                "CurrentYear": {
                    "val": "34.191"
                },
                "BudgetYearOne": {
                    "val": "33.817"
                },
                "BudgetYearOneBase": {
                    "val": "33.817"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.652"
                },
                "CurrentYear": {
                    "val": "-0.018"
                },
                "BudgetYearOne": {
                    "val": "-2.763"
                },
                "BudgetYearOneBase": {
                    "val": "-2.763"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.063"
                    },
                    "CurrentYear": {
                        "val": "-0.018"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.338"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-2.763"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.763"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments 1"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-2.251"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "779"
                    },
                    "ProjectTitle": {
                        "val": "Command, Control And Platform Electronics Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "11.900"
                        },
                        "CurrentYear": {
                            "val": "13.707"
                        },
                        "BudgetYearOne": {
                            "val": "14.685"
                        },
                        "BudgetYearOneBase": {
                            "val": "14.685"
                        },
                        "BudgetYearTwo": {
                            "val": "15.920"
                        },
                        "BudgetYearThree": {
                            "val": "17.197"
                        },
                        "BudgetYearFour": {
                            "val": "17.455"
                        },
                        "BudgetYearFive": {
                            "val": "17.586"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project researches components, software and algorithms that enable commanders at all echelons to have better and timelier information and allows them to execute mission command (MC) from potentially anywhere on the battlefield. Emphasis is on advancements to MC computing platforms with a specific emphasis on positioning, navigation, and timing (PNT), user\/computing platform interaction and cognitive burden reduction; informed operations\/data to decisions; MC warfighting function advancement and commander-centric capabilities.  This project researches technologies that support multi-modal man-machine interaction, battle space visualization, positioning and navigation in degraded environments (poor Global Positioning System (GPS) performance), automated cognitive decision aids, real-time collaborative tactical planning tools, data transfer, distributed data bases, open system architectures, and integration concepts which contribute to more efficient mobile operations.\n\nThis project supports Army science and technology efforts in the Command, Control, Communications and Intelligence Portfolio.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Army Research, Development, and Engineering Command (RDECOM), Communications\n- Electronics Research, Development, and Engineering Center (CERDEC), Aberdeen Proving Ground, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Battle Space Awareness and Positioning"
                                    },
                                    "Description": {
                                        "val": "This effort investigates positioning (pos), navigation (nav) and timing sensor\/integration technologies to provide position, velocity, and time information to support operational and training requirements, especially in hostile electro-magnetic interference and other radio frequency (RF) degraded\/denied environments. Work being accomplished under PE 0603772A\/project 101 compliments this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.143"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigated and identified sources of error impacting the performance of the integrated radio and sensor navigation brassboard demonstrator, coded advanced algorithms to perform navigation error mitigation in the demonstrator; investigated alternative\/emerging technologies for enhancing navigation in challenged environments such as exploiting signals of opportunity (SOO) from RF sources like broadcast television stations or natural phenomena such as lightning strikes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.757"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Research and investigate sensors based on emerging advances in micro-electromechanical systems (MEMS) and exploitation of SOOs to reduce dependence upon GPS as a sole navigation source; investigate advanced anti-jam antennas and pseudo-lite sources to protect and enhance weak GPS signals; examine modernized GPS signals for potential integration into Army systems; design, code and develop interfaces, protocols and software for handheld devices to access secure GPS through emerging modernized code (M-Code) capable GPS chips."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.794"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.794"
                                            },
                                            "Text": {
                                                "val": "Will investigate and analyze new sensor technologies for potential navigation and timing applications such as atomic sensors, multi-Global Navigation Satellite Systems, emerging SOOs, and MEMS focusing on improvements to individual sensors and methods for improved manufacturing techniques allowing the potential for smaller integrated navigation systems; examine vision based sensors and other aiding techniques such as human motion classification and network assisted navigation to enable navigation in the absence of GPS signals; investigate GPS augmentation systems to evaluate compatibility with new M-Code receiver chips and the ability to make GPS user equipment for ground vehicles and dismounted Soldiers less susceptible to interference sources."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Command and Control (C2) On-The-Move (OTM) Enabling Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort investigates, designs and codes software to improve the Warfighter's ability to access, use, present and understand relevant mission command information. Work on this effort transitions to PE 0603772A\/project 101."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.757"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Researched fundamental human centered design principles to reduce information overload in Army MC software; assessed the cognitive impact on Soldiers of software applications operating on different computing platforms (e.g. viewing maps on computers, tablets, and smart phones); investigated the application of computer learning techniques to capture human experience and apply it in similar but different situations to enable non-expert Soldiers to function at or near expert level; investigated the advantages of cloud technology (e.g. centralized management of distributed computing resources) in the disadvantaged, intermittent and low bandwidth tactical mission area; developed software algorithms to analyze audio speech, automatically identify the language and the intended domain or application (e.g. medical, checkpoint, intelligence), such that the algorithms have ability to select the appropriate translation engine to improve translation accuracy; investigated software applications that facilitate execution of C2 and distribution of intelligence information to Soldiers in small units using hand held devices; investigated architectures and techniques for storage and distribution of software applications for tactical handheld devices."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.950"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Investigate software and develop algorithms to increase unmanned platform autonomy and improve multi-platform autonomous collision avoidance; design and refine MC systems that learn and adapt based on the users' preferences and mission needs in order to reduce required training; investigate self-forming MC software solutions to reduce setup\/tear-down effort and provide some zero-time (initial startup) capability; architect automated troubleshooting tools to reduce MC field service representative support costs and improve system utility; improve upon advanced computing platform display technologies by researching methods of supporting additional points of touch for multiple simultaneous users, and wireless interface technology to connect to portable computing devices; architect and design a portable, tactical, distributed computing and storage solution to manage the distributed system and data to improve command post (CP) mobility and accessibility from vehicles and dismounts; develop and code a single common cross-platform software interface demonstrator that supports dismounted, mounted, and CP operations to reduce software design and support costs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.891"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.891"
                                            },
                                            "Text": {
                                                "val": "Will research and brassboard the required data, system architectures, and leader tools needed to provide continuously available MC capabilities from tactical through strategic echelons; investigate and design multi-echelon, unified MC software with a particular emphasis on enabling small unit commander-centric operations; design and code MC software that dynamically assesses the mission and the battle space to help maximize mission success by managing limited and distributed resources, including operational energy, bandwidth, and cognitive processing; design and code software tools that enable Soldiers to explore data, visualize relationships, and create and modify workflows to update and modify MC software applications without re-programming and revalidation; design MC software that analyzes unstructured and structured data from discourse, social media, and computer systems to provide alerts, suggest collaboration opportunities, and deliver expert level decision support to the commander; design and code software that measures individual and staff workload to facilitate more agile team operation and that applies distributed computing to solve a complex, multi-element problem within a small group of Soldiers without reach back to higher echelons."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H92"
                    },
                    "ProjectTitle": {
                        "val": "Communications Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "14.300"
                        },
                        "CurrentYear": {
                            "val": "20.484"
                        },
                        "BudgetYearOne": {
                            "val": "19.132"
                        },
                        "BudgetYearOneBase": {
                            "val": "19.132"
                        },
                        "BudgetYearTwo": {
                            "val": "20.503"
                        },
                        "BudgetYearThree": {
                            "val": "21.484"
                        },
                        "BudgetYearFour": {
                            "val": "21.347"
                        },
                        "BudgetYearFive": {
                            "val": "21.638"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project investigates and applies advanced communications and network devices, software, algorithms and services by leveraging and adapting commercial research and new communications and network sciences work by the Army Research Lab, Network Science Collaborative Technology Alliance or other Basic Research efforts. This project focuses development in wireless transport (e.g. mobile radio based communications systems) to develop new techniques for improving communications in high radio frequency (RF) interference environments and to increase the communications capacity of terrestrial and satellite communications (SATCOM) systems. This project also investigates enabling antenna components, materials, designs and configurations to reduce the visual signature of antennas on Soldier, vehicular and airborne platforms and reduce co-site interference on platforms with multiple transceivers such as radios and jammers. Additionally this project investigates cyber security devices, software and techniques to harden narrow band, wireless communications networks against cyber attacks; new mobile networking protocols to make wireless, on-the-move (OTM) communications networks more responsive to user needs. This project also investigates network operations software and techniques that improve the ability of the Soldier to manage and maintain complex, dynamic networks; and improved spectrum management software tools to make more efficient use of over-subscribed RF spectrum.\n\nThis project supports Army science and technology efforts in the Command, Control, Communications and Intelligence portfolio.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Army Research, Development, and Engineering Command (RDECOM), Communications-Electronics Research, Development, and Engineering Center (CERDEC), Aberdeen Proving Ground, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Antenna Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort investigates low cost, power efficient, conformal and directional antenna technologies for terrestrial, airborne, and tactical SATCOM ground terminals to enable them to operate OTM over multiple frequency bands, and further investigates armor embedded antenna and distributed array technologies. Together these efforts will improve ground forces electronic protection, increase signal power and range and provide greater connectivity for both mounted and dismounted forces. Work being accomplished under PE 0602270A\/project 906, PE 0603008A\/project TR1, and PE 0603270A\/project K15 compliments this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.719"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Designed wafer scale\/smart card antenna for low profile SATCOM OTM and unmanned aerial system antennas; adjusted embedded antenna designs to improve performance observed from ballistic assessments; investigated new metamaterials for broadband low profile antennas and nanotechnology for low visual signature armor and ballistic glass embedded transparent antennas; designed antenna modifications for interference mitigation to reduce RF communications and electronic warfare (EW) cosite interference between EW and blue force communication systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.689"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop optically non-intrusive antenna arrays for transparent Armor; investigate and advance smart switching for distributed antenna system arrays enabling higher output power, interoperability and improved link connectivity for terrestrial, SATCOM and EW communications; investigate and evolve antenna systems that provide capacity to support simultaneous EW jamming and communications without interference; establish standard interface for distributed terrestrial and SATCOM antenna systems to support interchange of communications modes on battlefield platforms."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.948"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.948"
                                            },
                                            "Text": {
                                                "val": "Will design and mature a smart switching system for distributed antenna arrays enabling higher output power, interoperability and improved link connectivity for SATCOM; investigate and mature antenna systems and arrays that provide improved communications performance and reliability through EW jammed environments; develop and finalize a government standard architecture to provide standard form-fit and electronic interfaces for distributed terrestrial and SATCOM antenna systems to support interchange of communications modes on battlefield platforms."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Wireless Information Assurance (IA)"
                                    },
                                    "Description": {
                                        "val": "This effort investigates, codes and fabricates software, algorithms and devices to protect wireless tactical networks against computer network attacks. Effort includes technologies that are proactive rather than reactive in countering attacks against tactical military networks. Work being accomplished under PE 0603008A\/project TR2 compliments this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.742"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Researched different types of frameworks upon which future cyber security can be developed to remove redundancies and conflicts between disparate software tools and techniques; designed and developed communications architecture that standardizes how cyber-security tools and applications should share information (e.g., messages, protocols, cryptography, concealing communications); investigated techniques, limitations and risks of protecting networks by using software methods that obscure the network details to prevent cyber attackers from mapping networks and traffic in preparation for an attack."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.437"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Design and code sophisticated software assurance algorithms to differentiate between stealthy life cycle attacks and software coding errors; design and assess secure coding methodologies that can detect and self correct against malicious code insertion; investigate theoretical control graph techniques for improvements in malware detection that can detect malware variants incorporating polymorphic and metamorphic transformation engines; research and design sophisticated, optimized cyber maneuver capabilities that incorporate the use of reasoning, intuition, and perception while determining the optimal scenario on when to maneuver, as well as the ability to map and manage the network to determine probable attack paths and the likelihood of exploit; investigate dynamically and efficiently altering tactical network services, ports, protocols and systems to inhibit red force ability to perform malicious network reconnaissance to determine location of critical networking services; research and assess data sharing and collaboration techniques between offensive and defensive operations to enable advanced warning and response actions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.302"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.302"
                                            },
                                            "Text": {
                                                "val": "Will evaluate and mature optimized cyber maneuver capabilities that incorporate the use of reasoning, intuition, and perception while determining the optimal scenario on when to change network configurations and settings to increase the difficulty for red forces to perform malicious network reconnaissance prior to attack; encode, evaluate and mature software to provide a feedback system to optimize the effectiveness of cyber maneuver and threat assessments; research algorithms and evaluate the effectiveness of dynamically maneuvering computer operating systems and applications to further restrict red force ability to perform malicious reconnaissance on tactical network components and hosts; mature and optimize data sharing and collaboration techniques between offensive and defensive operations and across security boundaries to enable advanced warning and response actions; research trans-disciplinary computer experimentation models that emulate attackers-defenders-users interactions and associated technological and human interrelationships; research a software based encryptor point solution that meets NSA formal requirements to eliminate the need for physical encryption devices on Army tactical communications systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cognitive Networking"
                                    },
                                    "Description": {
                                        "val": "This effort investigates, codes, fabricates and evaluates a set of advanced networking devices, software and algorithms to enable wireless networks to sense the dynamic and uncertain nature of mobile ad-hoc multi-tiered, multi-band network environments and spectrum conditions, and automatically adapt network topologies or traffic flows to increase overall performance while reducing the time and human effort required to operate the network. Work being accomplished under PE 0601104A\/project H50 and PE 0603008A\/project TR1 compliments this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.053"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Researched methods based upon game theory coupled with statistical estimation and machine learning to design new network control protocols and software that improves the ability of tactical wireless communications networks to change behavior, network topology and traffic flow based on changing RF environments and network congestion; designed and coded new software algorithms that increase the efficiency of current internet protocols."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.908"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Research software for self initiating and managing tactical wireless networks that supports spectrum efficiency in austere tactical environments; research ad-hoc routing, digital voice and disruption tolerant networking to deliver 2 way voice, data and position-location information to small units."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Dynamic Spectrum and Network Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and fabricates components and codes software for radios and network management systems to enable access to spectrum that is unavailable because of current inefficient spectrum management methods. This includes new management and visualization modalities as well as improved RF modulation techniques, devices and software. This effort also investigates RF signal processing, signal transmission and codes software to detect and overcome the interference of SATCOM due to jamming or atmospheric conditions such as scintillation. Work being accomplished under PE 0603008A\/project TR1 compliments this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.786"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Researched new software and algorithms to visualize\/present and alert Soldiers to the operational state of wireless networks at the Company, Battalion and Brigade levels; used distributed multi-agent software and algorithms to integrate situation awareness of networks (mission and cognitive) with real-time event correlation by timestamp\/location to provide Soldiers with correlated event alerts; investigated new SATCOM waveforms to increase communications capacity and improve anti-jam performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.450"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Research and develop software and hardware techniques allowing EW and communications systems to interoperate without mutual interference; research components, software and algorithms that support a waveform capable of simultaneous automated jamming and communication; investigate coordinated resource allocation, dynamic spectrum access (DSA) and interference cancellation algorithms to support interoperability between different wireless communication networks; investigate spectrum compatibility techniques to enable detection, identification, exploitation, location, disruption and neutralization of adversary RF systems in dense co-channel and multi-path interference environments, while allowing friendly communications and other RF systems to operate effectively in the same spectrum space."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.882"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.882"
                                            },
                                            "Text": {
                                                "val": "Will research network and physical layer models for tactical networking waveforms to enable the evaluation of the effectiveness of new signal processing and networking technologies to overcome RF interference such as red force jamming; design and code network reasoning software to enable the dynamic selection of signal processing and RF transmission techniques such as adaptive signal cancellation, coordinated scheduling of discontiguous signals, directional networking and multiple input multiple output networks to overcome adversarial RF jamming; develop a waveform architecture to define interfaces between the various RF, networking and signal processing hardware components; evaluate and develop signal analysis algorithms to detect RF interference of SATCOM signals; research and perform system analysis for protected SATCOM architectures to support modulation, coding and redundancy protection methods; research and analyze precision polarization concepts to support multiple communications paths and bandwidth expansion; perform modeling, simulation and emulation of networks to assess performance in contested environments; mature and evaluate performance of a signals management module for integration into the Soldier Radio Waveform to manage communications and blue force jamming RF emissions to prevent cosite interference while maintaining communications\/jamming performance."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}