{
    "id": "f0cc0c65cc7f9befd86c696391480672cc820ce8",
    "meta": {
        "filename": "dod-2015_RDTE_2015_NAVY_BA5_RDTE_JustificationBook_Navy_PB_2015.zzz_unzipped_RDTE_JustificationBook_Navy_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604755N"
        },
        "ProgramElementTitle": {
            "val": "Ship Self Def (Detect & Cntrl)"
        },
        "R1LineNumber": {
            "val": "129"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "721.472"
            },
            "PriorYear": {
                "val": "78.226"
            },
            "CurrentYear": {
                "val": "95.604"
            },
            "BudgetYearOne": {
                "val": "56.889"
            },
            "BudgetYearOneBase": {
                "val": "56.889"
            },
            "BudgetYearTwo": {
                "val": "116.837"
            },
            "BudgetYearThree": {
                "val": "120.762"
            },
            "BudgetYearFour": {
                "val": "127.440"
            },
            "BudgetYearFive": {
                "val": "81.200"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element consolidates currently ongoing and planned programmatic efforts related to Detect & Control aspects of Ship Self Defense (SSD) to facilitate effective planning and management of these efforts and to exploit the synergistic relationship inherent in each. Analysis and demonstration have established that surface SSD based on single-sensor detection point-to-point control architecture is inadequate against current and projected Anti-Ship Cruise Missile (ASCM) threats.  The supersonic seaskimming ASCM reduces the effective battle space to the horizon and the available reaction time-line to less than 30 seconds from first opportunity to detect until the ASCM impacts its target ship.  Against such a threat, multi-sensor integration is required for effective detection, and parallel processing is essential to reduce reaction time to acceptable levels and to provide vital coordination\/integration of hardkill and softkill assets. These SSD projects address and coordinate the detect and control functions necessary to meet the rigorous SSD requirements. \n\nQuick Reaction Combat Capability (QRCC, PU2178) \/ Ship Self Defense System (SSDS) Training Improvement Program (PU3358): Multi-sensor integration, parallel processing and the coordination of hard-kill \/ soft-kill capabilities in an automated, doctrine-based response to the ASCM threats are the cornerstones of SSDS being developed through QRCC (PU 2178) efforts. In addition, this project provides for the central system engineering management for the integration of advanced sensor, weapon and C4I upgrades and the test and certification of the Integrated Combat System (ICS).  The SSDS Training Improvement Program (PU 3358) is for the integration of Total Ship Training Capability (TSTC) improvements into the SSDS Advanced Capability Build (ACB) and Technology Insertion (TI) efforts under QRCC (PU 2178).\n\nThe Ship Self Defense System (SSDS) is the core combat system control element for the Quick Reaction Combat Capability (QRCC) in aircraft carriers and amphibious assault ships.  SSDS integrates a diverse set of fire control loop sensors and weapons, and C4I systems for each ship class (CVN68\/78, LHA6, LHD1, LPD17, and LSD41\/49).  SSDS MK2 provides the capabilities for integrated air and missile defense, multi-warfare situational awareness, combat direction, and joint interoperability via the Cooperative Engagement Capability (CEC) and Tactical Digital Information Link (TADIL)-J (Link 16).  SSDS MK2 is being fielded with the new construction carriers (CVN78 class) and amphibious ships (LHA6, LPD17 classes).  SSDS MK2 is replacing the Advanced Combat Direction System (ACDS) in the LHD1 class and SSDS MK1 in the LSD 41\/49 class as fleet modernization initiatives.\n\nSSDS MK2 integrates new combat system war-fighting capabilities and improvements on phased basis via ACB, TI, the Fire Control Loop Improvement Project (FCLIP), and Accelerated Mid-Term Interoperability Improvement Project (AMIIP).  New hardware TI baselines are required every four years to refresh the Commercial-Off-The-Shelf (COTS) assemblies to sustain system production and to support the incorporation of new ACB capabilities.  Each individual ship is planned for a TI upgrade on an eight year interval to replace obsolescent COTS hardware and support the fielding of the ACB capabilities.\n\nIntegrated Swimmer Defense (ISD, PU3306) scope is to provide the Navy Expeditionary security forces with capabilities of a portable marine integrated swimmer defense system (ISDS) to engage combat swimmers\/divers or unknown individuals underwater once they have been detected.\n\nNon-Lethal Weapons (PU 3172) provides a long range laser warning and dazzle systems for use in the maritime environment. Optical warning and distraction has been identified by the services as a possible technology solution to mitigate and\/or address several known joint non-lethal capability gaps."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "87.662"
                },
                "CurrentYear": {
                    "val": "130.360"
                },
                "BudgetYearOne": {
                    "val": "118.266"
                },
                "BudgetYearOneBase": {
                    "val": "118.266"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "78.226"
                },
                "CurrentYear": {
                    "val": "95.604"
                },
                "BudgetYearOne": {
                    "val": "56.889"
                },
                "BudgetYearOneBase": {
                    "val": "56.889"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-9.436"
                },
                "CurrentYear": {
                    "val": "-34.756"
                },
                "BudgetYearOne": {
                    "val": "-61.377"
                },
                "BudgetYearOneBase": {
                    "val": "-61.377"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.006"
                    }
                },
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-34.750"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.907"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-49.095"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-49.095"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.001"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-12.282"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-12.282"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-7.530"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2013 Reductions includes sequestration, SIBR\/STTR Transfer, and Miscellaneous rate adjustments.\n\nFY14 Changes includes Congressional Program Decreases for Project 2178 and 3172 and Miscellaneous rate adjustments.\n\nFY15 Changes includes Program Reduction for Project 2178, Department's decision to reduce contracted services, and miscellaneous rates adjustments.\n\nFor Project 2178, FY15 program changes includes reductions in Project 2178 for a 2-year delay in the SSDS MK 2 Advanced Capability Build (ACB)-16; ACB-16 was the designation for the next major SSDS baseline for the integration of new sensor, weapon and C4I capabilities for anti-ship missile defense and strike group interoperability.  With the delay, ACB-16 has been re-designated ACB-20.  The SSDS MK 2 ACB-12 capability baseline development, test and fielding will continue as planned.  However, with the delay in development and fielding of ACB-16, an increased number of SSDS MK 2 ships will receive ACB-12 capability baseline and specific fire control loop improvements, in lieu of ACB-16."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "2178"
                    },
                    "ProjectTitle": {
                        "val": "QRCC"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "698.591"
                        },
                        "PriorYear": {
                            "val": "72.425"
                        },
                        "CurrentYear": {
                            "val": "88.340"
                        },
                        "BudgetYearOne": {
                            "val": "50.530"
                        },
                        "BudgetYearOneBase": {
                            "val": "50.530"
                        },
                        "BudgetYearTwo": {
                            "val": "109.806"
                        },
                        "BudgetYearThree": {
                            "val": "114.206"
                        },
                        "BudgetYearFour": {
                            "val": "120.100"
                        },
                        "BudgetYearFive": {
                            "val": "76.014"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Ship Self Defense System (SSDS) is the core combat system control element for the Quick Reaction Combat Capability (QRCC) in aircraft carriers and amphibious assault ships.  SSDS integrates a diverse set of fire control loop sensors and weapons, and C4I systems for each ship class (CVN68\/78, LHA6, LHD1, LPD17, and LSD41\/49).  SSDS MK2 provides the capabilities for integrated air and missile defense, multi-warfare situational awareness, combat direction, and joint interoperability via the Cooperative Engagement Capability (CEC) and Tactical Digital Information Link (TADIL)-J (Link 16).  SSDS MK2 is being fielded with the new construction carriers (CVN78 class) and amphibious ships (LHA6, LPD17 classes).  SSDS MK2 is replacing the Advanced Combat Direction System (ACDS) in the LHD1 class and SSDS MK1 in the LSD 41\/49 class as fleet modernization initiatives.\n\nSSDS MK2 integrates new combat system war-fighting capabilities and improvements on phased basis via ACB, TI, the Fire Control Loop Improvement Project (FCLIP), and Accelerated Mid-Term Interoperability Improvement Project (AMIIP).  New hardware TI baselines are required every four years to refresh the Commercial-Off-The-Shelf (COTS) assemblies to sustain system production and to support the incorporation of new ACB capabilities.  Each individual ship is planned for a TI upgrade on an eight year interval to replace obsolescent COTS hardware and support the fielding of the ACB capabilities.\n\nThe QRCC project implements an evolutionary acquisition of improved ship self defense capabilities against Anti-Ship Cruise Missiles (ASCMs) for selected ships. The SSDS is the integrating element of QRCC. The design integrates several existing stand-alone Anti-Air Warfare (AAW) systems that do not individually provide the complete detection, control, and engagement capabilities needed against low flying, high speed ASCMs with low radar cross sections. The SSDS integration concept fulfills the need for an automated detection, quick reaction and multi-target engagement capability emphasizing performance in the littoral environment. SSDS replaces manual control of several self-defense systems with a single integrated capability under the computer-aided control of ship operators. System design emphasizes use of non-developmental items, commercial standards, commercial processors, computer program reuse and open system architecture. SSDS is a physically distributed, open system architecture computer network consisting of commercially available or previously developed hardware. It includes the Navy's standard displays (AN\/UYQ-70 and Common Display System) and command table for human-system interface, commercially based network and interface units, and commercially available fiber optic cabling.\n\nSSDS MK1 integrates the SPS-49A(V)1 radar, SPS-67(V)1 radar, AN\/SLQ-32A\/B electronic warfare system, Combat Identification Friend or Foe-Self Defense (CIFF-SD), Rolling Airframe Missile (RAM) and Phalanx Close-In Weapon System (CIWS) and is installed on LSD41\/49 class ships. SSDS MK1 successfully completed Operational Evaluation in June 1997. SSDS received Milestone III Approval for Full Rate Production (Mar 98) and authority to integrate with ACDS and Cooperative Engagement Capability (CEC) on CVN, LPD-17, LHD and LHA ship classes.\n\nSSDS MK2 facilitates the incremental evolution and implementation of follow-on modifications. Development of SSDS MK2 leveraged critical experiments and re-use of technology and software from SSDS MK1. SSDS MK2 integrates other ship self defense elements, such as AN\/SPQ-9B radar, NATO Sea-sparrow system, CEC and Tactical Data Links for joint interoperability. SSDS MK2 provides enhanced capabilities for Self Defense against air and surface threats using both ownship and remote data to address AAW Capstone requirements. SSDS MK2 becomes the integrated, coherent real time Command and Control System for Aircraft Carriers and Amphibious ships. It will increase operational capabilities; improve combat readiness and Strike Group\/Expeditionary Strike Group Interoperability; and promote standardization. It introduces new shipboard tactical displays and support equipment via Technology Insertion and warfighting capability improvements via Advanced Capability Builds (ACB). ACBs integrate advanced systems such as Dual Band Radar (DBR), Evolved Sea-Sparrow Missile (ESSM), RAM Block 2 missile, SLQ-32 SEWIP Block 2 and MH-60R Helicopter to implement the warfighting capability improvements and Total Ship Training Capability (TSTC) improvements.\n\nIn order to meet the Navy's warfighting capabilities and modernization concepts described in SEA POWER 21, Navy Open Architecture (OA) is being introduced in conjunction with SSDS Pre-Planned Product Improvement (P3I) Commercial off the Shelf (COTS) Tech Refresh. This is the first step in unifying a set of war fighting functions into a common architecture shared among many ship classes. This principle of commonality is a major mechanism for cost control and avoidances in the Navy's future war fighting systems. Starting in 2008, SSDS MK 2 was rehosted existing tactical computer program applications to the Open Architecture Computing Environment (OACE) specifications with equipment suites concurrent with P3I COTS Tech Insertion (TI) cycles, prior to migration and integration with other OA applications for implementation on future new construction ships or during future ship modernization. TI cycles and equipment technology refreshes are driven by COTS obsolescence. In FY09, system development was initiated for SSDS MK1 technology refresh for the LSD 41\/49 class ships. The effort will transition these ships to an SSDS MK OACE and SSDS MK 2 single source library. New system designation is SSDS MK2 Mod 5C.  The system development effort encompasses TI of new OA computing and display equipment (Common Processor System (CPS) and Common Display System (CDS)), modifications and additions to the SSDS MK 2 software for an upgraded interface with the Phalanx Closed-In-Weapon System (CIWS) Block 1B Baseline 2 and Battle Force Tactical Trainer (BFTT), and other unique LSD SSDS interfaces and functionality. The first LSD SSDS MK 2 Mod 5C is programmed for FY14 installation after land-based Combat System Integration and Certification Testing with IOC in FY15.  In FY10, SSDS MK 2 system development commenced for the first phase of migration to the Navy OA objective functional architecture designated as SSDS MK 2 ACB-12\/TI-12. ACB-12\/TI-12 encompasses: implementation of common product line software components for System Track Management; integration of the product line System Track Management components and associated data model with other SSDS software components and Combat System interfaces (e.g. CEC, DBR, ESSM and JUWL up-link, RAM Block 2 and CV-TSC); integration of new interfaces with SEWIP Block 2 ES,and MH-60R; integration of Common Processors System and Common Display System; and expansion of SSDS MK 2 Local Area Network (LAN) to OA Combat System LAN. ACB-12 is planned for IOC in the CVN 78, CVN 72 in FY16, and LHD 2 in FY17. In FY12, planning, analysis, and top level requirements definition was initiated for SSDS MK 2 ACB-20 (previously designated as ACB-16) and TI-16. ACB-20 warfighting improvement integration plan candidates include FCLIP, AMIIP-next, SEWIP Block 2 with automated radar designation decoy launch, SEWIP Block 3 with Electronic Attack, ESSM Block 2 missile, CIWS, interoperability with IFF Mode 5\/S and Joint Strike Fighter, integration of sensor \/ track data from multiple MH-60R Helicopters, Total Ship Training Capability (TSTC) updates and GCCS-M Data Exchange via CANES.  TI-16 will include common enterprise COTS Hardware \/ Software products for computing, storage, display, network switching, conversion, and information assurance devices to support system and equipment modernization driven by COTS obsolescence.  Funds were added in FY13 for the integration and test of SSDS MK2 Link16 interoperability improvements to address critical Strike Group interoperability issues under the AEGIS Wholeness Initiative, designated AMIIP. In FY13, software defect corrections were implemented as Phase 1 of the Fire Control Loop Improvement Project (FCLIP)to correct specific anti-ship missile defense defficiencies identified during live-fire testing.\n\nThe SSDS MK2 Development Test and Evaluation (DT&E) provides for comprehensive testing of SSDS MK2-based Combat System  hardware\/software upgrades for the CVN, LPD 17, LHD, LHA 6 and LSD ship classes. This includes Land Based testing at Wallops Island and At-Sea testing in the lead ships for specific ship class Combat System configuration and Live Fire testing in the Self Defense Test Ship. The DT&E encompasses test preparation, integration, engineering and development tests, data collection and analysis, and resolution and verification of deficiency corrections. The SSDS MK 2 T&E supports Integrated Combat System certification, the SSDS Test and Evaluation Master Plan (TEMP) and the Air Warfare Ship Self Defense CAPSTONE Enterprise TEMP.\n\nThe initial DT&E and Follow on Operational Test and Evaluation (FOT&E) for SSDS MK 2 was conducted with the CVN 76 SSDS MK 2 Mod 1 configuration in FY05. In FY07, the SSDS MK 2 FOT&E requirements were linked with the Air Warfare Ship Self Defense Enterprise T&E initiative to combine At-Sea Combat System element DT&E and OT&E requirements to synergize the resources required for testing in the SSDS MK 2 ships and the Self Defense Test Ship (SDTS). The LPD-17 class SSDS MK 2 Mod 2 FOT&E was conducted in FY07\/FY08 as part of the Enterprise T&E initiative. Live fire, Combat System end-to-end testing was conducted against Anti Ship Cruise Missile (ASCM) targets in the SDTS in FY07\/08\/09 in the CVN\/LHD\/LPD configurations.  FOT&E of ESSM integration with SSDS MK 2 was initiated in the CVN class in FY08 and will extend through FY14. FOT&E for the CVN class SSDS MK 2 Mod 1B P3I OACE COTS TI was conducted in FY09.  Future FOT&E includes the LHA 6 SSDS MK 2 Mod 4B configuration with the RAM Block 2 missile, ESSM, AMIIP and FCLIP; the LSD SSDS MK 2 Mod 5C configuration with the Phalanx CIWS 1B Baseline 2 system and RAM Block2; and CVN 78 SSDS MK 2 Mod 6C configuration with the DBR, SEWIP Block 2 ES, ESSM with JUWL up-link, and RAM Block 2."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "SSDS MK2 Development Test & Evaluation"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "21.261"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "For CVN\/LPD24\/LHA 6 SSDS MK2 Mod 1B\/2B\/4B Configurations with RAM Block 2 integration and Linux OACE:\n- Conduct Land Based system integration and engineering test at Wallops Island for LHA 6;\n- Conduct Live Fire At Sea Testing for LHA 6 in the SDTS - Enterprise Test 05 Phase 1.\n\nFor CVN\/LHD\/LPD SSDS MK2 MOD 1A\/2A\/3A configurations with AMIIP\/FCLIP phase 1:\n- Conduct Land Based system integration and engineering test at Wallops Island (WI) and Combat System Test (CST) at Integrated Combat System Test Facility (ICSTF), NSWC-Dahlgren for CVN70\/74\/77 for certification Objective Quality Evidence (OQE).\n\nFor LSD SSDS MK2 Mod 5C configuration with the Phalanx CIWS Block 1B Baseline 2, RAM Block 2 and CPS\/CDS equipment:\n- Complete Land Based system integration test and initiate engineering and Combat System Test (CST) at WI for LSD 50.\n\nFor CVN78 SSDS MK2 Mod 6C configuration with DBR, CEC, UPX-29, PL STM and OACE equipment:\n- Initiate Land Based system integration and engineering tests for CVN78 SSDS MK2 Engineering Software Releases for DBR Track capabilities at Wallops Island.  This includes integration with CEC, TPX-42, and PL STM."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "21.992"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "For CVN\/LPD24\/LHA6 SSDS MK2 Mod 1B\/2B\/4B Configurations with RAM Block 2 integration, Linux OACE, and AMIIP \/ FCLIP phase 1:\n- Conduct Land Based Development Test at WI and CST at ICSTF for CVN 68\/71\/75\/76 and LHA6 for certification.\n- Conduct Live Fire At Sea Testing for LHA 6 in SDTS - Enterprise Test 05 Phase 2.\n\nFor CVN\/LHD\/LPD SSDS MK2 MOD 1A\/2A\/3A configurations with AMIIP\/FCLIP phase 1:\n- Conduct Land Based system integration and engineering test at WI and CST at ICSTF for CVN 73, LHD 7\/8 and LPD 21\/22\/23 for certification OQE.\n\nFor LSD SSDS MK2 Mod 5C configuration with the Phalanx CIWS Block 1B Baseline 2, RAM Block 2 and CPS\/CDS equipment:\n- Complete Engineering Tests, Development Test \/ Operational Assessment, and CST at WI for LSD50.\n\nFor CVN78 SSDS MK2 Mod 6C configuration with DBR, CEC, TPX-42, PL STM, UPX-29, ESSM, MK29 launcher, RAM Block2, and TPX-42.\n- Conduct Land Based system integration and engineering tests for CVN78 SSDS MK2 Engineering Software Releases at Wallops Island for the fire control loop including CEC, UPX-29, ESSM, MK-29 launcher, and RAM Block 2.  This includes missile integration testing of ESSM X-Band JUWL uplink\/downlink with the SSDS MK2 MOD6C and DBR.  The testing will also include integration test with TPX-42, TADIL and Air Control."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.127"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.127"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "For CVN\/LPD24\/LHA6 SSDS MK2 Mod 1B\/2B\/4B Configurations with RAM Blk 2 integration, Linux OACE, and AMIIP\/FCLIP phase 1:\n- Conduct DT\/OT (IIIH Phase2 \/ ET06) and CSSQT on LHA6.\n\nFor LSD SSDS MK2 Mod 5C configuration with the Phalanx CIWS Block 1B Baseline 2, RAM Block 2 and CPS\/CDS equipment:\n- Conduct DT\/OT-III(I) Phase 2 \/ ET14 and Combat System Ship Qualification Trial (CSSQT) on LSD50.\n- Conduct Live Fire At Sea Testing for LSD MOD 5C in SDTS - Enterprise Test 12.\n\nFor CVN78 SSDS MK2 Mod 6C configuration with DBR, CEC, TPX-42, PL STM, UPX-29, ESSM, MK29 launcher, and RAM Block2.\n- Conduct Land Based system integration and engineering tests for CVN78 SSDS MK2 Engineering Software Releases at WI for the fire control loop including CEC, UPX-29, ESSM, MK-29 launcher, and RAM Block 2.  This will also include missile integration testing of ESSM X-Band JUWL uplink\/downlink with the SSDS MK2 MOD6C, and DBR Radar Equipment Simulator.  The testing will also include integration test with TPX-42, TADIL with AMIIP, and Air Control.\n- Conduct Combat System Assessment (CSA) Test at Wallops Island to deliver an integrated Combat System software package for CVN78 Combat System Light-off during construction."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SSDS MK2 Product Development-Advanced Capability Builds (ACB)\/Technology Insertion"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "51.164"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Perform SSDS MK 2 System Development including integration of government furnished hardware and software to provide Warfighting Capability Improvements via ACB, and OACE improvements and COTS obsolescence refresh via TI. Product development encompasses studies and analysis, modeling and simulation, system requirements engineering, critical experiments, hardware and software design, software code development, Engineering Development Model (EDM) units, hardware\/software integration, factory system integration testing, factory qualification testing, and system pre and post certification support during Combat System Integration Testing, Combat System Certification testing, DT&E (land-based and at-sea). \n\nFor LSD SSDS MK 2 Mod 5C Tech Insertion, conduct pre and post certification support for Land Based engineering tests, development tests, and Combat System certification test for Objective Quality Evidence (OQE).  This includes data analysis, resolution of software trouble reports and technical support.\n\nFor CVN 78 SSDS MK 2 Mod 6C, complete software code and unit test for phase 1 of software development for DBR track capability and DBR power and cooling system integration; and complete software IPRs for the design of phase 2 software for integration of ESSM with (Joint Universal Weapons Link (JUWL) up-link, RAM Block2, TADIL-J and Air Control.  \n\nFor SSDS MK2 AMIIP \/ FCLIP 1 for designated in-service carriers, complete software development and integration of SSDS MK2 Link 16 improvements.  Transition to Combat System interoperability and certification testing.\n\nFor ACB 20, initiate threat and capability analysis to support Capability Phasing Plan (CPP) and Concept Of Integration (COI) for mission essential Combat System capability improvements (FCLIP, AMIIP and C4I integration).\n\nFor TI-16, initiate engineering for Combat System\/SSDS MK2 equipment architecture and SSDS MK2 equipment system requirement documents\/specifications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "66.348"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Perform SSDS MK 2 System Development including integration of government furnished hardware and software to provide Warfighting Capability Improvements via ACB, and OACE improvements and COTS obsolescence refresh via TI. Product development encompasses studies and analysis, modeling and simulation, system requirements engineering, critical experiments, hardware and software design, software code development, EDM units, hardware\/software integration, factory system integration testing, factory qualification testing, and system pre and post certification support during Combat System Integration Testing, Combat System Certification testing, DT&E (land-based and at-sea). \n\nFor CVN 78 SSDS MK 2 Mod 6C, complete SSDS MK2 software design, code, test, and integration for the software for the CVN78 Combat System Light-off baseline.  (The SSDS software development for integration of SEWIP Block2 and CV-TSC are in the FY16 plans for post construction delivery to CVN78.)  Initiate Functional System Integration Test(FSIT) 1 and support for Land Based integration and engineering tests.  Initiate development of operator and maintenance training courses for SSDS MK 2 Mod 6C ACB-12\/TI-12. \n\nFor LHD2 SSDS MK2 MOD 3C ACB-12\/TI-12, initiate system engineering to define system architecture, generate requirements documents\/specifications, for modification of the CVN ACB-12\/TI-12 software for the LHD 2 CAPSTONE modernization.\n\nFor SSDS MK2 AMIIP \/ FCLIP 1 for designated in-service carriers, provide software support for Combat System interoperability and certification testing and shipboard integration and testing. \n\nFor SSDS MK2 ACB20, continue engineering analysis, formulate top level requirements and initiate Integrated Combat System CDD for the mission essential Combat System Capability improvements (FCLIP, AMIIP and C4I integration).\n\nFor SSDS MK2 TI-16, initiate full scale development of specific TI-16 equipment.  Conduct IPR, System Requirement Review (SRR) and System Functional Review (SFR) for SSDS MK2 TI-16 physical architecture.  Initiate equipment design and conduct Preliminary Design Review (PDR)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "33.403"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "33.403"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Perform SSDS MK 2 System Development including integration of government furnished hardware and software to provide Warfighting Capability Improvements via ACB, and OACE improvements and COTS obsolescence refresh via TI. Product development encompasses studies and analysis, modeling and simulation, system requirements engineering, critical experiments, hardware and software design, software code development, EDM units, hardware\/software integration, factory system integration testing, factory qualification testing, and system pre and post certification support during Combat System Integration Testing, Combat System Certification testing, DT&E (land-based and at-sea). \n\nFor CVN 78 SSDS MK 2 Mod 6C, complete SSDS MK2 software design, code, test, and integration for the CVN78 PSA\/CSSQT baseline including AMIIP.  Complete FSIT 2 and Factory Qualification Test(FQT) 1 and provide support for Land Based integration and engineering tests.  Continue development of operator and maintenance training courses for SSDS MK 2 Mod 6C ACB-12\/TI-12.  \n\nFor LHD 2 SSDS MK2 MOD 3C ACB12 \/ TI12, complete the SSDS MK2 software modifications and integration for the LHD 2 CAPSTONE modernization. \n\nFor SSDS MK2 ACB-20, complete Capability Phasing Plan and Concept of Integration for the mission essential Combat System Capability improvements (FCLIP, AMIIP and C4I integration)."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPN\/5239"
                                    },
                                    "Title": {
                                        "val": "SSDS"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "52.875"
                                        },
                                        "CurrentYear": {
                                            "val": "51.858"
                                        },
                                        "BudgetYearOne": {
                                            "val": "30.763"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "30.763"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "63.732"
                                        },
                                        "BudgetYearThree": {
                                            "val": "60.187"
                                        },
                                        "BudgetYearFour": {
                                            "val": "60.184"
                                        },
                                        "BudgetYearFive": {
                                            "val": "61.351"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTEN\/0603382N"
                                    },
                                    "Title": {
                                        "val": "Advanced Combat System Technology"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "1.345"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTEN\/0603658N"
                                    },
                                    "Title": {
                                        "val": "Cooperative Engagement"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "50.058"
                                        },
                                        "CurrentYear": {
                                            "val": "52.572"
                                        },
                                        "BudgetYearOne": {
                                            "val": "43.578"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "43.578"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "73.429"
                                        },
                                        "BudgetYearThree": {
                                            "val": "63.082"
                                        },
                                        "BudgetYearFour": {
                                            "val": "75.334"
                                        },
                                        "BudgetYearFive": {
                                            "val": "76.764"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTEN\/0603582N"
                                    },
                                    "Title": {
                                        "val": "Combat System Integration"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "33.208"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "11.528"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "11.528"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "24.147"
                                        },
                                        "BudgetYearThree": {
                                            "val": "23.033"
                                        },
                                        "BudgetYearFour": {
                                            "val": "21.377"
                                        },
                                        "BudgetYearFive": {
                                            "val": "21.825"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTEN\/0604307N"
                                    },
                                    "Title": {
                                        "val": "Surface Combatant Cmbt Sys Eng"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "232.441"
                                        },
                                        "CurrentYear": {
                                            "val": "202.528"
                                        },
                                        "BudgetYearOne": {
                                            "val": "180.118"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "180.118"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "274.021"
                                        },
                                        "BudgetYearThree": {
                                            "val": "178.667"
                                        },
                                        "BudgetYearFour": {
                                            "val": "184.402"
                                        },
                                        "BudgetYearFive": {
                                            "val": "234.750"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The first SSDS MK 2 system procurements took place under a Cost Plus Award Fee (CPAF) contract in FY99 for the CVN 76, LPD 17, LPD 18 and CVN 69. Follow-on equipment procurements for additional ships of the CVN, LPD and LHD classes were awarded on Firm Fixed Price (FFP) contracts. For those ships that will be receive P3I OACE COTS tech Refresh hardware suites, the initial system Tech Refresh Development occurred under a CPAF type contract, with ship COTS conversion equipment\/kits procured on FFP contracts.  \n\nA system engineering\/design agent and Life Cycle Maintenance Cost Plus Fixed Fee (CPFF) contract was awarded in FY05 and a follow-on CPFF\/CPAF contract, N00024-08-C-5122, was awarded on 30 Sept 2008, to support SSDS MK 2 system\/software maintenance and system upgrades through FY13 including the P3I COTS Tech Insertion. \n\n\nA follow on CPIF LOE contract, N00024-14-C-5128, was awarded 18 December, 2013 on a sole source basis for FY14-FY17 for the completion of the development, test, certification of SSDS MK2 (ACB12\/TI12) for CVN78, CVN72, and the software migration of ACB12 to TI16 for Amphibious Assault Ships (LHD\/LPD). For SSDS MK2 TI-16, the SSDS project will leverage common enterprise COTS Open Architecture Computing Environment (OACE) products for computing, storage, display, network, conversion, and information assurance.  A competitive Combat System Engineering Agent (CSEA) \/ SSDS MK2 Design Agent (DA) contract is planned for FY2018-FY2022."
                        },
                        "PerformanceMetrics": {
                            "val": "Requirement Documents\n - Capability Development Document (CDD) for Ship Self Defense System (SSDS) MK2 approved 19 December 2013.\n - Test and Evaluation Master Plan (TEMP No. 1400) For Ship Self Defense System (SSDS) Revision B, 5 Mar 2008.\n\nBackground\n - SSDS MK1 OPEVAL was successfully completed June 1997 with a Milestone III approval in March 1998\n - SSDS MK2 MOD 1 FOT&E was conducted on CVN 76 in 2005.  All KPP thresholds were met.  However, the system \n   was assessed as not suitable and not effective by COMOPTEVFOR based on the identification of SSDS MK2 and \n   Combat Systems deficiencies (24major, 37 minor deficiencies).\n - SSDS MK 2 Mod 2 FOT&E was conducted in LPD 17-19 in 2007\/2008. All KPPs thresholds were met and the system was\n   assessed OPERATIONALLY EFFECTIVE and OPERATIONALLY SUITABLE by COMOPTEVFOR in the 12 Feb 2010 report. 10 major and \n   minor deficiencies were identified against SSDS MK 2. (Also, major Warfare effects deficiencies were \n   identified against the LPD 17 class Combat System).\n - SSDS MK 2 Mod 3A FOT&E was conducted in LHD 8 in Feb 2010. All KPPs thresholds were met and the system was\n   assessed OPERATIONALLY EFFECTIVE and OPERATIONALLY SUITABLE by COMOPTEVFOR in the 13 Dec 2010 report. 10 \n   major deficiencies were identified against SSDS MK 2. (Also, major Warfare effects deficiencies were \n   identified against the LHD 8 Combat System).\n - SSDS MK2 FOT&E with ESSM and RAM Block 1 was conducted in the SDTS Oct-Dec 2011 as part of Enterprise Test - 03.  Combat System (system-of-system) deficiencies identified during MSLEX with stressing targets has resulted in a phased corrective action plan, designated as Fire Control Loop Improvement Project (FCLIP).\n\nStatus\n - The Director, Operational Test and Evaluation (DOT&E) FY 2012 Annual Report identified ship self-defense mission \n   deficiencies based on operational testing.  The report is a compilation of multiple reports from Commander, \n   Operational Test Force (COTF) including shipboard testing on the CVN 76, CVN 70, LPD 17, LPD 18, LPD 19, LHD 8; \n   and enterprise testing on the SDTS and in the Probability of Raid Annihilation (PRA) \n   test-bed. \n - SSDS was assessed Operationally Effective and Operationally Suitable for the LPD 17 Class and LHD 8.  The \n   Combat Systems (CVN, LPD, LHD) were assessed Not Operationally Effective against several Anti-Ship Cruise \n   Missiles (ASCM).  There are system of systems performance issues and design limitations.  The issues are \n   divided into four categories: detect, engage, test resources, and threat representation. \n - All of the major training deficiencies have been addressed and are pending Verification of Correction of \n   Deficiency (VCD) by COTF.  Revised SSDS NTSP was signed 30 Jul 2012.\n\n - OPNAV N96 is working with PEO IWS, DASN, and COTF to address the shortfalls in performance testing with the \n   following initiatives:\n     a. Continue to test and field combat system improvements through the Fire Control Loop Improvement Project (FCLIP) with SSDS MK2 integration of:  High Diver improvements to SPS-48E and CEC; RAM Blk 2; SPQ-9B tracking improvements; SEWIP Blk 2 integration; Evolved Sea Sparrow Missile (ESSM) and North Atlantic Treaty Organization (NATO) Seasparrow Surface Missile System (NSSMS) MK 9 Target Illuminator improvements; and  NULKA improvements. \n     b. Expand the use of Modeling and Simulation. Exploit the PRA test-bed model for system engineering and predictive analysis. \n     c. Consider high return self-defense improvements through the POM process with FCLIP and Advanced Capability Builds (ACB).\n - Corrective actions will be validated by follow-on testing during the FY14 to FY17 time period: CVN 68 class \/ LHA 6 SDTS events; verification of Correction of Deficiencies (VCD); new targets & threat representations; and expansion of PRA  test-bed to the CVN 78 and LHA 6 ship classes."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0604755N_2178_FILE1.JPG"
                                }
                            }
                        ]
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3172"
                    },
                    "ProjectTitle": {
                        "val": "Joint Non-Lethal Weapons"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "21.256"
                        },
                        "PriorYear": {
                            "val": "5.058"
                        },
                        "CurrentYear": {
                            "val": "5.170"
                        },
                        "BudgetYearOne": {
                            "val": "4.213"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.213"
                        },
                        "BudgetYearTwo": {
                            "val": "4.851"
                        },
                        "BudgetYearThree": {
                            "val": "4.377"
                        },
                        "BudgetYearFour": {
                            "val": "5.195"
                        },
                        "BudgetYearFive": {
                            "val": "3.006"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Develop non-lethal weapon systems in support of anti-terrorism\/force protection missions.  Example technologies include, but are not limited to, ocular interrupters, ship entanglement systems, and hailing devices.  Current efforts are focused on the Long-Range Ocular Interrupter (LROI), which is intended to provide the U.S. Navy with the capability to deliver a bright light producing a dazzling or glare effect on a closing target to warn and\/or suppress potential threats through increasing levels of visual degradation. The planned LROI will generate controlled, high-intensity output, providing warning and suppression effects.  The extended range capability of LROI will effectively increase tactical decision-making time in support of escalation of force (EoF) tactics, techniques and procedures (TTP) across a broad range of military operations (ROMO).  Further, the LROI will enhance Joint Force operations in assessing the intent of personnel and controlling the potential threat as early as possible."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Non-Lethal Weapons Development"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.658"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Updated the LROI Program Life Cycle Cost Estimate (PLCCE) to account for development of 290 systems. Initiated development of LROI as a Rapid Deployment Capability (RDC) and developed the RDC Acquisition Strategy. Completed LROI System Requirements Review (SRR) and System Functional Review (SFR)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.170"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Support engineering design and development for LROI RDC. Perform Preliminary Hazard Assessment and Safety Hazard Analysis. The increase in FY 2014 funding is driven by the higher-cost engineering and design activities such as refining concept designs, procuring\/manufacturing hardware, manufacturing prototypes, conducting engineering assessments of prototypes, fabricating production representative models (PRMs), and conducting performance evaluations of PRMs.  Concurrently, we will be developing LROI program of record transition strategy and documentation in accordance with Department of Defense statutory and regulatory requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.813"
                                            },
                                            "Articles": {
                                                "val": "8"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.813"
                                            },
                                            "Articles": {
                                                "val": "8"
                                            },
                                            "Text": {
                                                "val": "Complete LROI RDC system design and development, conduct environmental testing, and deploy initial 8 systems to Navy Expeditionary Combat Command (NECC). Develop all statutory and regulatory documentation required to support the milestone decision.  Conduct Laser Safety Review Board, develop training manuals, and Operations & Maintenance Guide.  Continue program of record documentation development and complete the program of record transition strategy."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Non-Lethal Weapons Testing"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.400"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed LROI RDC Test Plans. Procured long-lead test article components."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Perform engineering assessment and testing of LROI subassemblies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.400"
                                            },
                                            "Articles": {
                                                "val": "4"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.400"
                                            },
                                            "Articles": {
                                                "val": "4"
                                            },
                                            "Text": {
                                                "val": "Perform Quick Reaction Assessment (QRA) testing on LROI test assets.  Perform developmental testing in an operational setting and conduct environmental testing on LROI test assets."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPN\/8128"
                                    },
                                    "Title": {
                                        "val": "NCW Forces Active"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.350"
                                        },
                                        "CurrentYear": {
                                            "val": "0.518"
                                        },
                                        "BudgetYearOne": {
                                            "val": "1.236"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1.236"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.440"
                                        },
                                        "BudgetYearThree": {
                                            "val": "5.940"
                                        },
                                        "BudgetYearFour": {
                                            "val": "6.418"
                                        },
                                        "BudgetYearFive": {
                                            "val": "8.061"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The initial LROI systems are being designed, developed and deployed as an RDC.  The Naval Surface Warfare Center Dahlgren Division (NSWC DD) is designing and developing the LROI RDC systems. A Technical Data Package (TDP) will be developed in conjunction with the RDC which will be included in the Request for Proposal (RFP) to industry. The RFP including the TDP will be provided to industry to solicit offers for the production of 290 LROI systems."
                        },
                        "PerformanceMetrics": {
                            "val": "Complete engineering manufacturing design and technical data package. Develop Joint Capabilities Integration and Development System (JCIDS)-based requirements document including key system attributes and key performance parameters."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3306"
                    },
                    "ProjectTitle": {
                        "val": "Integrated Swimmer Defense (ISD)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "1.625"
                        },
                        "PriorYear": {
                            "val": "0.743"
                        },
                        "CurrentYear": {
                            "val": "1.013"
                        },
                        "BudgetYearOne": {
                            "val": "1.026"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.026"
                        },
                        "BudgetYearTwo": {
                            "val": "1.044"
                        },
                        "BudgetYearThree": {
                            "val": "1.086"
                        },
                        "BudgetYearFour": {
                            "val": "1.082"
                        },
                        "BudgetYearFive": {
                            "val": "1.106"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The scope of this project is to provide the fleet Expeditionary (specifically the Maritime Expeditionary Security Force) units with the capability of a portable maritime Integrated Swimmer Defense (ISD) system to engage combat swimmers\/divers or unknown individuals underwater once they have been detected. The ISD program combines the detection and engagement operations in order to complete the swimmer defense picture for the fleet. The objective of the integrated swimmer defense system (ISD) is the development and deployment of an integrated system capable of being deployed by the expeditionary harbor security units (primarily the Maritime Expeditionary Security Force). ISD will be designed to detect, track, classify, warn, deter and neutralize divers' and swimmers' threats. ISD is important to protecting high value assets within harbors from the increasing threat of waterborne terrorist or combatant attacks."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Integrated Swimmer Defense"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.743"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed project documentation.  Finalized P-SPEC."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.013"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Gain CPD approval and release\/award Test Article contract."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.026"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.026"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Receive Test Articles and begin integrated Test & Evaluation.  Gain TEMP approval."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPN\/8128"
                                    },
                                    "Title": {
                                        "val": "ISD"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "1.587"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.461"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.461"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.025"
                                        },
                                        "BudgetYearThree": {
                                            "val": "2.895"
                                        },
                                        "BudgetYearFour": {
                                            "val": "2.818"
                                        },
                                        "BudgetYearFive": {
                                            "val": "3.722"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The acquisition strategy includes the integration of swimmer\/diver detection sensors and using software to fuse the sensor track data thereby creating an end to end combat system capability for swimmer\/diver defense.  The ISD program of record system configuration will be produced through an Acquisition Category (ACAT) program to procure component systems needed to bring the performance of the UOES prototypes up to the full production requirements."
                        },
                        "PerformanceMetrics": {
                            "val": "User Operational Evaluation Systems (UOES) will culminate defined set of system capabilities and limitations.  Define level specifications and technical data packages."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3358"
                    },
                    "ProjectTitle": {
                        "val": "SSDS Training Improvement Program"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "1.081"
                        },
                        "BudgetYearOne": {
                            "val": "1.120"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.120"
                        },
                        "BudgetYearTwo": {
                            "val": "1.136"
                        },
                        "BudgetYearThree": {
                            "val": "1.093"
                        },
                        "BudgetYearFour": {
                            "val": "1.063"
                        },
                        "BudgetYearFive": {
                            "val": "1.074"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "The SSDS Training Improvement Program project (PU 3358) effort is dependent on the execution of the SSDS MK2 ACB-20 and TI-16 efforts under PU 2178 (QRCC).  PU 3358 funds the integration of Total Ship Training Capability (TSTC) improvements into the SSDS MK2 ACB-20 baseline and TI-16 configuration.  The integrated SSDS MK2 TSTC improvements will be included in the SSDS MK2 ACB-20 and TI-16 documentation, testing and certification.  The planning schedule for SSDS MK2 ACB-20 and TI-16 are documented in QRCC Project (PU 2178)."
                        },
                        "ProjectMissionDescription": {
                            "val": "The SSDS Training Improvement Program project is for the integration of Total Ship Training Capability (TSTC) improvements into the SSDS MK2 Advanced Capability Build (ACB-20) and Technology Insertion (TI-16) development efforts.  The TSTC improvements encompass physical and functional upgrades to the existing SSDS MK2 onboard training capabilities and configuration implemented with Battle Force Tactical Trainer (BFTT).  Planned TSTC improvements include a common method for integrated control of simulated air and surface vehicles including Identification Friend and Foe (IFF), for an Integrated Air Asset Simulation \/ Stimulation unit, and for the use of SSDS MK2 TI-16 Open Architecture Computing Environment (OACE) for TSTC integration."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "New Accomplishment\/Planned Program Entry"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.081"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Initiate Integrated Combat System engineering to determine top level requirements, capability phasing plan and concept of integration for the TSTC improvements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.120"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.120"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue Integrated Combat System engineering to define and allocate TSTC functional requirements to the training system, SSDS MK2, and other Combat System elements.  Define Integrated Combat System software architecture and physical architecture including SSDS MK2 TI-16 physical architecture to integrate TSTC."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "For the SSDS MK2 software development, including the integration of TSTC software improvements and the TI-16 Open Architecture Computing Environment, the acquisition strategy identified for SSDS MK2 for QRCC Project (PU 2178) (R-2A exhibit) applies."
                        },
                        "PerformanceMetrics": {
                            "val": "Requirement Documents\n - Ship Self Defense System (SSDS) Operational Requirement Document (ORD) approved 19 December 2013\n - Test and Evaluation Master Plan (TEMP No. 1400) For Ship Self Defense System (SSDS) Revision B, 5 Mar 2008."
                        }
                    }
                }
            ]
        }
    }
}