{
    "id": "f0e4b785eb4e68281861aba82213f5d0558f6fb0",
    "meta": {
        "filename": "dod-2015_RDTE_2015_ARMY_BA3_RDTE_JustificationBook_Army_PB_2015.zzz_unzipped_RDTE_JustificationBook_Army_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603710A"
        },
        "ProgramElementTitle": {
            "val": "NIGHT VISION ADVANCED TECHNOLOGY"
        },
        "R1LineNumber": {
            "val": "50"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "33.328"
            },
            "CurrentYear": {
                "val": "44.387"
            },
            "BudgetYearOne": {
                "val": "44.138"
            },
            "BudgetYearOneBase": {
                "val": "44.138"
            },
            "BudgetYearTwo": {
                "val": "44.228"
            },
            "BudgetYearThree": {
                "val": "45.270"
            },
            "BudgetYearFour": {
                "val": "40.395"
            },
            "BudgetYearFive": {
                "val": "44.297"
            }
        },
        "ProgramElementNote": {
            "val": "FY13 decreases attributed to General Congressional Reductions (-62 thousand); SBIR\/STTR transfers (-790 thousand) and Sequestration reductions (-3.037 million)"
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) matures and demonstrates sensor technologies that increase Warfighter survivability and lethality by providing sensor capabilities to acquire and engage targets at longer ranges in complex environments and operational conditions (e.g. day\/night, obscured, smoke, adverse weather). Project K70 pursues technologies that improve the Soldier's ability to see at night, provide rapid wide area search, multispectral aided target detection (AiTD), and enable passive long range target identification (ID beyond threat detection) in both an air and ground test-beds. Project K86 matures and evaluates sensors and algorithms designed to detect targets (vehicles and personnel) in camouflage, concealment and deception from airborne platforms, and provides pilotage and situational awareness imagery to multiple pilots\/crew members independently for enhanced crew\/aircraft operations in day\/night\/adverse weather conditions.  \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.  \n\nWork in this PE is fully coordinated with efforts in PE 0602120A (Sensors and Electronic Survivability), PE 0602270A (Electronic Warfare Technology), PE 0602709A (Night Vision and Electro-Optics Technology), PE 0602712A (Countermine Systems), PE 0603001A (Warfighter Advanced Technology), PE 0602211A (Aviation Technology), PE 0603003A (Aviation Advanced Technology), PE 0603005A (Combat Vehicle and Automotive Advanced Technology), PE 0603606A (Landmine Warfare and Barrier Advanced Technology), PE 0603774A (Night Vision Systems Advanced Development) and PE 0604710A (Night Vision Systems Engineering Development).   \n\nWork in this PE is performed by the U.S. Army Communications-Electronics Research, Development and Engineering Center (CERDEC)\/Night Vision and Electronic Sensors Directorate (NVESD), Fort Belvoir, VA."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "37.217"
                },
                "CurrentYear": {
                    "val": "36.407"
                },
                "BudgetYearOne": {
                    "val": "42.338"
                },
                "BudgetYearOneBase": {
                    "val": "42.338"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "33.328"
                },
                "CurrentYear": {
                    "val": "44.387"
                },
                "BudgetYearOne": {
                    "val": "44.138"
                },
                "BudgetYearOneBase": {
                    "val": "44.138"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-3.889"
                },
                "CurrentYear": {
                    "val": "7.980"
                },
                "BudgetYearOne": {
                    "val": "1.800"
                },
                "BudgetYearOneBase": {
                    "val": "1.800"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.062"
                    },
                    "CurrentYear": {
                        "val": "-0.020"
                    }
                },
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "8.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.790"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "1.800"
                                },
                                "BudgetYearOneBase": {
                                    "val": "1.800"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Sequestration"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-3.037"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "K70"
                    },
                    "ProjectTitle": {
                        "val": "Night Vision Adv Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "19.511"
                        },
                        "CurrentYear": {
                            "val": "20.390"
                        },
                        "BudgetYearOne": {
                            "val": "27.343"
                        },
                        "BudgetYearOneBase": {
                            "val": "27.343"
                        },
                        "BudgetYearTwo": {
                            "val": "28.935"
                        },
                        "BudgetYearThree": {
                            "val": "27.983"
                        },
                        "BudgetYearFour": {
                            "val": "22.951"
                        },
                        "BudgetYearFive": {
                            "val": "26.838"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates high-performance integrated sensor\/multi-sensor technologies to increase target detection range, extend target identification range, and reduce target acquisition (TA) timelines for dismounted Soldiers and tactical vehicles against threats that are beyond today's detection ranges or are partially obscured by terrain, weather or other features.\n\nThis project supports Army science and technology efforts in the Command, Control, Communications and Intelligence, Ground, Air and Soldier Portfolios.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the U.S. Army Communications-Electronics Research, Development, and Engineering Center (CERDEC) \/Night Vision and Electronic Sensors Directorate (NVESD), Fort Belvoir, VA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Weapon Sight Technology"
                                    },
                                    "Description": {
                                        "val": "This effort develops, integrates and demonstrates critical components for the next generation of weapon sight systems for mounted and dismounted Soldier use to provide improved actionable intelligence and the tools to assist in recognizing and identifying friend or foe."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Integrated and demonstrated Optical Augmentation (OA) hardware; completed final weapon sight integration and ruggedization for testing and evaluation; demonstrated sensor fusion integration between ultra violet (UV) and virtual pointer (VP) hardware and weapon sights for greatly enhanced target handoff during both day and night operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.102"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Integrate and evaluate an integrated sensor fusion kit (combines situational awareness and target handoff) and existing fielded equipment and improve algorithms to reduce false alarms for an affordable UV\/virtual pointer and hand-held targeting technology; leverage and integrate latest generation of high performance focal plane arrays (FPAs), displays, advanced optics, direction finding and wireless data component technologies for lighter weight, lower power, clip-on weapon sight with improved range performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.186"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.186"
                                            },
                                            "Text": {
                                                "val": "Will improve sensor processing efficiency and demonstrate crew served weapon sight with increased range, ID capability and reduced SWaP; leverage new optical design and high performance uncooled IR detector to complete design of next generation sniper weapon sight with reduced SWaP; begin design studies of conformal head mounted composite waveguide displays with day\/night usability and wireless interface for remote display of weapon sight imagery."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Urban Sensor Suite"
                                    },
                                    "Description": {
                                        "val": "This effort develops and integrates 360 degree closed hatch vision capability with real time acoustic and non-real time on-the-move (OTM) moving target indicator (MTI) threat detection and cueing sensors and algorithms, high resolution interrogation sensors (for slew to cue identification), improved resolution driving sensors and high bandwidth video capture capabilities in urban operations for improved survivability and lethality."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.637"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Validated, matured and optimized hardware designs which provide high resolution persistent surveillance imagery with picture in picture capability in order to identify specific areas of interest."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tactical Ground Persistent Surveillance and Targeting"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates high-performance integrated sensor\/multi-sensor technologies to increase local situational awareness and target discrimination capabilities and reduce target acquisition (TA) timelines for dismounted Soldiers, combat vehicles, tactical robots, ground and urban sensors against threats that are beyond today's ranges or discrimination capabilities or are partially obscured by terrain."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.123"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Matured high definition infrared (IR) focal plane arrays (FPAs) and modeled their range and resolution performance; matured components and constructed brassboard system to demonstrate radar\/IR\/laser Slew-to-Cue in an operational environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.108"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Increase sensor resolution with large format FPAs and improve active illumination coverage to demonstrate long range, rapid and positive target recognition; improve gimbal performance through a combination of mechanical and electrical techniques to provide stabilized imagery for the sensor surveillance suite; demonstrate improved Moving Target Indicator (MTI) software capable of human and small unmanned aerial vehicle (SUAV) target recognition with improved system performance by leveraging laser range finder, cross-cueing with radars and advanced real-time signal processing of IR imagery."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.455"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.455"
                                            },
                                            "Text": {
                                                "val": "Will mature and validate algorithms for ground to air infrared search and track capabilities; optimize techniques to include rotating camera(s), stacked prisms, and staring arrays to improve 360 degree coverage and increase affordability; demonstrate high resolution target tracking and identification for target handoff and engagement."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Sensors for Precision"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates technologies that allow combat vehicle commanders and crewmen to detect more rapidly, identify and geo-locate threat targets to enable fire control for platform weaponry. The effort leverages advance Infrared (IR) imaging technology, 3-D imaging sensor techniques, emerging multispectral laser technologies and precise far target location technology to increase target detection range, extended target and reduce target acquisition timelines. This effort supports the Army's Active Protection System (APS) program to mature and demonstrate APS technologies to reduce vehicle weight while reducing reliance on armor through the use of other means such as sensing, warning, hostile fire detection, and active countermeasures to achieve increased protection against current and emerging threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.751"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Fabricated, optimized, evaluated and demonstrated in a relevant environment, an affordable, High Definition (HD), Forward Looking Infrared (FLIR), multi-purpose sensor for high resolution target discrimination and identification of personnel and weapon\/non-weapon scenarios providing a potential upgrade in a commander's independent thermal viewer form factor; matured algorithms and validated multi-purpose sensor performance for hostile fire detection and situational awareness applications; integrated the multi-purpose HD FLIR with an ultra-violet (UV) pointer for day\/night targeting handoff between mounted and dismounted personnel enabling cooperative engagement for a user evaluation in a relative environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.180"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Integrate next generation, high definition component technologies to rapidly detect and identify threats while on-the-move for vehicle sights; demonstrate flash detection capability coupled with acoustics for cueing and bullet tracking; develop hardware and software for detection and negation of sniper optics."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.688"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.688"
                                            },
                                            "Text": {
                                                "val": "Will validate low cost integrated uncooled IR sensors for situational awareness and muzzle flash detection; improve design for active threat sensor detection of uncooled and cooled infrared sensors; mature clutter rejection techniques for reduced false alarms and threat sensor point of origin determination; exploit existing and emerging laser technologies and determine limitations for suppression of threat night vision and electro-optic imaging sensors; begin development of concept demonstrator hardware to demonstrate detection\/suppression in a single waveband."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Sensor Interoperability"
                                    },
                                    "Description": {
                                        "val": "This effort provides a high-level construct that addresses Dynamic, Distributed, Discovery (D3) of systems and sensors within a multi-layered interoperability characterization. The primary goal of the integrated sensor architecture (ISA) is developing and demonstrating an architecture that allows sensors to readily integrate into a network and share sensor\/system data and information."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "Will model and simulate the sensor portion of the Computing Environment (CE); mature and evaluate sensor to network standards including implementation specifications and guides; implement standards, demonstrate, evaluate and refine interoperability of Electro-optic\/Infrared, radar sensors, chemical, biological, radioactive, nuclear, explosive (CBRNE) systems, biometric sensors; mature and demonstrate sensor imagery and metadata products as well as D3 configuration capability."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier System Architecture"
                                    },
                                    "Description": {
                                        "val": "This effort designs, develops and matures soldier sensor, optics, displays and electronic system interfaces that will be incorporated into the larger Soldier system architecture to improve the individual Soldier's effectiveness \/ efficiency, reducing burden and while reducing total operational costs.  This effort is coordinated with PE 0603001A\/J50, PE 0602716A\/Project H70, PE 0602786A\/Project H98, 060315A\/Project S28, and 0603004A\/Project 232."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.014"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.014"
                                            },
                                            "Text": {
                                                "val": "Will develop Measures of Effectiveness \/ Measures of Performance (MOE\/MOP) for the sensor, optics, displays and electronic systems used by the individual Soldier and integrate these MOE\/MOPs into the overall Soldier System Architecture."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "K73"
                    },
                    "ProjectTitle": {
                        "val": "NIGHT VISION SENSOR DEMONSTRATIONS (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "8.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding for Night Vision advanced technology development."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "Description": {
                                        "val": "This is a Congressional Interest Item."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "This is a Congressional Interest Item."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "K86"
                    },
                    "ProjectTitle": {
                        "val": "Night Vision, Abn Sys"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "13.817"
                        },
                        "CurrentYear": {
                            "val": "15.997"
                        },
                        "BudgetYearOne": {
                            "val": "16.795"
                        },
                        "BudgetYearOneBase": {
                            "val": "16.795"
                        },
                        "BudgetYearTwo": {
                            "val": "15.293"
                        },
                        "BudgetYearThree": {
                            "val": "17.287"
                        },
                        "BudgetYearFour": {
                            "val": "17.444"
                        },
                        "BudgetYearFive": {
                            "val": "17.459"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates intelligence, surveillance, reconnaissance, targeting and pilotage technologies in support of the Army's aviation and networked systems. This effort focuses on improved reconnaissance, surveillance and target acquisition and night pilotage sensors, high-resolution heads-up displays, sensor fusion, and aided target recognition (AiTR) capabilities for Army vertical lift aircraft and utility helicopters and unmanned aerial systems (UAS). UAS payload efforts mature and demonstrate small, lightweight, modular, payloads (electro-optical\/infrared, laser radar, designator) to support target detection, identification, location, tracking and targeting of tactical targets for the Brigade Combat Team.  \n\nThe project supports Army science and technology efforts for the Air and Command, Control, Communications and Intelligence portfolios.  \n \nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.  \n\nWork in this project is performed by the U.S. Army Communications-Electronics Research, Development, and Engineering Center (CERDEC) \/Night Vision and Electronic Sensors Directorate (NVESD), Fort Belvoir, VA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Airborne Unmanned Persistent Imaging"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates day and night persistent surveillance imaging and enhanced reconnaissance, surveillance and target acquisition (RSTA) capabilities from a single payload on the Grey Eagle Unmanned Aerial System (UAS). The technology will be applied to smaller\/lighter UASs as miniaturized large format sensors mature."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.391"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Conducted flight test and demonstration of enhanced RSTA and targeting capabilities with a high definition (HD), dual-band infrared focal plane array-based turret; collected airborne imagery to support development of processing subsystem; trained, tested and optimized the image exploitation subsystem for persistent wide area activity monitoring."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.730"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete system flight testing; mature Step-Stare capability, demonstrating local-area persistent surveillance for small unit situational awareness; demonstrate automated target cueing, vehicle and dismount tracking, image mosaicing and mapping, and provide imagery and target report products to the small unit network; demonstrate HD dual band 720 pixel format MWIR and LWIR imagery to determine best band for battlefield conditions and improved performance in adverse weather."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Definition Aviation Displays"
                                    },
                                    "Description": {
                                        "val": "This effort develops and demonstrates an advanced monocular, see-through, high definition, digital, helmet mounted display (HMD) to replace Apache's analog, cathode ray tube-based Integrated Helmet and Display Sight System (IHADSS) and provides a baseline for future aviation HMDs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.426"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed fabrication of initial engineering prototype displays with advanced monocular optics and low power miniature liquid crystal displays; demonstrated and assessed key head-borne ergonomic parameters such as size and weight, center of gravity, display brightness\/contrast and resolution; integrated with HGU-56P helmet; conducted laboratory performance characterization and fabricated system demonstrator for flight testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.913"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete fabrication of wide field of view system demonstrators; conduct laboratory performance characterization of complete HMD system and aero-medical human factors conformance; finalize platform integration activities; conduct ground and flight test demonstrations and user evaluation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multifunction Imagers for Rotary Wing"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates an economical sensor capability by developing multifunction sensor modules for increased performance of pilotage capability in a degraded visual environment at lower total life cycle cost than separate sensor systems. Work in this effort is coordinated with degraded visual environments efforts in PE 0602211A, Aviation Technology, Project 47A."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.354"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop a dual-speed 60\/1000 Hz readout integrated circuit that enables a single infrared (IR) sensor to provide simultaneous day\/night imagery for applications such as pilotage; integrate the dual-purpose IR sensor into a multifunction sensor module with other low-light night vision technology to provide a multi-spectral capability; conduct trade studies to optimize sensor placement for multiple applications performance over the entire flight envelope, including degraded visual environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.049"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.049"
                                            },
                                            "Text": {
                                                "val": "Will fabricate a dual-purpose IR sensor with the dual speed ROIC; continue integration of dual-purpose IR sensors with other low-light night vision technology; develop pilotage image processing algorithms in the dual purpose IR sensor; develop threat warning algorithms for use with IR sensor operating at 1000 Hz frame rate; begin flight testing to validate pilotage sensor and processing technologies for performance in degraded visual environments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Local Area ISR for Tactical Small Units"
                                    },
                                    "Description": {
                                        "val": "This effort develops and demonstrates sensors enabling simultaneous display of wide and narrow field-of-view (FOV) infrared imagery for enhanced situational awareness\/targeting and multi-band image fusion and the ability to image battlefield laser spot locations for improved targeting accuracy and reduced fratricide caused by laser misalignment."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.746"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.746"
                                            },
                                            "Text": {
                                                "val": "Will conduct design trade study to retrofit existing turret with optical components to provide simultaneous wide FOV and independently steerable narrow FOV capability through optical beam splitting of the existing common sensor payload dual-band midwave\/longwave infrared camera; begins maturation of a compact, high definition, 3-band (visible, near infrared, shortwave infrared) camera module to enable imaging of battlefield lasers and multi-band image fusion."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Pilotage Sensor Fusion"
                                    },
                                    "Description": {
                                        "val": "This effort develops and matures sensor fusion utilizing combinations of sensing modalities (active and\/or passive) and associated real-time processing algorithms and architectures to produce synthetic scene representations that provide increased information content as opposed to scenes produced from existing single mode sensor solutions."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "Will collect field data from multiple sensor modalities (e.g. passive\/active infrared, radar, shortwave lidar) under degraded visual environment (DVE) conditions; identify exploitable features associated with each modality; begin development of algorithm approaches to produce synthetic scenes for presentation to the pilot."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}