{
    "id": "fa84898b73e231b7cde229c167544afe7a508970",
    "meta": {
        "filename": "dod-2015_RDTE_2015_NAVY_BA5_RDTE_JustificationBook_Navy_PB_2015.zzz_unzipped_RDTE_JustificationBook_Navy_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604264N"
        },
        "ProgramElementTitle": {
            "val": "Air Crew Systems Development"
        },
        "R1LineNumber": {
            "val": "99"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "92.412"
            },
            "PriorYear": {
                "val": "2.437"
            },
            "CurrentYear": {
                "val": "9.151"
            },
            "BudgetYearOne": {
                "val": "15.014"
            },
            "BudgetYearOneBase": {
                "val": "15.014"
            },
            "BudgetYearTwo": {
                "val": "13.408"
            },
            "BudgetYearThree": {
                "val": "12.796"
            },
            "BudgetYearFour": {
                "val": "5.557"
            },
            "BudgetYearFive": {
                "val": "5.685"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Aircrew Systems Development program provides Engineering and Manufacturing Development of Aviation Life Support Systems to protect aircrew and flight deck personnel from current and future threats including: directed energy weapons, chemical\/biological\/radiological agents\/fallout, ballistic projectiles, temperature extremes, heat\/fire, low concentration oxygen environments, high dynamic forces during emergency egress, hearing loss, and high \"G\" forces.  The program also provides development for the following capabilities: night vision capability, hearing and head protection, man mounted data display, communications, clothing, in flight restraint and stability emergency egress and descent, escape and evasion, survival and rescue, crash protection, and anthropometric sizing for small aircrew.  Acquisition initiatives include: competition, the application of streamlining initiatives, use of non-developmental items, joint and tri-service developments, and the pursuit of NATO\/allied cooperative ventures, which expedite introduction of new products into Navy and Marine Corps fixed and rotary wing aircraft, reduce costs, and promote commonality. Cost increase from FY14 to FY15 is due to the ramp up of the Electronic Knee Board program to support Integrated Test and the Enhanced Visual Acuity program to support PDR, CDR and TRR events.\n\nJUSTIFICATION FOR BUDGET ACTIVITY:\nThis program is funded under SYSTEM DEVELOPMENT AND DEMONSTRATION because it includes projects that have passed Milestone B approval and are conducting engineering and manufacturing development tasks aimed at meeting validated requirements prior to full-rate production decision."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "2.717"
                },
                "CurrentYear": {
                    "val": "11.401"
                },
                "BudgetYearOne": {
                    "val": "16.316"
                },
                "BudgetYearOneBase": {
                    "val": "16.316"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "2.437"
                },
                "CurrentYear": {
                    "val": "9.151"
                },
                "BudgetYearOne": {
                    "val": "15.014"
                },
                "BudgetYearOneBase": {
                    "val": "15.014"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.280"
                },
                "CurrentYear": {
                    "val": "-2.250"
                },
                "BudgetYearOne": {
                    "val": "-1.302"
                },
                "BudgetYearOneBase": {
                    "val": "-1.302"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-2.250"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.036"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-1.302"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.302"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.244"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Schedule:\n\n1. Acquisition Milestones:\nA. Laser Eye Protection - Milestone C, IOC and FRP delayed due to extended revision of threat requirement.\nB. Electronic Knee Board (EKB) - Post Milestone B and Milestone C were deleted as MDA has approved initial configuration. IOC changed to EOC for initial configuration. FOC delayed to support 64-Bit configuration.\n\n2. Production Milestones:\nA. Aircrew Endurance (AE) - Full Rate Production (FRP) 3 and FRP 4 removed because FRP 2 production will complete the procurement of all assets. IOC shifted one quarter due to production delays.\nB. Laser Eye Protection - LRIP and FRP contract awards changed to align with milestone decisions.\n\n3. Deliveries:\nA. AE - FRP 3 and FRP 4 removed because FRP 2 production will complete the procurement of all assets.  FRP 2 quantity changed from 1790 to 3541 to meet inventory objective.\nB. Laser Eye Protection - FRP 1 quantity updated from 305 to 461 and FRP 5 quantity updated from 1588 to 1124.\nC. EKB - FRP 2 quantity updated from 1736 to 2236 to meet initial inventory objective. FRP 3 and FRP 4 deliveries were added in FY18 and FY19.\n\n4. Contract Awards:\nA. EKB - FRP 3 and FRP 4 contract awards added to FY18 and FY19. \n\n5. Test and Evaluation:\nA. EKB - Renamed the test event from Developmental Test to Integrated Test to more accurately reflect the type of testing that will be conducted.\n\n6.  System Development:\nA.  EKB - PDR and CDR were deleted as MDA has approved initial configuration. Design Review was added to reflect next configuration plans.\n\nTechnical:  N\/A"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0606"
                    },
                    "ProjectTitle": {
                        "val": "Aircrew System Development"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "92.412"
                        },
                        "PriorYear": {
                            "val": "2.437"
                        },
                        "CurrentYear": {
                            "val": "9.151"
                        },
                        "BudgetYearOne": {
                            "val": "15.014"
                        },
                        "BudgetYearOneBase": {
                            "val": "15.014"
                        },
                        "BudgetYearTwo": {
                            "val": "13.408"
                        },
                        "BudgetYearThree": {
                            "val": "12.796"
                        },
                        "BudgetYearFour": {
                            "val": "5.557"
                        },
                        "BudgetYearFive": {
                            "val": "5.685"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "Cost increase from FY14 to FY15 is due to the ramp up of the Electronic Knee Board program to support Integrated Test and the Enhanced Visual Acuity program to support PDR, CDR and TRR events."
                        },
                        "ProjectMissionDescription": {
                            "val": "AIRCREW SYSTEMS: Aircrew Endurance (AE), Laser Eye Protection (LEP), Enhanced Visual Acuity (EVA), and Aircrew Systems (AS).\n\nUnder the above projects, AE includes Survival Vests & Armor, Universal Camouflage, Waste Management, Hydration, Cooling and Clothing Systems.  LEP includes Laser Eye Protection for noncorrective and corrective lens, Multi-Wavelength Spectacles, and Laser Eye Protection Improvement Program (LEPIP). EVA includes enhanced visibility in degraded visual environment technology. AS includes State of the Art (SOA) and Survival Systems.\n\nAIRCRAFT SYSTEMS: Aircraft systems include studies for Advanced Crash Protection, SOA, Survival Systems and Electronic Knee Board (EKB). EKB provides digital display that will allow aircrew to store, search, and view significant amounts of data required for mission accomplishment during flight operations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Aircrew System Development"
                                    },
                                    "Description": {
                                        "val": "AE includes Survival Vests & Armor, Universal Camouflage, Waste Management, Hydration Cooling and Clothing Systems.  LEP includes LEP Spectacles (both Self Protection and Multi-Wavelength), step-in visor and LEPIP. EVA includes enhanced visability in degraded visual environment technology. AS includes SOA."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.869"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "AE: Development of new outer jacket system for inclement weather conditions\nSOA: Continue a yearly evaluation and authorization of the survival and clothing items. Identification, testing and approval of Commercial Off-the-Shelf items (COTS) that provide upgrade performance, fill capability gaps, improve aircrew performance, safety and enhance survivibility."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.752"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "LEP: Continue research & development for next increment of threat spectacles.\nEVA: Continue Technology Development.\nSOA: Continue a yearly evaluation and authorization of the survival, clothing, and other aircrew systems items. Identification, testing and approval of COTS items that provide upgrade performance, fill capability gaps, improve aircrew performance, safety and enhance survivibility."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.990"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.990"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "LEP: Continue research & development for next increment of threat spectacles.\nEVA: Continue development.\nSOA: Continue a yearly evaluation and authorization of the survival, clothing, and other aircrew systems items. Identification, testing and approval of Commercial Off-the-Shelf items (COTS) items that provide upgrade performance, fill capability gaps, improve aircrew performance, safety and enhance survivibility."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aircraft Systems Development"
                                    },
                                    "Description": {
                                        "val": "Aircraft Systems include studies for Advance Crash Protection, Crashworthy Troop Seats, State of the Art (SOA), and Electronic Knee Board (EKB)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.568"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "SOA: Continue a yearly evaluation and authorization of Advance Crash Protection, EKB and other aircraft systems items.  Identification, testing and approval of COTS items that provide upgraded performance, fill capability gaps, improve aircrew performance, safety and enhance survivability."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.399"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EKB - Conduct development, design reviews, and Authorization to Work."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.024"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.024"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EKB: Continue development, complete design review, conduct integrated testing, and Authorizations to Work."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPN\/4244"
                                    },
                                    "Title": {
                                        "val": "Aviation Life Support"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "37.327"
                                        },
                                        "CurrentYear": {
                                            "val": "29.670"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "318.439"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APN\/0575"
                                    },
                                    "Title": {
                                        "val": "Aviation Life Support Mods"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "2.347"
                                        },
                                        "CurrentYear": {
                                            "val": "6.267"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "27.110"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "OPN\/4268"
                                    },
                                    "Title": {
                                        "val": "Aviation Support Equipment"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "30.762"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "30.762"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "39.089"
                                        },
                                        "BudgetYearThree": {
                                            "val": "41.404"
                                        },
                                        "BudgetYearFour": {
                                            "val": "44.806"
                                        },
                                        "BudgetYearFive": {
                                            "val": "45.684"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Commercial Off-The-Shelf \/Non-Developmental Items where possible, cost type contracts.  Majority of programs non-ACAT programs."
                        },
                        "PerformanceMetrics": {
                            "val": "Aircrew Endurance: Initial Operational Capability (IOC).\nElectronic Knee Board: Performance Metrics to include Design Review, EOC and FOC.\nEnhanced Visual Acuity: Performance Metrics to include PDR, CDR, MS B, MS C and IOC."
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0604264N_0606_FILE1.PNG"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0604264N_0606_FILE2.PNG"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0604264N_0606_FILE3.PNG"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "R4_2015PB_0604264N_0606_FILE4.PNG"
                                }
                            }
                        ]
                    }
                }
            ]
        }
    }
}