{
    "id": "fb42b246c2c060b7dff49233226bfe1cec0c21d5",
    "meta": {
        "filename": "dod-2015_RDTE_2015_AIRFORCE_V1_RDTE_JustificationBook_Air_Force_PB_2015.zzz_unzipped_RDTE_JustificationBook_Air_Force_PB_2015.xml",
        "budget_year": "2015",
        "budget_cycle": "PB",
        "submission_date": "2014-03",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603211F"
        },
        "ProgramElementTitle": {
            "val": "Aerospace Technology Dev\/Demo"
        },
        "R1LineNumber": {
            "val": "17"
        },
        "BudgetYear": {
            "val": "2015"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2014-03"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "72.462"
            },
            "CurrentYear": {
                "val": "77.329"
            },
            "BudgetYearOne": {
                "val": "91.062"
            },
            "BudgetYearOneBase": {
                "val": "91.062"
            },
            "BudgetYearTwo": {
                "val": "99.103"
            },
            "BudgetYearThree": {
                "val": "61.957"
            },
            "BudgetYearFour": {
                "val": "75.937"
            },
            "BudgetYearFive": {
                "val": "77.975"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "In FY 2015, this program has two new projects, High Speed\/Hypersonic Integration and Demonstration and Flight Systems Control.  These projects support Department of Defense (DoD) priorities for demonstrations in hypersonics and unmanned systems, respectively.\n\nThis program integrates and demonstrates advanced flight vehicle technologies that improve the performance and supportability of existing and future aerospace vehicles.  System level integration brings together aerospace vehicle technologies along with avionics, propulsion, and weapon systems for demonstration in a near- realistic operational environment. Integration and technology demonstrations reduce the risk and time required to transition technologies into operational aircraft. Efforts in this program have been coordinated through the Department of Defense (DoD) science and Technology (S&T) Executive Committee process to harmonize efforts and eliminate duplication. This program is in Budget activity 3, Advanced Technology Development, since it enables and demonstrates technologies for existing aerospace system upgrades and\/or new and future aerospace system developments that have military utility and address warfighter needs."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "81.376"
                },
                "CurrentYear": {
                    "val": "77.347"
                },
                "BudgetYearOne": {
                    "val": "82.305"
                },
                "BudgetYearOneBase": {
                    "val": "82.305"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "72.462"
                },
                "CurrentYear": {
                    "val": "77.329"
                },
                "BudgetYearOne": {
                    "val": "91.062"
                },
                "BudgetYearOneBase": {
                    "val": "91.062"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-8.914"
                },
                "CurrentYear": {
                    "val": "-0.018"
                },
                "BudgetYearOne": {
                    "val": "8.757"
                },
                "BudgetYearOneBase": {
                    "val": "8.757"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.107"
                    },
                    "CurrentYear": {
                        "val": "-0.018"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.101"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-6.706"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "8.757"
                                },
                                "BudgetYearOneBase": {
                                    "val": "8.757"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Decrease in FY 2013 Other Adjustments was due to Sequestration.\n\nIncrease in FY 2015 due to increase emphasis in hypersonic and autonomous systems control research."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "634920"
                    },
                    "ProjectTitle": {
                        "val": "Flight Vehicle Tech Integration"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "72.462"
                        },
                        "CurrentYear": {
                            "val": "77.329"
                        },
                        "BudgetYearOne": {
                            "val": "5.665"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.665"
                        },
                        "BudgetYearTwo": {
                            "val": "23.651"
                        },
                        "BudgetYearThree": {
                            "val": "15.010"
                        },
                        "BudgetYearFour": {
                            "val": "19.910"
                        },
                        "BudgetYearFive": {
                            "val": "20.050"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project demonstrates advanced aerospace vehicle technologies.  Aerospace Vehicle Technology Integration efforts are accomplished through integration of various technologies to include avionics, advanced propulsion, and weapon systems for demonstration in near-realistic operational environments.  Advanced Aerospace Structures Technologies are demonstrated to enhance the capability of current and future aerospace vehicles."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Flight Systems Controls"
                                    },
                                    "Description": {
                                        "val": "Integrates and demonstrates advanced control technologies that improve the performance, reliability, safety, and survivability of manned and unmanned, aerospace systems.  Enhanced capabilities are enabled by control, automation, and system level integration of subsystems and systems such as propulsion, airframes, avionics, power, weapons, communications, and operator interfaces. Modeling and simulation, integration, and technology demonstrations in a near-operational environment reduce the risk and time required to transition technologies into existing and future aerospace systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.916"
                                            },
                                            "Text": {
                                                "val": "Continued development and demonstration of technologies for situational awareness, autonomous control, and survivability for unmanned systems and manned platforms.  Demonstrated cooperative teaming of small unmanned platforms in complex, low altitude environments.  Demonstrated autonomous launch and safe airspace interoperability for multiple remotely piloted aircraft (RPA) systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.556"
                                            },
                                            "Text": {
                                                "val": "Continue to develop and demonstrate technologies for situational awareness, autonomous control, and survivability for unmanned systems and manned platforms.  Demonstrate airborne control of small unmanned platforms in complex, low altitude environments.  Continue demonstration of autonomous and safe airspace interoperability for manned and RPA systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Starting in FY 2015, efforts and funding in this area will be transferred to new project 634927, Flight Systems Control."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aerospace Vehicle Technology Integration"
                                    },
                                    "Description": {
                                        "val": "This title changed from Enhanced Platform Capabilities to Aerospace Vehicle Technology Integration to better reflect the content and objectives.  Develop, simulate, and demonstrate integrated technologies to improve the performance of aerospace platform capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "54.798"
                                            },
                                            "Text": {
                                                "val": "Completed lightweight composite structures ground experiment demonstration.  Initiated technology efforts for precision air delivery capability for legacy mobility aircraft by reducing tracking errors and better integration of airdrop technologies.  Matured adaptive turbine engine technologies for advanced air vehicles.  Continued combined inlet and large bypass ratio fan demonstration.  Began demonstration of large cargo aircraft in formation flight for fuel burn reduction to support transition decision.  Began flight validation safety and operational compatibility of C-130 aircraft with aft body drag reduction devices."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.952"
                                            },
                                            "Text": {
                                                "val": "Further efforts for precision air delivery capability for legacy mobility aircraft by reducing tracking errors and better integration of airdrop technologies.  Further development of advanced engine system design integration to mature adaptive turbine engine technologies for advanced air vehicles along with thrust augmentors and exhaust systems to provide technical options for highly fuel-efficient engines.  Complete demonstration of large cargo aircraft in formation flight for fuel burn reduction to support transition decision.  Complete flight safety validation and operational compatibility of C-130 aircraft with aft body drag reduction devices."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.607"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.607"
                                            },
                                            "Text": {
                                                "val": "Initiate C-17 formation flight Advanced Technology Demonstration.  Initiate feasibility flight test of C-17 aircraft with aft body drag reduction devices.  Continue to improve accuracy, situational awareness, and safety for air drop operations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Aerospace Structure Technologies"
                                    },
                                    "Description": {
                                        "val": "This title changed from Multi-Role Structure Technologies to Advanced Aerospace Structure Technologies to better reflect the content and objectives. Develop and demonstrate affordable lightweight, adaptive, and multifunctional structural concepts integrated into aerospace systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.835"
                                            },
                                            "Text": {
                                                "val": "Continued flight test of antenna integration into load-bearing structures.  Completed demonstrations of key high altitude persistent intelligence, surveillance and reconnaissance (ISR) technologies.  Completed demonstration of low band structurally integrated arrays and persistent multi-intelligence platforms.  Developed passive flow control improvements for enhanced aero efficiency of legacy aircraft."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.615"
                                            },
                                            "Text": {
                                                "val": "Continue flight test of directional finding communication antenna integration technology demonstration into load-bearing structures for small remotely piloted aircraft (RPA). Continue flight technology demonstrations of key high altitude persistent ISR for active flutter suppression, gust load alleviation, and adaptive, multi-purpose wing surfaces."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.058"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.058"
                                            },
                                            "Text": {
                                                "val": "Complete flight test of directional finding communication antenna integration technology demonstration into load-bearing structures for small RPA. Complete flight technology demonstrations of key high altitude persistent ISR for active flutter suppression, gust load alleviation, and adaptive, multi-purpose wing surfaces."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Adaptive Structure Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop technologies for adaptive structures to provide in-flight modifications offering improved performance. Starting in FY14 this effort moves to thrust Advanced Aerospace Structures Technologies, same Program and Project."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.058"
                                            },
                                            "Text": {
                                                "val": "Completed the development of integrated system health management and adaptive guidance and control technologies for aerospace vehicles. Completed structural health management ground technology demonstration for reusable space access vehicle."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Starting in FY 2014, efforts and funding in this area will be transferred to Advanced Aerospace Structure Technologies thrust, in this project, to realign and consolidate complimentary efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Speed\/Hypersonic Vehicle Technologies"
                                    },
                                    "Description": {
                                        "val": "This thrust moves to project 634926, High Speed\/Hypersonic Integration and Demostration in FY15. Develops, integrates and demonstrates, via simulations, ground, and flight tests, advanced flight vehicle technologies that improve the performance and supportability of future high speed\/hypersonic vehicles.  System level integration brings together air vehicle technologies along with avionics, propulsion, and warheads and other aerospace subsystems for demonstration in a near-realistic operational environment.  Integration and technology demonstrations reduce the risk and time required to transition technologies into operational systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.855"
                                            },
                                            "Text": {
                                                "val": "Completed flight demonstration of technologies applicable to reusable hypersonic vehicles and high-speed weapons and weapon systems.  Continued to advance high temperature materials and structures for hypersonic vehicles.  Continued small scale flight testing of high-speed flying experiments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "44.206"
                                            },
                                            "Text": {
                                                "val": "Begin accelerated development and demonstration of tactically-relevant long range high speed strike technologies including ground and flight demonstrations needed for potential follow-on acquisition program.  Effort builds upon successful scramjet engine demonstration under the X-51A program.  Increase in FY14 also supports high speed\/hypersonics testing support and continues to advance high temperature materials and structures for hypersonic vehicles."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Starting in FY 2015, efforts and funding in this area will be transferred to new project 634926, High Speed\/Hypersonic Integration and Demonstration."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "634926"
                    },
                    "ProjectTitle": {
                        "val": "High Speed\/Hypersonic Intgr and Demo"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "67.017"
                        },
                        "BudgetYearOneBase": {
                            "val": "67.017"
                        },
                        "BudgetYearTwo": {
                            "val": "51.037"
                        },
                        "BudgetYearThree": {
                            "val": "32.557"
                        },
                        "BudgetYearFour": {
                            "val": "39.104"
                        },
                        "BudgetYearFive": {
                            "val": "38.204"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "This is a new project starting in FY 2015 with scope and funding re-aligned from project 634920, Flight Vehicle Technology Integration, to support DoD priorities in hypersonics demonstration.  This project integrates advanced technologies such as avionics, propulsion, and other subsystems in simulations, ground tests, and flight tests to validate and demonstrate vehicle performance and other capabilities in environments relevant to or realistically representative of operational missions.  These activities and efforts enable low-risk and rapid transition to acquisition programs for near-term weapons systems and development and demonstration of far-term re-usable platforms."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops, integrates and demonstrates, via simulations, ground, and flight tests, advanced flight vehicle technologies that improve the performance and supportability of future high speed\/hypersonic vehicles. System level integration brings together air vehicle technologies along with avionics, propulsion, and warheads and other aerospace subsystems for demonstration in a near-realistic operational environment. Integration and technology demonstrations reduce the risk and time required to transition technologies into operational systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "High Speed\/Hypersonic Vehicle Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop, simulate and demonstrate integrated vehicle technologies to enable and improve the performance of future high-speed and hypersonic systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "67.017"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "67.017"
                                            },
                                            "Text": {
                                                "val": "Continue accelerated development and demonstration of tactically-relevant long range high speed strike technologies including ground and flight demonstrations needed for potential follow-on acquisition program.  Continue advancement of high temperature materials and structures for hypersonic vehicles."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "634927"
                    },
                    "ProjectTitle": {
                        "val": "Flight Systems Control"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "18.380"
                        },
                        "BudgetYearOneBase": {
                            "val": "18.380"
                        },
                        "BudgetYearTwo": {
                            "val": "24.415"
                        },
                        "BudgetYearThree": {
                            "val": "14.390"
                        },
                        "BudgetYearFour": {
                            "val": "16.923"
                        },
                        "BudgetYearFive": {
                            "val": "19.721"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "This is a new project starting in FY 2015 with scope and funding re-aligned from project 634920, Flight Vehicle Technology Integration, to support DoD priorities in unmanned systems demonstrations."
                        },
                        "ProjectMissionDescription": {
                            "val": "This program integrates and demonstrates advanced control technologies that improve the performance, reliability, safety, and survivability of existing and future, manned and unmanned, aerospace systems.  Enhanced capabilities are enabled by control, automation, and system level integration of subsystems and systems such as propulsion, airframes, avionics, power, weapons, communications, and operator interfaces. Modeling and simulation, integration, and technology demonstrations in a near-operational environment reduce the risk and time required to transition technologies into existing and future aerospace systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Autonomous Systems Control"
                                    },
                                    "Description": {
                                        "val": "Develop, simulate, and demonstrate advanced automation- and control-enabled capabilities for manned or unmanned aerospace platforms. Develop, simulate, and demonstrate autonomous flight controls for safe flight and cooperative operations between manned and remotely piloted air platforms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.380"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.380"
                                            },
                                            "Text": {
                                                "val": "Further development and demonstration of technologies for situational awareness, autonomous control, and survivability for unmanned systems and manned platforms. Continue demonstration of autonomous and safe airspace interoperability for manned and RPA systems. Continue development and demonstration of airborne control of teams of unmanned aircraft. Continue development and demonstration of improved accuracy, situational awareness, and safety for air drop operations."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}