{
    "id": "20f6a69677a8d5f35e5f512932b6c38a2c303531",
    "meta": {
        "filename": "dod-2017_PROCUREMENT_2017_AIRFORCE_OTHER_U_PROCUREMENT_JustificationBook_Air_Force_PB_2017.zzz_unzipped_U_PROCUREMENT_JustificationBook_Air_Force_PB_2017.xml",
        "budget_year": "2017",
        "budget_cycle": "PB",
        "submission_date": "2016-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3080F",
        "appropriation_name": "Other Procurement, Air Force"
    },
    "record": {
        "@quantityUnits": "Each",
        "@unitCostUnits": "Dollars",
        "@totalCostUnits": "Millions",
        "@manufacturerRateUnits": "Yearly",
        "@classification": "UNCLASSIFIED",
        "LineItemNumber": {
            "val": "845420"
        },
        "LineItemTitle": {
            "val": "Mobility Equipment"
        },
        "P1LineNumber": {
            "val": "63"
        },
        "BudgetYear": {
            "val": "2017"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2016-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationNumber": {
            "val": "3080F"
        },
        "AppropriationTitle": {
            "val": "Other Procurement, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Other Base Maintenance and Support Equip"
        },
        "BudgetSubActivityNumber": {
            "val": "5"
        },
        "BudgetSubActivityTitle": {
            "val": "Base Support Equipment"
        },
        "ResourceSummary": {
            "Quantity": {
                "AllPriorYears": {
                    "val": "300"
                },
                "Total": {
                    "val": "300"
                }
            },
            "TotalCost": {
                "AllPriorYears": {
                    "val": "59.312"
                },
                "PriorYear": {
                    "val": "64.934"
                },
                "CurrentYear": {
                    "val": "62.25"
                },
                "BudgetYearOneBase": {
                    "val": "8.146"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "8.146"
                },
                "BudgetYearTwo": {
                    "val": "8.39"
                },
                "BudgetYearThree": {
                    "val": "9.523"
                },
                "BudgetYearFour": {
                    "val": "9.693"
                },
                "BudgetYearFive": {
                    "val": "9.867"
                },
                "Total": {
                    "val": "232.115"
                }
            },
            "UnitCost": {
                "AllPriorYears": {
                    "val": "197706.67"
                },
                "Total": {
                    "val": "773716.67"
                }
            },
            "NetProcurementP1": {
                "AllPriorYears": {
                    "val": "59.312"
                },
                "PriorYear": {
                    "val": "64.934"
                },
                "CurrentYear": {
                    "val": "62.25"
                },
                "BudgetYearOneBase": {
                    "val": "8.146"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "8.146"
                },
                "BudgetYearTwo": {
                    "val": "8.39"
                },
                "BudgetYearThree": {
                    "val": "9.523"
                },
                "BudgetYearFour": {
                    "val": "9.693"
                },
                "BudgetYearFive": {
                    "val": "9.867"
                },
                "Total": {
                    "val": "232.115"
                }
            },
            "TotalObligationAuthority": {
                "AllPriorYears": {
                    "val": "59.312"
                },
                "PriorYear": {
                    "val": "64.934"
                },
                "CurrentYear": {
                    "val": "62.25"
                },
                "BudgetYearOneBase": {
                    "val": "8.146"
                },
                "BudgetYearOneOCO": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "8.146"
                },
                "BudgetYearTwo": {
                    "val": "8.39"
                },
                "BudgetYearThree": {
                    "val": "9.523"
                },
                "BudgetYearFour": {
                    "val": "9.693"
                },
                "BudgetYearFive": {
                    "val": "9.867"
                },
                "Total": {
                    "val": "232.115"
                }
            }
        },
        "Code": {
            "val": "A"
        },
        "Description": {
            "val": "This program funds procurement of Basic Expeditionary Airfield Resources (BEAR). It includes equipment to support the bed down of deployed forces (personnel, aircraft and support equipment) at austere and semi-austere locations. BEAR assets are a critical Agile Combat Support enabler for the Expeditionary Air Force. BEAR is composed of five types of air base capability packages: housekeeping, feeding, hygiene, power generation and flight line. Flight line packages consist of airfield lighting, aircraft hangars, fire stations, and numerous additional systems to support airfield operations. The program provides funding to procure new and replacement equipment items, and multi-media packages required to support BEAR training facilities at Silver Flag Sites, Regional Training Sites, Technical Schools, Technical Certification Centers, Services Combat Center Training, 49MMG, and Eagle Flag. Costs include inventory reconstitution, spares and consumables, repairs, and procurement of new equipment for upgrades or full UTC's replacement. BEAR demonstrated its critical role in support of Operations Enduring Freedom and other operations worldwide. \n\nThe AF continues to modernize major BEAR components to replace obsolete and inefficient items (e.g. Power Generation, Hygiene, Refrigeration,EALS, MAAS, Shelters, and Feeding): \n\nForce Module Water System: Water System takes non-potable water and converts it into potable water. The system is modular and scalable in design and consists of Source Run, Water Production, Reverse Osmosis Water Purification Unit (ROWPU), Initial, Follow-on, and Industrial Operations, Flight line Extension, freeze protection, grey water recovery, pumping, piping, and storage equipment; applicable fittings; and other components such as fluid control valves. \n\nPower System: Consists of prime and secondary power equipment which provides the capability to generate and distribute power to billeting, feeding, flight line and industrial operations at forward deployed sites. The primary power source for BEAR bed down locations is the BEAR Power Unit (BPU). The BPU is an 800 kilowatt (kW) Tier II compliant diesel generator. The power from the BPU is distributed through buried high voltage cabling and stepped down to facility power through the Secondary Distribution Center (SDC). The SDC is a 150 kilovolt-ampere (KVA) transformer capable of supporting twelve (12) billeting shelters via the Primary Distribution Panels (PDP). \n\nExpeditionary Airfield Lighting System (EALS): Light Emitting Diode (LED) and incandescent runway lighting system designed to be rapidly installed at contingency airfields and at other locations that need temporary airfield lighting. The lighting kit for runways includes runway edge and threshold lights, precision approach path indicator (PAPI), and strobe approach lights, distance to go marker lamps, taxi way lamps and battery-operated obstruction lights. The EALS also includes the generators, cables, control cables, transformers and regulators. The entire system is packaged on six (6) mobile trailers. \n\nMobile Aircraft Arresting System: This air transportable barrier arresting Bak-12 mounted on a mobile trailer to accommodate the recovery of fighter aircraft returning to battle damaged airfield. \n\nHygiene: Hygiene includes Shower, Shave and Latrine, and Self Help Laundry system which provides personal hygiene facilities in support of BEAR bases. \n\nHygiene Shelters: Hygiene Shelters are designed to be used as changing rooms connecting to the BEAR Hygiene System. The shelters support personnel utilizing BEAR Hygiene Systems. \n\nRefrigeration: Refrigeration units designed for the carriage of deep frozen, frozen, chilled and general cargo by road, rail, air, and sea (above or below deck), suitable for austere environmental conditions. It is used to support the BEAR services, feeding and mortuary operations. \n\nShelters: Shelters vary in sizes and are needed for billeting, kitchen, hygiene, and aircraft and equipment maintenance. Includes lighting, electrical equipment, environmental control units, remote area lighting, Shelter Flies, Shelter Flooring\/matting for various shelter sizes, Shelter liners. \n\nShelter Flooring: Shelter flooring varies in size for small and large shelters (ACH, LAMS, Mortuary). \n\nFeeding: BEAR Feeding includes kitchen and all applicable equipment. BEAR Feeding system provides the capability to prepare, and then serve, 500 meals over a two hour serving period, twice per day (24 hour period). The Feeding system is worldwide deployable and supports numerous basing options. This system supports initial mission requirements and follow-on high mobility feeding requirements for rapidly deployable mobility packages and other contingencies in all theaters of operation. \n\n10K Fuel Bladder: Collapsible, coated fabric fuel bladders are often used as an auxiliary fuel source for MEP generators. This is especially true for high fuel-consumption prime power generators. \n\nTraining\/Multi-Media Training - Provides BEAR and items for all training sites and funds for all required BEAR multi-media training requirements.\n\nProgram element associated with this P-1 Line is: 0401135F."
        },
        "Justification": {
            "val": "FY17 procurement dollars in the amount of $8.146M procures 18 Large Area Maintenance Shelters (LAMS), 4 9-2 Feeding Units, and PMA in Support of Installation and unit mission requirements for Air Force personnel."
        },
        "ItemExhibitList": {
            "P40AItemGroup": [
                {
                    "Name": {
                        "val": "Mobility Equipment"
                    },
                    "CategoryList": {
                        "Category": [
                            {
                                "Name": {
                                    "val": "Uncategorized"
                                },
                                "ItemList": {
                                    "Item": [
                                        {
                                            "Name": {
                                                "val": "POWER GENERATION"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "82"
                                                    },
                                                    "PriorYear": {
                                                        "val": "74"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "8"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "46.203"
                                                    },
                                                    "PriorYear": {
                                                        "val": "44.955"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.4"
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "val": "0"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "563447.06"
                                                    },
                                                    "PriorYear": {
                                                        "val": "607500"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "50000"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "HYGIENE"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "8"
                                                    },
                                                    "PriorYear": {
                                                        "val": "20"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "67"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "3.104"
                                                    },
                                                    "PriorYear": {
                                                        "val": "8"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "26.8"
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "val": "0"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "388000"
                                                    },
                                                    "PriorYear": {
                                                        "val": "400000"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "400000"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "HYGIENE SHELTER"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "208"
                                                    },
                                                    "PriorYear": {
                                                        "val": "80"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "268"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "2.78"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.927"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "3.104"
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "val": "0"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "13364.37"
                                                    },
                                                    "PriorYear": {
                                                        "val": "11582"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "11582"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "10K FUEL BLADDER"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "CurrentYear": {
                                                        "val": "30"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "CurrentYear": {
                                                        "val": "0.42"
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "val": "0"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "CurrentYear": {
                                                        "val": "14000"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "FEEDING - 9-2"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "AllPriorYears": {
                                                        "val": "2"
                                                    },
                                                    "PriorYear": {
                                                        "val": "16"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "45"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "4"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "4"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "1"
                                                    },
                                                    "PriorYear": {
                                                        "val": "8"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "21.184"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "2.035"
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "val": "0"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "2.035"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "AllPriorYears": {
                                                        "val": "500000"
                                                    },
                                                    "PriorYear": {
                                                        "val": "500000"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "470750"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "508750"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "508750"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "FEEDING - EEK"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "CurrentYear": {
                                                        "val": "30"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "CurrentYear": {
                                                        "val": "7.5"
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "val": "0"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "CurrentYear": {
                                                        "val": "250000"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "LARGE AREA MAINTENANCE SHELTERS (LAMS)"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "Quantity": {
                                                    "BudgetYearOneBase": {
                                                        "val": "18"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "18"
                                                    }
                                                },
                                                "TotalCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "4.623"
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "val": "0"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "4.623"
                                                    }
                                                },
                                                "UnitCost": {
                                                    "BudgetYearOneBase": {
                                                        "val": "256833"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "256833"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "NON RECURRING COST"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "3"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "PMA - OTHER GOVERNMENT COST"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "0.074"
                                                    },
                                                    "PriorYear": {
                                                        "val": "0.074"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "0.074"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.054"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.054"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "PMA- CONTRACTOR SERVICES"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "1.07"
                                                    },
                                                    "PriorYear": {
                                                        "val": "1.07"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "1.07"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "1.022"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "1.022"
                                                    }
                                                }
                                            }
                                        },
                                        {
                                            "Name": {
                                                "val": "TRANSPORTATION"
                                            },
                                            "ItemNumber": [],
                                            "IdCode": {
                                                "val": "A"
                                            },
                                            "ResourceSummary": {
                                                "TotalCost": {
                                                    "AllPriorYears": {
                                                        "val": "2.082"
                                                    },
                                                    "PriorYear": {
                                                        "val": "1.908"
                                                    },
                                                    "CurrentYear": {
                                                        "val": "1.698"
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "val": "0.412"
                                                    },
                                                    "BudgetYearOne": {
                                                        "val": "0.412"
                                                    }
                                                }
                                            }
                                        }
                                    ]
                                },
                                "CategorySubtotal": {
                                    "TotalCost": {
                                        "AllPriorYears": {
                                            "val": "59.312"
                                        },
                                        "PriorYear": {
                                            "val": "64.934"
                                        },
                                        "CurrentYear": {
                                            "val": "62.25"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "8.146"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0"
                                        },
                                        "BudgetYearOne": {
                                            "val": "8.146"
                                        }
                                    }
                                }
                            }
                        ]
                    },
                    "Remarks": {
                        "val": "Unit Costs for FY17 are assumed and subject to change."
                    },
                    "TotalCost": {
                        "TotalCost": {
                            "AllPriorYears": {
                                "val": "59.312"
                            },
                            "PriorYear": {
                                "val": "64.934"
                            },
                            "CurrentYear": {
                                "val": "62.25"
                            },
                            "BudgetYearOneBase": {
                                "val": "8.146"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "8.146"
                            }
                        }
                    }
                }
            ]
        },
        "DocumentAssemblyOptions": {
            "p40AItemScheduleSetting": {
                "val": "total"
            }
        }
    }
}