{
    "id": "039093ba5033a38f7808221587ac477096e283fb",
    "meta": {
        "filename": "dod-2016_RDTE_2016_AIRFORCE_V1_RDTE_JustificationBook_Air_Force_PB_2016.zzz_unzipped_RDTE_JustificationBook_Air_Force_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603112F"
        },
        "ProgramElementTitle": {
            "val": "Advanced Materials for Weapon Systems"
        },
        "R1LineNumber": {
            "val": "14"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "53.593"
            },
            "CurrentYear": {
                "val": "40.177"
            },
            "BudgetYearOne": {
                "val": "37.665"
            },
            "BudgetYearOneBase": {
                "val": "37.665"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "36.284"
            },
            "BudgetYearThree": {
                "val": "37.012"
            },
            "BudgetYearFour": {
                "val": "38.251"
            },
            "BudgetYearFive": {
                "val": "39.545"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program develops and demonstrates materials technology for transition into Air Force systems.  The program has four projects which develop: hardened materials technologies for the protection of aircrews and sensors; non-destructive inspection and evaluation technologies; transition data on structural and non-structural materials for aerospace applications; and airbase operations technologies including deployable base infrastructure, force protection, and fire fighting capabilities. Efforts in the program have been coordinated through the Department of Defense Science and Technology Executive Committee process to harmonize efforts and eliminate duplication. \n\nThis program is in Budget Activity 3, Advanced Technology Development because this budget activity includes development of subsystems and components and efforts to integrate subsystems and components into system prototypes for field experiments and\/or tests in a simulated environment."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "54.572"
                },
                "CurrentYear": {
                    "val": "32.177"
                },
                "BudgetYearOne": {
                    "val": "39.975"
                },
                "BudgetYearOneBase": {
                    "val": "39.975"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "53.593"
                },
                "CurrentYear": {
                    "val": "40.177"
                },
                "BudgetYearOne": {
                    "val": "37.665"
                },
                "BudgetYearOneBase": {
                    "val": "37.665"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.979"
                },
                "CurrentYear": {
                    "val": "8.000"
                },
                "BudgetYearOne": {
                    "val": "-2.310"
                },
                "BudgetYearOneBase": {
                    "val": "-2.310"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "8.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.897"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.082"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-2.310"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.310"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Decrease in FY16 due to higher DoD priorities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "632100"
                    },
                    "ProjectTitle": {
                        "val": "Laser Hardened Materials"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "22.330"
                        },
                        "CurrentYear": {
                            "val": "17.285"
                        },
                        "BudgetYearOne": {
                            "val": "15.629"
                        },
                        "BudgetYearOneBase": {
                            "val": "15.629"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "17.145"
                        },
                        "BudgetYearThree": {
                            "val": "16.986"
                        },
                        "BudgetYearFour": {
                            "val": "17.349"
                        },
                        "BudgetYearFive": {
                            "val": "17.693"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops and demonstrates advanced materials technologies that enhance protection for Air Force aircrews to ensure safety and to enable aircrews to perform required missions in threat environments.  Advanced materials technologies are also developed and demonstrated to enhance protection for Air Force sensors and systems to ensure safety, survivability, and operability in threat environments."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Aerospace Systems Protection"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate materials technologies that enhance hardening for sensors, avionics, and components to increase survivability and mission effectiveness of aerospace systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.800"
                                            },
                                            "Text": {
                                                "val": "Demonstrated strategies to mitigate directed energy damage for visual\/near-infrared (NIR), short wave infrared (SWIR), and mid wave infrared (MWIR) detectors critical to Intelligence, Surveillance, and Reconnaissance (ISR) sensors. Demonstrated damage-limiting semiconductor materials in a test bed configuration representing protection of both visual\/NIR and SWIR sensors.  Employed computation materials science to model material characteristics to increase accuracy and shorten design cycle time of coatings and dyes for use in sensor hardening. Conducted an air systems airframe and anti-access munitions hardening assessment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.161"
                                            },
                                            "Text": {
                                                "val": "Continue to advance development of protection materials for visual\/NIR ISR Sensors. Validate and demonstrate use of protection technologies for future ISR sensor designs and strategies to mitigate directed energy damage for visual\/NIR, SWIR, and MWIR detectors. Continue to develop survivable electro-optic sensors that provide full spectrum protection for missile warning. Continue evaluating the performance impact of damage-limiting semiconductor materials designed to harden electro-optic imaging sensors. Continue to develop laser countermeasures for survivability of dynamic electro-optional and infrared (EO\/IR) imagers. Validate and continue to employ computation materials science to model materials characteristics to increase accuracy and shorten design cycle time of coatings for use in sensor hardening. Initiate air systems airframe and anti-access munitions hardening assessment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.379"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.379"
                                            },
                                            "Text": {
                                                "val": "Continue development of protection materials for visual\/NIR ISR Sensors. Demonstrate use of protection technologies for future ISR sensor designs and strategies to mitigate directed energy damage for visual\/NIR, SWIR, and MWIR detectors. Develop survivable electro-optic sensors that provide full spectrum protection for missile warning. Continue evaluating the performance impact of damage-limiting semiconductor materials designed to harden electro-optic imaging sensors. Develop laser countermeasures for survivability of dynamic electro-optional and infrared (EO\/IR) imagers. Continue to employ computation materials science to model materials characteristics to increase accuracy and shorten design cycle time of coatings for use in sensor hardening. Initiate air systems airframe and anti-access munitions hardening assessment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aircrew Protection"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate materials technologies that enhance protection for Air Force aircrews to ensure safety and to enable aircrews to perform required missions in a threat environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.530"
                                            },
                                            "Text": {
                                                "val": "Developed and demonstrated personnel protection technologies for night-time operation across the visible\/NIR and SWIR spectral bands.  Fabricated and demonstrated performance of agile optical coatings and dyes for use in night-time applications.  Characterized eye protection technologies using computational materials science tools.  Insured process repeatability and performed demonstrations of personnel protection technologies in realistic operation environments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.124"
                                            },
                                            "Text": {
                                                "val": "Develop and demonstrate laser protection materials and technologies for personnel protection.  Continue development of helmet mounted sensor hardening materials.  Continue development of visor based aircrew protection materials.  Characterize eye protection technologies using computational materials science tools. Continue to improve functionality and performance of personnel protection technologies in expected operational conditions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.250"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.250"
                                            },
                                            "Text": {
                                                "val": "Continue to develop and demonstrate laser protection materials and technologies for personnel protection. Validate and continue development of helmet mounted sensor hardening materials. Continue to advance development of visor based aircrew protection materials. Characterize and demonstrate eye protection technologies using computational materials science tools. Demonstrate and continue to improve functionality and performance of personnel protection technologies in expected operational conditions."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "633153"
                    },
                    "ProjectTitle": {
                        "val": "Non-Destructive Inspection Development"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.450"
                        },
                        "CurrentYear": {
                            "val": "5.275"
                        },
                        "BudgetYearOne": {
                            "val": "5.029"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.029"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "6.350"
                        },
                        "BudgetYearThree": {
                            "val": "6.331"
                        },
                        "BudgetYearFour": {
                            "val": "6.423"
                        },
                        "BudgetYearFive": {
                            "val": "6.550"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops and demonstrates advanced nondestructive inspection\/evaluation technologies to monitor performance integrity and to detect failure causing conditions in weapon systems components and materials. Nondestructive inspection\/evaluation capabilities greatly influence and\/or limit many design, manufacturing, and maintenance practices.  This project provides technology to satisfy Air Force requirements to extend the lifetime of current systems through increased reliability and cost-effectiveness at field and depot maintenance levels.  Equally important is assuring manufacturing quality, integrity, and safety requirements."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Engine Inspection Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate advanced technologies to improve capabilities to inspect for cracks and other damage to extend the total safe life of turbine engines."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.036"
                                            },
                                            "Text": {
                                                "val": "Continued development of novel, whole-field nondestructive inspection\/evaluation approaches to nondestructively assess material and damage state of critical turbine engine components for the purpose of extending the useful life without increasing risk of in-flight failure of fracture to critical gas turbine engine components."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.298"
                                            },
                                            "Text": {
                                                "val": "Continue development of nondestructive inspection\/evaluation approaches to nondestructively assess material and damage state of critical turbine engine components for the purpose of extending the useful life without increasing risk of in-flight failure of fracture critical to gas turbine engine components."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.237"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.237"
                                            },
                                            "Text": {
                                                "val": "Demonstrate nondestructive inspection\/evaluation approaches to nondestructively assess material and damage state of critical turbine engine components for the purpose of extending the useful life without increasing risk of in-flight failure of fracture critical to gas turbine engine components."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Low-Observable Inspection Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate advanced inspection technologies supporting low-observable (LO) systems to enhance affordability and ensure full performance and survivability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.927"
                                            },
                                            "Text": {
                                                "val": "Validated handheld inspection method and sensor system for signature and material integrity assessment of existing and next generation LO material systems. Validated that the handheld nondestructive inspection tool can identify damage and register position relative to an aircraft, enabling more affordable signature assessment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.985"
                                            },
                                            "Text": {
                                                "val": "Initiate development of improved methods to acquire and analyze data to facilitate improved characterization, registration, and tracking of degradation and damage of LO materials that enables\/ensures more affordable signature assessment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.939"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.939"
                                            },
                                            "Text": {
                                                "val": "Continue development of improved methods to acquire and analyze data to facilitate improved characterization, registration, and tracking of degradation and damage of LO materials that enables\/ensures more affordable signature assessment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced System Monitoring Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate advanced systems status monitoring technologies to provide on-board and embedded sensing to gain continuous awareness of the state of key subsystems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.487"
                                            },
                                            "Text": {
                                                "val": "Transitioned augmented field and depot-level inspection technologies for assessing the structural integrity of airframes. Integrated computational materials science tools with life prediction methods to increase accuracy of life prediction. Continued to demonstrate and transition advanced turbine engine process\/status monitoring technologies to enable adaptive functions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.992"
                                            },
                                            "Text": {
                                                "val": "Validate improved field and depot-level nondestructive inspection\/evaluation technologies and methodologies for assessing the structural integrity of airframes. Validate improved nondestructive inspection\/evaluation methods to minimize maintenance burden to access critical, hard to reach locations on aircraft structures. Initiate enhanced methods for collecting and analyzing digital nondestructive inspection\/evaluation data necessary for improved damage detection and characterization. Validate the integration of computational materials science tools with life prediction methods to enable risk-based life management. Validate technologies to analyze materials state awareness and prevent corrosion. Initiate development of digitally enhanced nondestructive inspection\/evaluation techniques."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.853"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.853"
                                            },
                                            "Text": {
                                                "val": "Transition improved field and depot-level nondestructive inspection\/evaluation technologies and methodologies for assessing the structural integrity of airframes. Transition improved nondestructive inspection\/evaluation methods to minimize maintenance burden to access critical, hard to reach locations on aircraft structures. Continue enhanced methods for collecting and analyzing digital nondestructive inspection\/evaluation data necessary for improved damage detection and characterization. Demonstrate the integration of computational materials science tools with life prediction methods to enable risk-based life management. Demonstrate technologies to analyze materials state awareness and prevent corrosion. Continue development of digitally enhanced nondestructive inspection\/evaluation techniques."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "633946"
                    },
                    "ProjectTitle": {
                        "val": "Materials Transition"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "25.813"
                        },
                        "CurrentYear": {
                            "val": "17.617"
                        },
                        "BudgetYearOne": {
                            "val": "17.007"
                        },
                        "BudgetYearOneBase": {
                            "val": "17.007"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "12.789"
                        },
                        "BudgetYearThree": {
                            "val": "13.695"
                        },
                        "BudgetYearFour": {
                            "val": "14.479"
                        },
                        "BudgetYearFive": {
                            "val": "15.302"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops and demonstrates advanced materials and processing technologies for fielded and planned Air Force weapon, airframe, and propulsion applications.  Advanced materials and processes that have matured beyond applied research are characterized, critical data are collected, and critical evaluations in the proposed operating environment are performed.  This design and scale-up data improves the overall affordability of promising materials and processing technologies, providing needed initial incentives for their industrial development."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Materials Research and Technology"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "10.000"
                                        },
                                        "Text": {
                                            "val": "Conduct Congressionally-directed effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Metals Affordability Research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "5.000"
                                        },
                                        "Text": {
                                            "val": "Conduct Congressionally-directed effort."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "8.000"
                                        },
                                        "Text": {
                                            "val": "Conduct Congressionally directed effort."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Air Vehicle Materials Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate materials and processes technologies for air vehicle and subsystems to enhance lift, propulsion, LO performance, power generation management, and affordability of air vehicles."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.178"
                                            },
                                            "Text": {
                                                "val": "Continued to advance validation of processing methods and lifing tools for ceramic matrix composites and graded microstructure turbine engine disk concepts. Continued validation and initiated transition of next generation nondestructive inspection\/evaluation sensor systems for advanced LO material systems. Continued to advance development of magnetoresistive sensing technologies. Initiated integration of damage characterization with risk-based life management strategies for turbine engines.  Initiated development of materials and processes to increase LO materials affordability."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.213"
                                            },
                                            "Text": {
                                                "val": "Validate processing methods and lifing tools for ceramic matrix composites and graded microstructure turbine engine disk concepts. Demonstrate repeatability of magnetoresistive sensing technologies. Continue integration of damage with risk-based life management strategies for turbine engines.  Continue development of materials and processes to increase LO materials affordability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.524"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.524"
                                            },
                                            "Text": {
                                                "val": "Demonstrate processing methods and lifing tools for ceramic matrix composites and graded microstructure turbine engine disk concepts. Continue demonstration of repeatability of magnetoresistive sensing technologies. Integrate damage with risk-based life management strategies for turbine engines.  Continue development of materials and processes to increase LO materials affordability."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Temperature Material Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate affordable, novel high temperature materials\/structures and thermal management concepts to enable future defense capabilities for prompt global strike concepts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.635"
                                            },
                                            "Text": {
                                                "val": "Developed and demonstrated multimaterial structures to optimally address operational temperature zones for hot structure and expendable thermal protection systems made out of advanced ceramics, ceramic matrix composites, hybrids, advanced metals, and intermetallics.  Continued development of 2700F ceramic matrix composites for turbine hot section components."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.404"
                                            },
                                            "Text": {
                                                "val": "Initiate validation of repeatability of multimaterial structures to optimally address operational temperature zones for hot structure and expendable thermal protection systems made out of advanced ceramics, ceramic matrix composites, hybrids, advanced metals, and intermetallics.  Validate 2700F ceramic matrix composites for turbine hot section components."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.483"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.483"
                                            },
                                            "Text": {
                                                "val": "Validate repeatability of multimaterial structures to optimally address operational temperature zones for hot structure and expendable thermal protection systems made out of advanced ceramics, ceramic matrix composites, hybrids, advanced metals, and intermetallics.  Demonstrate 2700F ceramic matrix composites for turbine hot section components."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Adapative Turbine Engine Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate material and process technologies to increase power and efficiency for adaptive turbine engine propulsion and subsystem integration."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "Completed materials and production process assessments for an adaptive turbine engine prototype."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Work completed in FY14."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Work completed in FY14."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}