{
    "id": "0480010877a41a667a485b0790e205ece8a8e3f8",
    "meta": {
        "filename": "dod-2016_RDTE_2016_AIRFORCE_V3B_RDTE_JustificationBook_Air_Force_PB_2016.zzz_unzipped_RDTE_JustificationBook_Air_Force_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0305208F"
        },
        "ProgramElementTitle": {
            "val": "Distributed Common Ground\/Surface Systems"
        },
        "R1LineNumber": {
            "val": "211"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "6.321"
            },
            "CurrentYear": {
                "val": "26.994"
            },
            "BudgetYearOne": {
                "val": "22.784"
            },
            "BudgetYearOneBase": {
                "val": "22.784"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "21.687"
            },
            "BudgetYearThree": {
                "val": "26.677"
            },
            "BudgetYearFour": {
                "val": "22.357"
            },
            "BudgetYearFive": {
                "val": "22.757"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "In FY 2016,PE 0305208F, Project 676025, Data Compression, will be transferred to PE 0305206F,the Airborne Reconnaissance System Program to better align the program with like RDT&E efforts.\n\nThe FY2016 funding request was reduced by $1.918 million to account for the availability of prior execution balances."
        },
        "ProgramElementMissionDescription": {
            "val": "AF Distributed Common Ground Systems (DCGS) is a network-centric weapon system capable of tasking Intelligence, Surveillance and Reconnaissance (ISR) sensors and receiving, and providing the Processing, Exploitation, and Dissemination (PED) capability for data, information and intelligence from airborne, national, and commercial platforms and sensors. The weapon system consists of numerous active duty, Air National Guard, and mission partner sites interconnected by a robust communications infrastructure that allows collaborative reach-back operations.  Operators correlate collected Geospatial Intelligence (GEOINT), Signals Intelligence (SIGINT), and Measurement and Signature Intelligence (MASINT) data to provide decision-quality information to the Joint Task Force (JTF) and below, including significant support to time-critical targeting. AF DCGS is the primary PED capability for the U-2, Global Hawk, Predator, Reaper and Project Liberty (through 2015).\n\nAF DCGS is modernizing through sustainment by integrating the necessary technologies and tools to provide increased capabilities and meet emerging and urgent operational needs.  These efforts will also integrate commercial and government furnished equipment upgrades to provide current technologies and achieve necessary application services.  The next series of upgrades will meet the operational need to integrate new and\/or improved sensor capabilities.  They will also enhance interoperability by migrating to a Service Oriented Architecture (SOA)and improving data sharing ability per DoD direction.\n\nThe DCGS Data Compression effort provides the warfighter a capability to efficiently compress and decompress airborne ISR sensor data and transmit near real-time to tactical users through current and future bandwidth limited commercial satellite communications (SATCOM) or military SATCOM.  The effort will develop, test and implement new sensor data compression and decompression algorithms for current and emerging airborne ISR sensors.  Additionally, the program develops compression and decompression capabilities for manned and unmanned airborne platforms, associated ground stations, and DCGS.   Outputs will meet standard certification for use within the DoD GEOINT and MASINT architectures.\n\nActivities include studies and analysis to support both current program planning and execution and future program planning.\n\nThis program is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "6.321"
                },
                "CurrentYear": {
                    "val": "27.265"
                },
                "BudgetYearOne": {
                    "val": "24.702"
                },
                "BudgetYearOneBase": {
                    "val": "24.702"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "6.321"
                },
                "CurrentYear": {
                    "val": "26.994"
                },
                "BudgetYearOne": {
                    "val": "22.784"
                },
                "BudgetYearOneBase": {
                    "val": "22.784"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "-0.271"
                },
                "BudgetYearOne": {
                    "val": "-1.918"
                },
                "BudgetYearOneBase": {
                    "val": "-1.918"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "-0.271"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-1.918"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.918"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The FY2016 funding request was reduced by $1.918 million to account for the availability of prior execution balances."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "674826"
                    },
                    "ProjectTitle": {
                        "val": "Common Imagery Ground \/ Surface Systems"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.294"
                        },
                        "CurrentYear": {
                            "val": "19.483"
                        },
                        "BudgetYearOne": {
                            "val": "22.784"
                        },
                        "BudgetYearOneBase": {
                            "val": "22.784"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "21.687"
                        },
                        "BudgetYearThree": {
                            "val": "26.677"
                        },
                        "BudgetYearFour": {
                            "val": "22.357"
                        },
                        "BudgetYearFive": {
                            "val": "22.757"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "AF Distributed Common Ground Systems (DCGS) is a network-centric weapon system capable of tasking Intelligence, Surveillance and Reconnaissance (ISR) sensors and receiving and providing the Processing, Exploitation, and Dissemination (PED) capability for data, information and intelligence from airborne, national, and commercial platforms and sensors. The weapon system consists of numerous active duty, Air National Guard, and mission partner sites interconnected by a robust communications infrastructure that allows collaborative reach-back operations.  Operators correlate collected Geospatial Intelligence (GEOINT), Signals Intelligence (SIGINT), and Measurement and Signature Intelligence (MASINT) data to provide decision-quality information to the Joint Task Force (JTF) and below, including significant support to time-critical targeting. AF DCGS is the primary PED capability for the U-2, Global Hawk, Predator, Reaper and Project Liberty (through 2015).\n\nAF DCGS is modernizing through sustainment by integrating the necessary technologies and tools to provide increased capabilities and meet emerging and urgent operational needs.  These efforts will also integrate commercial and government furnished equipment upgrades to provide current technologies and achieve necessary application services.  The next series of upgrades will meet the operational need to integrate new and\/or improved sensor capabilities.  They will also enhance interoperability by migrating to a Service Oriented Architecture (SOA) and improving data sharing ability per DoD direction.\n\nProgram actions are categorized by four distinct efforts. The GEOINT effort provides the capability for Planning, Collecting, Processing, Analysis and Dissemination (PCPAD) of imagery intelligence.  The Systems Release effort provides this capability for SIGINT. The Data Links effort provides Line-of-Site (LOS) and Satellite Communications (SATCOM) capabilities that allow AF DCGS to send and receive information between airborne Intelligence, Surveillance, and Reconnaissance (ISR) assets and the AF DCGS weapon system. The Network Communications effort involves modernizing AF DCGS infrastructure to improve data ingest, transfer, and storage capabilities while migrating the network toward a cloud architecture.\n \nAF DCGS also participates in the development, testing, and implementation of international standards (to include NATO standardization agreements) to ensure joint, allied, and coalition interoperability."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Geospatial Intelligence (GEOINT)"
                                    },
                                    "Description": {
                                        "val": "Integrate new and improved sensors for exploitation and analysis of imagery and geospatial information."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Continued efforts to meet operational need to integrate new and improved sensors, increase capacity and imagery and geospatial data availability, and comply with DoD direction to improve interoperability through migration to a Service Oriented Architecture (SOA) construct."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "Continuing efforts to meet operational need to integrate new and improved sensors, increase capacity and imagery and geospatial data availability, virtualize sensor processing and comply with DoD direction to improve interoperability through migration to a Service Oriented Architecture (SOA) construct.  This includes integrating upgraded versions of electro-optical and synthetic aperture radar sensors."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.340"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.340"
                                            },
                                            "Text": {
                                                "val": "Will continue efforts to meet operational need to integrate new and improved sensors, increase capacity and imagery and geospatial data availability, and comply with DoD direction to improve interoperability through migration to a Service Oriented Architecture (SOA) construct.This will include integrating upgraded versions of electro-optical and synthetic aperture radar sensors."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Systems Release (SR)"
                                    },
                                    "Description": {
                                        "val": "Continue efforts to meet operational need to integrate new and improved sensors, increase capacity and signals intelligence data availability, and comply with DoD direction to improve interoperability through migration to a Service Oriented Architecture (SOA) construct."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Continued efforts to meet operational need to integrate new and improved sensors, increase capacity and signals intelligence data availability, and comply with DoD direction to improve interoperability through migration to a Service Oriented Architecture (SOA) construct."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Continuing efforts to meet operational need to integrate new and improved sensors, increase capacity and signals intelligence data availability, and comply with DoD direction to improve interoperability through migration to a Service Oriented Architecture (SOA) construct. A major effort will involve beginning to virtualize the SIGINT capability throughout the weapon system."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.744"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.744"
                                            },
                                            "Text": {
                                                "val": "Will continue efforts to meet operational need to integrate new and improved sensors, increase capacity and signals intelligence data availability, and comply with DoD direction to improve interoperability through migration to a Service Oriented Architecture (SOA) construct."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Data Links"
                                    },
                                    "Description": {
                                        "val": "Upgrade the AF DCGS capability to transmit and receive information via data link architecture."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.700"
                                            },
                                            "Text": {
                                                "val": "Continued upgrading AF DCGS capability to transmit and receive information via data link architecture. This included integrating improved SATCOM terminals."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Continuing to upgrade AF DCGS capability to transmit and receive information via data link architecture. This will include integrating improved SATCOM terminals."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "Will continue upgrading AF DCGS capability to transmit and receive information via data link architecture. This will include integrating improved SATCOM terminals."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Network Communications (NETCOMMS)"
                                    },
                                    "Description": {
                                        "val": "Upgrade and evolve the AF DCGS communications network across the various architectures."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.594"
                                            },
                                            "Text": {
                                                "val": "Continued to upgrade and evolve the AF DCGS communications network across the various architectures."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.483"
                                            },
                                            "Text": {
                                                "val": "Continuing to upgrade and evolve the AF DCGS communications network across the various architectures establishing capabilities for remote hardware and software management. This will include initial effort to modernize the wide area network and extend the high speed data transport capability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.700"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.700"
                                            },
                                            "Text": {
                                                "val": "Will Continue to upgrade and evolve the AF DCGS communications network across the various architectures establishing capabilities for remote hardware and software management. This will include continuing efforts to modernize the wide area network and extend the high speed data transport capability."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPAF: BA07: Line Item #: 846080"
                                    },
                                    "Title": {
                                        "val": "DCGS-AF"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "97.149"
                                        },
                                        "CurrentYear": {
                                            "val": "181.556"
                                        },
                                        "BudgetYearOne": {
                                            "val": "157.402"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "157.402"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "140.488"
                                        },
                                        "BudgetYearThree": {
                                            "val": "142.839"
                                        },
                                        "BudgetYearFour": {
                                            "val": "134.024"
                                        },
                                        "BudgetYearFive": {
                                            "val": "129.234"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Air Force has changed the AF DCGS acquisition strategy from a single block upgrade to programs that will deliver the following families of capabilities to the fielded baseline while meeting emerging operational requirements and continuing to develop and integrate new\/upgraded sensors:  GEOINT, Systems Release Upgrades, Data Links, and NetComms."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Geospatial Intelligence (GEOINT) Upgrades"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various,"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.840"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.840"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-02"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.840"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "System Release Upgrades"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various,"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "13.744"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "13.744"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-03"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "13.744"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Datalink Upgrades"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various,"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.700"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.700"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-05"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.400"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Network Communications Upgrade"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various,"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.022"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "15.283"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.700"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.700"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "22.005"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "PMA"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various,"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.572"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-09"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-09"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.500"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-09"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "TBD"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Geospatial Intelligence (GEOINT) Upgrades"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Systems Release Upgrades"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Datalink Upgrades"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Network Communications upgrades"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "676025"
                    },
                    "ProjectTitle": {
                        "val": "Data Compression"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.027"
                        },
                        "CurrentYear": {
                            "val": "7.511"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "In FY 2016, PE 0305208F, Project 676025, Data Compression, will be transferred to PE 0305206F,the Airborne Reconnaissance System Program to better align the program with like RDT&E efforts."
                        },
                        "ProjectMissionDescription": {
                            "val": "This initiative will provide the warfighter a capability to efficiently compress and decompress airborne ISR sensor data and transmit near real-time to tactical users through current and future bandwidth limited commercial SATCOM or military SATCOM.  The effort will develop, test and implement new sensor data compression and decompression algorithms for current and emerging airborne ISR sensors.  Additionally, the program develops compression and decompression for manned and unmanned airborne platforms, associated ground stations, data storage and the DCGS.  The effort includes life-cycle sustainment of airborne hardware & software including updates and integration support.  Algorithms will be suitable for service-wide use within the DoD GEOINT and MASINT architectures as part of ISR enterprise standards."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Data Compression"
                                    },
                                    "Description": {
                                        "val": "The program began developing and testing compression and decompression algorithms for airborne ISR sensor data.  The program will eventually build, integrate and test sensor specific hardware (with the algorithms embedded) for onboard data compression.  The effort initially focused on compression and decompression of complex and detected Synthetic Aperture Radar (SAR) data followed by applications of compression technologies to other DoD IMINT\/MASINT sensor data (Spectral, Electro-Optical\/Infrared (EO\/IR), Light Detection and Ranging (LIDAR), Phase History SAR) and ground architecture.  Algorithms will be suitable for service-wide use as part of ISR enterprise standards."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.027"
                                            },
                                            "Text": {
                                                "val": "Continued second phase development and evaluation of complex\/detected SAR, spectral, LIDAR, & Persistent EO\/IR sensor data compression capabilities at a reduced level of effort."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.511"
                                            },
                                            "Text": {
                                                "val": "Increase development and testing of complex\/detected SAR, spectral (HSI\/MSI), LIDAR, Persistent EO\/IR data compression capabilities, and other phenomenologies.  Will begin developing and testing compression and decompression algorithms for Phase History SAR.  Will also begin technology demonstration effort and cooperative platform integration."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Data Compression acquisition approach is to design and develop compression and decompression technology hardware and software components, interfaces and standards for various airborne ISR platforms, ground stations, data storage facilities, and exploitation tools utilizing existing contracts with full and open competition where appropriate.  Integration will be accomplished by the requisite program offices with data compression specific integration support provided."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Technology Development- Phase History"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD,"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.300"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.300"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Technolgy Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD,"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.721"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.721"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Technology Development- AFRL Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various,"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-06"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Technology Development- Other Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various,"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.300"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-02"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Office Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Govt\/Contractors"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD,"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.027"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.690"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.717"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Phase History SAR Phase 1"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SAR Phase 2 Compression"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "HSI Phase 2 Compression"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "SAR Phase 2 Compression Demonstration"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "HSI Phase 2 Compression Demonstration"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}