{
    "id": "08ea65c9a3881947b6d7b6b851a4a62b43b86d3c",
    "meta": {
        "filename": "dod-2016_RDTE_2016_ARMY_BA6_RDTE_JustificationBook_Army_PB_2016.zzz_unzipped_RDTE_JustificationBook_Army_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605326A"
        },
        "ProgramElementTitle": {
            "val": "Concepts Experimentation Program"
        },
        "R1LineNumber": {
            "val": "136"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "21.563"
            },
            "CurrentYear": {
                "val": "19.430"
            },
            "BudgetYearOne": {
                "val": "19.430"
            },
            "BudgetYearOneBase": {
                "val": "19.430"
            },
            "BudgetYearTwo": {
                "val": "33.788"
            },
            "BudgetYearThree": {
                "val": "30.722"
            },
            "BudgetYearFour": {
                "val": "29.055"
            },
            "BudgetYearFive": {
                "val": "58.595"
            }
        },
        "ProgramElementNote": {
            "val": "FY 2016 reduction attributed to realignment to other higher priority programs."
        },
        "ProgramElementMissionDescription": {
            "val": "Army Experimentation program supports current and future concepts and capabilities involving Soldiers and Leaders within live, virtual, and constructive environments of exploring concepts, capability requirements and solution across Doctrine, Organization, Training, Materiel, Leadership and Education, personnel, and Facilities (DOTMLPF) domains in order to learn and mitigate risk for current and future forces.  Experiments inform Army future concepts and assess high-risk conceptual assumptions in order to focus required capabilities and represent the user's requirements in the future Army.  Army experiments use the combined resources of Army battle laboratories, operational units, research labs, materiel developers, industry and academia to collaborate in the development, refinements, and assessment of future force concepts - to inform capability developments and validate concepts for current and future force.  Due to significant reduction in funding, beginning in FY 2015, Research, Development, Test and Evaluation (RDT&E) funding will focus on Simulated Experiments (SIMEX) to integrate and assess Army Concepts, Force Designs phases, with Army level issues across the breadth of a campaign that highlights validation and integration of Force 2025 outcomes.\n\nTraining and Doctrine Command (TRADOC) lead for Accelerated Capability Developments (ACD) to address current critical operational needs.  Enable development and deployment\/employment of accelerated capabilities (both materiel and non-materiel) to the current force.  Serve as TRADOC central coordinating organization for Headquarters Department of the Army (HQDA) staff support requirements related to accelerated capabilities developments.  Integrate ACD activities to ensure unity and priority of effort and synchronization and optimization of resources.  Integrate accelerated capabilities development activities between proponent force modernization domains to include Joint\/Service coordination.  Provide specialized capabilities development and integration at TRADOC Center of Excellence (CoE) Capabilities Development and Integration Directorates (CDIDs)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "22.246"
                },
                "CurrentYear": {
                    "val": "19.439"
                },
                "BudgetYearOne": {
                    "val": "22.149"
                },
                "BudgetYearOneBase": {
                    "val": "22.149"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "21.563"
                },
                "CurrentYear": {
                    "val": "19.430"
                },
                "BudgetYearOne": {
                    "val": "19.430"
                },
                "BudgetYearOneBase": {
                    "val": "19.430"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.683"
                },
                "CurrentYear": {
                    "val": "-0.009"
                },
                "BudgetYearOne": {
                    "val": "-2.719"
                },
                "BudgetYearOneBase": {
                    "val": "-2.719"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.009"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.683"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-2.719"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.719"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "312"
                    },
                    "ProjectTitle": {
                        "val": "Army\/Joint Experimentation"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.599"
                        },
                        "CurrentYear": {
                            "val": "2.454"
                        },
                        "BudgetYearOne": {
                            "val": "0.506"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.506"
                        },
                        "BudgetYearTwo": {
                            "val": "0.514"
                        },
                        "BudgetYearThree": {
                            "val": "0.521"
                        },
                        "BudgetYearFour": {
                            "val": "0.532"
                        },
                        "BudgetYearFive": {
                            "val": "0.548"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "Army Experimentation program supports current and future concepts and capabilities involving Soldiers and Leaders within live, virtual, and constructive environments by exploring concepts, capability requirements and solutions across Doctrine, Organization, Training, Materiel, Leadership and Education, Personnel, and Facilities (DOTMLPF) domains in order to learn and mitigate risk for current and future forces.  Experiments inform Army future concepts and assess high-risk conceptual assumptions in order to focus required capabilities and represent the user's requirements in the future Army.  Army experiments use the combined resources of Army battle laboratories, operational units, research labs, materiel developers, industry and academia to collaborate in the development, refinements, and assessment of future force concepts - to inform capability developments and validate concepts for current and future force.  Due to significant reduction in funding, beginning in FY 2015, Research, Development, Test and Evaluation (RDT&E) funding will  partially funds the Army's Simulated Experiment to integrate and assess Army Concepts, Force Designs, and Capabilities.  Specifically the Army's tool to support Force 2025 and Beyond (F2025B) Maneuvers to develop, refine, and validate requisite Force 2025 and Beyond Concepts, Operational and Organizational Plans, and DOTMLPF solution to achieve the vision of the Army's Force in the near (2014-2020), mid (2020-2030) and far (2030-2040) terms."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Experimentation - World Class Blue Force (WCBLUFOR) Analysts"
                                    },
                                    "Description": {
                                        "val": "Experimentation with future concepts requires commanders who understand those concepts, but military personnel are generally proficient in current doctrine, not future Army concepts.  The WCBLUFOR bridge this gap with experienced commanders who are versed in future Army concepts.  These subject matter experts provide technical and tactical expertise, play senior blue roles in experiments, develop orders, train and mentor staff, and provide analytic expertise.  Requisite skill sets that are not available on our Table of Distribution and Allowances (TDA)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.208"
                                            },
                                            "Text": {
                                                "val": "WCBLUFOR assisted and mentored planning, execution and evaluation of experiments supporting Army capstone, operational and functional concepts to provide credible incorporation of concepts into experiments.  WCBLUFOR also supported analysis and coordination for the Army's Campaign of Learning - both what we have learned and what remains to be learned."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Experimentation - Maneuver Brigade Experiments"
                                    },
                                    "Description": {
                                        "val": "Perform maneuver brigade experiments that will address 1) integration of Army in 2020 initiatives;  2) development of future Infantry Bridgade Combat Team (IBCT), Stryker Bridgade Combat Team (SBCT), and Airborne Brigade Combat Team (ABCT) capability Doctrine, Organization, Training, Materiel, Leadership and Education, Personnel and Facilities (DOTMLPF)  requirements and DOTMLPF solutions; and  3) acceleration and integration of capabilities for current force Brigade Combat Teams (BCTs)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.200"
                                            },
                                            "Text": {
                                                "val": "Conducted experiments to address learning demands supporting assigned Army Warfighting Challenges (AWFC).  Results informed the Integrated Learning Plan for each AWFC; specifically supporting concepts and Formation Based Analysis."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Experimentation - High-Fidelity Live-Virtual-Constructive Experiments"
                                    },
                                    "Description": {
                                        "val": "Experiments address concept and capability developments including integration of capabilities for all BCT types; development of future Doctrine, Organization, Training, Materiel, Leadership and Education, Personnel and Facilities (DOTMLPF) requirements and solutions; and acceleration and integration of capabilities for current force Brigade Combat Teams (BCTs) and above brigade."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.191"
                                            },
                                            "Text": {
                                                "val": "Experiments continued to address learning demands supporting critical Army Warfighting Challenges (AWFC); capstone, operational and concepts; and Formation Based Analysis.  Experiments supported learning in order to mitigate risk to Soldiers and developments providing tangible insurance against acquisition failure as well as a means to win the first battle of the next war."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.454"
                                            },
                                            "Text": {
                                                "val": "Simulated Experiments (SIMEX) become the focus to integrate and assess Army Concepts, Force Designs, and Capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.506"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.506"
                                            },
                                            "Text": {
                                                "val": "Simulated Experiments (SIMEX) will become the focus to integrate and assess Army Concepts, Force Designs, and Capabilities to support of Force 2025B Maneuvers to develop, refine, and validate rerequisite Force 2025 and Beyond Concepts, Operational and Organizational Plans, and DOTMLPF solutions to achieve the vision of the Army's Force in the near (2014-2020, mid (2020-2030), and far (2030-2040) terms."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "317"
                    },
                    "ProjectTitle": {
                        "val": "Current Force Capability Gaps"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "14.096"
                        },
                        "CurrentYear": {
                            "val": "15.862"
                        },
                        "BudgetYearOne": {
                            "val": "17.265"
                        },
                        "BudgetYearOneBase": {
                            "val": "17.265"
                        },
                        "BudgetYearTwo": {
                            "val": "31.736"
                        },
                        "BudgetYearThree": {
                            "val": "28.639"
                        },
                        "BudgetYearFour": {
                            "val": "26.939"
                        },
                        "BudgetYearFive": {
                            "val": "56.435"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Programs not funded in FY 2016: Counter Improvised Explosive Device Adapt the Force (AtF), Robotics, Tunnel Detection (TD), Exploitation, Non-Standard Training Gap Initiative, and Squad Dismounted Network Enabled. \n\nNew starts in FY 2016: Maneuver Fires Center Integration Exercise (MFIX) and Manned Unmanned Teaming Ground (MUM-T(G)). \n\nOperational Energy is renamed Net Zero Expeditionary Base Camp in FY 2016. \n\nContractor Year Equivalent (CME) Support to TRADOC Capability Development and Integration Directorates (CDIDs) - CME positions were previously realigned and FY14-18 funds transferred from a variety of RDT&E programs (i.e., PEs: 0605805A-F21; 0604804A-L43; 0604601A-S61; 0604270A-VS6; 0203744A-D17; 0604798A-DV1; 0603778A-090; 0605625A-FC8) into 0605326A-317 during the FY 14 PRESBUD cycle."
                        },
                        "ProjectMissionDescription": {
                            "val": "Training and Doctrine Command (TRADOC) lead for Accelerated Capability Developments (ACD) to address current critical operational needs.  Enable development and deployment\/employment of accelerated capabilities (both materiel and non-materiel) to the current force.  Serve as TRADOC central coordinating organization for Headquarters Department of the Army (HQDA) staff support requirements related to accelerated capabilities developments.  Integrate ACD activities to ensure unity and priority of effort and synchronization and optimization of resources.  Integrate accelerated capabilities development activities between proponent force modernization domains to include Joint\/Service coordination.  Provide specialized capabilities development and integration at TRADOC Centers of Excellence (CoE) Capabilities Development and Integration Directorates (CDIDs)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Counter Improvised Explosive Device Adapt the Force (AtF) (formerly Improvised Explosive Device (IED) Integrated Concept Development Team (ICDT))"
                                    },
                                    "Description": {
                                        "val": "The IED ICDT is responsible for conducting Doctrine, Organization, Training, Materiel, Leadership and Education, Personnel, and Facilities (DOTMLPF) assessments; performs gap analyses identified by HQDA and Joint Urgent Operational Needs Statement (JUONS)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.800"
                                            },
                                            "Text": {
                                                "val": "Led the Adapt the Force efforts under Army Counter-IED (CIED) Strategy supporting development and maintenance of AtF CIED database and resolution of DOTMLPF issues associated with integration of various CIED initiatives.  Was responsible for coordination and facilitating IED-Defeat Council of Colonels and General Officer Steering Committees producing guidance and directives for Army-wide IED-Defeat Training initiative and systems.  Supported TRADOC CoEs with CIED SMEs and products for all CIED Lines of Effort."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Lead the Adapt the Force efforts under Army Counter-IED (CIED) Strategy supporting development and maintenance of AtF CIED database and resolution of DOTMLPF issues associated with integration of various CIED initiatives.  Responsible for coordination and facilitating IED-Defeat Council of Colonels and General Officer Steering Committees producing guidance and directives for Army-wide IED-Defeat Training initiative and systems. Support TRADOC CoEs with CIED SMEs and products for all CIED Lines of Effort."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Operational Energy (formerly Demo\/Assess Operational Power and Energy)"
                                    },
                                    "Description": {
                                        "val": "Funding is needed for Operational Power and Energy"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "Continued acceleration of Operational Energy initiative for remote Combat Outposts and Soldier Power initiatives.  Operational Energy provided the warfighter with increased levels of agility, flexibility, and interoperability when operating in the expeditionary environment.  Operational energy solutions approach extended combat and tactical system's mission endurance and resilience, ensured uninterrupted and optimal energy to systems within the mission command network, and mitigate force risk by reducing energy demand.  Phased two of a multi-phased approach, which supported the development of integrated operational energy solutions. This approach ensured that designs identified and addressed effects on the force when delivering solutions, provided the necessary employment guidance and assessed impacts on operational effectiveness."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Continue acceleration of Operational Energy initiative for remote Combat Outposts and Soldier Power initiatives.  Operational Energy provides the warfighter with increased levels of agility, flexibility, and interoperability when operating in the expeditionary environment.  Operational energy solutions approach extends combat and tactical systems' mission endurance and resilience, ensure uninterrupted and optimal energy to systems within the mission command network, and mitigate force risk by reducing energy demand.  Phase two of multi-phased approached supports development of integrated operational energy solutions, which require a system-of-systems engineering approach.  This approach ensures that designs identify and address effects on the force when delivering solutions provide necessary employment guidance and assess impacts on operational effectiveness."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Army Expeditionary Warrior Experiment (AEWE) (formerly Prototype Solution Demonstrations)"
                                    },
                                    "Description": {
                                        "val": "AEWE addresses live, prototype experimentation requirements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.760"
                                            },
                                            "Text": {
                                                "val": "This campaign of experiments was critical at the Maneuver Center as we conduct research, development, and experimentation to ensure our future Maneuver Force is prepared and equipped to fight and win in a complex operating environment.  Through doctrine development, leveraging emerging technology and partnering with industry, the Maneuver Center is an advocate for the Maneuver Force.  FY14 campaign of experiments, Spiral I, is focused on technologies to support five primary study areas: Cellular Communications, Robotics, Solider Load and Protection, Power Solutions and Resupply."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "This campaign of experiments is critical at the Maneuver Center as we conduct research, development, and experimentation to ensure our future Maneuver Force is prepared and equipped to fight and win in a complex operating environment.  Through doctrine development, leveraging emerging technology and partnering with industry, the Maneuver Center is an advocate for the Maneuver Force.  FY15 campaign of experiments, Spiral J, will be focused on technologies to support five primary study areas: Cellular Communications, Robotics, Solider Load and Protection, Power Solutions and Resupply."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.153"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.153"
                                            },
                                            "Text": {
                                                "val": "This series of experiments is critical to promote research, development, and experimentation associated with Force 2025 and Beyond (F2025B) efforts.  AEWE provides a live prototype experimentation venue to address current operational needs and F2025B requirements.  FY16 campaign of experiments, Spiral K, is focused on technologies to support five primary study areas:  Cellular Communications, Robics, Solider Load and Protection, Power Solutions, and Resupply."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Robotics"
                                    },
                                    "Description": {
                                        "val": "Testing and demonstration of increased unmanned ground vehicle capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.165"
                                            },
                                            "Text": {
                                                "val": "Supported the Army robotics Campaign Plan development, and resolution of DOTMLPF issues associated with integration of various Robotics initiatives.  Was responsible for the Joint Ground Robotics Integration Team meetings. Produced guidance and directives for Army-wide Robotic subject matter experts (SMEs) and products for applicable initiative being resourced and assessed.  Included initiatives directly related to robotics such as operational control units (OCUs) like Tactical Robotic Controller and systems linked to the controllers."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Support the Army robotics Campaign Plan development, and resolution of DOTMLPF issues associated with integration of various Robotics initiatives. Responsible for the Joint Ground Robotics Integration Team meetings.  Producing guidance\/directives for Army-wide Robotic SMEs and products for applicable initiative being resourced and assessed.  To include initiatives directly related to robotics such as operational control units (OCUs) like Tactical Robotic Controller and systems linked to the controllers."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tunnel Detection (TD)"
                                    },
                                    "Description": {
                                        "val": "Test and demonstration of sensor technology."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Test and demonstrate a suite of sensor technology systems capable of detecting, exploiting, and remediating, clandestine purpose-built tunnels."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Exploitation"
                                    },
                                    "Description": {
                                        "val": "Document and Media Exploitation (DOMEX) is the collection and exploitation of captured equipment, documents, and media."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Document and Media Exploitation (DOMEX) enables tactical, operational, and strategic leaders with accurate information about enemy forces through the rapid and accurate extraction, exploitation, and analysis of captured enemy documents, media, and materiel. Tactically, DOMEX is the collection and exploitation of captured equipment, documents, and media to generate actionable intelligence. The DOMEX is a critical part of target exploitation, especially as it relates to actions on the objective during site exploitation activities. Efforts in exploitation also support Special Operations Command (SOCOM) with DOTMLPF assessments of classified solutions supporting technical reconnaissance, and information operations associated with exploitation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Non Standard Training Gap Initiative (formerly Non-Standard Capability Training Gaps)"
                                    },
                                    "Description": {
                                        "val": "Training for accelerated capabilites is accomplished primarily through mandated New Equipment Training (NET) with no process for follow on efforts.  This incongruity is detrimental to effective and consistent training for the force."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.129"
                                            },
                                            "Text": {
                                                "val": "Led the Non Standard Equipment (NSE) training process initiative supporting the development, execution, evaluation, and maintenance of the 2nd pilot program to develop a standardized and effective NSE training process for deployed units.  ARCIC Accelerated Capabilities Division (ACD) was responsible for facilitating and coordinating stakeholders in the execution, evaluation, and maintenance of Pilot Program 2 on the NSE training process."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.162"
                                            },
                                            "Text": {
                                                "val": "Lead the Non Standard Equipment (NSE) training process initiative supporting the development, execution, evaluation, and maintenance of the 2nd pilot program to develop a standardized and effective NSE training process for deployed units.  ARCIC Accelerated Capabilities Division (ACD)  responsible for facilitating and coordinating stakeholders in the execution, evaluation, and maintenance of Pilot Program 2 on the NSE training process."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tower Hawk"
                                    },
                                    "Description": {
                                        "val": "Provides support to development, integration, and equiping of solutions to the field for integrated base defense while providing long range pinpoint offensive action."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.500"
                                            },
                                            "Text": {
                                                "val": "Provided support to development, integration, and equiping of solutions to the field for integrated base defense while providing long range pinpoint offensive action against insurgents identified in hostile acts.  ACD provideds the integration efforts across DOTMLPF as part of coordination and facilitation efforts between Project Offices, TRADOC CoEs, and test agencies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Small Unit Learder Situational Awareness Tool (SULSAT)"
                                    },
                                    "Description": {
                                        "val": "Supports the Army Robotics Campaign Plan initiatives by addressing DOTMLPF issues associated with integration of emerging Robotics initiatives."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.002"
                                            },
                                            "Text": {
                                                "val": "Provided support to the Army Robotics Campaign Plan initiatives by addressing DOTMLPF issues associated with integration of emerging Robotics initiatives such as Small Unit Leader Situational Awareness Tools (SULSAT).  This required cutting-edge technology in multiple fields, including high speed graphics computing, 3-D imaging, virtual reality, and visualization.  This capability help with visualizing internal and external structures of buildings as well as potential threats, and then disseminating that information to soldiers and small-unit leaders."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Black Kite"
                                    },
                                    "Description": {
                                        "val": "Micro Air Vehicle (MAV) with increased sensor capability in support of Army Counter-IED (CIED) Strategy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.740"
                                            },
                                            "Text": {
                                                "val": "Micro Air Vehicle (MAV) with increased sensor capability in support of Army Counter-IED (CIED) Strategy associated with integration of various CIED initiatives.  Supported Army-wide IED-Defeat Training initiatives and systems.  Coordinated and integrated with TRADOC CoEs with CIED SMEs and products for all CIED Line of Efforts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Squad Dismounted Non-Network Enabled"
                                    },
                                    "Description": {
                                        "val": "Provides integration and assessment support across DOTMLPF."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "TRADOC Accelerated Capability Developments initiative provides integration and assessment support across DOTMLPF domains to equip, train, and deploy capability support for OEF problem of isolated maneuver elements at Command Outposts (COPs)\/Forward Operating Bases (FOBs) which have difficulty locating ground targets and lack timely response to engage these targets in organic, lethal, effects while minimizing collateral damage and exposure of Soldiers to unnecessary risk."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Contractor Year Equivalent (CME) Support to TRADOC Capability Development and Integration Directorates (CDIDs)"
                                    },
                                    "Description": {
                                        "val": "Provides CMEs to CDIDs across TRADOC to develop and integrate capabilities."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.700"
                                            },
                                            "Text": {
                                                "val": "Provide approximately 45 CMEs to CDIDs across TRADOC to develop and integrate the capabilities for which the ASA(ALT) community is developing and fielding materiel solutions.  FY14 would have been the first year of incremental funding until 100% of the requirement is funded in FY 2017 and beyond."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.434"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.434"
                                            },
                                            "Text": {
                                                "val": "Will provide approximately 87 CMEs to CDIDs across TRADOC to develop and integrate the capabilities for which the ASA(ALT) community is developing and fielding materiel solution.   FY 2014 would have been the first year of incremental funding until 100% of the requirement is funded in FY 2017 and beyond."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Maneuver Fires Center Integration Exercise (MFIX)"
                                    },
                                    "Description": {
                                        "val": "Maneuver Fires Center Integration Exercise (MFIX) will conduct Doctrine, Organization, Training, Materiel, Leadership and Education, Personnel, and Facilities (DOTMLPF) assessments."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.200"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.200"
                                            },
                                            "Text": {
                                                "val": "MFIX will conduct DOTMLPF assessments; test and certification training in support of small units across 5 domains (lethality, mission command, training and leader development, mobility and force protection).  MFIX will integrate efforts to allow small units to operate in complex and uncertain environments, see and fight across a wide area, make contact with the enemy under favorable conditions, overmatch the enemy in encounter actions, maneuver rapidly to seize and retain the initiative, identify and act on opportunities, adapt rapidly to changing battle conditions, and operate as part of a combined arms, air-ground and Joint Team."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Net Zero Expeditionary Base Camp (NET 0) (Formerly Operational Energy)"
                                    },
                                    "Description": {
                                        "val": "Continue acceleration of Operational Energy initiative for remote Combat Outposts and Soldier Power iniatives."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.275"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.275"
                                            },
                                            "Text": {
                                                "val": "Continue acceleration of Operational Energy initative for remote Combat Outposts and Soldier Power initiatives.  Operational Energy provides the Warfighter with increased levels of agility, flexibility, and interoperability when operating in the expeditionary environment.  Operational energy solutions will extend combat and tactical system's mission endurance and resilience, ensure uninterrupted and optimal energy to systems within the mission command network, and mitigate force risk by reducing energy demand.  Phase two of multi-phased approached will support development of integrated operational energy solutions requiring a system-of-systems engineering approach.  This approach will ensure that capability impacts are identified and addressed prior to delivering solutions, and that necessary employment guidance is provided and operational impacts are assessed."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Manned Unmanned Teaming Ground (MUM-T(G)"
                                    },
                                    "Description": {
                                        "val": "Follow-on focused assessment to test interoperability, assess integration with manned systems, and evaluate advanced technologies."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.203"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.203"
                                            },
                                            "Text": {
                                                "val": "Follow-on focused assessment to test interoperability, assess integration with manned systems, and evaluate advanced technologies.  MUM-T (G) capabilities will provide greater automation, improved performance, flexible use profiles, and greater survivability in contested environments.  In addition, system will demonstrate improved communications, security from tampering, and streamlined system design.  Capabilities must also demonstrate a reduction in manpower requirements to operate and support unmanned systems."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "33B"
                    },
                    "ProjectTitle": {
                        "val": "Soldier-Centered Analyses For Future Force"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.868"
                        },
                        "CurrentYear": {
                            "val": "1.114"
                        },
                        "BudgetYearOne": {
                            "val": "1.659"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.659"
                        },
                        "BudgetYearTwo": {
                            "val": "1.538"
                        },
                        "BudgetYearThree": {
                            "val": "1.562"
                        },
                        "BudgetYearFour": {
                            "val": "1.584"
                        },
                        "BudgetYearFive": {
                            "val": "1.612"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project will provide early application of human performance and human figure modeling tools in the development of Soldier-focused requirements to shape technology for Future Force development. Design analyses, constructive simulations and Soldier-in-the-loop assessments will ensure that manpower requirements and workload and skill demands are considered to avoid information and physical task overloads, and take optimum advantage of aptitudes, individual and collective training, and numbers of Soldiers for an affordable Future Force. The cited work is consistent with the Strategic Planning Guidance, the Army Science and Technology Master Plan (ASTMP), the Army Modernization Plan, and the Defense Technology Area Plan (DTAP). Work in this project is performed by the Army Research Laboratory (ARL)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Manpower and Personnel Integration (MANPRINT)"
                                    },
                                    "Description": {
                                        "val": "Provide dedicated modeling and analysis cell for early and accurate MANPRINT estimates to Army Materiel Command (AMC), Research, Development, and Engineering Command (RDECOM) and its Research, Development, and Engineering Centers (RDECs), TRADOC Centers, Schools and Centers of Excellence (CoEs), Army Test and Evaluation Command (ATEC) and other service laboratories."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.868"
                                            },
                                            "Text": {
                                                "val": "Developed and demonstrated model based links between Systems Engineering (SE) and MANPRINT tools and methods to leverage common data elements and resources to better inform acquisition tradeoff decisions.Developed an analysis methodology to link Human Systems Integratino (HSI) risk mitigation (i.e. specific system design changes) to manpower and health care cost avoidance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.114"
                                            },
                                            "Text": {
                                                "val": "Develop analysis methodologies to quantitatively predict (in dollars and\/or mission success) the effect of manpower, personnel, and training issues in system acquisition to inform optimization of Soldier-system performance and affordability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.659"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.659"
                                            },
                                            "Text": {
                                                "val": "Will develop model-based predictive analyses of Dismounted Infantry (DI) missions that will provide DOD leadership with analytic data to inform requirements development and trade-off decisions as early as Milestone A.  This analyses will integrate Human Systems Integration (HSI) and Systems Engineering (SE) inputs to generate critical tasks combinations that provide the necessary analytical data to support cognitive workload measurement, Measures of Effectiveness and Measures of Performance for DI.  Expand digital library by developing 3D models of Air Soldier Clothing and equipment items to perform early human figure modeling assessments of future aviation platform designs.  Develop 3D models of mounted and dismounted Soldier clothing and equipment items that are sized and fitted to ANTHRO II based human figure model sets for early assessments of future ground vehicle platform designs."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}