{
    "id": "0d819c02fcc593f6ca5637edcb968c708750ea40",
    "meta": {
        "filename": "dod-2016_RDTE_2016_ARMY_BA3_RDTE_JustificationBook_Army_PB_2016.zzz_unzipped_RDTE_JustificationBook_Army_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603606A"
        },
        "ProgramElementTitle": {
            "val": "Landmine Warfare and Barrier Advanced Technology"
        },
        "R1LineNumber": {
            "val": "47"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "22.233"
            },
            "CurrentYear": {
                "val": "13.070"
            },
            "BudgetYearOne": {
                "val": "13.993"
            },
            "BudgetYearOneBase": {
                "val": "13.993"
            },
            "BudgetYearTwo": {
                "val": "17.451"
            },
            "BudgetYearThree": {
                "val": "18.659"
            },
            "BudgetYearFour": {
                "val": "18.644"
            },
            "BudgetYearFive": {
                "val": "18.972"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) matures and demonstrates sensor components, subsystems and neutralization technologies that can be used by dismounted forces,  ground and air platforms to detect, identify and mitigate the effects of landmines, improvised explosive devices, minefields, and other explosive hazards\/threats. This PE also conducts modeling and simulation activities to assess the effectiveness of detection and neutralization concepts. Project 608 supports the maturation and demonstration of enabling component and subsystems for counter explosive hazards and countermine technologies in the areas of countermine and barrier development and Project 683 funds efforts on area denial sensors.  \n\nWork in this PE is fully coordinated with PE 0602120A (Sensors and Electronic Survivability), PE 0602622A (Chemical, Smoke and Equipment Defeating Technology), PE 0602624A (Weapons and Munitions Technology), PE 0602712A (Countermine Systems), PE 0602784A (Military Engineering Technology), PE 0603004 (Weapons and Munitions Advances Technologies), PE 0603270 (Electronic Warfare Technology) and PE 0603710A (Night Vision Advanced Technology).  \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n\nWork in this PE is performed by the U.S. Army Communications-Electronics Research, Development and Engineering Center (CERDEC)\/Night Vision and Electronic Sensors Directorate (NVESD), Fort Belvoir, VA."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "22.794"
                },
                "CurrentYear": {
                    "val": "13.074"
                },
                "BudgetYearOne": {
                    "val": "14.095"
                },
                "BudgetYearOneBase": {
                    "val": "14.095"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "22.233"
                },
                "CurrentYear": {
                    "val": "13.070"
                },
                "BudgetYearOne": {
                    "val": "13.993"
                },
                "BudgetYearOneBase": {
                    "val": "13.993"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.561"
                },
                "CurrentYear": {
                    "val": "-0.004"
                },
                "BudgetYearOne": {
                    "val": "-0.102"
                },
                "BudgetYearOneBase": {
                    "val": "-0.102"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.004"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.561"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.102"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.102"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "608"
                    },
                    "ProjectTitle": {
                        "val": "Countermine & Bar Dev"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "22.233"
                        },
                        "CurrentYear": {
                            "val": "13.070"
                        },
                        "BudgetYearOne": {
                            "val": "12.008"
                        },
                        "BudgetYearOneBase": {
                            "val": "12.008"
                        },
                        "BudgetYearTwo": {
                            "val": "15.465"
                        },
                        "BudgetYearThree": {
                            "val": "16.674"
                        },
                        "BudgetYearFour": {
                            "val": "16.658"
                        },
                        "BudgetYearFive": {
                            "val": "16.986"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates counter explosive hazard technologies for finding and neutralizing surface and buried threats in varying vegetation, soil, weather and diurnal conditions. Activities include remote\/standoff detection of individual explosive hazards and minefields and neutralization of explosive threats, landmines and minefields. This project also evaluates airborne explosive hazard detection sensors and fabricates them for lightweight plug-and-play use, on manned and Unmanned Aerial Systems (UASs) in mission specific applications. Efforts are supported by modeling and simulation assessments to define potential system effectiveness.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n\nThis project supports Army science and technology efforts in the Ground Maneuver, Soldier, Air and Command, Control, Communications and Intelligence portfolios. \n\nWork in this project is performed by the U.S. Army Communications-Electronics Research, Development and Engineering Center (CERDEC)\/Night Vision and Electronic Sensors Directorate (NVESD), Ft. Belvoir, VA. Minefield neutralization efforts are closely coordinated with Navy\/US Marine Corps."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Explosive Hazard Detection for Manned and Unmanned Aerial Systems"
                                    },
                                    "Description": {
                                        "val": "This effort provides manned and unmanned aerial systems (UASs) the capability to detect explosive threats, threat deployment activities, minefields and Home Made Explosives (HME)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.263"
                                            },
                                            "Text": {
                                                "val": "Demonstrated the performance of the specialized sensor integrated on the PUMA Small Unmanned Aerial Vehicle (SUAV) in a relevant environment; validated and tested the compatibility of the multi-spectral sensor developed for the Shadow Tactical Unmanned Aerial Vehicle (TUAV) with the communications architecture of the airframe and ground station."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ground Vehicle Explosive Hazard Detection"
                                    },
                                    "Description": {
                                        "val": "This project improves detection of low metal\/low contrast explosive threats buried in the road, such as Improvised Explosive Devices (IEDs) and antitank landmines. Currently, Ground Penetrating Radar (GPR) capabilities for detection of explosive threats in an electronic warfare environment are limited by radar receiver technology and detection latency. Improving the signal to noise ratio and acquisition rates reduces susceptibility to electromagnetic interference and improves the interoperability with electronic countermeasures, while continuing to improve detection and reduce false alarms. This project improves detection of explosive hazards when emplaced along the sides of roads. Technology is also needed to increase standoff detection and defeat distances, both in roads and off routes, enabling faster rates of advance and safer operations to support early entry and route clearance missions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.031"
                                            },
                                            "Text": {
                                                "val": "Integrated and demonstrated performance of initial full size four-panel digital GPR array with greater detection; integrated and demonstrated performance of ground vehicle based, forward looking Electro-Optical\/infrared (EO\/IR) sensor; matured sensor fusion algorithms and cueing techniques to enable handoff of potential in-road threats detected in front of the vehicle to the on-board digital GPR for confirmation of threat locations to enable increased rates of advance during route clearance operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.056"
                                            },
                                            "Text": {
                                                "val": "Demonstrate a digital GPR array in a militarily relevant environment and evaluate detection performance against buried threat devices with and without presence of electronic countermeasures; integrate ground vehicle based, forward looking EO\/IR sensor on a military vehicle."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.008"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.008"
                                            },
                                            "Text": {
                                                "val": "Will mature target detection algorithms for digital GPR array for identification of explosive hazards in roads and for precision marking; mature forward looking EO\/IR sensor suite with optimized spatial and spectral resolutions, multi-step target detection algorithms and automated decision making tools to provide integrated capabilities; integrate EO\/IR and GPR sensors data and analysis architectures to fuse target nominations from the standoff and localization sensors into a Graphical User Interface (GUI); demonstrate Light Detection and Ranging (LIDAR) sensor to image and identify side attack targets and threats and baseline target detection algorithms to detect road side explosive hazards."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Dismounted Explosive Hazard Detection"
                                    },
                                    "Description": {
                                        "val": "This effort matures, fabricates and evaluates lab demonstrators based on two different technologies to improve dismounted forces' capability to detect Improvised Explosive Hazards (IEDs) and landmines. This effort develops an illumination capability and modifies target detection algorithms for integration into current demonstrator digital goggles. This helmet mounted capability will aid the dismounted forces as they execute route clearance missions by improving detection of command initiation wires, trip wires and indicators of IED emplacement such as disturbed earth. A next generation handheld explosive hazard detector technology will also be developed and matured with improved IED detection capabilities and Size, Weight, and Power (SWaP) characteristics. The next generation handheld detector technology may be inserted into the current AN\/PSS-14 Mine Detector as an upgrade or may be a new handheld detector."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.939"
                                            },
                                            "Text": {
                                                "val": "Collected data in relevant environments using an improved digital night vision goggle with a new counter IED mode demonstrator and optimized target detection algorithms; demonstrated performance of low\/no-metal hand held buried explosive hazard detector against realistic IED and mine targets (including both metallic, non-metallic and command wire threat components) by integrating metal detector and ground penetrating radar technologies into a single system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.014"
                                            },
                                            "Text": {
                                                "val": "Demonstrate advanced handheld GPR antenna and improved wideband metal detection coils and collect data in field conditions for development of improved target detection algorithms."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "683"
                    },
                    "ProjectTitle": {
                        "val": "Area Denial Sensors"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "1.985"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.985"
                        },
                        "BudgetYearTwo": {
                            "val": "1.986"
                        },
                        "BudgetYearThree": {
                            "val": "1.985"
                        },
                        "BudgetYearFour": {
                            "val": "1.986"
                        },
                        "BudgetYearFive": {
                            "val": "1.986"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates surveillance, command and control technology components for alternative area protection systems that minimize the risk of injury or loss to non-combatants from exposure to anti-personnel landmines (APLs). The technology includes distributed personnel surveillance systems and command and control systems to be used with man-in-the-loop overwatch fires. This project uses modeling and simulation to evaluate new concepts and modify doctrine. This project also fabricates components, as well as system architectures and conducts evaluations at the system level in field settings.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n\nThis project supports Army science and technology efforts in the Ground and Command, Control, Communications and Intelligence portfolios. \n\nWork in this project is performed by the U.S. Army Communications-Electronics Research, Development and Engineering Center (CERDEC)\/Night Vision and Electronic Sensors Directorate (NVESD), Fort Belvoir, VA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Area Denial Sensors"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates current networked sensor and sensor fusion technology efforts to provide detection, identification, and classification for remotely delivered sensor systems and area denial munitions. Key technologies to be matured and demonstrated include deployable multi-mode sensors, fused sensor information, and local area network communications to meet requirements for man-in-the-loop command and control."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.985"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.985"
                                            },
                                            "Text": {
                                                "val": "Will mature deployable multi-mode sensor architecture that can be integrated into remote delivery munitions focusing on harsh shock environments; mature sensor fusion technologies to provide operator management of many remotely employed multi-mode sensor nodes to provide situational awareness and area denial effects."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}