{
    "id": "0ed6790fe7c130dd94de615ccfd55ec77129cb15",
    "meta": {
        "filename": "dod-2016_RDTE_2016_DHRA_RDTE_JustificationBook_DoD_Human_Resources_Activity_PB_2016.zzz_unzipped_RDTE_JustificationBook_DoD_Human_Resources_Activity_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "DoD Human Resources Activity",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605803SE"
        },
        "ProgramElementTitle": {
            "val": "R&D in Support of DOD Enlistment, Testing and Evaluation"
        },
        "R1LineNumber": {
            "val": "161"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "DoD Human Resources Activity"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "25.803"
            },
            "PriorYear": {
                "val": "6.908"
            },
            "CurrentYear": {
                "val": "8.452"
            },
            "BudgetYearOne": {
                "val": "9.533"
            },
            "BudgetYearOneBase": {
                "val": "9.533"
            },
            "BudgetYearTwo": {
                "val": "7.240"
            },
            "BudgetYearThree": {
                "val": "5.341"
            },
            "BudgetYearFour": {
                "val": "7.613"
            },
            "BudgetYearFive": {
                "val": "7.613"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Department of Defense Human Resources Activity (DHRA) is a DoD-wide Field Activity chartered to support the Under Secretary of Defense for Personnel and Readiness (USD (P&R)).  This PE includes application of R&D to expedite prototype development and mission support efforts to sustain and\/or modernize operations required for general RDT&E.\n\nProject 1:  DoD Enlistment Processing and Testing. The project administers testing programs, which enable the Armed Services to select highly qualified military recruits. The DoD uses a single test, the Armed Services Vocational Aptitude Battery (ASVAB), to determine eligibility of military applicants and to report recruit quality data to Congress. High quality recruits are obtained from administering the ASVAB annually to approximately 600,000 applicants for Military Service as part of the DoD Enlistment Testing program, and to 1 million students in the DoD Student Testing program. Each Service also uses ASVAB test forms developed in this program as part of their in-service testing programs. New ASVAB test forms and related support materials are implemented approximately every four years. This allows DoD to make measurement improvements as well as decrease the likelihood of test compromise. Ongoing RDT&E efforts include development and evaluation of procedures which (1) reduce or eliminate threats to the validity of the ASVAB test scores generated; (2) improve the efficiency of the test development, calibration, and validation process; and (3) improve selection and classification decisions made by each Service through more effective use of test score information. In addition, periodic assessments are required to provide DoD manpower planners and Congress with information on aptitude trends in the population from which recruits are drawn.\n\nProject 2:  Human Resources Automation Enhancements.  DCPDS is the Department’s enterprise civilian human resources (HR) transactional system supporting 800,000 employees, representing approximately one-third of the federal government’s civilian work force. DCPDS has proven its business case, avoiding costs for the Department of over $200M\/year when compared to the multiple DoD Component operational costs prior to establishment of the enterprise system.  The consolidation of all instances of DCPDS at the DDC completed in 2014 has resulted in substantial component savings.  In FY 15\/16, additional data center consolidation will include additional HRIT Enterprise systems moving to the DDC.\n\nNetwork and system operations span worldwide, with 24\/7 operations that support 19 Regional Service Centers and over 300 Customer Support Units. DCPDS completed its upgrade to the Hewlett Packard Blade architecture for all database servers in 2014. The current focus of DCPDS is the expansion of these efficiencies through the consolidation of DCPDS operations to a single data center, where DCPDS enterprise operations and all DoD customer regional operations will be located at the Lockheed Martin Denver Data Center.. (Army and Air Force relocated in FY14 and focus has now turned to .) \n\nOther DCPAS programs supporting the civilian workforce include minimizing involuntary separations, assisting laid-off workers, maintaining workforce balance, and reducing the costs of DoD's workers and unemployment compensation via the Defense Injury and Unemployment Compensation System (DIUCS). DHRA\/DCPAS supports the development, issuance and maintenance of uniform DoD-wide civilian personnel policy; provides program guidance and technical interpretation for both appropriated and non-appropriated funded civilian HR programs ; manages DoD's Civilian Assistance and Re-Employment (CARE) program, including the Priority Placement Program (PPP); investigates and mediates discrimination complaints; conducts grievance investigations; and manages the operation of the enterprise civilian HR information system, DCPDS. These programs are supported by an aggressive data automation program, to include a communications capability, computing equipment, and an automation software link to standardize these divergent functions. These funds continue to support these processes.\n\nProject 3: NEO Tracking System.  The Non-Combatant Evacuation Operations (NEO)Tracking System (NTS) \/ Emergency Tracking Accountability System (ETAS) is a certified and accredited DoD automated system that accounts for, and sustains visibility of noncombatant evacuees during a NEO under the authority of DODD 1000.25, DoD Personnel Identity Protection (PIP) Program. NTS is currently being used in the USAFRICOM, USCENTCOM, USEUCOM, USSOUTHCOM, and USPACOM Area of Responsibility. The ETAS component is the CONUS domestic version of NTS and is for use by USNORTHCOM during disasters in the CONUS whether natural, accidental, or acts of terrorism. The primary purpose of the NTS\/ETAS is to provide individual accountability of the evacuee by creating and maintaining a database of evacuees assembled during an evacuation operation and subsequently tracking the evacuees' movement throughout the evacuation process.  Minor growth from FY 2015 to FY 2016 is attributed to research and development supporting the integration of the Enterprise Identity Attribute Service and the Organization Unique Identifiers in this family of systems that provides secure attribute based access control.\n\nProject 4:  Synchronized Pre-deployment and Operational Tracker Enterprise Suite (SPOT-ES).  SPOT-ES is the Department of Defense (DoD) system of record for accountability and visibility of contracts and contractor personnel authorized to operate in a contingency operation.  SPOT-ES provides web based tracking and visibility into contract services, personnel and equipment locations; provides a common operational picture for Combatant Commanders; enhances the analytical tools to accurately plan for the quantity of contracted support required for future contingency operations; and collects accurate data for the Office of Management and Budget-directed quarterly census of all contractors supporting contingency operations.  Minor growth from FY 2015 to FY 2016 is attributed to development and integration of more rugged and transportable Automatic Identification Technologies that facilitates person accountability and property tracking and accountability of the NTS.\n\nProject 5:  ESGR Awards & Activty Tracking (AATR) Tool.  Employer Support of the Guard and Reserve (ESGR) requires a comprehensive web-based application (Awards and Activity Tracking and Reporting) to track ESGR Activities to include briefings and recognition of civilian employers and briefings of National Guard and Reserve that will track against organizational goals vs. costs and the hours donated by Volunteers.  The application will replace several manual processes that use Microsoft Excel spreadsheets across 54 State Committees and through contractor support.  This will also place all critical data in a DoD Data Center.  Development of a web-based application would immensely improve data collection and analysis while allowing field staff and volunteers to better focus on operations and mission accomplishment.  The application would be an addition to ESGR’s current Portal that contains ESGR’s member management, inquiry and case management, and freedom award nomination systems."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "6.908"
                },
                "CurrentYear": {
                    "val": "8.452"
                },
                "BudgetYearOne": {
                    "val": "9.533"
                },
                "BudgetYearOneBase": {
                    "val": "9.533"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "6.908"
                },
                "CurrentYear": {
                    "val": "8.452"
                },
                "BudgetYearOne": {
                    "val": "9.533"
                },
                "BudgetYearOneBase": {
                    "val": "9.533"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "Project 1"
                    },
                    "ProjectTitle": {
                        "val": "DoD Enlistment Processing & Testing"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "5.166"
                        },
                        "PriorYear": {
                            "val": "0.376"
                        },
                        "CurrentYear": {
                            "val": "1.945"
                        },
                        "BudgetYearOne": {
                            "val": "2.181"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.181"
                        },
                        "BudgetYearTwo": {
                            "val": "1.975"
                        },
                        "BudgetYearThree": {
                            "val": "1.833"
                        },
                        "BudgetYearFour": {
                            "val": "1.845"
                        },
                        "BudgetYearFive": {
                            "val": "1.845"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The primary mission of DoD Enlistment Processing and Testing is to test and implement more accurate methods of assessing aptitudes required for military enlistment, success in training, and performance on the job. Also, it includes implementing methods that are useful in the identification of persons with the high aptitudes required by today’s smaller and technically more demanding military."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "DoD Enlistment Processing & Testing"
                                    },
                                    "Description": {
                                        "val": "DoD Enlistment Processing & Testing"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.376"
                                            },
                                            "Text": {
                                                "val": "• Finalized and implemented new procedures for test development of ASVAB Items\n• Researched on revisions to ASVAB content DoD Student Testing Program (STP)\n• Evaluated the use of internet-based CAT-ASVAB in the CEP"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.945"
                                            },
                                            "Text": {
                                                "val": "• Continue to research on revisions to ASVAB content\n• Evaluate methods to convert all STP to Computer Adaptive Test (CAT)\n• Continue to evaluate the use of internet-based CAT-ASVAB in the Career Exploration Program (CEP)\n• Continue to reduce the frequency and impact of ASVAB test compromise, ensuring applicants are qualified to perform the military duties and responsibilities"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.181"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.181"
                                            },
                                            "Text": {
                                                "val": "• Continue the research effort on new measures\/new content that could potentially be added to the ASVAB\n• Continue development of new ASVAB test items in accordance with revised procedures\n• Will greatly reduce the frequency and impact of ASVAB test compromise, ensuring that military applicants are qualified to be in the military and capable of performing their military jobs."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "NOT REQUIRED."
                        },
                        "PerformanceMetrics": {
                            "val": "Each project contained within this program contains specific metrics to determine progress towards completion.  Metrics for all include completed and documented analysis provided by the performer. The completion date for that analysis varies with each project. In addition, to that analysis, each effort contains a roadmap addressing the best use of the findings throughout the department. If the results of the analysis show benefit to the Department, those findings are included in policy, doctrine, tactics and procedures."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "Project 2"
                    },
                    "ProjectTitle": {
                        "val": "Human Resources Automation Enhancements"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "16.939"
                        },
                        "PriorYear": {
                            "val": "2.832"
                        },
                        "CurrentYear": {
                            "val": "4.976"
                        },
                        "BudgetYearOne": {
                            "val": "5.179"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.179"
                        },
                        "BudgetYearTwo": {
                            "val": "4.271"
                        },
                        "BudgetYearThree": {
                            "val": "2.641"
                        },
                        "BudgetYearFour": {
                            "val": "4.469"
                        },
                        "BudgetYearFive": {
                            "val": "4.469"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Civilian HR automation enhancements planned for FY 2015 and FY 2016 are focused on software development to support the Department’s civilian workforce, including  a DoD-Wide performance management system; enhancement of employee competency assessment capability; modernization of injury and unemployment compensation case management;  and EEO investigations case management.  In addition, changes to DCPDS are required for mandates for the Office of Personnel Management (OPM), HR Line of Business (LoB), electronic Official Personnel Folder, and Retirement Systems Modernization implementation. DoD is one of five designated Shared Service Centers in the federal  government focused on providing standard services across agency lines, gaining potential significant business and cost-saving benefits. DoD is considered a leader in this initiative. \n\nDCPDS is the Department’s enterprise civilian HR system that has provided the savings originally projected in the achievement of full operational capability in 2002 and which has continued to operate as the DoD system serving over 800,000 employee records. Additional initiatives to sustain the Department’s lead in automated systems include expansion of employee self service functionality, and support for data warehouse improvements, engineering plans for consolidation and migration to a federal data center, an employee-manager portal, and information assurance initiatives to comply with DoD-mandated DMZ requirements. DCPDS enhancements will support the Department’s focus on the further consolidation of civilian HR operations to a single operational site, with linkage to Component operations worldwide."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Human Resources Automation Enhancements"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.832"
                                            },
                                            "Text": {
                                                "val": "• Completed consolidation of all Defense Agency and Military Service DCPDS regional computing operations into a single data center\n• Continued enhancement of information assurance infrastructure for mandated DoD requirements for zone architecture and move to Risk Management Framework\n• Planned and executed enhancements to support legislative mandates\/requirements\n• Implemented new employee\/manager portal for civilian personnel information\n• Planned performance management system integration\n• Completed next phase of DoD Demilitarized Zone (DMZ) extension to comply with DoD mandates for DMZ extension requirements for all systems\n• Supported HR Line of Business (LoB) initiatives, including modification of interfaces IAW OPM mandates\n• Developed DCPDS interfaces to support DoD requirements and external systems\n• Upgraded communication circuits to support expansion of DCPDS regional operations, test\/development site and DR site \n• Leveraged improved purchasing power for hardware and software maintenance purchases"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.976"
                                            },
                                            "Text": {
                                                "val": "• Implement initial cloud computing, data warehouse improvements and continued expansion of web services (15)\n• Enhance information assurance requirements, including DMZ extension mandates (15)\n• Consolidate DCPAS supported applications to enterprise data center (15)\n• Maximize the Departments’ systems to (1) manage injury and unemployment compensation cases; (2) assess executive (and equivalent) performance; (3) move all  HRIT Enterprise systems to a common data center, which is managed under the same controls and inherits common security protocols; (4) enhance the DoD capability to assess competencies and plan for workforce development. (15)\n• Plan modernization and integration of legacy applications (15)\n• Implement mobility access to DCPDS (Employment Verification and Leave Balance) within the Joint Information Environment (JIE) (15)\n• Enhance warm site disaster recovery capabilities (15)\n• Develop enhancements to comply with HR legislative and DoD regulatory requirements (Ongoing)\n• Support required changes for HR LoB interfaces and other OPM\/OMB mandates (Ongoing)\n• Implement continuous auditing and monitoring to improve compliance with FIAR (Ongoing)"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.179"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.179"
                                            },
                                            "Text": {
                                                "val": "• Implement new capabilities, including employee\/manager initiated actions, on portal (16)\n• Improve infrastructure virtualization to increase performance at improved cost (16)\n• Implement SSN Reduction in the DCPDS Mass Action Process (16)\n• Implement integration of supported applications (16)\n• Upgrade system platform to latest commercial version (16)\n• Develop enhancements to comply with HR legislative and DoD regulatory requirements (Ongoing)\n• Support required changes for HR LoB interfaces and other OPM\/OMB mandates (Ongoing)\n• Implement continuous auditing and monitoring to improve compliance with FIAR (Ongoing)"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "Project 3"
                    },
                    "ProjectTitle": {
                        "val": "NEO Tracking System"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.761"
                        },
                        "PriorYear": {
                            "val": "0.761"
                        },
                        "CurrentYear": {
                            "val": "0.531"
                        },
                        "BudgetYearOne": {
                            "val": "0.616"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.616"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Neo Tracking System (NTS) \/ Electronic Tracking Accountability System (ETAS) is a certified and accredited DoD automated system that accounts for, and sustains visibility of noncombatant evacuees during a NEO under the authority of DODD 1000.25, DoD Personnel Identity Protection (PIP) Program. NTS is currently being used in the USAFRICOM, USCENTCOM, USEUCOM, USSOUTHCOM, and USPACOM AORs. The ETAS component is the CONUS domestic version of NTS and is for use by USNORTHCOM during disasters in the CONUS whether natural, accidental, or acts of terrorism. The primary purpose of the NTS\/ETAS is to provide individual accountability of the evacuee by creating and maintaining a database of evacuees assembled during an evacuation operation and subsequently tracking the evacuees’ movement through the evacuation process."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "NEO Tracking System (NTS)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.761"
                                            },
                                            "Text": {
                                                "val": "• Converted the NTS program to a mobile application package that can be run on tablets and smart phones\n• Streamlined the distribution of NTS images, reducing not only the costs associated with the creation of an image, but also the time associated with receiving the image in the field"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.531"
                                            },
                                            "Text": {
                                                "val": "• Continue to upgrade system software and hardware drivers for Windows 7, 64-bit compatibility\n• Continue with hardware implementation\n• Provide automate distribution of system updates\n• Provide immediate authentication of emergency essential personnel\n• Provide web services to support development of Enterprise organizations attribute service for DoD which supports the Secure Data Access."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.616"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.616"
                                            },
                                            "Text": {
                                                "val": "• Will continue to upgrade hardware implementations\n• Will continue with automation distribution of system updates\n• Continue with the development and deploy required interface, Deploy Global Air Transportation Execution System Interface, the Advance Passenger Information System Customs and Border Protection, and Joint Patient Assessment and Tracking Systems, Health and Human Services."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Existing contract vehicles in place\/GSA for COTS."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "Project 4"
                    },
                    "ProjectTitle": {
                        "val": "Synchronized Pre-deployment & Operational Tracker Enterprise Suite"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "2.937"
                        },
                        "PriorYear": {
                            "val": "2.939"
                        },
                        "CurrentYear": {
                            "val": "1.000"
                        },
                        "BudgetYearOne": {
                            "val": "1.057"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.057"
                        },
                        "BudgetYearTwo": {
                            "val": "0.994"
                        },
                        "BudgetYearThree": {
                            "val": "0.867"
                        },
                        "BudgetYearFour": {
                            "val": "1.299"
                        },
                        "BudgetYearFive": {
                            "val": "1.299"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Synchronized Pre-deployment and Operational Tracker Enterprise Suite (SPOT-ES) is the Department of Defense (DoD) system of record for accountability and visibility of contracts and contractor personnel authorized to operate in a contingency operation.  SPOT-ES provides web based tracking and visibility into contract services, personnel and equipment locations; provides a common operational picture for Combatant Commanders; enhances the analytical tools to accurately plan for the quantity of contracted support required for future contingency operations; and collects accurate data for the OMB-directed quarterly census of all contractors supporting contingency operations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "The Synchronized Pre-deployment and Operational Tracker"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.939"
                                            },
                                            "Text": {
                                                "val": "• Continued to be the system of record for accountability and\nvisibility of contracts and contractor personnel in support of the CENTCOM\nArea of Responsibility and other contingencies around the world.  \n• Provided the only DoS, DoD, and USAID sanctioned\nLetter of Authorization (LOA) which provides the Government Furnished\nServices to contractor personnel.  \n• Provided the information on contractor personnel supporting Iraq\nand Afghanistan to the Office of the Secretary of Defense for reports to\nCongress.\n• Provided the number of contractor personnel and contract\ncapability to Combatant Commands for operational planning purposes and to\naid in their decision making processes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "• Continue to be the system of record for accountability and visibility of contracts and contractor personnel in support of the CENTCOM Area of Responsibility and other contingencies around the world.\n• Continue to provide the only DoS, DoD, and USAID sanctioned Letter of Authorization (LOA) which provides the Government Furnished Services to contractor personnel.\n• Provide the information on contractor personnel supporting Iraq and Afghanistan to the Office of the Secretary of Defense for reports to Congress.\n• Provide the number of contractor personnel and contract capability to Combatant Commands for operational planning purposes and to aid in their decision making processes."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.057"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.057"
                                            },
                                            "Text": {
                                                "val": "• Continue to be the system of record for accountability and visibility of contracts and contractor personnel in support of the CENTCOM Area of Responsibility and other contingencies around the world\n• Provides a common operational picture for Commanders, enhancing the analytical tools to accurately plan for the quantity of contracted support required for future contingency operations."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "Project 5"
                    },
                    "ProjectTitle": {
                        "val": "ESGR Awards and Activity Tracking & Reporting (AATR) Tool"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.500"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.500"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Design and build an Awards and Activity Tracking and Reporting (AATR) to track ESGR Activities to include briefings and recognition of civilian employers and briefings of National Guard and Reserve that will track against organizational goals vs. costs and the hours donated by Volunteers."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "ESGR Awards and Activity Tracking and Reporting (AATR) Tool"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "• Design and build Awards and Activity Tracking and Reporting (AATR)"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}