{
    "id": "11746562c38759f6d29035df5b5047813fc2448c",
    "meta": {
        "filename": "dod-2016_RDTE_2016_NAVY_BA1_3_RDTE_JustificationBook_Navy_PB_2016.zzz_unzipped_RDTE_JustificationBook_Navy_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0601152N"
        },
        "ProgramElementTitle": {
            "val": "In-House Lab Independent Res"
        },
        "R1LineNumber": {
            "val": "2"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Basic Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "18.135"
            },
            "CurrentYear": {
                "val": "19.142"
            },
            "BudgetYearOne": {
                "val": "19.126"
            },
            "BudgetYearOneBase": {
                "val": "19.126"
            },
            "BudgetYearTwo": {
                "val": "19.499"
            },
            "BudgetYearThree": {
                "val": "19.852"
            },
            "BudgetYearFour": {
                "val": "19.852"
            },
            "BudgetYearFive": {
                "val": "19.852"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) sustains U.S. Naval Science and Technology (S&T) superiority by providing new technological concepts for the maintenance of Naval power and national security, and by helping to avoid scientific surprise while exploiting scientific breakthroughs and providing options for new Future Naval Capabilities (FNCs). The Department of Navy (DON) component responds to S&T directions of the Naval S&T Strategic Plan for long term Navy and Marine Corps improvements and is in consonance with future warfighting concepts and doctrine developed at the Naval Warfare Development Command and the Marine Corps Combat Development Command. It enables technologies that significantly improve the Joint Chiefs of Staff's Future Joint Warfighting Capabilities. The In-house Laboratory Independent Research (ILIR) program also adds increased emphasis to the revitalization of the scientist and engineer workforce component at the Navy's Warfare Centers and Laboratories by attracting superior candidates and retaining our best members through the provision of exciting and meaningful work.\n\nThis PE addresses DON Basic Research, which includes scientific study and experimentation directed toward increasing knowledge and understanding in national-security related aspects of physical, engineering, environmental, and life sciences, and is the core of Discovery and Invention. Basic research projects are developed, managed, and related to more advanced aspects of research in some hundred-plus technology and capability-related 'thrusts', which are consolidated in thirteen research focus areas: Power and Energy; Operational Environments; Maritime Domain Awareness; Asymmetric and Irregular Warfare; Information, Analysis and Communication; Power Projection; Assure Access and Hold at Risk; Distributed Operations; Naval Warfighter Performance and Protection; Survivability and Self-Defense; Platform Mobility; Fleet\/Force Sustainment; Affordability, Maintainability and Reliability.\n\nThis portion of the DON Basic Research Program provides participating Naval Warfare Centers and Laboratories with funding for: basic research to support the execution of their assigned missions; developing and maintaining a cadre of active researchers who can distill and extend results from worldwide research and apply them to solve Naval problems; promoting hiring and development of new scientists; and encouragement of collaboration with universities, private industry, and other Navy and Department of Defense laboratories.\n\nILIR efforts are selected by Naval Warfare Centers\/Lab Commanding Officers and Technical Directors near the start of each Fiscal Year through internal competition. Efforts typically last three years, and are generally designed to assess the promise of new lines of research. Successful efforts attract external, competitively awarded funding. Because the Warfare Centers and Labs encompass the full range of naval technology interests, the scope of ILIR topics roughly parallels that of PE 0601153N, Defense Research Science.\n\nIn FY15 the ILIR PE 06011652N was simplified from seven Naval technology interests (advanced materials, electronics sensor sciences, energy sciences, human performance sciences, information sciences, naval platform design sciences, and ocean\/space sciences) into one encompassing ILIR program.  It is still possible to report which naval technology interest each project falls under.  Due to the number of efforts in PE 06011652N, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "18.230"
                },
                "CurrentYear": {
                    "val": "18.734"
                },
                "BudgetYearOne": {
                    "val": "19.126"
                },
                "BudgetYearOneBase": {
                    "val": "19.126"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "18.135"
                },
                "CurrentYear": {
                    "val": "19.142"
                },
                "BudgetYearOne": {
                    "val": "19.126"
                },
                "BudgetYearOneBase": {
                    "val": "19.126"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.095"
                },
                "CurrentYear": {
                    "val": "0.408"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "CurrentYear": {
                        "val": "0.408"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.095"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Not applicable.\n\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0000"
                    },
                    "ProjectTitle": {
                        "val": "In-House Lab Independent Res"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "18.135"
                        },
                        "CurrentYear": {
                            "val": "18.734"
                        },
                        "BudgetYearOne": {
                            "val": "19.126"
                        },
                        "BudgetYearOneBase": {
                            "val": "19.126"
                        },
                        "BudgetYearTwo": {
                            "val": "19.499"
                        },
                        "BudgetYearThree": {
                            "val": "19.852"
                        },
                        "BudgetYearFour": {
                            "val": "19.852"
                        },
                        "BudgetYearFive": {
                            "val": "19.852"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project sustains U.S. Naval S&T superiority, provides new technological concepts for the maintenance of naval power and national security, and mitigates scientific surprises, while exploiting scientific breakthroughs and providing options for new Future Naval Capabilities (FNC's).  It responds to S&T directions of the Naval S&T Strategic Plan for long term Navy and Marine Corps improvements.  It is in consonance with future warfighting concepts and doctrine developed at the Naval Warfare Development Command (NWDC) and the Marine Corps Combat Development Command (MCCDC), and enables technologies that significantly improve the Joint Chiefs of Staff's Future Joint Warfighting Capabilities.  \n\nThis portion of the DON Basic Research Program provides participating Naval Warfare Centers and Laboratories with funding for basic research to support the execution of their assigned missions, for developing and maintaining a cadre of active research scientists who can distill and extend results from worldwide research and apply them to naval problems, to promote hiring and development of new scientists, and to encourage collaboration with universities, private industry, and other Navy and Department of Defense laboratories."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "ADVANCED MATERIALS"
                                    },
                                    "Description": {
                                        "val": "Efforts include: structural materials; functional materials; maintenance reduction, hydrodynamics; power generation; energy conservation and conversion.\n\nIn FY 2015 the ILIR (In-House Laboratory Independent Research) Program was simplified from seven Naval technology interests (Advance Materials, Electronics Sensor Sciences, Energy Sciences, Human Performance Science, Information Sciences, Naval Platform Design Sciences and Ocean Space Sciences) into one encompassing ILIR Program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.903"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued ILIR projects that are intended to be approximately three years in length. Based on historical trends,\napproximately 30% of ILIR projects will turn over each year.  Projects selected for FY 2014 focus on supporting Naval Materials by Design and Intelligent Naval Sensors, Innovative Naval Prototype initiatives in Electromagnetic Gun and Sea Basing, and National Naval Responsibility initiatives in Undersea Weaponry and Naval\nEngineering.\n- Continued fundamental research on high strength nanostru.ctures\/nanomaterials.\n- Continued research for new concepts, configurations, and applications for metamaterials.\n- Continued research for high temperature alloys for engine applications.\n- Continued research for low-cost, high-strength material repair.\n- Continued ILIR projects that are intended to be approximately three years in length. Projects selected for FY 2015 will focus on supporting Naval Materials by Design and Intelligent Naval Sensors, Innovative Naval Prototype initiatives in Electromagnetic Gun and Sea Basing, and National Naval Responsibility initiatives in Undersea Weaponry and Naval Engineering."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "ELECTRONICS SENSOR SCIENCES"
                                    },
                                    "Description": {
                                        "val": "Description: Efforts include: sensing, diagnostics, and detectors; navigation and timekeeping; nano electronics; real time targeting, Electro Optical\/InfraRed (EO\/IR) electronics; EO\/IR electronic warfare; and EO\/IR sensors for surface and subsurface surveillance.\n\nIn FY 2015 the ILIR (In-House Laboratory Independent Research) Program was simplified from seven Naval technology interests (Advance Materials, Electronics Sensor Sciences, Energy Sciences, Human Performance Science, Information Sciences, Naval Platform Design Sciences and Ocean Space Sciences) into one encompassing ILIR Program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.167"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued ILIR projects that are intended to be approximately three years in length. Based on historical trends, approximately 30% of ILIR projects will turn over each year.\n- Continued research for computer vision techniques on optical and acoustic sensor data for underwater object detection and classification.\n- Continued research for wideband retro-reflective arrays.\n- Continued research on an application of Green's function techniqu.e to explore exotic and unexpected nano-phenomena in the electromagnetic scattering of finite-length nanowires. This effort has broad applicability to a variety of nano devices, such as: nano-antennas; nano-lasers; nanosensors; subwavelength photonic integration; and metamaterial designs.\n- Continued research for high finesse optical domain radio frequency (RF) filters.\n- Continued ILIR projects that are intended to be approximately three years in length. Projects selected for FY 2014 will focus on supporting Electric Power Sources and Multifunctional Electronics for Intelligent Naval Sensors, Innovative Prototype initiatives in Electromagnetic Gun and Persistent Surveillance, and the National Naval Responsibility in Undersea Weaponry.\n- Continued research for Wireless Highly Reliable Networks.\n- Continued research for the Optimization of Autonomous ASW Sensor Suites.\n- Continued research for Nano-sensor Technology.\n- Continued research for Nano-circuit Devices.\n- Continued research on Advanced Chem-Bio Sensor and Detection."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "ENERGY SCIENCES"
                                    },
                                    "Description": {
                                        "val": "Description: Efforts include: undersea weaponry; energetic materials and propulsion; directed energy; and TeraHertz Time-Domain Spectroscopy (THz-TDS) technology that addresses overseas contingency operations and Counter Improvised Explosive Device (C-IED) detection by detecting and spectroscopically identifying military and home-made explosives and formulations.\n\nIn FY 2015 the ILIR (In-House Laboratory Independent Research) Program was simplified from seven Naval technology interests (Advance Materials, Electronics Sensor Sciences, Energy Sciences, Human Performance Science, Information Sciences, Naval Platform Design Sciences and Ocean Space Sciences) into one encompassing ILIR Program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.138"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued ILIR projects that are intended to be approximately three years in length. Based on historical trends, approximately 30% of ILIR projects will turn over each year.\n- Continued research on the microbial biosynthesis of critical energetic ingredients.\n- Continued research for accelerated quantum chemistry simulations of energetics using a novel metadynamics approach.\n- Continued research for convergent synthesis of high performance heterocycles via late amination.\n- Continued research to investigate the dispersion and control of electromagnetic (EM) waves in the microwave (RF) region using fabricated metamaterial structures.\n- Continued ILIR projects that are intended to be approximately three years in length. Projects selected for FY 2014 will focus on supporting Naval Battlespace Awareness and Intelligent Naval Sensors, Innovative Naval Prototype initiatives in Persistent Surveillance and Sea Basing, and the National Naval Responsibility in Undersea Weaponry.\n- Continued research for High-Output, Low-Cost Energetic Materials.\n- Continued research for High-Speed Energetic Weapons.\n- Continued research on Fundamental Development of Polymer Materials with Tunable Energy Levels. \n- Continued Research for High-Density, High-Output Batteries."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HUMAN PERFORMANCE SCIENCES"
                                    },
                                    "Description": {
                                        "val": "Description: Efforts include: biosensors, biomaterial, bioprocesses; marine mammals; casualty care management, undersea medicine; human factors and organizational design; manpower, personnel and advanced cockpit; and operational training and education. These efforts are coordinated with the Navy Medical Research Center (NMRC).\n\nIn FY 2015 the ILIR (In-House Laboratory Independent Research) Program was simplified from seven Naval technology interests (Advance Materials, Electronics Sensor Sciences, Energy Sciences, Human Performance Science, Information Sciences, Naval Platform Design Sciences and Ocean Space Sciences) into one encompassing ILIR Program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.812"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued ILIR projects that are intended to be approximately three years in length. Based on historical trends, approximately 30% of ILIR projects will turn over each year.\n- Continued research for characterization of decision making behaviors associated with Human Systems Integration (HSI) design tradeoffs.\n- Continued research for Localization of human spatial processing using dense-array Electroencephalography.\n- Continued Integration of an implantable potentiostat for continuous monitoring of Nitric Oxide (NO) into a rat model of Hyperbaric Oxygen (HBO) toxicity.\n- Continued research to characterize the naturalistic decision making processes used in Naval Aviation acquisition programs to assess cost, schedule and performance tradeoffs within and between Human Systems Integration (HSI) domains. Content analysis will be performed to identify knowledge, skills, abilities, heuristics, and biases associated with HSI decision making.\n- Continued ILIR projects that are intended to be approximately three years in length. Projects selected for FY 2014 will focus on supporting Naval Battlespace Awareness and Intelligent Naval Sensors, Innovative Naval Prototype initiatives in Persistent Surveillance and Sea Basing, and the National Naval Responsibility in Undersea Weaponry.\n- Continued research for Brain and Spinal (and other) Injury Due to Shock Blast.\n- Continued research for Adaptive Learning Tools Based on Individual Awareness.\n- Continued research for Warfighter Impact Due to Operational Noise on Navy Ships."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "INFORMATION SCIENCES"
                                    },
                                    "Description": {
                                        "val": "Description: Efforts include: mathematical foundation and computational theory and tools for design communications; decision support theory;algorithm and tools, information assurance, secure and reliable infrastructure for command and control; mathematical optimization for optimalresource allocation and usage; modeling and computational propagation; seamless, robust connectivity and networking and cyber warfare.\n\nIn FY 2015 the ILIR (In-House Laboratory Independent Research) Program was simplified from seven Naval technology interests (Advance Materials, Electronics Sensor Sciences, Energy Sciences, Human Performance Science, Information Sciences, Naval Platform Design Sciences and Ocean Space Sciences) into one encompassing ILIR Program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.836"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued ILIR projects that are intended to be approximately three years in length. Based on historical trends approximately 30% of ILIR projects will turn over each year.\n- Continued research for the numerical analysis and design of methods for Partial Differential Equations (PDE) constrained optimization.\n- Continued research for framework for collaborative robotic asset management.\n- Continued research to develop a theory of Systems-of-Systems (SoS) network engineering and analysis based on the theory of time series of attributed graphs to understand how such systems can be mathematically formulated, simulated, analyzed, and tested.\n- Continued ILIR projects that are intended to be approximately three years in length. Projects selected for FY 2014 will focus on supporting Naval Battlespace Awareness and Intelligent Naval Sensors, Innovative Naval Prototype initiatives in Persistent Surveillance and Sea Basing,and the National Naval Responsibility in Undersea Weaponry.\n- Continued research on Weak Signature Identification.\n- Continued research on Advanced Target Classification.\n- Continued research on Collaborative Unmanned Systems Communication and Asset Management."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "NAVAL PLATFORM DESIGN SCIENCES"
                                    },
                                    "Description": {
                                        "val": "Description: Efforts include: novel hull forms, materials, structures and signatures; and virtual shaping concepts for structures and platforms.\n\nIn FY 2015 the ILIR (In-House Laboratory Independent Research) Program was simplified from seven Naval technology interests (Advance Materials, Electronics Sensor Sciences, Energy Sciences, Human Performance Science, Information Sciences, Naval Platform Design Sciences and Ocean Space Sciences) into one encompassing ILIR Program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.250"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued ILIR projects that are intended to be approximately three years in length. Based on historical trends, approximately 30% of ILIR projects will turn over each year.\n- Continued research for high fidelity, Reynolds-averaged Navier-Stokes (RANS) cavitation simulation.\n- Continued research for development of a new vehicle dynamics-based motion planning and control algorithm into the motion planning process.\n- Continued research for wall pressure fluctuation measurements in high Reynolds number turbulent pipe flow.\n- Continued research to characterize the biaxial fatigu.e behavior of carrier-based aircraft in a corrosive environment, identify the basic mechanism of environment assisted biaxial fatigu.e cracking, develop an accurate model for corrosion fatigu.e crack growth under biaxial loading, and demonstrate and validate the model in the application to aircraft structure. \n- Continued ILIR projects that are intended to be approximately three years in length. Projects selected for FY 2014 will focus on supporting Naval Battlespace Awareness and Intelligent Naval Sensors, Innovative Naval Prototype initiatives in Persistent Surveillance and Sea Basing,and the National Naval Responsibility in Undersea Weaponry.\n- Continued research for Littoral Mine Detection and Avoidance.\n- Continued research for Compact Broad Band Low Frequency Sonar.\n- Continued research for Advanced Obstacle Avoidance for Unmanned Systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "OCEAN  SPACE SCIENCES"
                                    },
                                    "Description": {
                                        "val": "Efforts include: Littoral Geosciences, Optics, and biology; Marine Mammals; Ocean Acoustics; and autonomous systems.\n\nIn FY 2015 the ILIR (In-House Laboratory Independent Research) Program was simplified from seven Naval technology interests (Advance Materials, Electronics Sensor Sciences, Energy Sciences, Human Performance Science, Information Sciences, Naval Platform Design Sciences and Ocean Space Sciences) into one encompassing ILIR Program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.219"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued ILIR projects that are intended to be approximately three years in length. Based on historical trends, approximately 30% of ILIR projects will turn over each year.\n- Continued optical propagation studies for Non-Line-of-Sight (NLOS) underwater laser communications. \n- Continued research for turbulent wake characterization.\n- Continued research for surface piercing strut wake signature reduction.\n- Continued research to assess the effects of Mid-Frequency Active (MFA) sonar on the movement of fish species in a natural environment, to compare the behavior and movement of fish prior to exposure to sonar, during exposure, and for a significant amount of time post-exposure to provide valuable data on fish behavior, movement, and survival following exposure to high intensity, tactical MFA sonar.\n- Continued ILIR projects that are intended to be approximately three years in length. Projects selected for FY 2014 will focus on supporting Naval Battlespace Awareness, Innovative Naval Prototype initiatives in Persistent Surveillance and Sea Basing, and National Naval Responsibility initiatives in Ocean Acoustics and Undersea Weaponry.\n- Continued research for Littoral Mine Detection and Avoidance.\n- Continued research for Compact Broad Band Low Frequency Sonar.\n- Continued research for Advanced Obstacle Avoidance for Unmanned Systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "IN-HOUSE LABORATORY INDEPENDENT RESEARCH (ILIR)"
                                    },
                                    "Description": {
                                        "val": "Starting in FY 2015, these requirements have been consolidated into a separate R-2 project to provide greater visibility of the program by providing an easily navigable overview of all In-House Laboratory Independent Researc(ILIR) Programs in a single location.  \n\nFunding increase in FY 2016 is due to rebalancing programs within the Program Element."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Completed research on how stresses and environment affect Aeta-phase precipitation in Al-Mg Alloys.\n- Completed the development of algorithms and simulation environment which addressed key issues in order to find approximate solutions to the coverage problem for static (wireless sensor networks) WSNs and dynamic WSNs (or UxVs). \n- Completed dynamic hybrid routing algorithm for Under Sea Sensors with integrated localization and tracking that may be implemented in a distributed manner, such that each node of such a network can intelligently and autonomously determine a wise routing strategy. \n- Completed research on increased weapon lethality focused on the design and synthesis of aluminum based cluster compounds so as to increase their reaction rates to the order of common CHNO High Explosives (HE). \n- Completed the development and investigation of new magnetoelastic\/piezoelectric composite materials and technology that combine extraordinary magnetoelectric (ME) coupling of composites with broadband tunability needed for applications such as sensitive magnetic sensors, transducers for sonar and energy harvesting.\n- Completed Principal Dynamic Mode (PDM) analysis to test the feasibility of detecting a mild emotional stressor and comparison of its performance against the standard power spectral density approach. \n- Completed effects of CO2 tolerance training on the incidence of high altitude pulmonary edema in rodents. \n- Completed investigation of the neural correlates of posttraumatic stress disorder (PTSD), both before and after clinical therapy, to discover the neural circuits most affected by the disorder and to use this information to optimize treatment strategies\n- Completed development of quantum codes and methods of construction, and verify their theoretical performance through various types of noise. Of particular interest are constructions that perform optimally through the Amplitude Damping channel. \n- Completed efforts to generate sharp and accurate images from synthetic aperture sonar (SAS) by utilizing Adjoint Control Filters for Nonlinear Partial Differential Equations.\n- Completed Automatic Code Parallelization utilizing Genetic Programming, where the computer code takes full advantage of the available parallel computers.\n- Completed effort addressing the problem of flow noise and flow induced vibration experienced by hull mounted and towed SONAR arrays.\n- Completed Sampling-Based Model Predictive Optimization With Application to Robot Kinodynamic Motion Planning for naval vehicles. \n- Completed parametric study of the effects displacement and step location have on the performance of a stepped planing hull for high speed naval craft.\n- Completed fundamental performance limitations imposed by acoustic interference on active sonar systems, concentrating on undersea networks in acoustically congested environments.\n- Completed embedded graph systems for robust, coordinated control of heterogeneous unmanned system networks. \n- Completed research for the Improved Understanding of Complex Flow Distribution over Towed Arrays."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.908"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue all efforts of FY 2014, less those noted as completed.\n-Continue research for polymer materials to understand improved helmet blast protection.\n-Continue fundamental research for composite materials for reduced signature for undersea vehicles.\n-Continue research for the fundamental understanding of graphene type Radio Frequency (RF) Antennas.\n-Continue fundamental research for the understanding of optimization of undersea sensor distribution in littoral environments. \n-Continue research for understanding effects of energetic materials under high pressure environment.\n-Continue research on Operational Fatigue of Warfighters due to Stress Environments.\n-Continue research on Human Gesture and Computer Interface and Functionality.\n-Continue research framework for Efficient Quantum Computing.\n-Continue research for Autonomous Routing of Unmanned Vehicles.\n-Continue fundamental research for undersea imaging and analysis.\n-Continue research framework for Efficient Quantum Computing.\n-Continue research for Autonomous Routing of Unmanned Vehicles.\n-Continue fundamental research for undersea imaging and analysis.\n-Continue research for modeling super-cavitation of Advanced Propulsor Designs.\n-Continue research for Predictive Performance Modeling of Advanced Naval Hull Designs.\n-Continue research for Design and Performance of High Speed Naval Vessels.\n-Continue research for Advanced Smart Wireless Cooperative Vehicular Network.\n-Continue research for Undersea Laser Communication and Identification in Littoral Environments.\n-Continue ILIR projects that are intended to be approximately three years in length researching littoral geosciences, optics, and biology; marine mammals; ocean acoustics; and autonomous systems.\nComplete FY 2013 initiated ILIR projects in many disciplines including:\n-A New Method to Generate Self-Adaptive Grid Point.\n-Energy Harvesting for Future Embedded Diagnostics Capability.\n-Sensorless Failover Design in High Criticality\/High Performance Applications.\n-Advanced Coding for Communication Links and Active Sensors The Role of Electrical Anomalies in Energetic Materials.\n-Direct Identification of Malaria Liver Stage vaccine Targets.\n-Reproductive Toxicity of Jet Propellant -5 (JP-5) and Alternative Jet Fuel Mixtures.\n-Diagnostics Capability Magnetostrictive Characterization and Modeling of HY100.\n-Directional Spreading of wind Waves.\n-Supercavitation - Impulsively Translated Projectiles.\n-Assessing the Effect of Biological Agent Ingestion.\n-Synthesis of Novel High Nitrogen Energetic Compounds by Simultaneous Shear and Pressure Loading.\n-Synthesis of Novel Tetraazapentalenes as HighPerformance, Insensitive Energetic Materials.\n-Affine-Invariant, Elastic Shape Analysis of Planar.\n-Highly Squinted Monopulse Synthetic Aperture Radar.\n-Estimation of Applied Forces Acting on a Ribbed Plate.\n-Plate Effect of Polyurea on the Shock Response of Composite Materials.\n-High Data Rate Undersea Laser Communication.\n-Machine Learning for Multi-Modal Data Analysis.\n-Sensorless Failover Design in High Criticality\/High Performance Applications\n-Energy Harvesting for Future Embedded Diagnostics Capability\n-Initiate FY 2015 ILIR projects that are intended to be approximately three years in length to research topics including :Structural materials, functional materials, maintenance reduction, hydrodynamics, power generation, energy conservation and conversion.  \n-Complete research to develop broadband dynamically controllable artificial dialetrics.\n-Sensing, diagnostics, and detectors; navigation and timekeeping; nano electronics; real time targeting, Electro- Optical\/InfraRed (EO\/IR) electronics; EO\/IR electronic warfare; and EO\/IR sensors for surface and subsurface surveillance. \n-Undersea weaponry, energetic materials and propulsion, directed energy, and TeraHertz Time-Domain Spectroscopy (THz-TDS) technology that addresses overseas contingency operations and Counter Improvised Explosive Device (C-IED) detection by detecting and spectroscopically identifying military and home-made explosives and formulations.  \n-Biosensors, biomaterial, bioprocesses; marine mammals; casualty care management, undersea medicine; human factors and organizational design; manpower, personnel and advanced cockpit; and operational training and education.  These efforts are coordinated with the Navy Medical Research Center (NMRC).\n-Mathematical foundation and computational theory and tools for design communications, decision support theory, algorithm and tools, information assurance, secure and reliable infrastructure for command and control, mathematical optimization for optimal resource allocation and usage, modeling and computational propagation, seamless, robust connectivity and networking and cyber warfare.\n-Novel hull forms, materials, structures and signatures; and virtual shaping concepts for structures and platforms.\n-Littoral geosciences, optics, and biology; marine mammals; ocean acoustics; and autonomous systems.\n-Naval Materials by Design and Intelligent Naval Sensors, Innovative Naval Prototype initiatives in Electromagnetic Gun and Sea Basing, and National Naval Responsibility initiatives in Undersea Weaponry and Naval Engineering.\n-Battlespace Awareness and Intelligent Naval Sensors, Innovative Naval Prototype initiatives in Persistent Surveillance and Sea Basing, and the National Naval Responsibility in Undersea Weaponry.\n-Command and Control and connectivity research.\n- Initiated ILIR projects that were intended to be approximately three years in length including:\n- Initiated research for polymer materials to understand improved helmet blast protection.\n- Initiated fundamental research for composite materials for reduced signature for undersea vehicles.\n- Initiated research for the fundamental understanding of graphene type Radio Frequency (RF) Antennas.\n- Initiated research for complex unmanned sensor networks."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.601"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.601"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2015, less those noted as completed above.\n- Initiate FY 2016 ILIR projects that are intended to be approximately three years in length to research topics including :\n- Structural materials, functional materials, maintenance reduction, hydrodynamics, power generation, energy conservation and conversion.  \n- Complete research to develop broadband dynamically controllable artificial dialetrics.\n- Sensing, diagnostics, and detectors; navigation and timekeeping; nano electronics; real time targeting, Electro- Optical\/InfraRed (EO\/IR) electronics; EO\/IR electronic warfare; and EO\/IR sensors for surface and subsurface surveillance. \n- Undersea weaponry, energetic materials and propulsion, directed energy, and TeraHertz Time-Domain Spectroscopy (THz-TDS) technology that addresses overseas contingency operations and Counter Improvised Explosive Device (C-IED) detection by detecting and spectroscopically identifying military and home-made explosives and formulations.  \n- Biosensors, biomaterial, bioprocesses; marine mammals; casualty care management, undersea medicine; human factors and organizational design; manpower, personnel and advanced cockpit; and operational training and education.  These efforts are coordinated with the Navy Medical Research Center (NMRC).\n- Mathematical foundation and computational theory and tools for design communications, decision support theory, algorithm and tools, information assurance, secure and reliable infrastructure for command and control, mathematical optimization for optimal resource allocation and usage, modeling and computational propagation, seamless, robust connectivity and networking and cyber warfare.\n- Novel hull forms, materials, structures and signatures; and virtual shaping concepts for structures and platforms.\n- Littoral geosciences, optics, and biology; marine mammals; ocean acoustics; and autonomous systems.\n- Complete FY 2014 initiated ILIR projects researching topics in many disciplines including:\n- Tailoring Instruction to the Individual:  Investigating the Utility of Trainee Aptitudes for use in Adaptive Training.\n- Research to Improve Situational Awareness Using Learned Representations and Autonomous Systems.\n- Developing Novel Propellants for Solid Ramjet Application.\n- Anomalous Capacity Loss and Recovery in Lead Acid Batteries Following Rapid Pulsed Discharge Power and Energy.\n- Research of n+InP as a Possible New Semiconductor Material for Fast Neutron Spectroscopy.\n- Polarimetric Radar Cross Section Control.\n- Broadband Prewhitening Filtering Framework to Improve Beamforming Detection Performance inLinear Arrays under reduced Snapshot Support Conditions.\n- Automated Storytelling: Co-clustering of Topic Models for Topic Detection and Tracking\n- Developing the Theory of Superabsorption.\n- Topological Methods for the Analysis of Big Data.\n- Complete Development of a Unified Theory for Multiphase Flows\n- Complete Mechanistic Studies of Alane Decomposition\n- Neutralization Using Air-Deployable Self-surveying UUV \n- Optimized Waterspace Management & Scheduling for Heterogeneous Teams of Autonomous Vehicles. \n- Secure Underwater Communications Study for the Advanced Undersea Weapons (AUWS).\n- Acoustic Reception and Transmission in High Speed Flows.\n- Beamforming with Arrays of Sensor Elements with Uncertain Location.\n- Develop Design, Testing, and Analysis of Zero Poisson Ratio Metamaterials\n- Beam Space Multiple Input Multiple Output.\n- Graphene Broadband Infrared Light-Emitting Devices.\n- Machine Learning of Autonomous Vehicle Tactics through Human Evaluation.\n- Nomad: A Hybrid-Cloud Aware High Assurance and Availability Cloud Service.\n- Nonvolatile and Cryogenic Compatible Quantum Memory Devices.\n- Stochastic Compiler Hacks as Software Immunization Mechanisms (SCHSIM).\n- Energy Harvesting for Future E\n- Projects selected for FY 2016 will focus on supporting:\n- Naval Materials by Design and Intelligent Naval Sensors, Innovative Naval Prototype initiatives in Electromagnetic Gun and Sea Basing, and National Naval Responsibility initiatives in Undersea Weaponry and Naval Engineering.\n- Battlespace Awareness and Intelligent Naval Sensors, Innovative Naval Prototype initiatives in Persistent Surveillance and Sea Basing, and the National Naval Responsibility in Undersea Weaponry.\n- Command and Control and connectivity research."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SCIENCE TECHNOLOGY ENGINEERING AND MATH (STEM) EFFORTS AT NAVY LABS"
                                    },
                                    "Description": {
                                        "val": "This effort will support both the Science and Engineering Apprenticeship Program (SEAP) and the Naval Research Enterprise Intern Program (NREIP) summer programs to encourage participating students to pursue science and engineering careers, to further their education via mentoring by laboratory personnel and their participation in research, and to make them aware of DoN research and technology efforts, which can lead to employment within the DoN.  Participating students will spend eight to ten weeks during the summer doing research at approximately 19 to 20 DoN laboratories.  Participants will receive a stipend distributed by the Contractor.  The stipend is a monthly allowance paid to interns for their participation in the research efforts.\n\nThis activity was separated from ILIR in FY 2013 to highlight Science Technology Engineering and Math (STEM) efforts at Navy labs previously funded within the Ocean\/Space Sciences activity in this PE. Funding increase in FY 2015 results from temporary augmentation of STEM within the PE, but the FY 2016 decrease plan rebalances the PE to focus on the NREIP and SEAP programs, scaling back on other STEM efforts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.810"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued Naval Research Enterprise Intern Program (NREIP) to support undergraduate and graduate students performing Navy-related research at Naval Warfare Centers under the supervision and mentorship of DON Scientists, thus exposing them to interesting and challenging work done at the centers. NREIP is a continuing Navy education program.\n- Continued Science and Engineering Apprenticeship Program (SEAP) supporting high school student programs.\n- Continued Science, Technology, Engineering and Mathematics (STEM) projects that are intended to be approximately three years in length. Projects selected for STEM funding will focus on engaging and educating future Naval scientists and engineers and incorporating naval relevance, diversity, and STEM best practices. These efforts complement and support the ongoing independent research, education and outreach efforts taking place at the Naval laboratories."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.826"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2014."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.525"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.525"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue the NREIP and SEAP efforts of FY 2015."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "The ILIR initiative seeks to improve the quality of defense research conducted predominantly through the Naval Warfare Centers\/Laboratories.  It also supports the development of technical intellect and education of engineers and scientists in disciplines critical to national defense needs through the development of new knowledge in a military laboratory environment.  Initial research focus is often conducted in an unfettered environment since it is basic research, but many projects focus on applying recently developed theoretical knowledge to real world military problems with the intention of developing new capabilities and improving the performance of existing systems.  Individual project metrics then become more tailored to the needs of specific applied research and advanced development programs.  The National Research Council of the National Academies of Science and Engineering's Congressionally directed \"Assessment of Department of Defense Basic Research\" concluded that the DoD is managing its basic research program effectively."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "9999"
                    },
                    "ProjectTitle": {
                        "val": "Congressional Adds"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.408"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "0.408"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This Congressional increase will help sustain U.S. Naval Science and Technology (S&T) superiority by providing new technological concepts for the maintenance of Naval power and national security, and by helping to avoid scientific surprise while exploiting scientific breakthroughs and providing options for new Future Naval Capabilities (FNCs). The In-house Laboratory Independent Research (ILIR) program also adds increased emphasis to the revitalization of the scientist and engineer workforce component at the Navy's Warfare Centers and Laboratories by attracting superior candidates and retaining our best members through the provision of exciting and meaningful work."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.408"
                                        },
                                        "Text": {
                                            "val": "- Further efforts for the ILIR program."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "The ILIR initiative seeks to improve the quality of defense research conducted predominantly through the Naval Warfare Centers\/Laboratories."
                        }
                    }
                }
            ]
        }
    }
}