{
    "id": "14d5c3549f3874b9d527f54c9293ce5fc4cc9244",
    "meta": {
        "filename": "dod-2016_RDTE_2016_ARMY_BA5A_RDTE_JustificationBook_Army_PB_2016.zzz_unzipped_RDTE_JustificationBook_Army_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605035A"
        },
        "ProgramElementTitle": {
            "val": "Common Infrared Countermeasures (CIRCM)"
        },
        "R1LineNumber": {
            "val": "116"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "145.337"
            },
            "BudgetYearOne": {
                "val": "77.570"
            },
            "BudgetYearOneBase": {
                "val": "77.570"
            },
            "BudgetYearTwo": {
                "val": "72.909"
            },
            "BudgetYearThree": {
                "val": "63.577"
            },
            "BudgetYearFour": {
                "val": "54.401"
            },
            "BudgetYearFive": {
                "val": "25.641"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Aircraft Survivability Development budget line includes Common Missile Warning System (EE4), Aircraft Survivability Equipment Development (EE3), and Common IR Counter Measure (EB4).\n\n\nEE3: FY16 funds have moved to ER7, PE 0605051A (Aircraft Survivability Development). \nThe objective of the Aircraft Survivability Equipment (ASE) Development project is to improve Radio Frequency (RF) ASE for Army aviation. The APR-39 Radar Warning Receiver (RWR) detects, categorizes, and prioritizes Radio Frequency (RF) emitters and provides a visual \/ aural alert to aircrew members warning them of targeting by RF-guided weapons. The Milestone Decision Authority (MDA) approved Phases 1 and 2 of a 3-phased path forward. \n\nPhase 1 serves as an obsolescence \/ sustainment upgrade to the Processor Line Replaceable Unit (LRU) of the AN\/APR-39A(V) Radar Warning Receiver (RWR) implemented to ensure that the currently fielded system remains viable until affordable improved RF ASE capability can be pursued in Phases 2 and 3. \n\nPhase 2, RWR Modernization, adopts the ongoing United States Navy Class I RWR Engineering Change Proposal (ECP), commonly referred to as the APR-39D(V)2 system. APR-39D(V)2 will significantly improve the near-spherical RF threat coverage, automatic detection and identification of threat types, bearing, and lethality. Under Phase 2, the Army will develop enhancements to the APR-39D(V)2, including integrated suite control functionality, threat correlation and off-boarding capability, and hardware upgrades needed to keep the APR-39D(V)2 technically relevant and address emerging Low Probability Intercept (LPI) and frequency agile threats. \n\nPhase 3 adds active Electronic Countermeasures (ECM) jamming capability for selected aircraft; Materiel Development Decision (MDD) for this ECM jamming capability phase is not expected until later in the Future Years Defense Program (FYDP).\n\n\nEE4: FY16 funds have moved to ER8, PE 0605051A (Aircraft Survivability Development). \nThe US Army operational requirements concept for Aviation Infrared (IR) countermeasure systems is known as the Suite of Integrated Infrared Countermeasures (SIIRCM). SIIRCM is an integrated warning and countermeasure system to enhance aircraft survivability against IR-guided threat missile systems. The Common Missile Warning System (CMWS) is a core element of the SIIRCM concept. CMWS is an integrated ultraviolet (UV) missile warning system, with an Improved Countermeasure Dispenser (ICMD) serving as a subsystem to a host aircraft. \n\nThe CMWS program is a UV missile warning system that cues both flare and laser-based countermeasures to defeat incoming IR-seeking missiles and will alert aircrews to the presence of certain incoming unguided munitions. The B-Kit consists of the components which perform the missile detection and aircrew notification, unguided munitions detection and aircrew notification, false alarm rejection, and countermeasure employment\/cueing functions of the system. The CMWS Electronic Control Unit (ECU) receives UV missile detection data from Electro-Optic Missile Sensors (EOMS) and sends a missile alert signal to warn aircrews via on-board avionics. Tier 1 threat missiles detected and tracked by the CMWS are subsequently defeated by a combination of missile seeker countermeasures, including decoy flares and IR Laser Jamming (currently ATIRCM-equipped CH-47 platform only). In addition, the CMWS ECU receives from the EOMS unguided munitions detection data which it also passes to the aircrew through aural and visual alerts. The aircrew then applies the appropriate Tactics, Techniques and Procedures (TTPs) to break contact or engage the enemy with own-ship ordnance. The CMWS Generation 3 (Gen 3) ECU in conjunction with ongoing software development efforts will address outstanding material release conditions to achieve a Full Material Release (FMR) for CMWS and ensure protection against emerging IR-guided missile threats. \n\nThe A-Kit for CMWS includes mounting hardware, wiring harnesses, cables, and other components necessary to install and interface the mission kit on host aircraft. The A-Kit ensures the mission kit is functionally and physically operational with a specific host aircraft type.\n\n\nEB4:\nThe Common Infrared Countermeasure (CIRCM) is an infrared (IR) countermeasure system that interfaces with a Missile Warning System (MWS) to provide near spherical protection of the host platform in order to defeat IR threat missiles.  The CIRCM will provide the sole acquisition of future laser-based IR countermeasure systems for all rotary-wing, tilt-rotor, and small fixed-wing aircraft across the Department of Defense.  The US Army's concept of CIRCM is part of the Suite of Integrated Infrared Countermeasures (SIIRCM).  The core components of the SIIRCM concept are: a Missile Warning System (MWS), IR expendables countermeasures (flares) and a laser-based IRCM.  The SIIRCM detects, declares and initiates IRCM against IR-guided Surface-to-Air Missiles (SAM) or Air-to-Air Missiles (AAM).  The CIRCM is the next generation of the laser-based IRCM component and will interface with both the Army's Common Missile Warning System (CMWS) and the Navy's future missile warning system.  CIRCM was approved to be funded to the Director, Cost Assessment and Program Evaluation Independent Cost Estimate (CAPE ICE) through Milestone B (MS B) per Defense Acquisition Executive Acquisition Decision Memorandum (DAE) (ADM), December 28, 2011.\n\nThe A-Kit for CIRCM includes mounting hardware, wiring harnesses, cables, and other components necessary to install and interface the mission kit on host aircraft.  The A-Kit ensures the mission kit is functionally and physically operational with a specific host aircraft type.  The CIRCM B-Kit is the mission kit (laser, pointer tracker, and controller) required to achieve near spherical coverage for an aircraft.\n\n\n\nEB4 justification:\nFiscal Year 2016 Base RDT&E in the amount of $77.570 million supports the Engineering and Manufacturing Development (EMD) phase to include twelve A-Kit prototypes, platform integration, and integration with other Aircraft Survivability Equipment (ASE) systems."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "145.409"
                },
                "BudgetYearOne": {
                    "val": "143.099"
                },
                "BudgetYearOneBase": {
                    "val": "143.099"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "145.337"
                },
                "BudgetYearOne": {
                    "val": "77.570"
                },
                "BudgetYearOneBase": {
                    "val": "77.570"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "-0.072"
                },
                "BudgetYearOne": {
                    "val": "-65.529"
                },
                "BudgetYearOneBase": {
                    "val": "-65.529"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "-0.072"
                                },
                                "BudgetYearOne": {
                                    "val": "-65.529"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-65.529"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "EB4"
                    },
                    "ProjectTitle": {
                        "val": "CIRCM"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "128.189"
                        },
                        "BudgetYearOne": {
                            "val": "77.570"
                        },
                        "BudgetYearOneBase": {
                            "val": "77.570"
                        },
                        "BudgetYearTwo": {
                            "val": "72.909"
                        },
                        "BudgetYearThree": {
                            "val": "63.577"
                        },
                        "BudgetYearFour": {
                            "val": "54.401"
                        },
                        "BudgetYearFive": {
                            "val": "25.641"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Funds in the program are a realignment of funds from program VU8, PE 0604270A (Electronic Warfare Development) for more efficient and effective program management."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Common Infrared Countermeasure (CIRCM) is an infrared (IR) countermeasure system that interfaces with a Missile Warning System (MWS) to provide near spherical protection of the host platform in order to defeat IR threat missiles.  The CIRCM will provide the sole acquisition of future laser-based IR countermeasure systems for all rotary-wing, tilt-rotor, and small fixed-wing aircraft across the Department of Defense.  The US Army's concept of CIRCM is part of the Suite of Integrated Infrared Countermeasures (SIIRCM).  The core components of the SIIRCM concept are: a Missile Warning System (MWS), IR expendables countermeasures (flares) and a laser-based IRCM.  The SIIRCM detects, declares and initiates IRCM against IR-guided Surface-to-Air Missiles (SAM) or Air-to-Air Missiles (AAM).  The CIRCM is the next generation of the laser-based IRCM component and will interface with both the Army's Common Missile Warning System (CMWS) and the Navy's future missile warning system.  CIRCM was approved to be funded to the Director, Cost Assessment and Program Evaluation Independent Cost Estimate (CAPE ICE) through Milestone B (MS B) per Defense Acquisition Executive Acquisition Decision Memorandum (DAE) (ADM), December 28, 2011.\n\nThe A-Kit for CIRCM includes mounting hardware, wiring harnesses, and other components necessary to install and interface the mission kit on host aircraft.  The A-Kit ensures the mission kit is functionally and physically operational with a specific host aircraft type.  The CIRCM B-Kit is the mission kit (laser, pointer tracker, and controller) required to achieve near spherical coverage for an aircraft.\n\n\nJustification:\nFiscal Year 2016 Base RDT&E in the amount of $77.570 million supports the Engineering and Manufacturing Development (EMD) phase to include nine B-Kit prototypes, platform integration, and integration with other Aircraft Survivability Equipment (ASE) systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Development Efforts"
                                    },
                                    "Description": {
                                        "val": "RDT&E dollars begin the design and development of the CIRCM system."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "128.189"
                                            },
                                            "Text": {
                                                "val": "RDT&E dollars support the CIRCM EMD phase, prototype manufacturing for twelve B-Kit prototypes, and platform integration.\n\n\"Other Testing\" includes funds to acquire test threat assets."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "77.570"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "77.570"
                                            },
                                            "Text": {
                                                "val": "RDT&E dollars support the CIRCM EMD phase to include Critical Design Review (CDR), software testing, Airworthiness Release (AWR) testing, flight testing, Reliability Demonstration Testing (RDT), B-Kit ship set prototype deliveries, A-Kit integration, prototype A-Kit Modification Work Order (MWO) development, Training Support Plan (TSP) and Technical Manual (TM) development.\n\n\"Other Testing\" includes funds to acquire test threat assets."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "."
                                    },
                                    "Title": {
                                        "val": "APA Funding:  APA, BA 4, AZ3537"
                                    },
                                    "Funding": {
                                        "BudgetYearTwo": {
                                            "val": "64.942"
                                        },
                                        "BudgetYearThree": {
                                            "val": "104.858"
                                        },
                                        "BudgetYearFour": {
                                            "val": "166.201"
                                        },
                                        "BudgetYearFive": {
                                            "val": "216.127"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "None"
                        },
                        "AcquisitionStrategy": {
                            "val": "The December 28, 2011 DAE ADM authorized entry into the Technology Development (TD) phase, designated the program a pre-Major Defense Acquisition Program (MDAP), and approved the updated exit criteria.  CIRCM will continue pre-MS B activities until MS B approval.  Contract award to a single vendor is anticipated in the third quarter of FY15.  The EMD contract will include priced options for Other Platform A-Kit Development, A-Kit Engineering Support, Low Rate Initial Production (LRIP) 1 and 2 Prototypes (Hardware and Installs), LRIP 1 and 2 Engineering and Test Support, Software Technical Data Package (TDP), Navy funded requirements, and Defense Exportability Features (DEF).  Upon CIRCM MS C approval planned for the fourth quarter of FY17, the LRIP and Engineering Support options may be exercised and the program may immediately enter the Production & Deployment phase with First Unit Equipped (FUE) planned for third quarter of FY19, and a Full Rate Production Decision Review (FRPDR) planned for the third quarter of FY19."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "System Engineering Program Management"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "-"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "10.588"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "9.503"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "9.503"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Non-Recurring Engineering (NRE)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "-"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "39.042"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-06"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "34.626"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "34.626"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Prototype Manufacturing"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "-"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "40.031"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-06"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "13.890"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "13.890"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Other R&D"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "-"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "5.290"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.167"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "5.167"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Data"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "-"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.427"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.427"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-05"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Support Equipment"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "-"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.700"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.500"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-07"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Government System Test and Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "-"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.500"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.050"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "5.050"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-04"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Other Testing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "-"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "30.038"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "6.407"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "6.407"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-05"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "76651-175.png"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "76651-176.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "TD Phase"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Laser Integration Test and Evaluation (LITE) Lab"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Reliability Demonstration Test (TD)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Guided Weapons Evaluation Facility (GWEF) - TD Phase"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Pallet Flight Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Bridge Activity"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "MS B"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "EMD Contract Award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "EMD Phase"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Critical Design Review (CDR) Risk Reduction Test Activity"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "CDR"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Prototype Deliveries"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Developmental Test Activity"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Reliability Demonstration Test (EMD)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "GWEF - EMD Phase"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "MS C"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LRIP"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Initial Operational Test and Evaluation (IOT&E)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FUE"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FRPDR"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "EE3"
                    },
                    "ProjectTitle": {
                        "val": "A\/C Surv Equip Dev"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "14.838"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Funds in the program are a realignment of funds from program 665, PE 0604270A (Electronic Warfare Development). Transitioned to Project ER7, PE 605051A Aircraft Survivability Development in FY 2016."
                        },
                        "ProjectMissionDescription": {
                            "val": "The objective of the Aircraft Survivability Equipment (ASE) Development project is to improve Radio Frequency (RF) ASE for Army aviation. The APR-39 Radar Warning Receiver (RWR) detects, categorizes, and prioritizes Radio Frequency (RF) emitters and provides a visual \/ aural alert to aircrew members warning them of targeting by RF-guided weapons. The Milestone Decision Authority (MDA) approved Phases 1 and 2 of a 3-phased path forward. \n\nPhase 1 serves as an obsolescence \/ sustainment upgrade to the Processor Line Replaceable Unit (LRU) of the AN\/APR-39A(V) Radar Warning Receiver (RWR) implemented to ensure that the currently fielded system remains viable until affordable improved RF ASE capability can be pursued in Phases 2 and 3. \n\nPhase 2, RWR Modernization, adopts the ongoing United States Navy Class I RWR Engineering Change Proposal (ECP), commonly referred to as the APR-39D(V)2 system. APR-39D(V)2 will significantly improve the near-spherical RF threat coverage, automatic detection and identification of threat types, bearing, and lethality. Under Phase 2, the Army will develop enhancements to the APR-39D(V)2, including integrated suite control functionality, threat correlation and off-boarding capability, and hardware upgrades needed to keep the APR-39D(V)2 technically relevant and address emerging Low Probability Intercept (LPI) and frequency agile threats. \n\nPhase 3 adds active Electronic Countermeasures (ECM) jamming capability for selected aircraft; Materiel Development Decision (MDD) for this ECM jamming capability phase is not expected until later in the Future Years Defense Program(FYDP).\n\nJustification: There is no Fiscal Year (FY) 2016 Base RDT&E dollar funding requirement for PE 655035 project EE3. FY16 justification is reported under ER7."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Phase 2 Radio Frequency CM"
                                    },
                                    "Description": {
                                        "val": "Phase 2 Product Development (Digital RWR)"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.838"
                                            },
                                            "Text": {
                                                "val": "Will fund testing of Phase 2 prototypes, Mission Data Set (MDS) development, platform integration on AH-64E, and integration with other ASE systems."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "AZ3511"
                                    },
                                    "Title": {
                                        "val": "Radio Frequency CM (AZ3511)"
                                    },
                                    "Funding": {
                                        "CurrentYear": {
                                            "val": "56.163"
                                        },
                                        "BudgetYearOne": {
                                            "val": "28.730"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "28.730"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "145.749"
                                        },
                                        "BudgetYearThree": {
                                            "val": "23.538"
                                        },
                                        "BudgetYearFour": {
                                            "val": "41.133"
                                        },
                                        "BudgetYearFive": {
                                            "val": "144.724"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Army RF ASE is managed by Project Manager ASE (PM ASE) for development, testing, procurement, integration and installation on Army rotary wing and small fixed wing aviation platforms. PM ASE proposed a three-phased path forward commensurate with user priorities and affordability considerations. The Milestone Decision Authority (MDA) approved Phases 1 and 2 of a 3-phased path forward.\n\nPhase 1 addresses obsolescence\/Diminishing Manufacturing Sources (DMS) issues associated with the currently fielded AN\/APR-39A(V) Radar Warning Receiver (RWR) via sole source Engineering Change Proposal (ECP) awarded to the APR-39A manufacturer. \n\nPhase 2 adopts the on-going United States Navy (USN) RWR Class I Correction of Deficiencies ECP commonly referred to as the APR-39D(V)2 system, limiting service-unique design, test, and integration expenses. Full Army participation throughout the remaining development, testing, procurement, fielding, and sustainment of the APR-39D(V)2 Digital RWR will address the significant Army RF capability gap while avoiding additional costs associated with a single-Service solution. This multi-Service approach also fields an effective and suitable Material Solution 3 years sooner to support the re-balance of the National Defense Strategy to the RF threat-heavy Asia-Pacific Region. \n\nPhase 3 will develop and integrate active Electronic Countermeasures jamming capability for select aircraft."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Other Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "-"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "7.985"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.267"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Project Management"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "-"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.182"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.247"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Digital Radar Warning Receiver (RWR)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Lab Demo \/ Study"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "10.634"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "S\/W Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "OGA,"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen Proving Ground, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.817"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "SIL Updates"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "-"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "AMRDEC"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.121"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Depot Standup"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Tobyhanna"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Tobyhanna, PA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.052"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Platform Integration"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Multiple"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "-"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.729"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Contractor Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "-"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.359"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.397"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Matrix Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "-"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "6.236"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.114"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Multi-Service DT\/OT"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "-"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.025"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "5.629"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Government system Test and Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.517"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "76651-177.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Phase 1 APR-39C(V)1 Fielding Decision"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Phase 1 APR-39C(V)1 FUE"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Phase 2 APR-39D(V)2 Army Design Requirements Insertion"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Phase 2 APR-39D(V)2 Prototype Fabrication and Qualification"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Phase 2 APR-39D(V)2 DT\/OT"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Phase 2 APR-39D(V)2 Platform Integration"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Phase 2 APR-39D(V)2 Procurement Decision"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Phase 2 Procurement \/ Deployment"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Phase 2 APR-39D(V)2 FUE"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Emerging Threats"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Software Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "EE4"
                    },
                    "ProjectTitle": {
                        "val": "Common Missile Warning System (CMWS)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "2.310"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "FY15 funds in the program are a realignment of funds from program VU7, PE 0604270A (Electronic Warfare Development). FY16 funds are realigned to Project ER8, PE 605051A (Aircraft Survivability Development)."
                        },
                        "ProjectMissionDescription": {
                            "val": "The US Army operational requirements concept for Aviation Infrared (IR) countermeasure systems is known as the Suite of Integrated Infrared Countermeasures (SIIRCM). SIIRCM is an integrated warning and countermeasure system to enhance aircraft survivability against IR-guided threat missile systems. The Common Missile Warning System (CMWS) is a core element of the SIIRCM concept. CMWS is an integrated ultraviolet (UV) missile warning system, with an Improved Countermeasure Dispenser (ICMD) serving as a subsystem to a host aircraft. \n\nThe CMWS program is a UV missile warning system that cues both flare and laser-based countermeasures to defeat incoming IR-seeking missiles and will alert aircrews to the presence of certain incoming unguided munitions. The B-Kit consists of the components which perform the missile detection and aircrew notification, unguided munitions detection and aircrew notification, false alarm rejection, and countermeasure employment\/cueing functions of the system. The CMWS Electronic Control Unit (ECU) receives UV missile detection data from Electro-Optic Missile Sensors (EOMS) and sends a missile alert signal to warn aircrews via on-board avionics. Tier 1 threat missiles detected and tracked by the CMWS are subsequently defeated by a combination of missile seeker countermeasures, including decoy flares and IR Laser Jamming (currently ATIRCM-equipped CH-47 platform only). In addition, the CMWS ECU receives from the EOMS unguided munitions detection data which it also passes to the aircrew through aural and visual alerts. The aircrew then applies the appropriate Tactics, Techniques and Procedures (TTPs) to break contact or engage the enemy with own-ship ordnance. The CMWS Generation 3 (Gen 3) ECU in conjunction with ongoing software development efforts will address outstanding material release conditions to achieve a Full Material Release (FMR) for CMWS and ensure protection against emerging IR-guided missile threats. \n\nThe A-Kit for CMWS includes mounting hardware, wiring harnesses, cables, and other components necessary to install and interface the mission kit on host aircraft. The A-Kit ensures the mission kit is functionally and physically operational with a specific host aircraft type.\n\nJustification: There is no Fiscal Year (FY) 2016 Base RDT&E dollar funding requirement for EE4. FY16 justification is reported under ER8."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Development Effort"
                                    },
                                    "Description": {
                                        "val": "-"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.310"
                                            },
                                            "Text": {
                                                "val": "RDT&E funding supports continuing development engineering of the Threat Analysis Database (TAD), salaries, and integration with other ASE systems."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "APA"
                                    },
                                    "Title": {
                                        "val": "BA 4 AZ3517"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "103.021"
                                        },
                                        "CurrentYear": {
                                            "val": "60.401"
                                        },
                                        "BudgetYearOne": {
                                            "val": "78.348"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "78.348"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "42.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "38.331"
                                        },
                                        "BudgetYearFour": {
                                            "val": "33.358"
                                        },
                                        "BudgetYearFive": {
                                            "val": "19.110"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The acquisition strategy includes buying CMWS B-Kits to support the Army Force Generation (ARFORGEN) model and installation of A-Kits on all modernized aircraft. The previous CMWS production contract was a firm fixed-priced (FFP), Indefinite Delivery, Indefinite Quantity (IDIQ) contract. A FFP bridge contract was awarded March 2013 for CMWS hardware. The follow-on CMWS production FFP\/CPFF IDIQ contract is a 3 year firm fixed price contract to procure the remaining Generation 3 Electronic Control Units (ECUs) and A-Kits and was awarded SEP 2013. The Gen 3 ECU, which provides increased processing capacity and enables unguided munitions detection, became a part of the system in FY 2010; First Unit Equipped (FUE) for the Gen 3 ECU was achieved in Operation Enduring Freedom (OEF) on 18 September 2013. All aircraft deployed to OEF have received the new processor with hostile fire detection capability. Gen 3 ECU's will gradually replace all Gen 2 ECU's across the Aviation fleet between now and 2017."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "CMWS Systems Engineering Program Management"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "PM ASE, HSV, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.670"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.206"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "CMWS Tier 2\/3 Upgrades"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "-"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.000"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "CMWS Threat Analysis Database Design"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "BAE"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.455"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Threat Analysis Database (TAD)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "BAE"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.104"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-06"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "CMWS Enhanced Sensor Study & Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "-"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "11.466"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "76651-178.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "CMWS system Dev\/Tier 2 and 3 Upgrades (TAD Updates)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2011"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "CMWS Enhanced Sensor Study & Evaluation"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "CMWS Gen 3 Production"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}