{
    "id": "159dac8e2a35d3d367dbbb1a70c384c9d7b2082c",
    "meta": {
        "filename": "dod-2016_RDTE_2016_MDA_RDTE_JustificationBook_Missile_Defense_Agency_PB_2016.zzz_unzipped_RDTE_JustificationBook_Missile_Defense_Agency_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Missile Defense Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603180C"
        },
        "ProgramElementTitle": {
            "val": "Advanced Research"
        },
        "R1LineNumber": {
            "val": "34"
        },
        "MdapCode": {
            "val": "362"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Missile Defense Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "23.025"
            },
            "CurrentYear": {
                "val": "16.584"
            },
            "BudgetYearOne": {
                "val": "17.364"
            },
            "BudgetYearOneBase": {
                "val": "17.364"
            },
            "BudgetYearTwo": {
                "val": "18.919"
            },
            "BudgetYearThree": {
                "val": "20.380"
            },
            "BudgetYearFour": {
                "val": "21.069"
            },
            "BudgetYearFive": {
                "val": "21.457"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "N\/A"
        },
        "ProgramElementMissionDescription": {
            "val": "Advanced Research conducts leading edge research and development to create and enable future missile defense capability. The Missile Defense Agency (MDA) executes this mission by capitalizing on the creativity and innovation of the brightest minds in our Nation's universities and small businesses, collaborative research partnerships between allied country academic institutions, and innovative ideas from industry.  This includes a focus on facilitating the transition of technology to the Ballistic Missile Defense System through a Commercialization and Transition Office and the execution of the Rapid Innovation Fund Program.  Advanced Research identifies priorities and balances the research portfolio in collaboration with the Agency's Chief Engineer and an Agency-wide executive level Research Council.\n\nMD40 Program-Wide Support (PWS) consists of essential non-headquarters management efforts providing integrated and efficient support to the MDA functions and activities across the entire Ballistic Missile Defense System (BMDS)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "19.188"
                },
                "CurrentYear": {
                    "val": "16.584"
                },
                "BudgetYearOne": {
                    "val": "16.715"
                },
                "BudgetYearOneBase": {
                    "val": "16.715"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "23.025"
                },
                "CurrentYear": {
                    "val": "16.584"
                },
                "BudgetYearOne": {
                    "val": "17.364"
                },
                "BudgetYearOneBase": {
                    "val": "17.364"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "3.837"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.649"
                },
                "BudgetYearOneBase": {
                    "val": "0.649"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "4.720"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.883"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustment"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.649"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.649"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2016 increase reflects realignment of Department of Defense priorities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "MD25"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Technology Development"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "23.025"
                        },
                        "CurrentYear": {
                            "val": "15.787"
                        },
                        "BudgetYearOne": {
                            "val": "16.549"
                        },
                        "BudgetYearOneBase": {
                            "val": "16.549"
                        },
                        "BudgetYearTwo": {
                            "val": "17.977"
                        },
                        "BudgetYearThree": {
                            "val": "19.295"
                        },
                        "BudgetYearFour": {
                            "val": "19.903"
                        },
                        "BudgetYearFive": {
                            "val": "20.237"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "N\/A"
                        },
                        "ProjectMissionDescription": {
                            "val": "Advanced Technology Development explores new Ballistic Missile Defense System (BMDS) capability by leveraging the creativity and innovation of the Nation's small businesses and universities, and through cooperative international research agreements  between U.S. and foreign universities of allied nations. The program manages the selection process and administers the Missile Defense Small Business Innovation Research (SBIR) Program Element, 0605502C.  SBIR topics and projects are selected annually based on identified needs across the BMDS and executed in partnership with the sponsoring elements. In FY 2016, the program will conduct Advanced Technology Innovation Broad Agency Announcement (ATI BAA) solicitation for identifying potential breakthrough research on missile defense related technology with private industry, qualified accredited educational institutions, and non-profit organizations. Projects may include directed energy, sensors, command and control, or interceptor technology.  The program will execute and administer the Missile Defense Agency Science, Technology and Research Broad Agency Announcement (MSTAR BAA) which invests in university research ranging from sensor data fusion to solid rocket propulsion to advanced materials for missile defense application.\n\nAdvanced Technology Development pursues a broad range of revolutionary technology targeted for application and insertion into the BMDS.  This work facilitates the commercialization and transition of promising technology into the BMDS by promoting a cooperative environment to reduce cost and increase return on investment between small business, prime contractors and MDA elements."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Research"
                                    },
                                    "Description": {
                                        "val": "N\/A"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "23.025"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Awarded Advanced Research contracts to domestic universities for innovative investigations to enlarge the battle space and enhance discrimination and raid handling \n\n-Pursued on-going scientific and engineering university research initiatives and projects:\n-- Alabama A&M University : Reconfigurable computing for multi-sensor tracking applications\n-- Johns Hopkins University: Parameterized fragmentation models for intercept optical signatures\n-- Texas A&M University: Ignition of composite propellants with advanced additives \n-- Texas A&M University: Hybrid waveguide\/micro electro mechanical system optical signal processor\n-- University of Texas: Nanomaterial-based printing of conformable X-Band Phased Array Antenna\n-- University of Alabama Huntsville: Green oxidizer development\n-- University of Connecticut: Radar signal processing for system tracks and correlation ambiguity\n-- University of Illinois: Decision theory for optimal engagement planning\n-- University of New Hampshire: Gas circulator for diode pumped alkali laser\n-- University of Southern California: Algorithms for detection, track and classification objects in high\n    debris environment\n\n-Sponsored breakthrough technology and innovative solutions from private industry, qualified accredited domestic educational institutions, and nonprofit organizations, using the Advanced Technology Innovation Broad Agency Announcement (ATI BAA)\n\n\n-Conducted research and material solution analysis to identify initiatives and technology to include missiles, sensors, and command and control components in the defense against current and future threats:\n--Howard University: Infrared analysis in counterfeit parts detection and supply chain validation\n-- Purdue University: Propulsion improvements for Divert Attitude Control Systems (DACS) thrusters\n-- University of Dayton: Common aperture use of lighter high-energy lasers\n-- University of New Hampshire: Numerical simulations of diode pumped alkali lasers with spatial geometries\n-- University of Tennessee: Target handoff and resource management for multi-sensor, multi-target  tracking\n   systems\n-- University of Maryland: Development of 20N class ADN (Ammonium DiNitramide) thrusters for fast response time DACS propulsion  systems\n\n-Partnered with industry, the High Energy Laser Joint Technology Office, Universities and National Laboratories through advanced technology initiatives to improve sensor technology, high energy laser acquisition, tracking, and pointing technology, and lightweight fiber laser amplifiers\n -- Successfully completed a joint Air Force\/Missile Defense Agency test series, combining an MQ-9 with an F-16, to collect airborne sensor data for future Integrated Air and Missile Defense initiatives\n\n-Leveraged University-to-University (UUR) International Research opportunities with allied nations to enhance Ballistic Missile Defense System (BMDS) Advanced Technology initiatives and build stronger relationships with Missile Defense Agency (MDA) North Atlantic Treaty Organization (NATO) Allied nations and our partner countries:\n--North Carolina State University\/Czech Republic Institute of Physics: Multi-sensor algorithm development to\n    track space objects and debris\n--Auburn University\/Middle East Technical University of Turkey: Integrated framework for engineering reliability\n   into high assurance BMDS simulations\n--University of Nebraska, Lincoln\/University of Bordeaux, France: Fast deposition of diamond films for thermal\n   management, wear resistance, and corrosion resistance\n--University of Nebraska, Lincoln\/University of Rouen, France: Polymer parts with tailored microstructure \n   distribution optimized to reduce the weight of parts\n\n-Instituted an International Cooperative Agreement between the Department of Defense of the United States of America and the Ministry of Defense of the Kingdom of Denmark concerning ballistic missile defense technology. Frequency Modulated Continuous Wave radar project to determine the utility of high-resolution range\/range-rate radar technology for ballistic missile defense applications \n\n-Managed the Commercialization and Transition process of the Small Business Innovation Research (SBIR) and Technology Applications programs to assist MDA-funded technology developers in finding and entering technology transfer opportunities to missile defense applications:\n--Corvid Technologies Inc. transitioned hypervelocity impact modeling\n--Frontier Technology Inc. transitioned improvements in spacecraft assembly, integration and test for Navy fleet\n   energy reduction analysis and data management\n--Innovative Defense Technology transitioned an automatic test and analysis tool for improving test data \n   processing time and reducing cost \n--Sentar Inc. transitioned software to provide an integrated risk assessment of vulnerabilities, weaknesses, and \n   malicious threats for software code analysis\n--Mentis Sciences transitioned air defense radome technology in support of David's Sling Weapons System\n--San Diego Composites transitioned lightweight composite hardware into the Common Kill Vehicle for Ground\n   Based Missile Defense and Standard Missile 3 upgrades  \n\n-Accelerated the transition and fielding of innovative technology into military and Ballistic Missile Defense systems from small businesses through the Rapid Innovation Fund Broad Agency Announcement for the following research areas:\n--Counterfeit Parts Detection\n--High Performance Divert and Attitude Control Components\n\n-Conducted system engineering and integration to identify and mature initiatives and technology to defend against current and future threats"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.787"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Pursue on-going scientific and engineering university research initiatives and projects:\n  --Texas A&M University: Solid Propellant Additives for Divert Attitude Control System (DACS) Applications \n  --Texas A&M University: Hybrid Waveguide\/Micro Electro Mechanical System Optical Signal Processor\n  --University of Illinois: Decision Theory for Optimal Engagement Planning \n  --University of Tennessee: Target Handoff and Resource Management for Multi-Sensor Multi-Target Tracking\n    System \n  --University of Alabama Huntsville: Computational studies of aero-optic effects of higher Reynolds numbers gas\n    flows over sensor structures \n  --University of Southern California: Algorithms for detection, track, and classification of objects in a high debris\n    environment \n  --University of Maryland: Development of Thrusters for Fast Response Time DAC Propulsion\n    Systems\n  --University of New Hampshire: Gas Circulator for Diode Pumped Alkali Laser\n  --University of Connecticut: Innovative Radar Signal Processing & Algorithms\n  --Purdue University: Propulsion Improvements for MDA Applications\n  --Howard University: Infrared Analysis in Counterfeit Parts Detection and Supply Chain Validation\n  --Auburn University \/ Middle East Technical University, Turkey: Integrated Framework for Engineering Replicability into High Assurance BMDS Simulations\n\n-Sponsor breakthrough technology and innovative solutions from private industry, qualified accredited domestic educational institutions, and nonprofit organizations, using the Advanced Technology Innovation Broad Agency Announcement (ATI BAA), to include research in: \n  -- Radar Systems\n  -- Directed Energy Systems\n  -- Electro-Optical \/ (Infrared)IR Sensor Systems\n  -- Computer Science, Signal and Data Processing\n  -- Mechanical and Aerospace engineering\n  -- Decision Theory\n  -- Modeling & Simulation\n  -- Interceptor Technology\n  -- Sensor Technology\n\n-Partner with industry, the High Energy Laser Joint Technology Office, Universities and National Laboratories through advanced technology initiatives to improve sensor technology, high energy laser acquisition, tracking, and pointing technology, and lightweight fiber laser amplifiers\n\n-Conduct research and material solution analysis to identify initiatives and technology to include missiles, sensors, and command and control components in the defense against current and future threats\n\n-Leverage University-to-University (UUR) International Research opportunities with allied nations to enhance Ballistic Missile Defense System (BMDS) Advanced Technology initiatives and build stronger relationships with Missile Defense Agency (MDA) North Atlantic Treaty Organization (NATO) Allied nations and our partner countries.\n\n-Manage the selection process of the Small Business Innovation Research (SBIR) and Technology Applications programs to assist MDA-funded technology developers in finding and entering technology transfer opportunities to missile defense applications\n\n-Conduct system engineering and integration to identify and mature initiatives and technology to defend against current and future threats\n\n-MDA Science Technology Engineering and Mathematics (STEM) Outreach will expand volunteer activities for other MDA facilities to increase overall MDA K-12 STEM awareness and engagement nationwide"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.549"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.549"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Pursue on-going scientific and engineering university research initiatives and projects:\n  --Texas A&M University: Solid Propellant Additives for Divert Attitude Control System (DACS) Applications \n  --Texas A&M University: Hybrid Waveguide Micro Electro Mechanical System Optical Signal Processor\n  --Alabama A&M University: Reconfigurable Computing for Multi-Sensor Tracking Applications \n  --University of Texas at Austin: Nanomaterial-based Ink-Jet Printing Science and Technology for Conformable X-\n     Band Phased Array Antenna\n  --University of New Hampshire: Gas Circulator for Diode Pumped Alkali Laser (DPAL)\n  --University of Connecticut: Development of innovative solutions for hardware security, and detection and\n     prevention\n  -- University of New Hampshire: Numerical Simulations of DPAL with Co-Flowing Planar Jet Geometries\n  -- Auburn University \/ Middle East Technical University, Turkey: Integrated Framework for Engineering\n     Replicability into High Assurance Ballistic Missile Defense System (BMDS) Simulations\n\n-Sponsor breakthrough technology and innovative solutions from private industry, qualified accredited domestic educational institutions, and nonprofit organizations, using the Advanced Technology Innovation Broad Agency Announcement (ATI BAA), to include research in: \n  -- Radar Systems\n  -- Directed Energy Systems\n  -- Electro-Optical Infrared Sensor Systems\n  -- Computer Science, Signal and Data Processing\n  -- Mechanical and Aerospace engineering\n  -- Decision Theory\n  -- Modeling & Simulation\n  -- Interceptor Technology\n  -- Sensor Technology\n\n-Partner with industry, the High Energy Laser Joint Technology Office, universities and national laboratories through advanced technology initiatives to improve sensor technology, high energy laser acquisition, tracking, and pointing technology, and lightweight fiber laser amplifiers\n\n-Conduct systems engineering, integration, research and material solution analysis to identify initiatives and technology to include missiles, sensors, and command and control components in the defense against current and future threats\n\n-Leverage University-to-University (UUR) International Research opportunities with allied nations to enhance BMDS Advanced Technology initiatives and build stronger relationships with Missile Defense Agency (MDA) North Atlantic Treaty Organization (NATO) allied nations and our partner countries\n\n-Manage the selection process of the Small Business Innovation Research (SBIR) and Technology Applications programs to assist MDA-funded technology developers in finding and entering technology transfer opportunities to missile defense applications"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0603175C"
                                    },
                                    "Title": {
                                        "val": "Ballistic Missile Defense Technology"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "10.372"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "10.3720"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603176C"
                                    },
                                    "Title": {
                                        "val": "Advanced Concepts and Performance Assessment"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "6.919"
                                        },
                                        "CurrentYear": {
                                            "val": "8.470"
                                        },
                                        "BudgetYearOne": {
                                            "val": "12.139"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "12.139"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "13.227"
                                        },
                                        "BudgetYearThree": {
                                            "val": "12.932"
                                        },
                                        "BudgetYearFour": {
                                            "val": "13.249"
                                        },
                                        "BudgetYearFive": {
                                            "val": "13.219"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603177C"
                                    },
                                    "Title": {
                                        "val": "Discrimination Sensor Technology"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "29.642"
                                        },
                                        "CurrentYear": {
                                            "val": "36.610"
                                        },
                                        "BudgetYearOne": {
                                            "val": "28.200"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "28.200"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603178C"
                                    },
                                    "Title": {
                                        "val": "Weapons Technology"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "45.268"
                                        },
                                        "CurrentYear": {
                                            "val": "54.068"
                                        },
                                        "BudgetYearOne": {
                                            "val": "45.389"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "45.389"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "48.912"
                                        },
                                        "BudgetYearThree": {
                                            "val": "70.115"
                                        },
                                        "BudgetYearFour": {
                                            "val": "54.595"
                                        },
                                        "BudgetYearFive": {
                                            "val": "66.797"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603294C"
                                    },
                                    "Title": {
                                        "val": "Common Kill Vehicle Technology"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "67.796"
                                        },
                                        "CurrentYear": {
                                            "val": "25.639"
                                        },
                                        "BudgetYearOne": {
                                            "val": "46.753"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "46.753"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "75.262"
                                        },
                                        "BudgetYearThree": {
                                            "val": "71.476"
                                        },
                                        "BudgetYearFour": {
                                            "val": "86.814"
                                        },
                                        "BudgetYearFive": {
                                            "val": "99.701"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603904C"
                                    },
                                    "Title": {
                                        "val": "Missile Defense Integration and Operations Center (MDIOC)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "50.271"
                                        },
                                        "CurrentYear": {
                                            "val": "58.503"
                                        },
                                        "BudgetYearOne": {
                                            "val": "49.211"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "49.211"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "58.074"
                                        },
                                        "BudgetYearThree": {
                                            "val": "53.655"
                                        },
                                        "BudgetYearFour": {
                                            "val": "55.194"
                                        },
                                        "BudgetYearFive": {
                                            "val": "57.162"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The acquisition strategy to conduct these technology development agreements consists of partnering with accredited domestic universities, small businesses, and nonprofit organizations. Missile Defense Agency (MDA) awards competitive procurements via the MDA Science and Technology Advanced Research Broad Agency Announcement; the Advanced Technology Innovation Broad Agency Announcement; the Small Business Innovative Research program; and the Small Business Technology Transfer program."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MD40"
                    },
                    "ProjectTitle": {
                        "val": "Program-Wide Support"
                    },
                    "SpecialProject": {
                        "val": "1"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.797"
                        },
                        "BudgetYearOne": {
                            "val": "0.815"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.815"
                        },
                        "BudgetYearTwo": {
                            "val": "0.942"
                        },
                        "BudgetYearThree": {
                            "val": "1.085"
                        },
                        "BudgetYearFour": {
                            "val": "1.166"
                        },
                        "BudgetYearFive": {
                            "val": "1.220"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Program-Wide Support (PWS) contains non-headquarters management costs in support of Missile Defense Agency (MDA) functions and activities across the entire Ballistic Missile Defense System (BMDS). It Includes Government Civilians, Contract Support Services, and Federally Funded Research and Development Center (FFRDC) support.  This provides integrity and oversight of the BMDS as well as supports MDA in the development and evaluation of technologies that will respond to the changing threat. Additionally, PWS includes Global Deployment personnel and support performing deployment site preparation and activation and, provides facility capabilities for MDA Executing Agent locations.  Other MDA wide costs includes:  physical and technical security; civilian drug testing; audit readiness; the Science, Technology, Engineering, and Mathematics (STEM) program; legal services and settlements; travel and agency training; office and equipment leases; utilities; data and unified communications support; supplies and maintenance; materiel and readiness and central property management of equipment; and similar operating expenses. Program Wide Support is allocated on a pro-rata basis and therefore, fluctuates by year based on the adjusted RDT&E profile (which excludes:0305103C Cyber Security Initiative, 0603274C Special Program, 0603913C Israeli Cooperative Program and 0901598C Management Headquarters)."
                        }
                    }
                }
            ]
        }
    }
}