{
    "id": "19ffb16980cc1e4826bc2bef7c73c90a4fc1ef61",
    "meta": {
        "filename": "dod-2016_RDTE_2016_OSD_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2016.zzz_unzipped_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603727D8Z"
        },
        "ProgramElementTitle": {
            "val": "Joint Warfighting Program"
        },
        "R1LineNumber": {
            "val": "56"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "17.611"
            },
            "PriorYear": {
                "val": "3.325"
            },
            "CurrentYear": {
                "val": "5.396"
            },
            "BudgetYearOne": {
                "val": "9.626"
            },
            "BudgetYearOneBase": {
                "val": "9.626"
            },
            "BudgetYearTwo": {
                "val": "7.936"
            },
            "BudgetYearThree": {
                "val": "8.425"
            },
            "BudgetYearFour": {
                "val": "9.107"
            },
            "BudgetYearFive": {
                "val": "9.230"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Joint Warfighting Program (JWP) is a pivotal resource that synchronizes two Department-wide domains, military requirements and acquisition, with shared analyses and actionable assessments.  JWP supports analyses for customers including joint command staffs, the Joint Staff, and OSD elements responsible for oversight of Components equipping forces for joint missions. The account underwrites limited-scope analyses, experiments, and partnerships that define joint capability gaps and develop actionable requirements for follow-on acquisition efforts.  This program element plays a major role in portfolio assessments aiming to identify critical gaps between Service-generated capabilities and suggest affordable solutions. JWP funds venues for demonstration of emergent technology-based prototypes that enable joint customers to draft requirements based on realistic understanding of feasible solutions.  JWP specifically aims to assist joint-end-users by analyses that identify essential capability improvements as actionable joint military needs expressed as specific Key Performance Parameters (KKPs) and Key System Attributes (KSAs).  These analyses and assessments deliver independent perspectives on ways to align Service and Agency investments and potential solutions for capability gaps created by evolving threats not aligned to single Component missions.  Though a relatively modest program, JWP is consistently cited by joint combatant commanders’ staffs as the seminal infusion of funding that spawned insightful demonstrations, theater centers of excellence, mission essential capability modifications and strategic concepts.  JWP also underwrites staff analyses in the Acquisition, Technology & Logistics staff of the Office of the Secretary of Defense (OSD).  Working with Service, OSD and joint command counterparts, the AT&L staff performs portfolio assessments focusing on warfighting environments ten to twenty years ahead.   \n\nTypical projects funded with JWP include translation of capability gap assessments into actionable military needs statements, identification of candidate solutions via experimentation, translation of solution concepts into field demonstrations, and remedy of joint capability gaps in partnership with Defense agents for doctrine changes and technology development.  JWP resources dedicated to direct support joint commands provides analytic expertise not normally allocated via formal staffing billets.  In this activity, JWP underwrites small grants to invigorate employment of experimentation and analysis, to formulate strategies to resolve joint capability gaps, and to stimulate participation in the Department enterprises for joint experimentation and joint capability development.  JWP resources also support Mission Area Portfolio Assessments (MAPA), and the development of tools supporting joint analytic efforts.\n\nThe balance of JWP funds contributes resources to examination of potential remedies for joint mission capability gaps.  These early assessments of potential capability gap solutions can accelerate engineering development, subsequent field experiments, and capability demonstrations in field conditions.  This segment of JWP often represents the first effort to define alternative solutions across the range of Doctrine, Organization, Training, Material, Leadership and Personnel-Facilities.  The resources sustain a small segment of civilian operation research analysis (currently hosted by the Institute for Defense Analysis – IDA and the Naval Postgraduate School - NPS).  Administered by the Joint Operations Support (JOS) division within OSD’s AT&L organization, JOS works closely and continuously with joint customers around the world.  Analytic project selection is undertaken in consultation with the OSD staffs serving AT&L and Policy and with elements of the Joint Staff."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "3.425"
                },
                "CurrentYear": {
                    "val": "7.405"
                },
                "BudgetYearOne": {
                    "val": "7.683"
                },
                "BudgetYearOneBase": {
                    "val": "7.683"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "3.325"
                },
                "CurrentYear": {
                    "val": "5.396"
                },
                "BudgetYearOne": {
                    "val": "9.626"
                },
                "BudgetYearOneBase": {
                    "val": "9.626"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.100"
                },
                "CurrentYear": {
                    "val": "-2.009"
                },
                "BudgetYearOne": {
                    "val": "1.943"
                },
                "BudgetYearOneBase": {
                    "val": "1.943"
                }
            },
            "AdjustmentDetails": {
                "CongressionalDirectedReductions": {
                    "CurrentYear": {
                        "val": "-2.009"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.100"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Baseline Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "1.943"
                                },
                                "BudgetYearOneBase": {
                                    "val": "1.943"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2016 baseline adjustments to support emergent priorities in the Department."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P727"
                    },
                    "ProjectTitle": {
                        "val": "Joint Warfighting"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "17.611"
                        },
                        "PriorYear": {
                            "val": "3.325"
                        },
                        "CurrentYear": {
                            "val": "5.396"
                        },
                        "BudgetYearOne": {
                            "val": "9.626"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.626"
                        },
                        "BudgetYearTwo": {
                            "val": "7.936"
                        },
                        "BudgetYearThree": {
                            "val": "8.425"
                        },
                        "BudgetYearFour": {
                            "val": "9.107"
                        },
                        "BudgetYearFive": {
                            "val": "9.230"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Warfighting Program (JWP) is a pivotal resource that synchronizes two Department-wide domains, military requirements and acquisition, with shared analyses and actionable assessments.  JWP supports analyses for customers including joint command staffs, the Joint Staff, and OSD elements responsible for oversight of Components equipping forces for joint missions. The account underwrites limited-scope analyses, experiments, and partnerships that define joint capability gaps and develop actionable requirements for follow-on acquisition efforts.  This program element plays a major role in portfolio assessments aiming to identify critical gaps between Service-generated capabilities and suggest affordable solutions. JWP funds venues for demonstration of emergent technology-based prototypes that enable joint customers to draft requirements based on realistic understanding of feasible solutions.  JWP specifically aims to assist joint-end-users by analyses that identify essential capability improvements as actionable joint military needs expressed as specific Key Performance Parameters (KKPs) and Key System Attributes (KSAs).  These analyses and assessments deliver independent perspectives on ways to align Service and Agency investments and potential solutions for capability gaps created by evolving threats not aligned to single Component missions.  Though a relatively modest program, JWP is consistently cited by joint combatant commanders’ staffs as the seminal infusion of funding that spawned insightful demonstrations, theater centers of excellence, mission essential capability modifications and strategic concepts.  JWP also underwrites staff analyses in the Acquisition, Technology & Logistics staff of the Office of the Secretary of Defense (OSD).  Working with Service, OSD and joint command counterparts, the AT&L staff performs portfolio assessments focusing on warfighting environments ten to twenty years ahead.   \n\nTypical projects funded with JWP include translation of capability gap assessments into actionable military needs statements, identification of candidate solutions via experimentation, translation of solution concepts into field demonstrations, and remedy of joint capability gaps in partnership with Defense agents for doctrine changes and technology development.  JWP resources dedicated to direct support joint commands provides analytic expertise not normally allocated via formal staffing billets.  In this activity, JWP underwrites small grants to invigorate employment of experimentation and analysis, to formulate strategies to resolve joint capability gaps, and to stimulate participation in the Department enterprises for joint experimentation and joint capability development.  JWP resources also support Mission Area Portfolio Assessments (MAPA), and the development of tools supporting joint analytic efforts.\n\nThe balance of JWP funds contributes resources to examination of potential remedies for joint mission capability gaps.  These early assessments of potential capability gap solutions can accelerate engineering development, subsequent field experiments, and capability demonstrations in field conditions.  This segment of JWP often represents the first effort to define alternative solutions across the range of Doctrine, Organization, Training, Material, Leadership and Personnel-Facilities.  The resources sustain a small segment of civilian operation research analysis (currently hosted by the Institute for Defense Analysis – IDA and the Naval Postgraduate School - NPS).  Administered by the Joint Operations Support (JOS) division within OSD’s AT&L organization, JOS works closely and continuously with joint customers around the world.  Analytic project selection is undertaken in consultation with the OSD staffs serving AT&L and Policy and with elements of the Joint Staff."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Support for Joint Capability Analysis"
                                    },
                                    "Description": {
                                        "val": "JWP resources are dedicated to analytic support for joint capability analysis and joint customers.  JWP supports joint capabilities by promoting analyses and assessments to address challenges specific to their theater or functional missions.  It aims to reinvigorate joint military staff capabilities to employ rigorous analysis and experimentation methodologies in support of specific mission assignments. It support joint commander identification of capability gaps and selectively funds limited objective experiments experiment to understand a concept or technology that addresses a specific joint mission challenge. JWP also resources Mission Area Portfolio Assessments (MAPA) serving the need of joint capability clients."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.469"
                                            },
                                            "Text": {
                                                "val": "-Completed an initial identification and technical review and analyses of on-going Service, Defense Agency, OSD, and Combatant Command (CCMD) re-use efforts, equipment data sources, files, and formats. \n-Identified the taxonomy and developed and coordinated the draft list of capability drivers for candidate re-use equipment, including technical, and cost factors to use to measure outputs and capability success metrics.\n-Completed the baseline system definition and Project Plan for a DOD Intelligence, Surveillance, and Reconnaissance (ISR) Pilot Proof of Principle construct and test bed platform in conjunction with the Air Force ISR Agency in San Antonio, TX.  \n-Supported initiatives to improve coordination of DoD Intelligence, Requirements and Acquisition domains.  Refined concept which will serve as a joint marketplace for coordination between Intelligence, Requirements and Acquisition enterprises by enabling intelligence tailored and efficient intelligence product support for acquisition Programs of Record.\n- Funded senior military mentors and contractor analytic support for detailed technical portfolio assessments of projected adversary capabilities.\n-Developed a Service Level Agreement concept that provides a mechanism for the marketplace serving acquisition customers and the intelligence service providers to interact and agree on information needs and products.\n-Supported the system hardening, system enhancements, and made software bug fixes. Testing was completed in August and results were submitted to the Army. \n-The Integrated Cyber Ops project explored in phases several case studies across a range of potential problem areas to ensure robust Pacific Command (PACOM) cyber capabilities. Developed test case for Exercise ULCHI FOCUS GUARDIAN 2015; a preliminary engineering design for Pacific Command’s Supervisory Control and Data Acquisition (SCADA) experiment FY15; a draft Modeling & Simulation (M&S) plan for conducting realistic cyber training environment for PACOM Cyber Protection teams."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.238"
                                            },
                                            "Text": {
                                                "val": "Continue emphasis on enhancing Mission Area Portfolio Assessments (MAPAs) to provide insights for future technology-based military capabilities serving the needs of joint warfighters.  Provide direct analytical support responding to emergent joint military staffs to identify capability gaps and military needs for material solutions.  Continue to support Joint Interagency Field Experimentation (JIFX) effort hosted by Naval Postgraduate School. Support joint commanders to develop and refine capability requirements.  Continue to partner with joint military staffs, encouraging experimentation cells to address mission capability gaps, explore potential solutions, and improve understanding of new technologies and concepts in response to evolving missions and military threats.  Empower the joint military staffs to employ rigorous analysis and experimentation methodologies. Continue work to finalize the Defense Asset Capability Re-Use Initiative (DECRI) system architecture and Project Plan for system build, and begin actual development and implementation of the DECRI decision support and information system. Update ISR module tables to additional Joint Capability Areas (JCAs), design DECRI interfaces and automated data feeds, and conduct detailed DECRI system and warfighter\/Combatant Command (CCMD) user assessments. Plan and execute an analysis for Airborne Intelligence, Surveillance, and Reconnaissance (AISR) Transport Infrastructure.  Several CCMDs, specifically SOCOM, CENTCOM, AFRICOM, and PACOM, have documented issues with how the current and projected AISR Transport Infrastructure falls short of meeting operational needs.  The CBA will be developed in accordance with JCIDS processes through a working group led by AT&L, Joint Staff, and DoD Chief Information Office (CIO), and will include the Services, the CCMD, USD(I), and several agencies.  Material gaps identified in the Capability Based Assessment (CBA) will be used to develop an Initial Capabilities Document (ICD) that could support an Analysis of Alternative (AoA) and subsequent program start."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.776"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.776"
                                            },
                                            "Text": {
                                                "val": "Continue emphasis on Mission Area Portfolio Assessment (MAPA) to provide insights for acquisition decisions focused on capability development serving the needs of joint commanders and joint clients.  Provide direct analytical support responding to emergent joint military staffs to identify capability gaps and military needs for material solutions.  Continue to support Joint Interagency Field Experimentation (JIFX) effort hosted by Naval Postgraduate School. Support joint commanders to develop and refine capability requirements.  Continue to partner with joint military staffs, encouraging experimentation cells to address mission capability gaps, explore potential solutions, and improve understanding of new technologies and concepts in response to evolving missions and military threats.  Empower the joint military staffs to employ rigorous analysis and experimentation methodologies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Analytic Development of Joint Military Requirements Addressing Evolving Threats \/ Missions"
                                    },
                                    "Description": {
                                        "val": "This segment underwrites innovative, responsive and timely analytic support on joint capability development serving the needs of joint warfighters in partnership with senior acquisition staffs.  It provides an independent source to examine potential remedies for mission capability gaps and can establish a framework for subsequent field experiments, capability demonstrations or accelerated acquisition.  Joint warfare independent analysis often represents the first effort to define alternative solutions across the range of Doctrine, Organization, Training, Material, Leadership and Personnel-Facilities.  These resources leverage a small analytic framework (currently consisting of analysts at the Institute for Defense Analysis (IDA), and the Naval Postgraduate School (NPS)).  Administered by the Joint Operations Support cell within OSD\/AT&L, this fund capability gap definition and technology based initiatives.  Project selection is undertaken in consultation with the OSD staffs serving Acquisition, Technology, and Logistics (AT&L) and Policy and with elements of the Joint Staff."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.856"
                                            },
                                            "Text": {
                                                "val": "-Conducted the Joint Interagency Field Experiment (JIFX) in partnership with the Naval Post Graduate School to enable Combatant Command staffs to better define capability requirements.\n-Conducted in JIFX three, week-long, field experiments focused on emerging technologies with over 120 individual experiments engaging more than 800 participants from industry, academia, Non-Government Organizations (NGOs), all services, 8 of 9 CCMDs  and other government agencies to include Departments of Homeland Security (co-sponsor), State, Energy, Justice, Health and Human Services and  Transportation.\n-Conducted in JIFX general technology assessments of all experiments and provided the results to CCMDs (and other federal entities upon request) in the form of published technical reports available on the JIFX website or from the Defense Technical Information Center. This information provides the CCMDs in the requirements process and limited objective experiments. Evaluation data for individual experiments was shared with the technology provider and early indications are that more than 75% of these organizations change their products based on this government feedback.\n-Conducted in JIFX detailed cyber and Radio Frequency (RF) vulnerability assessments of 23 emerging technologies providing thorough and realistic potential adversarial assessment of a single technologies and a system-of-systems early in the technology development cycle.  This information was provided to CCMDs in the form of technical reports for use in requirements development and is available for acquisition decision-making. Early data suggests that more than 90% of these technology providers change their products based on this feedback.\n-Initiated development of a risk evaluation strategy for cyber effects to inform FY16 Platform Resilience and Mission Assurance analytical agenda.\n-Developed a cyber-vulnerability mitigation strategy typology that complements DoD's Risk Management Framework. \n-Examined mission priorities and criticality of systems (weapon systems and tactical communications systems) based on Department planning scenarios as a precursor for evaluating cyber resilience.\n-Initiated alignment of cyber effects to missions to determine potential risk, opportunities, impacts and implications as a precursor to inform cyber resilience roadmaps.\n-Completed a review of analytical approaches being used (or could be used) to identify key cyber terrain in both fielded weapon systems and systems at various stages in the acquisition process."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.158"
                                            },
                                            "Text": {
                                                "val": "This segment will provide independent analysis of joint issues and capability gaps.  It will provide responsive and timely capability development pathways and recommendations for rapid acquisition, field experiments conducted by joint military staffs and units.  It will provide an independent source for enabling capability development suitable for joint experimentation undertaken by joint authorities.  The findings of these investigative analyses frequently explore joint capability development via experiments and prototype demonstrations leading toward potential material solutions.  It will enable CCMDs to do experiments in the field that addresses regional capability gaps, explores potential solutions, and improves understanding of new technologies.  As before, it will empower the joint staffs to employ rigorous analysis and experimentation methodologies in support of their specific mission assignments, to assess their own needs critically and to examine viable capability gap solutions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.850"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.850"
                                            },
                                            "Text": {
                                                "val": "This segment will provide independent analysis of joint issues and capability gaps.  It will provide responsive and timely capability development pathways and recommendations for rapid acquisition, field experiments conducted by joint military staffs and units.  It will provide an independent source for enabling capability development suitable for joint experimentation undertaken by joint authorities.  The findings of these investigative analyses frequently explore joint capability development via experiments and prototype demonstrations leading toward potential material solutions.  It will enable CCMDs to do experiments in the field that addresses regional capability gaps, explores potential solutions, and improves understanding of new technologies.  As before, it will empower the joint staffs to employ rigorous analysis and experimentation methodologies in support of their specific mission assignments, to assess their own needs critically and to examine viable capability gap solutions."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Performance is measured through metrics including (1) objective validation of enhanced CCMD capabilities to perform joint missions in their assigned theaters and areas of responsibility, (2) documented delivery effective joint operational concepts, (3) confirmed production of refined and validated capability descriptions."
                        }
                    }
                }
            ]
        }
    }
}