{
    "id": "1ab435accfa0665dd76b5089f5a7d3a53ce5dc34",
    "meta": {
        "filename": "dod-2016_RDTE_2016_AIRFORCE_V2_RDTE_JustificationBook_Air_Force_PB_2016.zzz_unzipped_RDTE_JustificationBook_Air_Force_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0604759F"
        },
        "ProgramElementTitle": {
            "val": "Major T&E Investment"
        },
        "R1LineNumber": {
            "val": "94"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "31.423"
            },
            "CurrentYear": {
                "val": "47.232"
            },
            "BudgetYearOne": {
                "val": "68.302"
            },
            "BudgetYearOneBase": {
                "val": "68.302"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "66.845"
            },
            "BudgetYearThree": {
                "val": "66.142"
            },
            "BudgetYearFour": {
                "val": "66.436"
            },
            "BudgetYearFive": {
                "val": "67.679"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "32.341"
                },
                "CurrentYear": {
                    "val": "47.232"
                },
                "BudgetYearOne": {
                    "val": "68.755"
                },
                "BudgetYearOneBase": {
                    "val": "68.755"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "31.423"
                },
                "CurrentYear": {
                    "val": "47.232"
                },
                "BudgetYearOne": {
                    "val": "68.302"
                },
                "BudgetYearOneBase": {
                    "val": "68.302"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.918"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.453"
                },
                "BudgetYearOneBase": {
                    "val": "-0.453"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.918"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.453"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.453"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "664597"
                    },
                    "ProjectTitle": {
                        "val": "Air Force Test Investments"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "31.423"
                        },
                        "CurrentYear": {
                            "val": "47.232"
                        },
                        "BudgetYearOne": {
                            "val": "68.302"
                        },
                        "BudgetYearOneBase": {
                            "val": "68.302"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "66.845"
                        },
                        "BudgetYearThree": {
                            "val": "66.142"
                        },
                        "BudgetYearFour": {
                            "val": "66.436"
                        },
                        "BudgetYearFive": {
                            "val": "67.679"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This PE provides planning, improvements, and modernization for test capabilities at three Air Force Test Center (AFTC) organizations: 96 Test Wing at Eglin AFB FL (to include 96 Test Group at Holloman AFB NM, and operating locations at Wright-Patterson AFB OH), Arnold Engineering Development Complex (AEDC) at Arnold AFB TN and the 412 Test Wing at Edwards AFB CA.  The purpose is to help test organizations improve and develop their test infrastructure and capabilities to keep pace with improvements in weapon system technologies.  \n\nThe improvement and modernization (I&M) requirements are defined through the AF Test Investment Planning & Programming (TIPP) Process.  All projects have been reviewed through the Tri-Service Reliance process (to communicate AF efforts to the other Services and avoid unwarranted duplication of effort) and are documented in the Technology Development Acquisition Program (TDAP) database.  Each project has its own planning, development, equipment acquisition, equipment installation, and checkout phases which often require significant differences in funding from one year to the next.  As such, the changes in category funding from year to year do not necessarily indicate program growth, but rather a planned phasing of improvement and modernization efforts.  The test capabilities at these locations enable testing through all phases of weapon system acquisition, from system concept exploration through component and full-scale integrated weapon system testing to operational testing.  These test organizations are a part of the Major Range and Test Facility Base (MRTFB), operated and maintained by the Air Force for DoD test and evaluation.  These national test assets are available to others requiring their unique capabilities.\n\nThe 96 TW, at Eglin AFB FL, conducts and supports developmental test and evaluation (DT&E) of non-nuclear air armaments; Command, Control, Communications, Computers, Intelligence, Surveillance, Reconnaissance (C4ISR) systems; target acquisition and weapon delivery systems; navigation systems; provides a climatic simulation capability; determines target\/test item spectral signatures; and provides Cyber testing capabilities as part of the Joint Information Operations (IO) Range.  The 96 TG at Holloman AFB, NM provides independent test and evaluation of inertial navigation systems, Global Positioning System (GPS) and integrated systems used for aircraft navigation and missile guidance systems, including vulnerability to electronic interference; provides the liaison function for coordinating and scheduling all US Air Force test operations at White Sands Missile Range; provides subsonic through hypersonic ground testing of aircraft and missiles in a flight-representative environment under highly instrumented conditions; and executes flight test and test support for advanced avionics and weapons development of joint, international and commercial test programs.  The 96 TG, OL-AC at Wright-Patterson AFB, OH provides independent test and evaluation (T&E) in support of aircraft survivability and full-scale aircraft landing gear T&E.  These T&E activities include the development, T&E of aircraft landing gear components supporting engineering acquisition, design, safety, and performance evaluations.  In addition, they provide an independent T&E capability for component qualification.\n\nAEDC, at Arnold AFB TN, provides pre-flight and reliability ground environmental test support for DoD aeropropulsion, flight systems, and space and missile programs.  The center has 53 test facilities providing: aerodynamic testing of scale model aircraft, missiles, and space systems; testing of large and full-scale satellites, sensors, and space vehicles in a simulated space environment; altitude environmental testing for aircraft, missile, and spacecraft propulsion systems; and testing of large-scale models such as space boosters together with their propulsion systems.\n\nThe 412th Test Wing, at Edwards AFB CA, conducts and supports DT&E and Operational Test and Evaluation (OT&E) of aircraft and aircraft systems, aerospace research vehicles, unmanned aerial vehicles, cruise missiles, parachute delivery\/recovery\/systems, and cargo handling systems.\n\nI&M efforts within this PE are identified in four mission area categories:  Airframe\/Propulsion\/Avionics (APA); Armament\/Munitions (A\/M); Command, Control, Communications, Computers, Intelligence, Surveillance, Reconnaissance (C4ISR)\/Cyber; and Space.  These categories describe general types of effort that will be conducted in this PE.  APA provides planning, improvements, and modernization needed for test capabilities to conduct and support DT&E and OT&E of aircraft and aircraft systems, aerospace research vehicles, unmanned aerial vehicles, cruise missiles, parachute delivery\/recovery systems, cargo handling systems, and turbine engines.  APA focuses on evaluation of the vehicle airframe, propulsion system, and avionics systems, as well as overall systems integration testing.  It encompasses both ground test facilities, on-board test aircraft systems, and open-air range infrastructure, including instrumentation and data processing.  A\/M provides planning, improvements and modernization to conduct DT&E of air-to-ground and air-to-air armaments and munitions, which include gun, chaff and flare systems, as well as aerial decoy and target systems.  The A\/M category encompasses the full range of DT&E from digital modeling and simulation, to precision measurement testing, to hardware-in-the-loop and installed systems testing, to open-air range testing.  Elements of A\/M DT&E include environmental, warhead effectiveness, arena blast\/fragmentation, guidance navigation and control, aerodynamics, propulsion, electromagnetic interference and compatibility, mass properties, seeker and signature measurement, survivability, lethality, integration, reliability, net-centric and terminal effects testing.  A\/M also involves the design and development of systems needed to support A\/M DT&E including the design and development of sleds, targets, range support systems and various instrumentation and measurement systems.  C4ISR provides planning, improvements and modernization to conduct DT&E of systems that support Command and Control (C2) functions which range from air campaign planning at the theater level to wing level C2 operations, to planning individual missions, to putting weapons on target using concepts such as machine to machine targeting.  C4ISR includes ground and flight performance testing of airborne C2 networks and tactical data links, air operation centers, mission planning systems, multi-level security systems, radio and communication systems, ISR systems, information assurance systems, and radar systems such as those used by Joint Surveillance Target Attack Radar Systems (JSTARS) and air traffic control systems.  C4ISR conducts DT&E on a full range of systems covering the sensor (detection) to the shooter (weapon), including functional and environmental testing of these systems.  C4ISR\/Cyber also includes DT&E for offensive and defensive Cyber capabilities.  Space provides planning, improvements, and modernization needed for test capabilities to perform developmental and operational testing for space and launch acquisition and sustainment programs.  Test capabilities include launch vehicle, satellite, missile, sensor, thermal protection system, signature, hardness, and interface testing.  The capabilities reside at Vandenberg, Kirtland, Arnold, Patrick, Schriever, Peterson, Holloman Air Force Bases and others.  Infrastructure includes launch sites, mobile control units, thermal vacuum chambers, sled tracks, arc heated wind tunnels, ballistic test ranges, signature collection, and the requisite personnel.  \n\nThis program is in Budget Activity 6, RDT&E Management Support, because this budget activity includes research, development, test and evaluation efforts and funds to sustain and\/or modernize the installations or operations required for general research, development, test and evaluation."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Airframe\/Propulsion\/Avionics T&E I&M"
                                    },
                                    "Description": {
                                        "val": "Improvement and modernization of the AF capability to test and evaluate Airframe\/Propulsion\/Avionics (APA)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.593"
                                            },
                                            "Text": {
                                                "val": "The Joint Airborne Instrumentation Integration (JAII) project completed hardware and data instrumentation system upgrades to approximately 78 percent of AFMC's instrumented airborne test platforms and ground support infrastructure per the test fleet modernization plan.  The Telemetry Systems Integration Support (TSIS) Project completed remote control capabilities to all six telemetry (TM) systems (2 fixed antennas and 4 mobile antennas), completed C-band upgrades to two fixed TM ground antenna sites, modified 25 remaining ground-based TM receivers to incorporate C-band capability, and initiated efforts to investigate and resolve TM frequency coverage gaps on the flight line and taxiways at Edwards AFB.  The Tunnel 4T project completed installation and verification efforts and began validation efforts of the new Captive Trajectory System (CTS) rig, the nozzle actuator and control systems, and the Data Acquisition System (DAS) at AEDC's 4T transonic wind tunnel.  \n\nThe Advanced Large Military Engine Capability (ALMEC) Project installed and checked out 4 of 18 main drive exciters; upgraded two exhaust intercoolers, restoring those systems to full capability; installed auto-strainers and isolation valves on the C-Plant air supply water system; completed design efforts and initiated procurement and installation activities on the plant control and air supply water systems; completed preliminary design and specification package development of the facility switchgear systems to replace aging breaker systems; and initiated design and procurement efforts on the H1 heater tube replacements for the C1\/C2 aero-propulsion test cells.  \n\nThe Advanced Small Military Engine Capability (ASMEC) completed procurement and installation and checkout of the gas heater system, completed critical design and procurement activities on the air supply and mechanical bypass systems, and completed preliminary design efforts on the plant control systems to upgrade AEDC's T3 high speed altitude test facility.  However, due to funding reductions, remaining portions of the ASMEC project were cancelled after FY14.  \n\nThe Improved Transonic Test Capability (IMTTC) developed an adaptive acquisition strategy after completing system level Analysis of Alternative (AoA) and preliminary design for high priority DoD test capability needs:  increasing throughput of AEDC's 16T transonic wind tunnel systems with productivity and efficiency enhancements to Data Acquisition Systems (DAS), Test Article Control Systems (TACS) and data networks by removing obsolete equipment with modern technology.  Initiated procurement for a hardware integration and software development lab that will reduce potential impacts to MDAP test customers in FY16-18.  \n\nThe Test Instrumentation, Data Systems & Control (TIDSC) completed the development and award of two IDIQ contracts that will be used to procure Digital Temperature Scanners (DTS) and Digital Voltage Scanners (DVS) throughout the TIDSC Program; completed detailed design for the C1 Test Cell; completed data distribution network upgrade for J2 Test Cell; initiated procurement of some C1 Test Cell DTS\/DVS units; developed a priority list and order of upgrades for TIDSC facilities across the AEDC Turbine Engine Test and Space & Missiles mission areas.  \n\nThe Ultra High Accuracy Reference System (UHARS) project at Holloman AFB completed integration efforts and initiated fielding, installation and checkout of the GPS and non-GPS based reference systems needed to test and evaluate future navigation and guidance systems.  The T&E Board of Directors led tri-service investment planning and joint T&E Reliance efforts directed by the Service Secretaries."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "33.755"
                                            },
                                            "Text": {
                                                "val": "JAII will continue executing instrumentation systems upgrades to remaining AFMC's instrumented airborne test platforms and initiate development efforts on airborne instrumentation network solutions.  TSIS will complete remote control upgrades to the remaining TM antenna systems; complete C-band capability modifications to the remaining ground-based TM receivers; and will complete efforts to address TM frequency coverage gaps on the flight line and taxiways at Edwards AFB.  \n\nALMEC will complete the Main Drive Exciter project by installing and verifying the remaining 12 main drive exciters; perform the first of four upgrade outages for Engine Test Facility (ETF) plant control systems; upgrade the ETF plant controls network and control room; install new isolation valves on the air supply water system, completing the scope of this project; complete detailed design and procurement for the second of four upgrade efforts on the ETF plant controls project; award a GFE contract for the A3B switchgear and unit substation upgrade project; complete detailed design for the A3B switchgear and unit substation upgrade project and initiate major GFE procurements; complete H1 heater tube procurement and complete H1 Heater Bank 1 upgrade; begin design activity for modification of the remaining exhaust intercooler for the C1 and C2 test cells; and begin design activity for H1 Heater Bank 1 roof upgrade. \n\nIMTTC will complete detailed designs for DAS, TACS (Cart 3 and Cart 1), and data networks by mid-year; execute the modified funding profile to accelerate major procurements that will reduce potential schedule impacts for MDAP test customers in FY16-18.  Implement design solutions that will increase commonality with the TIDSC Program toward a future AEDC enterprise data system. Initiate concept development phase to upgrade Test Conditions Controls (TCC) and Next Generation Pressure Sensitive Paint (PSP).\n\nTIDSC will complete the ETF core switch data distribution network upgrade; complete the J1 data distribution network upgrade; complete the full C1 upgrade by installing DTS and DVS infrastructure and installing new data distribution network infrastructure; complete the detailed design and hardware procurement for the Arcs facility upgrade (H1, H2, and H3 Test Cells), and complete the detailed design and hardware procurement for the J2 facility measurement system upgrade.\n\nUHARS will conduct close-out activities.  The Common Range Integrated Instrumentation System (CRIIS) Production project will begin Analysis of Alternative (AoA) studies to address time, space, position information (TSPI) gaps and address design, development and procurement options for upgrading range TSPI instrumentation capabilities.  The Landing Gear Test Facility (LGTF) Modernization Program will start their Dynamometer upgrades.  This will include development of the specification and aspects of the acquisition process.  The T&E Board of Directors will continue to lead tri-service investment planning and joint T&E Reliance efforts as directed by the Service Secretaries."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "54.709"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "54.709"
                                            },
                                            "Text": {
                                                "val": "JAII will continue executing instrumentation systems upgrades to remaining AFMC's instrumented airborne test platforms and begin developing solutions to address and mitigate spectrum loss.  \n\nALMEC will complete the upgrade of H1 Heater Bank 2, which completes the scope of this project; complete the second of four major upgrade outages for the ETF controls project; complete the procurement, installation, and checkout of the A3B switchgear and unit substation project; complete the installation of H1 Heater Bank 1 Roof, which will complete the scope of this project; procure the tube material required for the final exhaust intercooler upgrade to be performed in FY17; and complete the detailed design and procurement for the third of four major upgrades for the ETF controls project.\n\nIMTTC will complete final detailed design for TACS (Cart 2); complete acceleration of major procurements that will reduce potential schedule impacts for MDAP test customers in FY16-18.  Begin preliminary design and develop procurement documents for TCC and PSP.\n\nTIDSC will complete the Arcs facility (H1, H2, and H3 test cells) upgrade, complete the J2 measurement system upgrade; complete the detailed design and hardware procurement for the C2 facility upgrade; and complete the detailed design and hardware procurement for the J1 facility upgrade.\n\nCRIIS Production will complete the AoA studies to address TSPI gaps and address design, development and procurement options for upgrading range TSPI instrumentation capabilities.  CRIIS Production will also begin Lot 1 procurement of OSD Central Test and Evaluation Investment Program (CTEIP) developed CRIIS TSPI Increment two pods, aircraft internal mounts, and ground support infrastructure.  Purchase and delivery of initial CRIIS equipment will focus on Eglin AFB IOC.  \n\nAFMC will initiate improvement and modernization projects to support AF vision 2023 prioritized by the AF Test Investment Planning & Programming (TIPP) process; these may include Advanced Frequency Control & Analysis, DoD Transonic Test improvements, Mission Control\/Communications Upgrades, and Radar time, space, and position information (TSPI) modifications.\n  \nThe LGTF Modernization Program will continue with their acquisition processes and expand to include Phase II of the upgrade.  This includes system design, fabrication, and installation.\n\nCommon Airborne Networked Instrumentation System (CANIS) will begin by supporting and complementing the CTEIP-funded Integrated Network Enhanced Telemetry (iNET) project by implementing the airborne solutions.  FY16 activity will include implementing spirals 0, 1, and 2 of the CANIS acquisition approach.  Spiral 0 modifies Air Force Test Center (AFTC) telemetry policies and procedures and makes use of tier 1 waveforms; Spiral 1 implements multi-band and C-Band transmitter and transceiver conversions; and Spiral 2 establishes a test asset networked data gathering package.\n\nNext Generation Turbine Engine Test Capability (NGTETC) restores the capability to existing AEDC infrastructure to make it more efficient, effective, and responsive to emerging test requirements.  It will meet the emerging test requirements of 6th generation turbine engines.  FY16 will implement a detailed 6th generation turbine engine test capability analysis of alternatives (AoA) for each supporting need (i.e., exhaust cooler, venturi upgrades, cluster valves, compressor in-bleeds, exhaust expansion joint, exhaust sprays, and thermal and power management).  The cooler, venturi, cluster valve, and expansion joint upgrades need to be completed by FY18.\n\nModular Mission Control Room Upgrade (MMCRU) will begin in FY16.  The initial studies will be undertaken to support the hardware integration (spiral 1), situational awareness integration (spiral 2), and applications migration of the MMCRU implementation.  MMCRU establishes a \"cloud type\" mission control room architecture to enable user friendly access to and distribution of data through internet protocol (IP) networks.\n\nImproved Plant Reliability and Efficiency\/Transonic Aero Propulsion Test Capability will begin in FY16 and restore specific components and sub-systems in AEDC Wind Tunnel 16T (and to some extent Wind Tunnel 16S) primary drive systems to provide a reliable and fully capable tunnel asset for future test customers.  FY16 will begin to restore the capabilities of the main drive motors (re-wind main drive motors M1 and M4), C1 compressor (replace both C1 compressor rotor blades and spacers), main drive motor sub-systems (refurbish\/replace), C1 compressor sub-systems (refurbish\/replace), and the electrical support systems (refurbish\/replace primary Propulsion Wind Tunnel (PWT) facility main drive electrical utilities) to original specifications.\n\nVoice Communication System Upgrade (VCSU) will begin in FY16.  FY16 efforts will replace an obsolete AFTC air-to-ground communication system [i.e., Federated Digital Switch (FEDS) voice communication switch] with a modern architecture voice over IP (VOIP) based system to meet current and future point-of-use configurable voice switching and conferencing of all associated test participants.  FY16 will include conducting the initial VCSU design study to analyze options and impacts to minimize hardware costs, migrate the external interface (EI) to software, design options and impacts for red (secure)\/black (non-secure) switch capability, examine options for hybrid solutions, and prototype selected software designs.\n\nTunnel 16S Reactivation.  DoD lacks a suitable capability to meet emerging supersonic ground aerodynamic T&E requirements for next generation high speed aircraft (i.e., Next Generation Air Dominance (NGAD), etc.).  Supersonic capabilities are needed to support large supersonic aircraft test models (i.e., wingspans and lengths greater than 3-ft. and 5-ft. respectively at Mach numbers exceeding 1.6M) that require high quality testing and aerodynamic data suitable for aircraft development.  Prior to inactivation, AEDC Wind Tunnel 16S met the T&E need, but it has been mothballed.  In FY14 and into FY15 major system assessments had been and are being performed to determine reactivation feasibility. These activities will culminate in FY15 with an operational check run to evaluate major system operability.  FY16 funding will be used to improve or modernize those Tunnel 16S systems identified in this assessment deemed inadequate to meet the emerging T&E requirements (i.e., NGAD) that have an FY18 need date.\n\nThe T&E Board of Directors will continue to lead tri-service investment planning and joint T&E Reliance efforts as directed by the Service Secretaries."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Armament\/Munitions T&E I&M"
                                    },
                                    "Description": {
                                        "val": "Improvement and modernization of the AF capability to test and evaluate Armament\/Munitions (A\/M)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.830"
                                            },
                                            "Text": {
                                                "val": "The Advanced Command Destruct System (ACDS) project completed Independent Verification & Validation (IV&V) efforts and final report activities to close out the program.  The Advanced Munitions Test Improvement (AMTI) project completed integration and acceptance of the Millimeter Wave (MMW) and advanced GPS simulators, real-time scene generation software upgrades, and seeker integration with the MMW and Imaging Infrared simulators to support weapon testing.  The Gulf Range Test and Training Control Center (GRTTCC) project completed a critical power system upgrade to the 96 TW's Central Control Facility (CCF); completed integration and checkout of high-resolution video, data distribution and display system hardware; and continued procurement and integration of next generation TM processing systems and upgrades to mission control room computer systems and fiber data links.  The Joint Gulf Range Area Network Development (JGRAND) completed design efforts and made preparations to award a contract for development of an Alternate Range Network Operations Control Center (Alt RNOCC) at Eglin test site C-3; continued installation of fiber optical cable to connect test sites D-84 to D-1B and D-84 to Bldg 44; and continued to procure network protocol and security hardware to improve range data communication capabilities at the 96 TW.  The Combined High-Speed\/High-Resolution (CHSHR) EO\/IR Imaging project completed procurement and delivery of approximately 50% of the high-speed digital camera systems and 30% of the infrared camera systems; eliminated dependency on film processing at the Holloman High-Speed Test Track (HHSTT) and procured a new ultra high speed digital camera system for the HHSTT; completed modernization of four Cinetheodolite (Cine-T) long range optical tracking systems at Eglin test site B-70; initiated modernization efforts for four additional Cine-T long range optical tracking systems at Eglin test site C-72; and continued to develop remote C2 operations to provide improved tracking capabilities of IR and long-range optical tracking systems at Eglin AFB.  The Next Generation Munitions Test Environment (NGMTE) project initiated environmental approval and range clearing efforts to begin installation of a new insensitive munitions pad at Eglin test site C-80B; completed preparation efforts to award a contract in FY15 to construct a new drop tower on C-80B to support insensitive munitions testing; completed acceptance testing of a new 8,300 foot\/second gun system to support insensitive munitions testing and meet MIL-STD 2105 requirements; and continued procurement and installation of new data acquisition and fragment scoring systems supporting the ballistic test ranges and arena test range C-80B to improve gun and munitions test capabilities and meet Joint Munitions Effectiveness Model (JMEM) requirements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.574"
                                            },
                                            "Text": {
                                                "val": "GRTTCC will complete integration and checkout of next generation TM processing systems, and will complete upgrades to mission control room computer systems and fiber data links at the 96 TW's CCF.  JGRAND will award a contract to develop the Alt RNOCC facility at Eglin test site C-3; continue installation of fiber optical cable to connect test sites D-84 to D-1B and D-84 to Bldg 44; and continue to procure network protocol and security hardware to improve range communication capabilities at the 96 TW.  CHSHR EO\/IR Imaging will continue procurement and delivery of approximately 70% of the high-speed digital camera systems and 50% of the infrared camera systems; will complete evaluation of the new ultra high speed digital camera system for the HHSTT and will procure additional ultra-high speed and ultra-high resolution digital cameras for the HHSTT; will complete modernization of the four Cine-T long range optical tracking systems at Eglin test site C-72; and will continue to develop remote C2 operations to provide improved tracking capabilities of IR and long-range optical tracking systems at Eglin AFB.  NGMTE will continue installation of a new insensitive munitions pad at Eglin test range C-80B; will award a contract to construct a new drop tower on C-80B to support insensitive munitions testing; will begin efforts to upgrade environmental test chambers and facilities supporting munitions development; will replace and modernize the hydraulic control systems on the ballistic test ranges; and will continue procurement and installation of new data acquisition and fragment scoring systems supporting the ballistic test ranges and arena test range C-80B to improve gun and munitions test capabilities at Eglin AFB."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.887"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.887"
                                            },
                                            "Text": {
                                                "val": "JGRAND will complete development of the Alt RNOCC facility at Eglin test site C-3, installation of fiber optical cable connecting test sites D-84 to D-1B and D-84 to Bldg 44, and network protocol and security hardware upgrades to improve range communication capabilities at the 96 TW.  CHSHR EO\/IR Imaging will complete procurement and delivery of approximately 80% of the high-speed digital camera systems and 75% of the infrared camera systems; will continue modernization of IR and long-range Cine-T optical tracking systems; and will continue to develop remote C2 operation upgrades to provide improved tracking capabilities at Eglin AFB.  NGMTE will continue to upgrade aging gun and munitions test infrastructure, develop and procure common data instrumentation and acquisition systems, and replace environmental test chambers\/facilities supporting gun and arena test capabilities.  AFMC will initiate improvement and modernization projects to support AF vision 2023 prioritized by the AF Test Investment Planning & Programming (TIPP) process, these may include Maritime Test Support and Eglin Water Range capability upgrades."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "C4ISR T&E I&M"
                                    },
                                    "Description": {
                                        "val": "Improvement and modernization of the AF capability to test and evaluate C4ISR"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "C4ISR\/Cyber received no I&M funding in FY2014 due to higher priority investments but early planning did begin for two new I&M projects, Improved Command and Control (C2) Test Operations Center (I-C2TOC) and Cyber Defense Test Capability (CDTC), both of which receive funding in FY15.  I-C2TOC will develop net-centric C2 battle management operations test and evaluation capabilities, improve communication interfaces and data collection, handling, analysis and display capabilities to support C4ISR end-to-end weapon system testing at Eglin AFB.  CDTC will provide an environment, methodology, techniques, and tools necessary to determine cyber defense effectiveness and mission success of systems under test."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.903"
                                            },
                                            "Text": {
                                                "val": "I-C2TOC will begin preliminary design and development activity on secure network infrastructure required to enhance net-centric C2 battle management operations and test control capabilities, improve communication interfaces and data collection, handling, analysis and display capabilities supporting C4ISR end-to-end weapon system testing at Eglin AFB.\n\nCDTC will begin with the first phase of a Federally-Funded Research and Development Center (FFRDC) study that will provide a detailed analysis of the draft six-step DoD cybersecurity test and evaluation process and determine its adequacy in testing cyber vulnerabilities of acquisition systems under test. The study will also identify manpower and test infrastructure investments required to fully execute the cybersecurity T&E process."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.706"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.706"
                                            },
                                            "Text": {
                                                "val": "I-C2TOC will continue development of secure network infrastructure and initiate procurement of software and hardware servers and workstations needed to enhance net-centric C2 battle management operations and test control capabilities, improve communication interfaces and data collection, handling, analysis and display capabilities supporting C4ISR end-to-end weapon system testing at Eglin AFB.  AFMC will initiate improvement and modernization projects to support AF vision 2023 prioritized by the AF Test Investment Planning & Programming (TIPP) process, these may include the Multi-layered Security Improvement for Cyber modifications and I-C2TOC acceleration.\n\nThe CDTC project will continue in FY16 with phase II of the cybersecurity T&E study.  During this phase, a detailed test capabilities investment roadmap will be finalized along with detailed plans for acquiring and training the workforce necessary for executing the cybersecurity T&E process.\n\nImproved Data Links Hardware-in-the-Loops (HITLs) will begin in FY16 by improving and modernizing the 46 Test Squadron (TS) data link test capabilities.  The solution minimizes risk by integrating COTS\/GOTS hardware and software into the existing core data link (DL) T&E capabilities.  FY16 implementation will include F-35 multi-function data link (MADL) DL emulation, F-22 MADL DL emulation, B-2 DL emulation, and the interoperability and use of net enabled weapons."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "RDTE: BA 06: PE 0604256F"
                                    },
                                    "Title": {
                                        "val": "Threat Simulator Development"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "14.786"
                                        },
                                        "CurrentYear": {
                                            "val": "24.418"
                                        },
                                        "BudgetYearOne": {
                                            "val": "23.844"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "23.844"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "21.846"
                                        },
                                        "BudgetYearThree": {
                                            "val": "22.251"
                                        },
                                        "BudgetYearFour": {
                                            "val": "22.641"
                                        },
                                        "BudgetYearFive": {
                                            "val": "23.045"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTE: BA 06: PE 0605807F"
                                    },
                                    "Title": {
                                        "val": "Test and Evaluation Support"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "724.958"
                                        },
                                        "CurrentYear": {
                                            "val": "689.509"
                                        },
                                        "BudgetYearOne": {
                                            "val": "673.908"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "673.908"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "666.993"
                                        },
                                        "BudgetYearThree": {
                                            "val": "677.220"
                                        },
                                        "BudgetYearFour": {
                                            "val": "684.977"
                                        },
                                        "BudgetYearFive": {
                                            "val": "697.626"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTE: BA 06: PE 0605976F"
                                    },
                                    "Title": {
                                        "val": "Facility Restoration & Modernization - T&E"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "44.160"
                                        },
                                        "CurrentYear": {
                                            "val": "46.955"
                                        },
                                        "BudgetYearOne": {
                                            "val": "40.518"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "40.518"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "42.978"
                                        },
                                        "BudgetYearThree": {
                                            "val": "43.795"
                                        },
                                        "BudgetYearFour": {
                                            "val": "44.349"
                                        },
                                        "BudgetYearFive": {
                                            "val": "45.142"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTE: BA 06: PE 0605978F"
                                    },
                                    "Title": {
                                        "val": "Facility Sustainment - T&E Support"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "29.743"
                                        },
                                        "CurrentYear": {
                                            "val": "32.965"
                                        },
                                        "BudgetYearOne": {
                                            "val": "27.895"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "27.895"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "28.372"
                                        },
                                        "BudgetYearThree": {
                                            "val": "28.914"
                                        },
                                        "BudgetYearFour": {
                                            "val": "29.374"
                                        },
                                        "BudgetYearFive": {
                                            "val": "29.900"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "This program element uses several different contracting strategies to provide the most cost effective T&E investment solutions.  The main acquisition strategy is to use full and open competition wherever possible to improve and modernize existing test capabilities."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}