{
    "id": "1d53edc66f02a3f5028fb30942aacca2840bc1f9",
    "meta": {
        "filename": "dod-2016_RDTE_2016_NAVY_BA6_RDTE_JustificationBook_Navy_PB_2016.zzz_unzipped_RDTE_JustificationBook_Navy_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605804N"
        },
        "ProgramElementTitle": {
            "val": "Technical Information Services"
        },
        "R1LineNumber": {
            "val": "157"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "1.046"
            },
            "CurrentYear": {
                "val": "0.876"
            },
            "BudgetYearOne": {
                "val": "0.925"
            },
            "BudgetYearOneBase": {
                "val": "0.925"
            },
            "BudgetYearTwo": {
                "val": "0.946"
            },
            "BudgetYearThree": {
                "val": "0.962"
            },
            "BudgetYearFour": {
                "val": "0.984"
            },
            "BudgetYearFive": {
                "val": "1.004"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Technical Information Services program provides support to achieve affordability in the development of Navy systems by reducing life-cycle costs through the facilitation of advanced technology associations between U.S. industry and the Navy.  Warfighting effectiveness is enhanced through strategic relationships with industry to commercialize the science and technology developed by the Naval Research Enterprise and to gain strategic understanding of industry Research and Development Programs and plans; access concepts and technologies; and access to business practices within the civil sector."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.637"
                },
                "CurrentYear": {
                    "val": "0.876"
                },
                "BudgetYearOne": {
                    "val": "0.934"
                },
                "BudgetYearOneBase": {
                    "val": "0.934"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "1.046"
                },
                "CurrentYear": {
                    "val": "0.876"
                },
                "BudgetYearOne": {
                    "val": "0.925"
                },
                "BudgetYearOneBase": {
                    "val": "0.925"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.409"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.009"
                },
                "BudgetYearOneBase": {
                    "val": "-0.009"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "0.409"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.002"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.002"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.007"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.007"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Not applicable.\n\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0835"
                    },
                    "ProjectTitle": {
                        "val": "Tech Info System"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.610"
                        },
                        "CurrentYear": {
                            "val": "0.876"
                        },
                        "BudgetYearOne": {
                            "val": "0.925"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.925"
                        },
                        "BudgetYearTwo": {
                            "val": "0.946"
                        },
                        "BudgetYearThree": {
                            "val": "0.962"
                        },
                        "BudgetYearFour": {
                            "val": "0.984"
                        },
                        "BudgetYearFive": {
                            "val": "1.004"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The goal for this project is to enhance warfighter effectiveness by:  leveraging industry independent Research and Development science and technology base; developing strategic partnerships with industry to transition private sector technology; and transferring appropriate Navy-developed innovative concepts and inventions to the private sector for purposes of commercialization.  (Public Law 96-480, Federal Technology Transfer Act of 1986)\n\nThis project also provides the Department of the Navy (DoN) interface to the Office of the Assistant Secretary of Defense for Rapid Fielding, and to the Assistant Secretary of Commerce for Technology Policy for matters relating to policy and reporting requirements for technology transfer. \n\nThe funding increases FY 2014 to FY 2015 are due to the return on investment of T2 pilot projects to the Naval Research Enterprise by Chief of Naval Research."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "TECHNICAL INFORMATION SERVICES"
                                    },
                                    "Description": {
                                        "val": "Technical Information Services supports the spin-in and spin-out of research and development performed by Navy laboratories and industry.  This program develops the tools and provides management oversight of the DoN Domestic Technology Transfer (T2) Program.  The Navy plans on initiating two new pilot programs per year with the objective of increasing the visibility and transfer of the Navy developed technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.610"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continued development of a database to capture value of technology transfer to the Navy and, if possible, platform insertion information. \n-Continued efforts to raise visibility of Navy technologies through a more widely defined publications program. \n-Continued studies to analyze trends of Cooperative Research and Development Agreements (CRADAs) in the Navy Defense Technology Transfer Information System (NDTTIS).\n-Continued efforts to implement Navy participation in support of new DoD T2 Strategic Plan. - Continued efforts to advance the Navy engagement in the DOD 1401 T2 Program.\n-Continued efforts to increase intellectual property mining activities at Navy laboratories. \n-Continued Two new pilot programs to support Technology Transfer (T2) efforts at Navy Office of Research and Technology Application (ORTA) activities across laboratories. \n-Continued Effort to develop guidelines to implement the use of CRADAs in the Navy Acquisition Program. \n-Continued Effort for Phase III of Navy Defense Technology Transfer Information System (NDTTIS) database to include value\/impact of CRADAs including T2 and First Responder results of commercialization and benefits to the Warfighter. \n-Continued Effort to implement two standardized T2 agreements. \n-Continued development of new T2 training course. \n\nInitiated the following efforts:\n- Efforts to raise visibility of Navy technologies through publications with a goal of 2 additional Trade publications.\n- Effort for Phase IV of Navy Defense Technology Transfer Information System (NDTTIS) database to include  additional value\/impact of CRADAs and investigate a new search engine.\n- Effort to establish a Navy wide T2 Intellectual Property Mining Program.\n- Effort to provide ONR guidance to Navy wide Laboratory Management encouraging Office of Research and Technology Applications (ORTAs) to cross train with Acquisition\/Program Managers."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.876"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue all efforts of FY 2014.\nInitiate the following efforts:\n- Two new pilot programs per year to support Technology Transfer (T2) efforts at Navy Office of Research and Technology Application (ORTA) activities across laboratories.\n- Efforts to raise visibility of Navy technologies through publications.\n- Effort for Phase V of Navy Defense Technology Transfer Information System (NDTTIS) database to continue additional value\/impact of Cooperative Research and Development Agreements (CRADAs) and investigate a new search engine.\n- Effort to continue a Navy wide T2 Innovation Discovery\/Intellectual Property Mining Program.\n- Effort to provide ONR guidance to Navy wide Laboratory Management encouraging representatives of the Office of Research and Technology Applications (ORTAs) accept developmental assignments in Acquisition."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.925"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.925"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue all efforts of FY 2015.\nInitiate the following efforts:\n- Two new pilot programs per year to support Technology Transfer (T2) efforts at Navy Office of Research and Technology\nApplication (ORTA) activities across laboratories.\n- Efforts to raise visibility of Navy technologies through publications and\/or videos.\n- Effort to improve Navy Defense Technology Transfer Information System (NDTTIS) database to continue additional value\/impact of Cooperative Research and Development Agreements (CRADAs).\n- Effort to continue the Navy wide T2 Innovation Discovery\/Intellectual Property Mining Program.\n- Effort to coordinate\/support a regional technology transfer industry day."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Demonstrate support for technological transitions from the Naval Research Enterprise into industrial and commercial enterprises supporting Navy programs of record and warfighter needs, by being responsive to Offices of Research and Technology Applications focal points for technology transfer in their development of Cooperative Research and Development Agreements (CRADA), and reducing transaction\/information exchange timeframes by 25%."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2296"
                    },
                    "ProjectTitle": {
                        "val": "Federal Lab Consortium"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.436"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "0.436"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Federal Laboratory Consortium for Technology Transfer (FLC) was established by Congress under the Federal Technology Transfer Act of 1986 (P.L. 99-502, 20 October 1986, as amended).  The FLC, in cooperation with federal laboratories and the private sector, provides services to enhance the transfer of federally-developed technology to include activities such as:  developing and administering technology transfer training courses and materials; assisting Federal agencies and laboratories in their technology transfer programs; and providing a clearinghouse for technology transfer requests."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "New Accomplishment\/Planned Program Entry"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.436"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "In accordance with the Federal Technology Transfer Act of 1986 (P.L. 99-502, 20 October 1986, as amended),  disseminated funding judiciously."
                        }
                    }
                }
            ]
        }
    }
}