{
    "id": "21880d8518e1cf4dca38eb02e623c621d64085f2",
    "meta": {
        "filename": "dod-2016_RDTE_2016_OSD_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2016.zzz_unzipped_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602000D8Z"
        },
        "ProgramElementTitle": {
            "val": "Joint Munitions Technology"
        },
        "R1LineNumber": {
            "val": "8"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "38.999"
            },
            "PriorYear": {
                "val": "17.693"
            },
            "CurrentYear": {
                "val": "20.037"
            },
            "BudgetYearOne": {
                "val": "19.352"
            },
            "BudgetYearOneBase": {
                "val": "19.352"
            },
            "BudgetYearTwo": {
                "val": "19.388"
            },
            "BudgetYearThree": {
                "val": "19.390"
            },
            "BudgetYearFour": {
                "val": "19.619"
            },
            "BudgetYearFive": {
                "val": "19.884"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program addresses applied research associated with improving the lethality, reliability, safety, and survivability of munitions and weapon systems.  The goal is to develop and demonstrate joint enabling technologies that can be used by the Program Executive Officers (PEOs) as they develop their specific weapon programs.  The program invests in and demonstrates technologies from a Joint Service perspective, thus maximizing efficiencies, ensuring the development of technology with the broadest applicability while avoiding duplication of efforts.\n\nMunition Area Technology Groups (MATGs) and Fuze Area Technology Groups (FATGs) have been established for each munition and capability area and are tasked with: 1) coordinating, establishing, and maintaining 2018 and 2023 year technology development plans and roadmaps, 2) coordinating biannual meetings to review technical and programmatic details of each funded and proposed effort, 3) developing and submitting Technology Transition Agreements in coordination with appropriate PEOs for insertion in their Insensitive Munitions (IM) Strategic Plans \/ Fuze Technology Development Plan, and 4) interfacing with other MATGs \/ FATGs and IM \/ fuze science and technology projects as appropriate.  The Joint Insensitive Munitions Technology Program (JIMTP) and Joint Fuze Technology Program (JFTP) will utilize a Technical Advisory Committee (TAC) (consisting of senior Department of Defense (DoD) and Department of Energy (DOE) laboratory representatives, and senior Munitions PEO representatives) to provide program oversight, policy, direction, and priorities during its annual meeting.\n\nThe Insensitive Munitions (IM) effort will demonstrate enabling technologies needed to develop weapons in compliance with requirements established in United States Code, Title 10, Chapter 141, Section 2389 and DoD Instruction 5000.1.  This effort will take promising technologies demonstrated at the laboratory scale and transition them into demonstration programs utilizing generic hardware based on priority munitions identified in the PEO IM Strategic Plans.  Mature demonstrated IM technology can be transitioned, thereby decreasing their program costs and schedule risk and facilitating spin-offs to other non-compliant munitions within their portfolios.\n\nThe JIMTP investments focus on five Munition Areas:  1) High Performance Rocket Propulsion (HPP), 2) Minimum Signature Rocket Propulsion (MSP), 3) Blast and Fragmentation Warheads (BFW), 4) Anti-Armor Warheads (AAW), and 5) Gun Propulsion (GP).  MATGs, under tri-service leadership, have developed technology roadmaps for each Munition Area that are used to guide investments based on goals consistent with the DoD IM Strategic Plan.  These IM technologies, alone or in combination, will be developed and tested at the small-scale, and for eventual incorporation in hardware, simulating real-world munitions, to demonstrate their utility and feasibility. \n\nThe Enabling Fuze Technology effort will also demonstrate fuze enabling technologies needed to develop weapons that address priority capability areas identified in the Guidance for Development of the Force (GDF), the Secretary of Defense Memorandum, DoD Policy on Cluster Munitions and Unintended Harm to Civilians, and shortfalls in current weapon systems.  This effort will develop fuzing technologies and mature them for transition into advanced technology (Budget Activity (BA) 6.3) programs and\/or design tools and protocols for weapon fuzing.  In this way, the Service and Industrial base weapon and fuze communities will be able to heavily leverage and apply these emerging and promising technologies in fuzing modeling and simulation tools, multi-point initiation, high reliability fuze architectures, survivable components, modular fuze packaging, and fuze sensor. \n\nThe Joint Fuze Technology Program investments focus on four specific capability areas that have been identified by Department strategic guidance and current shortfalls in weapon systems and will be validated by the PEOs and the Heads of the Service Science and Technology (S&T) communities.  These capability areas are:  1) Hard Target Survivable Fuzing, 2) Tailorable Effects Weapon Fuzing, 3) High Reliability Fuzing, and 4) Enabling Fuze Technologies and Common Architecture."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "17.959"
                },
                "CurrentYear": {
                    "val": "20.065"
                },
                "BudgetYearOne": {
                    "val": "20.085"
                },
                "BudgetYearOneBase": {
                    "val": "20.085"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "17.693"
                },
                "CurrentYear": {
                    "val": "20.037"
                },
                "BudgetYearOne": {
                    "val": "19.352"
                },
                "BudgetYearOneBase": {
                    "val": "19.352"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.266"
                },
                "CurrentYear": {
                    "val": "-0.028"
                },
                "BudgetYearOne": {
                    "val": "-0.733"
                },
                "BudgetYearOneBase": {
                    "val": "-0.733"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.009"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.257"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Realignment for Higher Priority Programs"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.678"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.678"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC SEC 8104"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "-0.028"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumptions"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.055"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.055"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funding decreases were used to pay for higher priority DoD bills."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P000"
                    },
                    "ProjectTitle": {
                        "val": "Insensitive Munitions"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "27.369"
                        },
                        "PriorYear": {
                            "val": "12.288"
                        },
                        "CurrentYear": {
                            "val": "13.545"
                        },
                        "BudgetYearOne": {
                            "val": "13.082"
                        },
                        "BudgetYearOneBase": {
                            "val": "13.082"
                        },
                        "BudgetYearTwo": {
                            "val": "13.106"
                        },
                        "BudgetYearThree": {
                            "val": "13.108"
                        },
                        "BudgetYearFour": {
                            "val": "13.262"
                        },
                        "BudgetYearFive": {
                            "val": "13.442"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Insensitive Munitions (IM) Technology Program (JIMTP) aims to develop the enabling technologies needed to build weapons in compliance with statutory requirements (United States Code, Title 10, Chapter 141, Section 2389) and regulation (DoDI 5000.1 and 5000.02, and CJCSI 3170.01F).  This effort will take promising technologies developed at the laboratory scale and mature them for transition into advanced technology (Budget Activity (BA) 6.3) programs based on the priority munitions identified in the DoD IM Strategic Plans.  Mature and demonstrated IM technology can be transitioned to the PEOs, thereby decreasing the program costs and schedule risk.  This will additionally promote spin-offs to other non-compliant munitions within the DoD portfolio.  Without new technology, future variants of current weapon systems will have the same, or worse, response to IM stimuli.  New weapon developments will face similar challenges.  This is especially true with increased performance requirements for improved and new systems. \n\nThe JIMTP investments focus on five Munition Areas:  1) High Performance Rocket Propulsion, 2) Minimum Signature Rocket Propulsion, 3) Blast and Fragmentation Warheads, 4) Anti-Armor Warheads, and 5) Gun Propulsion.  Munition Area Technology Groups (MATGs), under tri-service leadership, have developed technology roadmaps for each Munition Area that are used to guide investments based on goals consistent with the DoD IM Strategic Plans.  The program is structured around these five areas with clear cross-cutting tasks."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "High Performance Rocket Propulsion (HPP)"
                                    },
                                    "Description": {
                                        "val": "HPP focuses on the development and demonstration of technologies to improve the IM response of HPP systems, rocket motors with Ammonium Perchlorate and with or without a metal fuel, for rockets and missiles launched from air, ground, and sea platforms.  These technologies, when applied to rocket motors, improve to one or more threats, while not degrading the response to other IM threats and, at minimum, maintaining munition performance.  Technologies include, but are not limited to, rocket propellant ingredients, including synthesis, characterization and scale-up; reduced smoke or smoky propellants, including formulation, characterization and scale-up; rocket motor case design; materials for active and passive thermal mitigation; shock mitigation materials and techniques; passive and active coatings; active and passive venting techniques for motor cases or containers; ignition systems; sensors; and thrust mitigation techniques.  Operating conditions may be controlled or widely varying in both temperature and vibration.  The 2018 and 2023 year goals of the HPP MATG are concentrated on solving the IM response of missile propulsion systems due to Fragment Impacts and Slow Cook Off for the majority of HPP rocket motors, and solving the Fast Cook Off response of very large HPP motors."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.442"
                                            },
                                            "Text": {
                                                "val": "-  Determined the IM response of less reactive propellants in steel and composite cases by conducting IM testing on sub-scale analogue motors.\n-  Characterized less reactive propellants with advanced ingredients with safety testing, mechanical property measurements, variable confinement cook off testing, and slow cook off visualization testing.\n-  Conducted small scale cook-off testing and gap testing on novel ionic liquid candidates for high performance propulsion.  \n-  Conducted small-scale slow cook-off study correlating historical subscale and full scale slow cook-off data for high performance rocket motors.  \n-  Formulated a novel high performance propellant in one pound quantities and conducted initial studies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.673"
                                            },
                                            "Text": {
                                                "val": "-  Synthesize and characterize less reactive ingredients for high performance rocket motor propellant that will maintain missile performance.\n-  Conduct bench-top testing of motor case venting devices.\n-  Conduct sub-scale testing and analysis to validate a new sub-scale test to predict full-scale reactions in cook-off and impact testing.\n-  Conduct small scale testing on energetic materials to assess pre-ignition processes and novel mitigation device."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.556"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.556"
                                            },
                                            "Text": {
                                                "val": "-  Scale up and conduct performance testing on rocket propellant formulation composed of less reactive ingredients.\n-  Optimize novel mitigation device design and conduct small scale tests. \n-  Scale up, conduct characterization, and aging testing on propellant formulation that is less temperature and impact sensitive."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Minimum Signature Rocket Propulsion (MSP)"
                                    },
                                    "Description": {
                                        "val": "MSP focuses on the development and demonstration of technologies to improve the IM response of MSP systems.  The development and demonstration of minimum signature (MS) rocket technologies, when applied to munition systems, will improve munition IM response to one or more threats, while not degrading the response to other IM threats and, at minimum, maintaining munition performance.  Technologies include, but are not limited to, MS rocket propellant formulations, ingredients for MS propellant formulations (including synthesis, characterization and scale-up), case and packaging design, active and passive venting techniques, rocket motor case design, ignition systems, and thrust mitigation techniques.  Of particular interest are technologies that provide a higher burning rate minimum signature propellant with state-of-the-art energy and reduced shock sensitivity.  The 2018 and 2023 year goals of the MSP MATG are concentrated on solving the IM response of missile propulsion systems due to Fragment Impact, Slow Cook Off, and Shaped Charge Jet (SCJ) threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.321"
                                            },
                                            "Text": {
                                                "val": "-  Generated multi-gram batches of novel coated materials.  Produced one pint-scale mixes of two promising minimum signature propellants.\n-  Scaled up and produced multi-grams of novel material.  Built and down-selected candidate materials for unique venting mechanism.\n-  Characterized two minimum signature propellants in a unique configuration to determine the go\/no go threshold and investigated other design factors that contributed to ignition, to aide in the development of a modeling and simulation effort designed to predict the reaction of an analog rocket motor under fragment impact.\n-  Completed propellant development program using new binder and conducted gap testing.\n-  Conducted initial screening studies on two ingredients that have potential for MS propellants through solubility and ignition sensitivity testing.\n-  Further narrowed the operational range for the autoignition materials and conducted trade studies.\n-  Demonstrated Army Burn-to-Violent Reaction (ABVR) screening test as a discriminator for reaction violence."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.577"
                                            },
                                            "Text": {
                                                "val": "-  Conduct mechanical, safety, and card gap testing, and determine ballistic properties of novel coated material minimum signature propellant. \n-  Conduct design of experiments of candidate formulations and down-select to most promising candidate to provide desired performance characteristics. \n-  Conduct final characterization tests and slow cook-off tests to validate formulation. \n-  Build and test unique venting mechanisms in various configurations in environmental and cook-off tests.\n-  Characterize baseline and novel MS propellant using ABVR screening test. \n-  Develop an analysis tool and conduct composite material testing that will provide mitigation of shock response for fragment impact while providing the necessary material strength for solid rocket motors and launch tubes."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.472"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.472"
                                            },
                                            "Text": {
                                                "val": "-  Conduct impact testing on baseline and novel MS propellants in representative cylindrical container to investigate propellant reactions relative to ABVR test result predictions.\n-  Fabricate and test composite materials to validate modeling and analysis.  Optimize materials and optimize design for future testing.\n-  Synthesize and scale up propellant ingredient to one kilogram batch for initial characterization studies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Blast and Fragmentation Warheads (BFW)"
                                    },
                                    "Description": {
                                        "val": "BFW focuses on the development and demonstration of technologies to improve the IM response of Blast\/Fragmentation munitions.  These technologies, when applied to munitions, improve IM response to one or more threats, while not degrading the response to other IM threats and, at minimum, maintain munition performance.  Munition operating conditions may be controlled or have widely varying environmental conditions, such as temperature and vibration, and other factors such as cost, availability and reliability may be critically important depending on the intended munition application.  Technologies include, but are not limited to, new ingredient synthesis and characterization, initial formulation development, scale-up, warhead\/charge configuration, venting techniques for both munitions and their containers, protection or packaging materials and systems, shock mitigation liners, initiation devices, techniques, and technologies.  Applications vary but include high performance warhead fills, booster explosives, bulk demolition charges, and bulk fills for blast and\/or fragmentation charges.  The 2018 and 2023 year goals of the BFW MATG are concentrated on solving the IM response of blast fragment warheads to the Sympathetic Detonation, Fast Cook Off, and SCJ threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.466"
                                            },
                                            "Text": {
                                                "val": "-  Completed device scale experiments on sensitization process and transition to Budget Activity (BA) 6.3 project.\n-  Performed one kilogram scale-up of additional composite materials.  Formulated and tested IM characteristics of the material.  \n-  Synthesized 60 kilograms of new explosive ingredients and formulated explosives on the ten gallon scale.  Determined mid-scale performance and IM properties of new formulations.\n-  Conducted thermal cycling and IM testing on novel explosive material. \n-  Scaled up to one gallon mix a melt cast enhanced blast explosive fill and performed sensitivity and performance testing.  Prepared to transition to Task under Program Element (PE) 0603000D8Z\/P301. \n-  Conducted characterization and performance testing, as well as IM assessments for novel general purpose bomb explosive fill formulation.  Conducted characterization testing and down selected unique explosive booster material and transitioned to Task under PE 0603000D8Z\/P301.\n-  Produced small quantities of unique energetic material for formulation and characterization testing.\n-  Conducted synthesis optimization process for novel energetic material and scaled up to produce several 100 gram batches."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.723"
                                            },
                                            "Text": {
                                                "val": "-  Scale up synthesis process of novel energetic material to produce one kilogram batches to provide multiple grain size material.  Examine fundamental properties and conduct characterization testing on manufactured materials.  \n-  Perform safety, IM, and performance testing on novel energetic formulations.  Analyze results to define failure diameter and establish baseline data for designing IM formulations for transition to a possible BA 6.3 demonstrator.\n-  Scale up to 40 gram batches unique energetic material and conduct performance and thermal response testing.\n-  Prove concept for detonation train for IM fills for large warheads.  Analyze data for formulation to assess the insensitivity to an IM threat.\n-  Predict the potential for passing sympathetic reaction testing based on explosive data gathered during preliminary small-scale testing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.633"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.633"
                                            },
                                            "Text": {
                                                "val": "-  Conduct large scale gap testing, as well as bullet and fragment impact testing on unique explosive formulation for large warheads. \n-  Optimize and mature explosive initiation device design and conduct small-scale performance testing.  Down-select design and begin design refinement. \n-  Utilize novel coating process and scale up formulations of high energy explosive.  Prepare samples and conduct screening tests."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Anti-Armor Warheads (AAW)"
                                    },
                                    "Description": {
                                        "val": "AAW focuses on the development and demonstration of explosive ingredients, explosives, and warhead and fuze technologies for improving IM of AAW munitions.  The development of explosive ingredients, explosives, and warhead and fuze technologies, when applied to munitions, improve IM response to one or more threats, while not degrading the response to other IM threats and, at minimum, maintain munition performance.  Technologies include, but are not limited to, new ingredient synthesis and characterization, initial formulation development, scale-up, warhead\/charge configuration, venting techniques for both munitions and their containers, protection\/packaging materials and systems, shock mitigation liners, and initiation devices, techniques, and technologies.  Applications vary but include high performance warhead fills, booster explosives, and all other technology to mitigate the violent response of AAW munitions to IM threats.  Munition operating conditions may be controlled or have widely varying environmental conditions, such as temperature and vibration, and other factors such as cost, availability, and reliability may be critically important depending on the intended munition application.  The 2018 and 2023 year goals of the AAW MATG are concentrated on solving the IM response of anti-armor warheads to the Fragment Impact, Sympathetic Reaction, and Shaped Charge Jet threats for larger munitions and the Fragment Impact, Slow Cookoff, and Sympathetic Reaction \/ Shaped Charge Jet threats for Medium Caliber Munitions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.228"
                                            },
                                            "Text": {
                                                "val": "-  Scaled up and conducted IM testing of energetic materials with less nitramine content and enhanced insensitivity. \n-  Conducted small scale performance and mechanical properties testing on unique combined effects explosive formulation.  \n-  Conducted aging study and scaled up formulations to 50 pound batches for novel, cast cured, multi-effects explosives formulation.  \n-  Conducted larger scale formulation (five pounds) of explosive material and performed intermediate scale IM and performance tests.\n-  Produced unique high energy melt cast explosive formulation material for initial characterization and evaluation testing.\n-  Characterized materials, formulated, and down-selected high energy melt-phase explosive. \n-  Scaled up to five gallon mix, conducted initial testing, completed aging study, and conducted standard IM tests on novel, cast cured, multi-effects explosives formulation. \n-  Scaled up high energy pressed explosive and conducted performance testing. \n-  Assessed additional explosive materials to validate the baseline model data.\n-  Down-selected optimized formulation and conducted IM testing on cast cured explosive, using fine grain material.  Prepared to transition to Task under PE 0603000D8Z."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.485"
                                            },
                                            "Text": {
                                                "val": "-  Scale up synthesis of newly identified explosive ingredient with high performance and low sensitivity potential.\n-  Development and characterization of explosive formulations using a recently scaled-up newly identified explosive ingredient.\n-  Conduct slow cook-off and small scale sympathetic detonation test on unique combined effects explosive formulation. \n-  Down-select formulations of energetic materials composed of finer particle size nitramine content and enhanced insensitivity and conduct small scale cookoff and fragment impact testing.  Prepare five pound batches of selected formulation.\n-  Conduct small scale slow cook-off, fragment impact and shaped charge testing on unique high energy melt cast explosive formulation for transition to BA 6.3 project. \n-  Design surrogate munition and shaped charge jet impact initiation testing configurations to demonstrate models utility for weapon design."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.403"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.403"
                                            },
                                            "Text": {
                                                "val": "-  Conduct tests using surrogate munition and shaped charge jet impact initiation testing configurations to validate models utility for weapon design. \n-  Complete design of experiments, manufacture of down-selected formulations, and characterization study of newly identified explosive ingredient with high performance and low sensitivity potential."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Gun Propulsion (GP)"
                                    },
                                    "Description": {
                                        "val": "GP focuses on the development and demonstration of technologies in the area of GP systems.  The development and demonstration of gun propulsion technologies, when applied to munition systems, will improve munition IM response to one or more threats, while not degrading the response to other IM threats and, at minimum, maintaining munition performance.  Technologies include, but are not limited to, gun propellant formulations, ingredients for gun propellant formulations, including synthesis, characterization and scale-up, cartridge case and packaging design, active and passive venting techniques, reduced sensitivity primer propellant and primer systems, and robust primers for insensitive propellants.  Applications vary, but include both large and medium caliber munitions, as well as propelling charges for mortars and shoulder launched munitions.  Operating requirements vary, and other factors such as barrel life and operation over varying environmental conditions may be critically important depending on the intended munition application.  The 2018 and 2023 year goals of the GP MATG are concentrated on solving the IM response of gun propulsion munitions to Fragment Impact and Slow Cook Off threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.831"
                                            },
                                            "Text": {
                                                "val": "-  Conducted performance IM testing of down-selected candidates for gun propellants.\n-  Continued formulation development to manufacture six kilogram batches for extrusion into 30 pounds of propellant.  Conducted various tests to validate IM properties and suitability for gun propellant.\n-  Designed and fabricated apparatus to test propellants and developed modeling code for small-scale slow cook-off protocol.\n-  Developed properties of ignition propellants after exposure to novel ignition methodology.  Performed sub-scale performance testing.  Produced one gallon mixes of novel binder to complete IM testing. \n-  Scaled up six pounds of unique less sensitive binder propellant formulation and conducted characterization testing.\n-  Conducted small scale unique processing of propellant grains."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.087"
                                            },
                                            "Text": {
                                                "val": "-  Conduct slow cook-off tests in new apparatus to validate test small scale test protocol for propellant formulations.   \n-  Establish data set of required material characteristics after exposure to novel ignition methodology.\n-  Down select unique process ingredients and complete sub-scale IM testing of propellant.\n-  Optimize propellant candidates for new projectile and evaluate for performance and sensitivity.  Scale-up and characterize new primer to conduct modeling and to optimize the configuration to enable full scale testing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.018"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.018"
                                            },
                                            "Text": {
                                                "val": "-  Optimize unique process ingredient propellant formulation, conduct gun testing and prepare for large scale manufacturing of propellant to prepare for slow cook-off testing.\n-  Conduct impact performance testing of propellant and primer for new projectile."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0603000D8Z P002"
                                    },
                                    "Title": {
                                        "val": "BA 3 Insensitive Munitions Advanced Technology"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "16.312"
                                        },
                                        "CurrentYear": {
                                            "val": "19.788"
                                        },
                                        "BudgetYearOne": {
                                            "val": "19.229"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "19.229"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "19.248"
                                        },
                                        "BudgetYearThree": {
                                            "val": "19.293"
                                        },
                                        "BudgetYearFour": {
                                            "val": "19.446"
                                        },
                                        "BudgetYearFive": {
                                            "val": "19.701"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "1)  Transitions of technologies developed by the Program are tracked and documented by technology maturity. \n2)  Munition Area Technology Group (MATG) Technology Roadmaps are prepared, evaluated, and analyzed by Joint Insensitive Munitions Technology Program management and technical staff. \n3)  Chairman's Annual Assessments for each MATG are critically reviewed by the Technical Advisory Committee to determine progress, transition plans, and relevance of each project.  \n4)  Project progress toward goals and milestones is assessed at each MATG meeting.  \n5)  Annual technical reports and papers are tracked and documented for the Program. \n6)  External Peer Review of Projects conducted as part of Joint Army\/Navy\/NASA\/Air Force meetings."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P204"
                    },
                    "ProjectTitle": {
                        "val": "Enabling Fuze Technology"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "11.630"
                        },
                        "PriorYear": {
                            "val": "5.405"
                        },
                        "CurrentYear": {
                            "val": "6.492"
                        },
                        "BudgetYearOne": {
                            "val": "6.270"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.270"
                        },
                        "BudgetYearTwo": {
                            "val": "6.282"
                        },
                        "BudgetYearThree": {
                            "val": "6.282"
                        },
                        "BudgetYearFour": {
                            "val": "6.357"
                        },
                        "BudgetYearFive": {
                            "val": "6.442"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This RDT&E effort will demonstrate fuze enabling technologies needed to develop weapons that address priority capability areas identified in the Guidance for Development of the Force (GDF), the Secretary of Defense Memorandum, DoD Policy on Cluster Munitions and Unintended Harm to Civilians, and shortfalls in current weapon systems.  This effort will develop enabling technologies at the laboratory scale and transition them into Budget Activity (BA) 6.3 demonstration programs for weapons where priority capabilities and technology needs have been identified and validated by the Program Executive Officers (PEOs) and the Heads of the Service Science and Technology (S&T) communities.  Mature BA 6.2 fuze technologies will be transitioned, thereby decreasing their program costs and schedule risk and facilitating spin-offs to other munitions within their portfolios.\n\nUnder the Joint Fuze Technology Program (JFTP), investments are focused on specific capability areas that have been identified by Department strategic guidance and current shortfalls in weapon systems and validated by the PEOs and Heads of the Service S&T communities.  These four capability areas are: 1) Hard Target Survivable Fuzing, 2) Tailorable Effects (TE) Weapon Fuzing, 3) High Reliability Fuzing, and 4) Enabling Fuze Technologies and Common Architecture."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Hard Target Fuzing"
                                    },
                                    "Description": {
                                        "val": "The Hard Target Fuzing challenges are grouped into three Technology Areas.  First, improved modeling and simulation capabilities provide the validated computational tools necessary for hard target applications.  Second, basic phenomenology and understanding of the Fuze Environment is the science-based endeavor of providing the test equipment, instrumentation, and analysis techniques for experimentation and data gathering necessary for next generation fuzing.  Third, hard target survivable fuze components are developed to increase the effectiveness of facility denial munitions by improving the prediction tools and testing methodologies to evaluate the survivability and functionality of legacy and future fuzes.  Development of these technologies will enable next generation boosted and hypersonic penetrators to execute missions against hardened and deeply buried targets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.393"
                                            },
                                            "Text": {
                                                "val": "-  Adapted and transitioned JFTP developed testing protocol in boosted and high speed penetrator development programs.\n-  Demonstrated and transitioned survivable modular fuze technology for multi-role common miniature munitions with distributed\/embedded fuzes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.663"
                                            },
                                            "Text": {
                                                "val": "-  Develop and demonstrate alternative packaging technology for the electronic components of a fireset to improve fuze survivability and reliability for hypersonic penetrating weapon applications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.617"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.617"
                                            },
                                            "Text": {
                                                "val": "-  Develop low cost, survivable hard target detonators for next generation penetrator weapons and test against extreme levels of shock and vibration associated with the long duration penetrating events."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tailorable Effects Fuzing"
                                    },
                                    "Description": {
                                        "val": "This area focuses on developing fuzing for tailorable effects weapons that encompasses the ability to selectively vary the output of the weapon (Dial-a-Yield) and\/or the ability to generate selectable effects (directed blast, fragmentation); developing initiation and multi-point technologies to include electronic safe and arm based multi-point initiators for tunable output – scalable yield warheads; MicroElectro-Mechanical Systems (MEMS) based multi-point initiators for tunable output\/scalable yield warheads; and smart fuzing for tailorable effects weapons.  These technologies will enable weapons that can effectively defeat a variety of targets while minimizing unintentional collateral effects."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.374"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated and transitioned into BA 6.3 advanced technology development of detonator, initiation, and fireset technologies.\n-  Applied initiation architecture and control technologies for application in the Services’ warhead development programs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.646"
                                            },
                                            "Text": {
                                                "val": "-  Begin development of a primary explosive ink with high output and low sensitivity for use in MEMS micro-detonators."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.512"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.512"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate and transition into BA 6.3 advanced technology development of Hardened Selectable Multipoint Fireset technologies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Reliability Fuzing"
                                    },
                                    "Description": {
                                        "val": "Develop high reliability fuzing architectures, fuzing components, and Unexploded Ordnance (UXO) reduction features.  These technologies will enable the next generation of cluster munitions to achieve the required greater than 99 percent reliability goal.  Evolving DoD emphasis on increased weapon system reliability is driving the need to consider new and novel approaches for achieving increased fuze reliability while maintaining or enhancing fuze design safety.  DoD policy, higher weapon reliability expectations and harsher weapon system operational requirements are dictating the need for higher fuze reliability than available using current technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.333"
                                            },
                                            "Text": {
                                                "val": "-  Researched and developed novel technologies for UXO reduction features including fuze mechanisms and initiation energetic to eliminate any unexploded ordnance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.605"
                                            },
                                            "Text": {
                                                "val": "-  Develop and demonstrate MEMS structures that give existing MEMS Fuzes the ability to self-report safety and reliability compromises in an effort to improve reliability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.595"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.595"
                                            },
                                            "Text": {
                                                "val": "-  Complete testing and characterization of MEMS safety and arming (S&A) micro scale materials and energetic to transition into high reliability low cost munitions technology applications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enabling Fuze Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop common\/modular fuze architecture; innovative fuze component technologies; sensors; next generation fuze setting capability, tools and modeling; and fuzing power sources.  These fuzing technologies will provide smaller, more cost effective solutions while meeting or exceeding the performance of existing technologies.  Development of these technologies will enable future weapon applications to be more mission adaptive and smaller along with improved target detection capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.305"
                                            },
                                            "Text": {
                                                "val": "-  Conducted assessments of common fuze architecture technologies: safety components, modular electronics, sensors, interfaces, and packaging."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.578"
                                            },
                                            "Text": {
                                                "val": "-  Begin research of failure modes in flash programmable logic devices (F-PLD) that enables reliable, safe, and effective use of F-PLDs as fuze components."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.546"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.546"
                                            },
                                            "Text": {
                                                "val": "-  Develop and demonstrate low cost, small energy harvesting, and event detection sensors for Gravity Dropped Weapons."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0603000D8Z P301"
                                    },
                                    "Title": {
                                        "val": "BA 3 Enabling Fuze Advanced Technology"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "3.397"
                                        },
                                        "CurrentYear": {
                                            "val": "6.862"
                                        },
                                        "BudgetYearOne": {
                                            "val": "6.686"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "6.686"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "6.693"
                                        },
                                        "BudgetYearThree": {
                                            "val": "6.708"
                                        },
                                        "BudgetYearFour": {
                                            "val": "6.751"
                                        },
                                        "BudgetYearFive": {
                                            "val": "6.850"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "1)  Transitions of technologies developed by the Program are tracked and documented by technology maturity.\n2)  Fuze Area Technology Group (FATG) Technology Roadmaps are prepared, evaluated, and analyzed by Joint Fuze Technology Program management and technical staff.\n3)  Chairman's Annual Assessments for each FATG are critically reviewed by the Technology Advisory Committee to determine progress, transition plans, and relevance of each project.\n4)  Project progress toward goals and milestones is assessed at each FATG meeting.\n5)  Annual technical reports and papers are tracked and documented for the Program.\n6)  Technology Transition Agreements in place with Munitions programs."
                        }
                    }
                }
            ]
        }
    }
}