{
    "id": "2492505fb8d19d386b2fe56d44934d0d21561cd2",
    "meta": {
        "filename": "dod-2016_RDTE_2016_ARMY_BA2_RDTE_JustificationBook_Army_PB_2016.zzz_unzipped_RDTE_JustificationBook_Army_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602783A"
        },
        "ProgramElementTitle": {
            "val": "Computer and Software Technology"
        },
        "R1LineNumber": {
            "val": "24"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "10.232"
            },
            "CurrentYear": {
                "val": "10.761"
            },
            "BudgetYearOne": {
                "val": "12.656"
            },
            "BudgetYearOneBase": {
                "val": "12.656"
            },
            "BudgetYearTwo": {
                "val": "13.811"
            },
            "BudgetYearThree": {
                "val": "14.007"
            },
            "BudgetYearFour": {
                "val": "14.136"
            },
            "BudgetYearFive": {
                "val": "14.415"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) develops and evaluates hardware and software algorithms enabling enhanced understanding and accelerating the decision cycle time for commanders and leaders operating in a mobile, dispersed, highly networked environment.  Project Y10 supports research on information and communications technology.  \n\nWork in this PE complements and is fully coordinated with efforts in PE 0602705A (Electronics and Electronic Devices), 0602716A (Human Factors Engineering Technology), PE 0602782A (Command, Control, Communications Technology), PE 0603772A (Advanced Tactical Computer Science and Sensor Technology), and PE 0603008A (Command, Control, Communications Advanced Technology). \n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the U.S. Army Research Laboratory (ARL) at the Adelphi and Aberdeen Proving Ground, MD locations."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "10.434"
                },
                "CurrentYear": {
                    "val": "10.764"
                },
                "BudgetYearOne": {
                    "val": "12.742"
                },
                "BudgetYearOneBase": {
                    "val": "12.742"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "10.232"
                },
                "CurrentYear": {
                    "val": "10.761"
                },
                "BudgetYearOne": {
                    "val": "12.656"
                },
                "BudgetYearOneBase": {
                    "val": "12.656"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.202"
                },
                "CurrentYear": {
                    "val": "-0.003"
                },
                "BudgetYearOne": {
                    "val": "-0.086"
                },
                "BudgetYearOneBase": {
                    "val": "-0.086"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.003"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.202"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.086"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.086"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "Y10"
                    },
                    "ProjectTitle": {
                        "val": "Computer\/Info Sci Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "10.232"
                        },
                        "CurrentYear": {
                            "val": "10.761"
                        },
                        "BudgetYearOne": {
                            "val": "12.656"
                        },
                        "BudgetYearOneBase": {
                            "val": "12.656"
                        },
                        "BudgetYearTwo": {
                            "val": "13.811"
                        },
                        "BudgetYearThree": {
                            "val": "14.007"
                        },
                        "BudgetYearFour": {
                            "val": "14.136"
                        },
                        "BudgetYearFive": {
                            "val": "14.415"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Not applicable for this item."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops and evaluates information and communications processing software to automate the delivery of  information for planning, rehearsal, and execution by ground commanders. Efforts develop communication\/network architectures and software and the information fusion software necessary to simplify the understanding and interactions from humans to humans, humans to computers, computers to humans.  Research enables enhanced understanding of many information sources and accelerates the decision cycle time for commanders and leaders operating in mobile, dispersed, highly networked environment envisioned for the future force.\n\nWork in this project is fully coordinated with PE 0603008A (Command, Control, Communications Advanced Technology)and PE 0603772A (Advanced Tactical Computer Science and Sensor Technology), PE 0603008A (Command, Control, Communications Advanced Technology), and PE 0603794A (Command, Control and Communications Advanced Technology).\n\nThis project supports Army science and technology efforts in the Command, Control, Communications, and Intelligence portfolio.  \n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the U.S. Army Research Laboratory (ARL), Adelphi and Aberdeen Proving Ground, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Information Processing"
                                    },
                                    "Description": {
                                        "val": "This effort develops and evaluates fusion software to improve the completeness and timeliness of decision-making in command and control (C2) operations. The goal of this effort is to develop software applicable to the Distributed Common Ground Station-Army (DCGS-A) architecture (an integrated architecture of all ground\/surface systems) and for future force assessment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.213"
                                            },
                                            "Text": {
                                                "val": "Extracted,resolved, and exploited social network information from multi-source data in order to provide timely accurate assessments of social and cultural influences for small unit decision making."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.248"
                                            },
                                            "Text": {
                                                "val": "Evaluate techniques for predicting crowd attitudes, intent, and behaviors from fused text sources; and develop concepts for integrating social network analysis into the C2."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.696"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.696"
                                            },
                                            "Text": {
                                                "val": "Will examine text analytics techniques for rapid extraction of social and cultural relationship information in order to increase the accuracy and timeliness of predicting attitudes for use in social network analyses; and evaluate the use of crowd sourcing and teaming concepts for analysis in a DCGS-A-like environment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Information Assurance"
                                    },
                                    "Description": {
                                        "val": "This effort designs and evaluates software for the protection of information and networks in wireless tactical environments.  The goal is to develop software algorithms that detect and defeat malicious activities of adversaries in the bandwidth constrained tactical networks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.156"
                                            },
                                            "Text": {
                                                "val": "Evaluated experimental implementation of intrusion detection software algorithms and architectures; and developed and analyzed predictive models for distributed intrusion detection of cyber attacks in bandwidth constrained environments to improve ability to detect and defeat malicious activities on Army networks and hosts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.207"
                                            },
                                            "Text": {
                                                "val": "Design and evaluate an intrusion prevention architecture that dynamically monitors host and network data to detect, analyze, respond, and protect against unauthorized cyber activity in bandwidth and power-constrained environments; investigate models that will be used to develop and evaluate secure protocols that may be used in tactical networks; and explore active protection approaches that may be managed and\/or deployed locally, centrally, or in a distributed environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.562"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.562"
                                            },
                                            "Text": {
                                                "val": "Will develop and characterize techniques for novel stealthy (i.e., low probability of detection and intercept) information communications for future tactical networks; develop computational tools that provide theoretically-grounded risk assessments and situational awareness by integrating a broad range of information about vulnerability and network structure and roles that is automatically obtained from the network; and design innovative detectors, analyst aids, and prevention\/recovery tools that provide robustness and fight-through capabilities to complex heterogeneous networks that combine a variety of wireless and wired technologies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Information Exchange"
                                    },
                                    "Description": {
                                        "val": "This effort will investigate and develop software that integrates sensor data from local and external information sources.  The goal is to enable tactical users to cooperatively share relevant and timely tactical information within a distributed wireless environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.239"
                                            },
                                            "Text": {
                                                "val": "Developed workflow and algorithms to enable end-user's ability to define and refine the collection, correlation, and aggregation of raw and processed data from both local and higher echelon information sources to produce summaries that are directly relevant to the user's current operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.280"
                                            },
                                            "Text": {
                                                "val": "Develop and evaluate text, image, and full motion video processing algorithms for use within representative state transfer services operating across a suite of distributed nodes using realistic network connectivity and data sources."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.270"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.270"
                                            },
                                            "Text": {
                                                "val": "Will explore text-based techniques, like transfer learning and semantic representation of visual concepts, as a means of overcoming challenges in extracting objects, actions, and context from video; and develop tools to assist with information extraction from various communication modes to include text embedded in video transmissions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Language Translation"
                                    },
                                    "Description": {
                                        "val": "This effort develops and assesses computational multilingual algorithms and software frameworks to enable commanders and troops to bridge language barriers in order to counter adversaries and collaborate with allies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.093"
                                            },
                                            "Text": {
                                                "val": "Developed an experimental framework for evaluation of state-of the-art academic Optical Character Recognition and Machine Translation (OCR\/MT), entity extraction, and entity resolution algorithms using realistic, representative data; developed, refined, and tested advanced algorithms to improve multilingual and machine translation technologies in three areas: (a) OCR of noisy and degraded document images typical of field-captured materials, (b) domain-specific machine translation targeting domains and genres outside of commercial interest, and (c) recognition of key content in handwritten documents typical of materials commonly encountered in the field to facilitate the rapid transition of promising candidate technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.139"
                                            },
                                            "Text": {
                                                "val": "Develop, refine, and test advanced algorithms to improve machine translation technologies by incorporating data subset selection techniques into algorithms to generalize existing MT modules to new domains of military interest."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.053"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.053"
                                            },
                                            "Text": {
                                                "val": "Will implement and validate advanced algorithms that improve machine translation technologies by incorporating data selection techniques into algorithms to generalize existing MT modules ; and increase ability to translate low density languages of military interest to include key languages native to Africa."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Network Theory"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and designs theory based software models to evaluate and validate emerging network protocols and structures.  The goal of this effort is to develop software algorithms that maintain effective communications in networks in spite of disruptive effects such as task reorganization, mobility of friendly forces, and adversarial attacks on friendly networks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.849"
                                            },
                                            "Text": {
                                                "val": "Investigated and evaluated techniques for improving network performance and Soldier decision making by adapting data processing and delivery behaviors based on current network abilities and user information quality preferences; developed and evaluated non-traditional communications techniques, such as optical and ultra violet (UV), to provide alternative means of communications in radio frequency (RF)-challenged environments; and investigated techniques for using mobile infrastructure and user movement to improve communication networks and information delivery in hybrid (wired and wireless) networks."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.158"
                                            },
                                            "Text": {
                                                "val": "Develop and evaluate UV communications components that attach to the RF common sensor radio; use simulation to investigate how mobility and autonomy may be exploited to maintain connectivity; and investigate mapping connectivity regions to blend with mobility planning and sensing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.400"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.400"
                                            },
                                            "Text": {
                                                "val": "Will implement UV communications components that attach to the RF common sensor radio; validate simulation models to investigate how mobility and autonomy may be exploited to maintain connectivity; validate that optical and UV can provide robust non-line- of- sight communications to augment RF communications; and implement mapping connectivity regions to blend with mobility planning and sensing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Heterogeneous Computing and Computational Sciences"
                                    },
                                    "Description": {
                                        "val": "This effort researches and develops software algorithms to allow information processing across different computing hardware platforms. The goal of this research is to provide high performance computing (HPC) equivalent processing capabilities to the Soldier on the battlefield."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.658"
                                            },
                                            "Text": {
                                                "val": "Developed, implemented and validated discrete mathematical algorithms for high fidelity electromagnetic propagation and electromagnetic interference for use in real time modeling and optimization of ad hoc mobile networks; tested, analyzed, and optimized the performance of current and proposed mobile ad hoc network simulations; developed code enabling algorithm deployment for extremely large networks using inter-core load balancing between standard computing cores and specialized accelerators such as Graphics Processing Units; and performed validation of the models and results using standard battle command benchmarks."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.673"
                                            },
                                            "Text": {
                                                "val": "Investigate approaches for computational off-loading to disparate, hybrid cores focused on extracting maximum performance from the parallel nature of many-core pervasive technologies; create new models to describe offered load and computational capacity within cloudlet-based services in Army-centric mobile and ad hoc networked technologies; and develop software engineering protocols and methods to promote portability while maintaining efficiency with heterogeneous systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.673"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.673"
                                            },
                                            "Text": {
                                                "val": "Will develop an auto-tuning approach to balance performance models for hybrid cores where low-level instruction scheduling is a problem; implement new mathematical algorithm to address placement of mobile HPC in dynamic battlefield networks; design the problem for heterogeneous networks and quantify minimum communications path lengths (using quantum annealing algorithms) to converge on a solution for optimum distribution."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Material Modeling-Force Protection"
                                    },
                                    "Description": {
                                        "val": "This effort designs and evaluates software to improve parallel processing for computationally intensive physics problems.  The intent is to create a computational science environment to assist researchers from different disciplines to work collaboratively and to exchange models and results."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.024"
                                            },
                                            "Text": {
                                                "val": "Developed parallel computational common software environment on emerging multi-core petaflop high performance computing (HPC) systems; and implemented interface algorithm, data models and formats to solve multi-scale\/multi-physics software developed for coupling between molecular dynamics and finite element methods."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.056"
                                            },
                                            "Text": {
                                                "val": "Develop and extend capabilities to couple multi-scale\/multi-physics software that will be designed to achieve efficiency across a growing base of computing cores; and investigate the use of domain specific languages to couple novel HPC capabilities within the material modeling domain and facilitate rapid software deployment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.002"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.002"
                                            },
                                            "Text": {
                                                "val": "Will develop hierarchical multi-scale models for material behavior and design; use multiple parallel model couplings to tie models of different length or time scales together; investigate emerging programming languages for scalability and portability on different HPC computing platforms; and investigate applicability of emerging programming languages for specific class of multi-physics applications related to underbody blast applications which includes modeling of the Soldier."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}