{
    "id": "296f4010576ad7090243a40a5829c67f631a5bb2",
    "meta": {
        "filename": "dod-2016_RDTE_2016_ARMY_BA6_RDTE_JustificationBook_Army_PB_2016.zzz_unzipped_RDTE_JustificationBook_Army_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605718A"
        },
        "ProgramElementTitle": {
            "val": "Army Modeling & Sim X-Cmd Collaboration & Integ"
        },
        "R1LineNumber": {
            "val": "147"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "1.239"
            },
            "CurrentYear": {
                "val": "1.124"
            },
            "BudgetYearOne": {
                "val": "0.938"
            },
            "BudgetYearOneBase": {
                "val": "0.938"
            },
            "BudgetYearTwo": {
                "val": "1.924"
            },
            "BudgetYearThree": {
                "val": "1.846"
            },
            "BudgetYearFour": {
                "val": "3.369"
            },
            "BudgetYearFive": {
                "val": "2.581"
            }
        },
        "ProgramElementNote": {
            "val": "FY 2016 decrease attributed to realignment of funding for higher priority programs."
        },
        "ProgramElementMissionDescription": {
            "val": "PE 0605718A promotes the Army's Modeling and Simulation (M&S) strategy, defined by five guiding priorities: (1) formulate Army M&S policies; (2) develop and employ management processes for models, simulations and data; (3) develop M&S standards, architectures, networks and environments; (4) develop\/employ new M&S tools and simulation technology; (5) develop an M&S workforce.  PE 0605718A focuses on priorities 3 and 4.\n\nM&S Standards, Architectures, Networks and Environments: The consistent use of standards, architectures, networks and environments advances the goal of interoperability.  The Army coordinates with Joint, Interagency, Intergovernmental, and Multinational (JIIM) partners along with industry and academia to develop\/employ standards that promote collaboration and facilitate the sharing of tools, data and information.  The Army oversees procedures and processes for the appropriate use of standards to foster common formats and increase M&S and data reuse.  The Army ensures these standards, architectures, networks and environments are readily accessible and can be reliably applied by users.\n\nM&S Tools and Simulation Technology: The Army must have credible M&S tools and data to support the full range of Army organizational missions and functional responsibilities.  M&S results that are timely and credible enhance decision making.  The Army must develop and accredit reliable M&S tools so that decision makers and senior leaders benefit from the results and thus support the continued development, integration and use of such tools.  To ensure credibility and reliability of results, M&S managers, developers and users must make the capabilities, constraints, limitations and assumptions of their M&S tools readily accessible.  PE 0605718A provides for the development and employment of tools in the form of models, simulations and data that support the full range of Army interests and deliver timely information to enhance effective decision making.  Moreover, these tools can be documented, verified, validated and accredited for their intended purpose in order to provide timely, credible results."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "1.282"
                },
                "CurrentYear": {
                    "val": "1.125"
                },
                "BudgetYearOne": {
                    "val": "1.485"
                },
                "BudgetYearOneBase": {
                    "val": "1.485"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "1.239"
                },
                "CurrentYear": {
                    "val": "1.124"
                },
                "BudgetYearOne": {
                    "val": "0.938"
                },
                "BudgetYearOneBase": {
                    "val": "0.938"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.043"
                },
                "CurrentYear": {
                    "val": "-0.001"
                },
                "BudgetYearOne": {
                    "val": "-0.547"
                },
                "BudgetYearOneBase": {
                    "val": "-0.547"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.001"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.043"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.547"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.547"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "S03"
                    },
                    "ProjectTitle": {
                        "val": "Analysis M&S Tools and Services"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.239"
                        },
                        "CurrentYear": {
                            "val": "1.124"
                        },
                        "BudgetYearOne": {
                            "val": "0.938"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.938"
                        },
                        "BudgetYearTwo": {
                            "val": "1.924"
                        },
                        "BudgetYearThree": {
                            "val": "1.846"
                        },
                        "BudgetYearFour": {
                            "val": "3.369"
                        },
                        "BudgetYearFive": {
                            "val": "2.581"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "FY14-18 funds include those reprogrammed from PE0605718A, Project S05 - SIMTECH: $124,000, $116,000, $117,000, $117,000, $118,000.  Reprogramming occurred during the POMBES14-18 cycle."
                        },
                        "ProjectMissionDescription": {
                            "val": "The project \"Analysis Tools and Services\" has two functions:\n\nFunction 1 (priority 3 of the Army M&S strategy) -- Develop M&S standards, architectures, networks and environments that promote sharing, interoperability, access, and reliable application of tools, formats, data and information among\/for users.  M&S = Modeling and Simulation.\n\nFunction 2 (priority 4 of the Army M&S strategy) -- Develop and improve tools and technology in the form of models, simulations and data that support the full range of Army interests and deliver timely information to enhance effective decision making.  These tools can be documented, verified, validated and accredited for their intended purpose.  \n\nResources under Project S03 support the six M&S communities (Acquisition, Analysis, Experimentation, Intelligence, Test & Evaluation, Training) at the enterprise level through enabling efforts. These efforts include the following: (a) design models, simulations, data and tools that are resident within one organization but reusable and trusted by M&S users and specialists across the Army M&S Enterprise; (b) leverage industry and academia; (c) promote interoperability within M&S and between M&S and operational capabilities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Develop M&S standards, architectures, networks and environments"
                                    },
                                    "Description": {
                                        "val": "Develop M&S standards, architectures, networks and environments that promote sharing, interoperability, access, and reliable application of  tools, formats, data and information among\/for users."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.409"
                                            },
                                            "Text": {
                                                "val": "Fy14 funds are distributed among activities that promote the third priority of the Army M&S strategy: develop M&S standards, architectures, networks and environments.  The specific distribution is based on requirements and priorities established prior to the start of and during FY14."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.366"
                                            },
                                            "Text": {
                                                "val": "Fy15 funds are distributed among activities that promote the third priority of the Army M&S strategy: develop M&S standards, architectures, networks and environments.  The specific distribution is based on requirements and priorities established prior to the start of and during FY15."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.310"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.310"
                                            },
                                            "Text": {
                                                "val": "Fy16 funds will be distributed among activities that promote the third priority of the Army M&S strategy: develop M&S standards, architectures, networks and environments.  The specific distribution will be based on requirements and priorities established prior to the start of and during FY16."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Develop M&S tools and technology"
                                    },
                                    "Description": {
                                        "val": "Develop and improve tools and technology in the form of models, simulations and data that support the full range of Army interests and deliver timely information to enhance effective decision making.  These tools can be documented, verified and validated for their intended purpose."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.830"
                                            },
                                            "Text": {
                                                "val": "Fy14 funds are distributed among activities that promote the fourth priority of the Army M&S strategy: develop M&S tools and technology.  The specific distribution is based on requirements and priorities established prior to the start of and during FY14."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.758"
                                            },
                                            "Text": {
                                                "val": "Fy15 funds are distributed among activities that promote the fourth priority of the Army M&S strategy: develop M&S tools and technology.  The specific distribution is based on requirements and priorities established prior to the start of and during FY15."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.628"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.628"
                                            },
                                            "Text": {
                                                "val": "Fy16 funds will be distributed among activities that promote the fourth priority of the Army M&S strategy: develop M&S tools and technology.  The specific distribution will be based on requirements and priorities established prior to the start of and during FY16."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}