{
    "id": "35ea1822d3199f2b748b61accd3a8b638631bc8b",
    "meta": {
        "filename": "dod-2016_RDTE_2016_CBDP_RDTE_JustificationBook_Chemical_and_Biological_Defense_Program_PB_2016.zzz_unzipped_RDTE_JustificationBook_Chemical_and_Biological_Defense_Program_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Chemical and Biological Defense Program",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603384BP"
        },
        "ProgramElementTitle": {
            "val": "CHEMICAL\/BIOLOGICAL DEFENSE (ATD)"
        },
        "R1LineNumber": {
            "val": "43"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Chemical and Biological Defense Program"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "140.595"
            },
            "CurrentYear": {
                "val": "155.374"
            },
            "BudgetYearOne": {
                "val": "140.094"
            },
            "BudgetYearOneBase": {
                "val": "140.094"
            },
            "BudgetYearTwo": {
                "val": "145.877"
            },
            "BudgetYearThree": {
                "val": "144.556"
            },
            "BudgetYearFour": {
                "val": "142.008"
            },
            "BudgetYearFive": {
                "val": "144.811"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Demonstrates technologies supporting transition to advanced component development in the areas of physical capabilities (biological and chemical detection, situational awareness and effects modeling, and protection and hazard mitigation) and medical capabilities (pretreatments, therapeutics, diagnostics capabilities, and drug manufacturing and regulatory science technologies), including capabilities against non-traditional agents.  Major efforts support enhanced chemical detection capabilities for aerosols and non-traditional agents, expanded capabilities for biosurveillance in pathogen detection and diagnosis, and pretreatments and therapeutics against a broader set of chemical and biological agents.\n\nIn the physical sciences area, Project CB3 focuses on demonstrations of CB defense technologies, including biological detection, chemical detection, information system technology for hazard prediction and systems performance, and protection, and decontamination.  The Project continues to pursue solutions against traditional agents. \n\nAll non-traditional agent (NTA)-dedicated research (both medical and non-medical) is consolidated in Project NT3.  This Project includes NTA chemical diagnostics, medical pretreatments, therapeutics, detection, and protection and hazard mitigation.\n\nThe medical program in Project TM3, aims to produce biological diagnostic assays and reagents, diagnostic device platforms, pretreatments and therapeutics for bacterial, viral, and toxin threats as well as for chemical threats, and medical devices, as countermeasures for CBR threat agents.  Specific areas of medical investigation include: prophylaxis, pretreatment, antidotes and therapeutics, personnel and patient decontamination, and medical management of casualties.  \n\nProject TT3, Techbase Technology Transition, pursues efforts to enhance military operational capability, concepts of operation, WMD elimination, and hazard mitigation following a biological warfare or chemical warfare attack.\n\nThe PE is dedicated to conducting proof-of-principle field demonstrations, and testing system-specific technologies to meet specific military needs.  Work conducted under this PE will transition to and will provide risk reduction for PE 0603884BP\/PE 0604384BP activities.\n\nFY 2015 funding includes $132.7 million of base funding and $22.7 million of Ebola emergency funding."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "144.847"
                },
                "CurrentYear": {
                    "val": "132.674"
                },
                "BudgetYearOne": {
                    "val": "136.597"
                },
                "BudgetYearOneBase": {
                    "val": "136.597"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "140.595"
                },
                "CurrentYear": {
                    "val": "155.374"
                },
                "BudgetYearOne": {
                    "val": "140.094"
                },
                "BudgetYearOneBase": {
                    "val": "140.094"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-4.252"
                },
                "CurrentYear": {
                    "val": "22.700"
                },
                "BudgetYearOne": {
                    "val": "3.497"
                },
                "BudgetYearOneBase": {
                    "val": "3.497"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "22.700"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-2.543"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.709"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "3.497"
                                },
                                "BudgetYearOneBase": {
                                    "val": "3.497"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funding: N\/A\n\nSchedule: N\/A\n\nTechnical: N\/A"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "CB3"
                    },
                    "ProjectTitle": {
                        "val": "CHEMICAL BIOLOGICAL DEFENSE (ATD)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "19.317"
                        },
                        "CurrentYear": {
                            "val": "17.722"
                        },
                        "BudgetYearOne": {
                            "val": "16.062"
                        },
                        "BudgetYearOneBase": {
                            "val": "16.062"
                        },
                        "BudgetYearTwo": {
                            "val": "16.676"
                        },
                        "BudgetYearThree": {
                            "val": "15.982"
                        },
                        "BudgetYearFour": {
                            "val": "15.577"
                        },
                        "BudgetYearFive": {
                            "val": "15.698"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Project CB3 develops technology advancements for joint service application in the area of information systems and modeling and simulation technologies.  These activities will speed maturing of advanced technologies to reduce risk in system-oriented integration\/demonstration efforts.  Information systems advanced technology focuses on areas of advanced warning and reporting, hazard prediction and assessment, simulation analysis and planning, and systems performance modeling."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) Material Contamination Mitigation"
                                    },
                                    "Description": {
                                        "val": "Demonstration of non-traditional decontamination technologies and approaches which gain significantly improved effectiveness by complementary application."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.161"
                                            },
                                            "Text": {
                                                "val": "Continued the development, demonstration, and transition of non-traditional decontamination technologies and approaches which gain significantly improved effectiveness by complementary application.  Continued to integrate and demonstrate robust surface chemistry and decontamination process analysis using ultra high vacuum system into technology maturation process for hazard mitigation.  Continued to develop coatings, innovative chemistries\/processes, enzyme approaches to hazard mitigation, human remains decontamination processes, and radiological\/nuclear decontamination\/hazard mitigation capabilities.  Transitioned quantitatively evaluated interim capability for radiological\/nuclear decontamination\/hazard mitigation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.171"
                                            },
                                            "Text": {
                                                "val": "Continue S&T efforts related to Dial-a-Decon and Enzyme Decon projects.  Investigate non-aqueous formulations and responsive coatings."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.096"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.096"
                                            },
                                            "Text": {
                                                "val": "Complete maturation of formulation component of Dial-a-Decon project.  Conduct a technology readiness assessment and transition data package.  Continue development of the Dial-a-Decon brassboard to enhance efficacy by modifying dissemination of formulations.  Initiate development of the next generation of hazard mitigation technologies that include integration of multiple systems to achieve efficacy goals.  Conduct a field trial of Wide Area Decon technologies.  Continue responsive coatings projects to enhance decontaminability as part of the systems approach to achieving efficacy goals."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "2) Percutaneous Protection"
                                    },
                                    "Description": {
                                        "val": "Study and assessment of percutaneous protective technologies."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.265"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.265"
                                            },
                                            "Text": {
                                                "val": "Investigate engineering and manufacturing limitations for the production and system integration of multifunctional materials.  Develop system integration approaches for incorporation of those materials in protective garments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "3) Respiratory and Ocular Protection"
                                    },
                                    "Description": {
                                        "val": "Demonstration of design alternatives for chemical and biological air-purifying respirators to provide enhanced protection with lower physiological burden and improved interface with mission equipment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.593"
                                            },
                                            "Text": {
                                                "val": "Developed prototype respirator and conduct testing in a relevant environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.360"
                                            },
                                            "Text": {
                                                "val": "Continue the development of a prototype respirator and conduct testing in a relevant environment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "4) Respiratory and Ocular Protection"
                                    },
                                    "Description": {
                                        "val": "Demonstrate novel filtration media into a lightweight, low-profile, and low-burden individual protective filter, which has enhanced performance against a broader range of challenges that includes toxic industrial chemicals."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.823"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.823"
                                            },
                                            "Text": {
                                                "val": "Develop, fabricate, and evaluate hybrid system technology prototypes.  Transition a synthetic nano-structured material focused on toxic industrial chemical removal, including ammonia."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "5) Biosurveillance (BSV)"
                                    },
                                    "Description": {
                                        "val": "Integrate existing disparate military and civilian datasets, investigate methodologies to appropriately integrate open source data into advanced warning systems, and leverage and enhance advanced epidemiological models and algorithms for disease prediction, forecasting, impact and biological threat assessment.  Contribute to the development of global, near real-time, disease monitoring and surveillance systems that address secondary infection, fuse medical syndromic, environmental, and clinical data, and feed into disease modeling, medical resource estimation and decision support tools."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.217"
                                            },
                                            "Text": {
                                                "val": "Completed Verification and Validation (V&V) of existing agent-based epidemiological models, to include underlying population data and disease spread algorithms, along with biosurveillance data fusion, for use in robust adaptive decision making.  Demonstrated data stream (inclusive of point of need diagnostic data) integration for early warning and analytical capabilities of the BSV Ecosystem.  Developed analytic capabilities to synthesize and interrogate multiple sources of data to provide high confidence in the prediction, early warning and forecasting (inclusive of mitigation strategies) of infectious disease outbreaks.  Continued the development of a scalable, replicable framework to serve as the basis for a biosurveillance cloud for government data.  Continued development of an infrastructure and integrated set of tools and methods for the collection, storage, recall, and cross comparison of a wide array of biologic-related data emerging from research, clinical testing, and diagnostics, and other diverse sources."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "6) Detection"
                                    },
                                    "Description": {
                                        "val": "Focuses on the detection and identification of chemical and biological threats in near real-time at a distance from the detector.  Future programs focus on the improvement of algorithms, excitation sources, and detector elements to increase range, reduce false positives, increase sensitivity, and reduce cost."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.081"
                                            },
                                            "Text": {
                                                "val": "Continued processes of validating ground truth systems for detection technologies (genomic and proteomic technology) field assessments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.100"
                                            },
                                            "Text": {
                                                "val": "Continue processes of validating ground truth systems for detection technologies (genomic and proteomic technology) field assessments to lead into the initiation of sequence based comprehensive identification and characterization platform development for field forward capability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.244"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.244"
                                            },
                                            "Text": {
                                                "val": "Continue sequence based comprehensive identification and characterization platform development for field forward capability."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "7) Hazard Prediction"
                                    },
                                    "Description": {
                                        "val": "Improve battlespace awareness by accurately predicting hazardous material releases, atmospheric transport and dispersion, and resulting human effects.  Develop predictive capability for the source term of releases of chemical, biological, and industrial materials."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.242"
                                            },
                                            "Text": {
                                                "val": "Continue implementation of new numerical schemes and performance optimization for transport and dispersion models.  Continue enhancement of high-fidelity urban transport and dispersion.  Continue configuration management of science and technology prototype to establish upgraded capabilities listed as valid requirements for Hazard Prediction and Assessment Capability\/Joint Effects Model (HPAC\/JEM).  Initiate next-generation development of missile intercept\/functioning missile effects model.  Complete implementation and testing of new numerical schemes for future establishment of 64-bit\/multi-core-capable models."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.406"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.406"
                                            },
                                            "Text": {
                                                "val": "Continue implementation of new numerical schemes and performance optimization for transport and dispersion models.  Continue enhancement of high-fidelity urban transport and dispersion.  Continue configuration management of science and technology prototype to establish upgraded capabilities listed as valid requirements for Hazard Prediction and Assessment Capability\/Joint Effects Model (HPAC\/JEM).  Continue next-generation development of missile intercept\/functioning missile effects model."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "8) Hazard Prediction"
                                    },
                                    "Description": {
                                        "val": "Improve battlespace awareness by accurately predicting hazardous material releases, atmospheric transport and dispersion, and resulting human effects.  Develop predictive capability for the source term of releases of chemical, biological, and toxic industrial materials."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.158"
                                            },
                                            "Text": {
                                                "val": "Continued implementation of new numerical schemes and performance optimization for transport and dispersion models.  Continued enhancement of high fidelity urban transport and dispersion.  Continued with work on configuration management of science and technology prototype to establish upgraded capabilities listed as valid requirements for Hazard Prediction and Assessment Capability\/Joint Effects Model (HPAC\/JEM).  Initiated final development and integration of the missile intercept\/functioning missile effects model (i.e., hazard predictions given an missile intercepted in flight and hazard predictions given a missile that correctly delivers its payload).  Continued providing field transport and dispersion databases and websites for community accessible permanent test archiving.  Continued implementation and testing of new numerical schemes for future establishment of 64-bit\/multi-core capable models."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "9) Data Analysis"
                                    },
                                    "Description": {
                                        "val": "Develop chemical, biological, radiological and nuclear data-sharing capabilities.  Develop chapters of the Chemical and Biological Warfare Agent Effects Manual Number 1 (CB-1), an authoritative source capturing analytical methods for evaluating the effects of CB warfare agents on equipment, personnel, and operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.643"
                                            },
                                            "Text": {
                                                "val": "Initiated construction of a secure and capable framework for CB-1 within the Defense Threat Reduction Information Analysis Center (DTRIAC) Next Gen Scientific and Technical Information Archival and Retrieval System (STARS).  Supported modeling and analysis in response to the West Africa Ebola outbreak."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.052"
                                            },
                                            "Text": {
                                                "val": "Complete construction of a secure and capable framework for CB-1 within the Defense Threat Reduction Information Analysis Center (DTRIAC) Next Gen Scientific and Technical Information Archival and Retrieval System (STARS)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.797"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.797"
                                            },
                                            "Text": {
                                                "val": "Implement the Chemical and Biological Agent Effects Manual Number 1 (CB-1) on the Defense Threat Reduction Information Analysis Center (DTRIAC) Next Gen Scientific and Technical Information Archival and Retrieval System (STARS)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "10) Operational Effects"
                                    },
                                    "Description": {
                                        "val": "Develop decision support tools and information management capabilities for planning and real-time analysis to determine and assess operational effects, risks, and overall impacts of CBRN incidents on decision-making.  Focus areas include consequence management, population modeling, and knowledge management."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.790"
                                            },
                                            "Text": {
                                                "val": "Continued system performance model integration with advanced development programs and initiated development of second generation versions of systems performance models in individual protection."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.024"
                                            },
                                            "Text": {
                                                "val": "Continue system performance model integration with advanced development programs.  Complete second generation system performance model for multiple decontamination systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.431"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.431"
                                            },
                                            "Text": {
                                                "val": "Continue operational effects research and analysis efforts to provide the CBDP with objective, quantitative analysis in support of science and technology initiatives, material developments, operational guidance, and requirements setting."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "11) Filtration"
                                    },
                                    "Description": {
                                        "val": "Demonstration of novel filtration media into a lightweight, low-profile, and low-burden individual protective filter, which has enhanced performance against a broader range of challenges that includes toxic industrial chemicals."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.913"
                                            },
                                            "Text": {
                                                "val": "Continued the integration and demonstration of latest generation novel filtration media into a lightweight, low-profile, and low-burden individual protective filter, which has enhanced performance against a broader range of challenges that includes toxic industrial chemicals.  Continued transitioning these technologies to the Joint Service General Purpose Mask (JSGPM) and Joint Service Aircrew Mask (JSAM) programs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.102"
                                            },
                                            "Text": {
                                                "val": "Transition a synthetic nano-structured material focused on toxic industrial chemical removal, including ammonia."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "12) Fabrics"
                                    },
                                    "Description": {
                                        "val": "Demonstration of lightweight chemical and biological protective textiles that can be used as an integrated combat duty uniform."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.761"
                                            },
                                            "Text": {
                                                "val": "Continued to integrate next phase of integrated textile systems into a complete second generation candidate ensemble for the Uniform Integrated Protection Ensemble (UIPE) Phase II program.  Transitioned new fabric technologies to the UIPE program.  Scaled-up fabrics to ensemble prototypes and test in a relevant environment.  Continued the trade-space analysis of all government, industrial, and academic candidate materials for use in future UIPE phase initiations.  Completed transition of the human performance tool set to ACD&P - UIPE program so that it can be used in the optimization of protective ensemble design."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.432"
                                            },
                                            "Text": {
                                                "val": "Complete all demonstration activities of the developed fabric technologies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "13) SBIR\/STTR"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.239"
                                            },
                                            "Text": {
                                                "val": "SBIR\/STTR - FY15 - Small Business Innovative Research."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "CA4"
                                    },
                                    "Title": {
                                        "val": "CONTAMINATION AVOIDANCE (ACD&P)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "16.800"
                                        },
                                        "CurrentYear": {
                                            "val": "40.088"
                                        },
                                        "BudgetYearOne": {
                                            "val": "60.192"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "60.192"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "41.486"
                                        },
                                        "BudgetYearThree": {
                                            "val": "3.372"
                                        },
                                        "BudgetYearFour": {
                                            "val": "2.370"
                                        },
                                        "BudgetYearFive": {
                                            "val": "7.056"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "DE4"
                                    },
                                    "Title": {
                                        "val": "DECONTAMINATION SYSTEMS (ACD&P)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "14.748"
                                        },
                                        "CurrentYear": {
                                            "val": "2.900"
                                        },
                                        "BudgetYearOne": {
                                            "val": "1.594"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1.594"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "14.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "IS4"
                                    },
                                    "Title": {
                                        "val": "INFORMATION SYSTEMS (ACD&P)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "9.085"
                                        },
                                        "CurrentYear": {
                                            "val": "6.169"
                                        },
                                        "BudgetYearOne": {
                                            "val": "7.464"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "7.464"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "8.355"
                                        },
                                        "BudgetYearThree": {
                                            "val": "7.871"
                                        },
                                        "BudgetYearFour": {
                                            "val": "1.240"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.870"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "TE4"
                                    },
                                    "Title": {
                                        "val": "TEST & EVALUATION (ACD&P)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "12.106"
                                        },
                                        "CurrentYear": {
                                            "val": "18.188"
                                        },
                                        "BudgetYearOne": {
                                            "val": "17.371"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "17.371"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "18.836"
                                        },
                                        "BudgetYearThree": {
                                            "val": "19.199"
                                        },
                                        "BudgetYearFour": {
                                            "val": "18.803"
                                        },
                                        "BudgetYearFive": {
                                            "val": "13.717"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "NT3"
                    },
                    "ProjectTitle": {
                        "val": "TECHBASE NON-TRADITIONAL AGENTS DEFENSE (ATD)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "21.423"
                        },
                        "CurrentYear": {
                            "val": "21.574"
                        },
                        "BudgetYearOne": {
                            "val": "22.948"
                        },
                        "BudgetYearOneBase": {
                            "val": "22.948"
                        },
                        "BudgetYearTwo": {
                            "val": "21.392"
                        },
                        "BudgetYearThree": {
                            "val": "20.129"
                        },
                        "BudgetYearFour": {
                            "val": "19.603"
                        },
                        "BudgetYearFive": {
                            "val": "19.759"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Project NT3 develops future capabilities against emerging and novel threats and verifies current capabilities against Non-Traditional Agents (NTAs).  This project focuses on demonstrating fast and agile scientific responses to enhance or develop capabilities that address emerging threats.  Efforts in this project support an integrated approach to develop new or enhanced countermeasures against novel and emerging threats through innovative science and technology (S&T) solutions for detection, protection, decontamination and medical countermeasures (MCMs).  Efforts supply test methodologies and supporting science to verify capabilities, develop protection and hazard mitigation options, expand hazard assessment tools, and develop MCMs against NTAs.  This project is a comprehensive and focused effort for developing NTA defense capabilities, coordinated with specific interagency partners for doctrine, equipment, and training for the Warfighter and civilian population for defense against NTAs.  This project funds advanced technology development of NTA defense science and technology initiatives and transitions them to Budget Activities 4 and 5."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) Diagnostics - Medical"
                                    },
                                    "Description": {
                                        "val": "Focuses on state-of-the-art laboratory\/fieldable methods that detect exposure to non-traditional agents in clinical samples.  It also targets the identification of biomolecular targets that can be leveraged as analytical methodologies, as well as, laboratory and animal studies characterizing time-course and longevity of a particular analyte\/biomarker."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.488"
                                            },
                                            "Text": {
                                                "val": "Continued development of mature technologies that can quickly diagnose pre-symptomatic NTA exposure.  Began transition method development for identification and validation of NTAs in clinical samples to the Laboratory Response Network."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.656"
                                            },
                                            "Text": {
                                                "val": "Continue development of mature technologies that can quickly diagnose pre-symptomatic NTA exposure.  Continue transition method development for identification and validation of NTAs in clinical samples to the Laboratory Response Network."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.708"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.708"
                                            },
                                            "Text": {
                                                "val": "Continue development of mature technologies that can quickly diagnose pre-symptomatic NTA exposure.  Continue transition method development for identification and validation of NTAs in clinical samples to the Laboratory Response Network."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "2) Material Contamination Mitigation"
                                    },
                                    "Description": {
                                        "val": "Study and assessment of decontamination technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.822"
                                            },
                                            "Text": {
                                                "val": "Continued verification, demonstration, and transition of decontamination technologies against NTAs to the Advanced Development - Decontamination Family of Systems (DFoS) program.  Continued to develop and demonstrate enzyme technology for low-impact decontamination of NTAs, and transitioned these technologies.  Continued to enhance NTA-related understanding and capabilities of current decontamination and hazard mitigation technologies and develop additional processes for NTA hazard mitigation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.109"
                                            },
                                            "Text": {
                                                "val": "Continue to assess performance and unique aspects of full spectrum of NTAs and develop technologies to optimize performance against NTAs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.345"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.345"
                                            },
                                            "Text": {
                                                "val": "Continue integration of a Point-of-Use decontaminant formulation system with optimized methods for delivery matching the agent, surface and environmental conditions, and optimized application method.  Construct a multi-dimensional \"Decontamination Performance Region Map\" that will facilitate Point-of-Use decontaminant formulation in the field.  Continue development of the Dial-a-Decon brassboard to enhance NTA efficacy by modifying dissemination of formulations and complete an assessment of Dial-a-Decon formulas.  Integrate NTAs into the continuing responsive coatings projects to enhance decontaminability as part of the systems approach to achieving efficacy goals."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "3) Personnel Contamination Mitigation"
                                    },
                                    "Description": {
                                        "val": "Develop new technologies to alleviate the risk associated with contaminated human remains and personnel effects (materials) exposed to and contaminated by chemical agents by neutralizing and\/or physically removing the residual chemical agents."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.059"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.059"
                                            },
                                            "Text": {
                                                "val": "Explore combinations of complementary technologies to reduce the contamination hazard faster with less outside support and develop revolutionary prototype systems that sense, respond, and signal contamination."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "4) Pretreatments - Medical"
                                    },
                                    "Description": {
                                        "val": "Develop nerve agent enzyme pretreatments that provide protection against non-traditional agents.  Enzymes should have the ability to rapidly bind and detoxify nerve agents, and have broad binding specificity and high catalytic efficiency for the destruction of agents.  For enzyme approaches, one molecule of catalytic bioscavenger should be capable of detoxifying numerous molecules of nerve agents resulting in the capability for a small quantity of catalytic bioscavenger to protect against a large dose of nerve agent."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.908"
                                            },
                                            "Text": {
                                                "val": "Continued exploitation of alternative expression systems for production of recombinant butyrylcholinesterase (rBuChE).  Pursued novel in-silico and\/or in vitro methods to facilitate high throughput screening and development of medical countermeasures."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.079"
                                            },
                                            "Text": {
                                                "val": "Continue efforts to demonstrate feasibility of intra-muscular (IM) stoichiometric bioscavenger.  Contributing to alternate manufacturing processes for rBuChE.  Contribute to research efforts at the Absorption, Distribution, Metabolism and Excretion (ADME) Research Center of Excellence, with Tier 0, 1 and 2 assay potential."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.772"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.772"
                                            },
                                            "Text": {
                                                "val": "Continue efforts to demonstrate proof-of-concept for IM and pulmonary delivery of a stoichiometric bioscavenger.  Continue contributing to alternate manufacturing processes for rBuChE.  Demonstrate impact ADME Research Center of Excellence across multiple medical countermeasure product development efforts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "5) Therapeutics - Medical"
                                    },
                                    "Description": {
                                        "val": "Determine the toxic effects of agents by probable routes of field exposure and refine standard experimental routes.  Physiological parameters and pathological assessment will be used to establish the general mode and mechanisms of toxicity required for Medical Countermeasure (MCM) development."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.782"
                                            },
                                            "Text": {
                                                "val": "Conducted formulation and stability studies of therapeutic compounds.  Examined small animal model safety studies of limited selected formulations of centrally active reactivators or anti-cholinergic compounds."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.274"
                                            },
                                            "Text": {
                                                "val": "Continue development of technology to facilitate delivery of therapeutic regimen to the brain.  Refine small animal models to support Food and Drug Administration (FDA) licensure."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.188"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.188"
                                            },
                                            "Text": {
                                                "val": "Continue support of enabling technology to facilitate delivery of therapeutic regimen to the brain.  Continue to refine and validate small animal models to support FDA licensure."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "6) Detection"
                                    },
                                    "Description": {
                                        "val": "Detection NTA: Focuses on technologies to provide NTA detection capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.234"
                                            },
                                            "Text": {
                                                "val": "Continued the development of test methodology to validate signatures for chemical aerosol threat materials."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.932"
                                            },
                                            "Text": {
                                                "val": "Continue the development of test methodology to validate signatures for chemical aerosol threat materials."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.847"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.847"
                                            },
                                            "Text": {
                                                "val": "Continue integration studies for Next Generation Chemical Detector (NGCD) based on Micro Electro-Mechanical Systems components for Gas Chromatography and Mass Spectrometry.  Continue the development of test methodology to validate signatures for chemical aerosol threat materials.  Initiate the transfer of validated signatures into the NGCD program of record."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "7) Modeling & Simulation"
                                    },
                                    "Description": {
                                        "val": "This effort develops non-traditional agent (NTA) technology advancements for joint service application in the area of information systems and modeling and simulation technologies.  These activities will speed maturing of advanced technologies to reduce risk in system-oriented integration\/demonstration efforts.  Information systems advanced technology focuses on areas of advanced warning and reporting, hazard prediction and assessment, simulation analysis and planning, and systems performance modeling."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.245"
                                            },
                                            "Text": {
                                                "val": "Conducted analysis and oversight of NTA simulant testing related to creating and verifying NTA modeling source terms, for defense against chemical hazards."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.239"
                                            },
                                            "Text": {
                                                "val": "Complete analysis of NTA simulant testing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.239"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.239"
                                            },
                                            "Text": {
                                                "val": "Continue sensitivity and validation studies on NTA source term models and update and expand NTA databases."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "8) Air Purification"
                                    },
                                    "Description": {
                                        "val": "Study and assessment of filter technologies."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.377"
                                            },
                                            "Text": {
                                                "val": "Assess the performance of novel adsorbents and develop specific functionalities of NTAs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "9) Percutaneous Protection"
                                    },
                                    "Description": {
                                        "val": "Study and assessment of protective technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.136"
                                            },
                                            "Text": {
                                                "val": "Continued verification, demonstration and transition of low burden technologies to improve overall protective clothing performance against NTAs.  Transitioned technologies to the Uniform Integrated Protective Ensemble (UIPE) program."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.862"
                                            },
                                            "Text": {
                                                "val": "Assess and optimize technologies to improve whole system performance against NTAs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "10) Test & Evaluation"
                                    },
                                    "Description": {
                                        "val": "Develops test and evaluation technologies and processes in support of NTA activities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.808"
                                            },
                                            "Text": {
                                                "val": "Completed initial select agent testing, and continued further prioritized select agent testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.781"
                                            },
                                            "Text": {
                                                "val": "Continue further prioritized select agent testing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.790"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.790"
                                            },
                                            "Text": {
                                                "val": "Continue methodology and protocol development to support the evaluation of Next Generation Chemical Detector technologies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "11) SBIR\/STTR"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.265"
                                            },
                                            "Text": {
                                                "val": "SBIR\/STTR - FY15 - Small Business Innovative Research."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "CA4"
                                    },
                                    "Title": {
                                        "val": "CONTAMINATION AVOIDANCE (ACD&P)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "16.800"
                                        },
                                        "CurrentYear": {
                                            "val": "40.088"
                                        },
                                        "BudgetYearOne": {
                                            "val": "60.192"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "60.192"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "41.486"
                                        },
                                        "BudgetYearThree": {
                                            "val": "3.372"
                                        },
                                        "BudgetYearFour": {
                                            "val": "2.370"
                                        },
                                        "BudgetYearFive": {
                                            "val": "7.056"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "DE4"
                                    },
                                    "Title": {
                                        "val": "DECONTAMINATION SYSTEMS (ACD&P)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "14.748"
                                        },
                                        "CurrentYear": {
                                            "val": "2.900"
                                        },
                                        "BudgetYearOne": {
                                            "val": "1.594"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1.594"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "14.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "IP4"
                                    },
                                    "Title": {
                                        "val": "INDIVIDUAL PROTECTION (ACD&P)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.588"
                                        },
                                        "CurrentYear": {
                                            "val": "6.811"
                                        },
                                        "BudgetYearOne": {
                                            "val": "4.217"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "4.217"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.400"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "12.016"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MC4"
                                    },
                                    "Title": {
                                        "val": "MEDICAL CHEMICAL DEFENSE (ACD&P)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "1.970"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "1.970"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "TE4"
                                    },
                                    "Title": {
                                        "val": "TEST & EVALUATION (ACD&P)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "12.106"
                                        },
                                        "CurrentYear": {
                                            "val": "18.188"
                                        },
                                        "BudgetYearOne": {
                                            "val": "17.371"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "17.371"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "18.836"
                                        },
                                        "BudgetYearThree": {
                                            "val": "19.199"
                                        },
                                        "BudgetYearFour": {
                                            "val": "18.803"
                                        },
                                        "BudgetYearFive": {
                                            "val": "13.717"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TM3"
                    },
                    "ProjectTitle": {
                        "val": "TECHBASE MED DEFENSE (ATD)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "93.949"
                        },
                        "CurrentYear": {
                            "val": "110.310"
                        },
                        "BudgetYearOne": {
                            "val": "93.725"
                        },
                        "BudgetYearOneBase": {
                            "val": "93.725"
                        },
                        "BudgetYearTwo": {
                            "val": "96.359"
                        },
                        "BudgetYearThree": {
                            "val": "97.445"
                        },
                        "BudgetYearFour": {
                            "val": "96.329"
                        },
                        "BudgetYearFive": {
                            "val": "98.080"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Project TM3 funds preclinical and early phase clinical development of vaccines, therapeutic drugs, and diagnostic capabilities to provide safe and effective medical defense against validated biological threat agents or emerging infectious disease biothreats including bacteria, toxins, and viruses.  Innovative biotechnology approaches to advance medical systems designed to rapidly identify, diagnose, prevent, and treat disease due to exposure to biological threat agents will be evaluated.  In addition this project supports the advanced development of medical countermeasures to include prophylaxes, pretreatments, antidotes, skin decontaminants and therapeutic drugs against identified and emerging chemical warfare threat agents.  Entry of candidate vaccines, therapeutics, and diagnostic technologies into advanced development is facilitated by the development of technical data packages that support the Food and Drug Administration (FDA) Investigational New Drug (IND) processes, DoD acquisition regulations, and the oversight of early phase clinical trials in accordance with FDA guidelines.  This project also supports the advanced development of medical countermeasures to protect the Warfighter against radiological\/nuclear exposure.\n\nThe Medical Countermeasures Initiative (MCMI) was established to coordinate inter-related advanced development and flexible manufacturing capabilities, providing a dedicated, cost-effective, reliable, and sustainable MCM process that meets the Warfighter and national security needs.  MCMI efforts within science and technology (S&T) are concentrated in advancing two areas: 1) regulatory science and 2) flexible manufacturing technologies and processes for MCMs.  Efforts conducted in these areas are enablers supporting the DoD Medical Countermeasures Advanced Development and Manufacturing (MCM-ADM) capability.\n\nFY 2015 funding includes $87.6 million of base funding and $22.7 million of Ebola emergency funding."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) Assays and Reagents"
                                    },
                                    "Description": {
                                        "val": "Development and verification of rapid, sensitive, and specific tests for the identification of Biological Warfare Agents (BWAs) and their expressed pathogens and toxins in clinical specimens from Warfighters for the diagnosis of exposure\/infection.  Discovery of host biomarkers generated in response to exposure to biological threat agents."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.599"
                                            },
                                            "Text": {
                                                "val": "Developed laboratory, data fusion informatics methodologies and specimen pipelines into robust and well-characterized signatures required to identify and bio-type emerging, re-emerging, and identify antibiotic resistant mutations and phenotypes.  Developed thermostable reagents\/scale-up protocols to advanced development for use in austere biosurveillance environments.  Collaborated with the Centers for Disease Control (CDC) to improve diagnostic and surveillance capabilities needed to counter traditional, engineered, emerging and biological threats.  Transitioned genotypic and phenotypic characterization data for ten previously selected Bacillus anthracis and previously selected Yersinia pestis isolates.  Transitioned the Threat Characterization Consortium (TCC) sequencing data of BSL-2 and BSL-3 bacteria.  Demonstrated of extraction and analysis of differential gene expression (EDGE) bioinformatics capability.  Developed Amoeba-Pure Prototype Device.  Demonstrated EDGE Bioinformatics capability to OCONUS customers."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.709"
                                            },
                                            "Text": {
                                                "val": "Continue to mature thermostable reagents for use in austere biosurveillance environments.  Continue to collaborate with the CDC to improve diagnostic and surveillance capabilities needed to counter traditional, engineered, emerging and biological threats.  Complete development and transition signature analysis and assay\/device for strain identification and genotyping of Burkholderia pseudomallei and CCHF virus.  Continue development of Mass spectrometry protocol capable of identifying HHA false positive triggers on multiple toxin lateral flow assays.  Transition sequencing and analysis of B.  pseudomallei genomes and near neighbor genomes.  Begin Phase II of Republic of Korea (ROK) Project Agreement to expand into pathogen discovery capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.556"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.556"
                                            },
                                            "Text": {
                                                "val": "Validate the performance of 50 multi-plex assays utilizing the MAGPIX format (multiplexing platform capable of performing qualitative and quantitative analysis) for the detection of Burkholderia pseudomallei and its near neighbors.  Continue Phase II of ROK Project Agreement."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "2) Bacterial Therapeutics"
                                    },
                                    "Description": {
                                        "val": "Identify, optimize and evaluate potential therapeutic compounds effective against bacterial threat agents."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.532"
                                            },
                                            "Text": {
                                                "val": "Evaluated FDA approved compounds for efficacy in non-human primate models against aerosolized challenge of B.  anthracis.  Continued evaluation of efficacy of novel topoisomerase inhibitor against Y.  pestis and F.  tularensis.  Developed novel ribosome inhibitors and additional novel topoisomerase inhibitors as therapeutics for priority antimicrobial resistant bacterial pathogens.  Continued pre-clinical research required to submit IND applications to the FDA for additional products or additional product indications to refresh the bacterial therapeutics product pipeline."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.521"
                                            },
                                            "Text": {
                                                "val": "Evaluate FDA approved compounds for efficacy in non-human primate models against aerosolized challenge of B.  anthracis.  Develop novel ribosome inhibitors as therapeutics for priority bacterial pathogens.  Continue pre-clinical research required to submit IND applications to the FDA for additional products.  Continue non-clinical work utilizing the Animal Rule for the submission of Supplemental New Drug Applications (sNDAs), reducing the focus to novel topoisomerase inhibitors and addressing a limited number of priority pathogens."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.403"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.403"
                                            },
                                            "Text": {
                                                "val": "Conduct evaluation of an FDA approved compound for efficacy in pivotal GLP non-human primate studies against an aerosolized challenge of F.  tularensis in support of submission of a sNDA under the Animal Rule.  Down select between novel ribosome inhibitors and a novel topoisomerase inhibitor as therapeutics for priority bacterial pathogens.  Continue non-clinical research required to submit IND applications to the FDA for additional products.  Continue supportive pivotal GLP studies to further the advancement of both novel and approved therapeutics for limited priority pathogen indications under the Animal Rule."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "3) Bacterial\/Toxin Vaccines"
                                    },
                                    "Description": {
                                        "val": "Evaluate the best single agent bacterial and toxin vaccines for effectiveness against aerosol challenge in large animal models."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.460"
                                            },
                                            "Text": {
                                                "val": "Initiated transition requirements in support of the ricin vaccine.  Continued to test mutants of RVEc as backup candidates for improved safety and efficacy."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.655"
                                            },
                                            "Text": {
                                                "val": "Continue with the advanced developer to fulfill S&T needs in support of the ricin vaccine transition.  Down-select to a back-up candidate to RVEc."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.363"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.363"
                                            },
                                            "Text": {
                                                "val": "Complete transition ricin vaccine.  Utilize ongoing clinical work to generate monoclonal antibodies against ricin toxin.  Demonstrate proof-of-concept efficacy for lead Tularemia Vaccine in nonhuman primate model.  Continue development of a monoclonal antibody-based pretreatment against botulinum neurotoxin.  Explore technology transfer of manufacturing to a suitable long-term manufacturing partner.  Develop and evaluate bridging strategies for interim fielding capability readiness."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "4) Biosurveillance"
                                    },
                                    "Description": {
                                        "val": "Integrate existing disparate military and civilian datasets, investigate methodologies to appropriately integrate open source data into advanced warning systems, and leverage and enhance advanced epidemiological models and algorithms for disease prediction, forecasting, impact and biological threat assessment.  Contribute to the development of global, near real-time, disease monitoring and surveillance systems that address secondary infection, fuse medical syndromic, environmental, and clinical data, and feed into disease modeling, medical resource estimation and decision support tools.  Program originated in CB3 in FY14, and transitioned to TM3 in FY15."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.936"
                                            },
                                            "Text": {
                                                "val": "Complete the development of a scalable, replicable framework to serve as the basis for a biosurveillance cloud for government data.  Complete efforts using social media to infer individual and collective health behavior for digital threat surveillance, epidemic planning and response.  Continue the development of analytic capabilities to synthesize and interrogate multiple sources of data to provide high confidence in the prediction, early warning and forecasting (inclusive of mitigation strategies) of infectious disease outbreaks.  Continue the development of the BSV Ecosystem to include analyst collaboration tools, advanced analytics, and analyst workbench.  Continue the development and testing of a fieldable \"smart trap\" for long-term autonomous surveillance of arboviruses in mosquitoes.  Initiate the development of various biosurveillance analytic capabilities including a Surveillance Window App (SWAP), a suite of five epidemiological tools for integration into the Biosurveillance Ecosystem, and a Biosurveillance Ecosystem evaluation support capability.  Initiate a field forward diagnostic evaluation capability to assess technical feasibility and limitations of deploying point of need diagnostics in austere environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.444"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.444"
                                            },
                                            "Text": {
                                                "val": "Complete the development and testing of a fieldable \"smart trap\" for long-term autonomous surveillance of arboviruses.  Continue the development of the BSV Ecosystem to include analyst collaboration tools, advanced analytics, and analyst workbench.  Continue the development of various biosurveillance analytic capabilities including a Surveillance Window App (SWAP), a suite of five epidemiological tools for integration into the Biosurveillance Ecosystem, and a Biosurveillance Ecosystem evaluation support capability.  Continue the field forward diagnostic evaluation capability to assess technical feasibility and limitations of deploying point of need diagnostics in austere environments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "5) Chemical Diagnostics"
                                    },
                                    "Description": {
                                        "val": "Focuses on state-of-the-art laboratory\/fieldable methods that detect exposure to chemical warfare agents (CWA) (e.g., nerve agents and vesicants) in clinical samples.  It also targets the identification of biomolecular targets that can be leveraged as analytical methodologies, as well as laboratory and animal studies characterizing time-course and longevity of a particular analyte\/biomarker."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.391"
                                            },
                                            "Text": {
                                                "val": "Expanded the current set of analytical methods to more sensitive analytical platforms for the detection of CWAs in clinical samples.  Evaluated new analytical methods against currently used methods."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.389"
                                            },
                                            "Text": {
                                                "val": "Continue the current set of analytical methods to more sensitive analytical platforms for the detection of CWAs in clinical samples.  Continue development of new analytical methods against currently used methods."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.400"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.400"
                                            },
                                            "Text": {
                                                "val": "Continue the current set of analytical methods to more sensitive analytical platforms for the detection of CWAs in clinical samples."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "6) Diagnostic Device Platforms"
                                    },
                                    "Description": {
                                        "val": "Diagnostic device development to include systems able to harness next generation technologies to revolutionize clinical diagnostics in care facilities and in hospital laboratories.  This investment will incorporate capabilities such as next generation sequencing and advanced biomolecular methods to harness both host and pathogen biomarkers in a threat agnostic approach that will serve all echelons of military medical care.  Technology transitions to the Next Generation Diagnostic System."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "26.375"
                                            },
                                            "Text": {
                                                "val": "Continued to develop candidate devices for potential transition to advanced developers to support the deployment of point of care diagnostic capabilities.  Developed hardware solutions and assay formats to enable point of need diagnostic capabilities.  Verified clinical utility of host and pathogen biomarkers and integrate onto diagnostic platform prototype(s) that confers the ability to identify and type novel infectious agents as a function of their relationship to previously characterized pathologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.234"
                                            },
                                            "Text": {
                                                "val": "Evaluate candidate host biomarker diagnostic targets in clinical test environments.  Develop point-of-need diagnostic platforms with host biomarker diagnostic assays and test performance.  Evaluate metrics of host-based diagnostic approach by comparing with pathogen detection approaches (infection to detection time, sensitivity, specificity, etc.) in analytical and\/or clinical environments.  Continue to develop candidate devices for potential transition to support the deployment of point of care diagnostic capabilities.  Continue development of hardware solutions and assay formats to enable point of need diagnostic capabilities.  Verify clinical utility of host and pathogen biomarkers and integrate onto diagnostic platform prototypes that confer(s) the ability to identify and type novel infectious agents as a function of their relationship to previously characterized pathologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.832"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.832"
                                            },
                                            "Text": {
                                                "val": "Continue to develop candidate devices for potential transition to support the development of point of care diagnostic capabilities.  Continue development of hardware solutions and assay formats to enable point of need diagnostic capabilities.  Continue to verify clinical utility of host and pathogen biomarkers and integrate onto diagnostic platform prototypes that confer(s) the ability to identify and type novel infectious agents as a function of their relationship to previously characterized pathologies.  Continue sequence based comprehensive identification and characterization platform development for field forward capability."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "7) Medical Countermeasures Initiative"
                                    },
                                    "Description": {
                                        "val": "The MCMI will integrate the regulatory science and manufacturing technologies and processes developed into the Advanced Development and Manufacturing (MCM-ADM) as enablers of the advanced development and flexible manufacturing capability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.135"
                                            },
                                            "Text": {
                                                "val": "Continued development of human in vitro immune mimetic assays for FDA acceptance to enable rapid and accurate prediction of the human response to experimental vaccines and other MCMs.  Continued to develop and make practical improvements to existing agile, flexible, manufacturing bioprocesses for the purpose of accelerating access to biodefense MCMs.  Continued the development of a plant-based VLP vaccine.  Identified additional ex-vivo cell\/tissue mimetics such as precision cut tissue slices to serve as predictive surrogates for accelerated MCM efficacy and safety evaluation.  Supported filovirus pre-exposure\/post-exposure vaccine in response to West Africa Ebola outbreak."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.517"
                                            },
                                            "Text": {
                                                "val": "Continue development of human in vitro immune mimetic assays for FDA acceptance to enable rapid and accurate prediction of the human response to experimental vaccines and other MCMs.  Continue to develop and make practical improvements to existing agile, flexible, manufacturing bioprocesses for the purpose of accelerating access to biodefense MCMs.  Identify long-term partner for Advanced Development Manufacturing capability.  Continue the development of a plant-based VLP vaccine."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.428"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.428"
                                            },
                                            "Text": {
                                                "val": "Continue development of human in vitro immune mimetic assays for FDA acceptance to enable rapid and accurate prediction of the human response to experimental vaccines and other MCMs.  Continue to develop and make practical improvements to existing agile, flexible, manufacturing bioprocesses for the purpose of accelerating access to biodefense MCMs.  Continue to develop agile, flexible manufacturing processes that are amenable to the DoD Advanced Development and Manufacturing capability (ADMc)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "8) Neurologic Therapeutics"
                                    },
                                    "Description": {
                                        "val": "Focuses on therapeutic strategies to effectively minimize neurologic injuries resulting from exposure to chemical warfare agents (CWA).  This effort involves the development of neuroprotectants, anticonvulsants, and improved neurotransmitter restorers.  Supports eventual Food and Drug Administration (FDA) licensure of new compounds or new indications for licensed products for use in the treatment of chemical warfare casualties."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.752"
                                            },
                                            "Text": {
                                                "val": "Maintained core capability for in vitro and in vivo testing efforts supporting regulatory science to facilitate FDA licensure."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.649"
                                            },
                                            "Text": {
                                                "val": "Continue efforts supporting regulatory science to facilitate FDA licensure including in vitro and in vivo testing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.244"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.244"
                                            },
                                            "Text": {
                                                "val": "Maintain Absorption, Distribution, Metabolism and Excretion (ADME) Research Center of Excellence partnership to ensure capability for supporting regulatory science to facilitate FDA licensure."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "9) Toxin Therapeutics"
                                    },
                                    "Description": {
                                        "val": "Identify, optimize and evaluate potential therapeutic candidates effective against biological toxin threat agents."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.412"
                                            },
                                            "Text": {
                                                "val": "Continued evaluation of small molecule non-peptidic inhibitors for pharmacokinetic and toxicology profiles.  Tested novel small molecule inhibitors in mouse model of BoNT A intoxication for efficacy."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Continue evaluation of small molecule non-peptidic inhibitors for pharmacokinetic and toxicology profiles.  Continue to test novel small molecule inhibitors in mouse model of BoNT A intoxication for efficacy.  Initiate production, characterization, and evaluation of humanized antibody cocktail to prevent and\/or treat BoNT intoxication."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.500"
                                            },
                                            "Text": {
                                                "val": "Continue characterization and evaluation of humanized pentavalent antibody cocktail to prevent and\/or treat BoNT intoxication, advancing to preclinical studies.  Complete testing of novel small molecule inhibitors in NHP model of BoNT A intoxication for efficacy.  Finalize preclinical studies to advance antibody based therapeutic for staphylococcal enterotoxin B intoxication into phase I clinical trials."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "10) Vaccine Platforms and Research Tools"
                                    },
                                    "Description": {
                                        "val": "Use novel technology and methods to support development of vaccine candidates.  Conduct studies to determine potential immune interference between lead vaccine candidates, the effect of alternative vaccine delivery methods, and thermo-stabilization technologies on the efficacy of lead vaccine candidates.  Identify correlates of protection in humans, and predict the success of lead vaccine candidates in humans."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.423"
                                            },
                                            "Text": {
                                                "val": "Continued formulation studies to produce a thermo-stable, spray-dried formulation of an advanced vaccine candidate.  Continued to evaluate stabilization technologies that provide thermal stability to multiple classes of vaccines such as viral vectored vaccines and subunit protein vaccines.  Continued to evaluate alternative (needle-free) vaccine delivery technologies such as inhalers or skin patches for the delivery of mature vaccine candidates.  Utilized clinical samples from Filovirus or Alphavirus outbreaks in multiple international locations to help define clinically relevant correlates of immunity."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.826"
                                            },
                                            "Text": {
                                                "val": "Continue to develop alternative production platforms applying them to current CBDP vaccine needs.  Conduct side-by-side studies to identify optimal adjuvants against bacterial, viral and toxin targets.  Utilize clinical samples from Filovirus outbreaks in multiple international locations to help define clinically relevant correlates of immunity."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.584"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.584"
                                            },
                                            "Text": {
                                                "val": "Maintain studies that utilize clinical samples from Filovirus outbreaks in multiple international locations to refine definition of clinically relevant correlates of immunity.  Evaluate novel adjuvants as platforms for utilization in biodefense vaccines.  Develop and evaluate bridging strategies for interim fielding capability readiness."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "11) Viral Therapeutics"
                                    },
                                    "Description": {
                                        "val": "Identify, optimize and evaluate potential therapeutic candidates effective against designated viral threat agents."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.658"
                                            },
                                            "Text": {
                                                "val": "Evaluated immunotherapies for Filoviruses in non-human primate models.  Continued development of antibody-based therapies for Filovirus infections.  Continued screening program to determine efficacy of FDA approved compounds against emerging infectious diseases.  Evaluated FDA-approved host-directed tyrosine kinase inhibitors for efficacy against Alphavirus, Filovirus, Flavivirus, Arenavirus, Bunyavirus, and Orthopoxvirus.  Continued pre-clinical research required to submit IND applications to the FDA for additional products or additional product indications to refresh the viral therapeutics product pipeline.  Accelerated an Ebola Virus countermeasure development in response to the West Africa outbreak."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.314"
                                            },
                                            "Text": {
                                                "val": "Evaluate immunotherapies for filoviruses in non-human primate models.  Continue and repurposing screening program to determine efficacy of FDA approved compounds against emerging infectious diseases.  Continue pre-clinical research required to submit IND applications to the FDA for additional products or additional product indications to refresh the viral therapeutics product pipeline."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "Evaluate immunotherapies for alphaviruses in small animal and non-human primate models.  Continue a repurposing screening program to determine the efficacy of FDA approved compounds against emerging infectious diseases.  Continue pre-clinical research required to submit IND applications to the FDA for additional products or additional product indications to refresh the viral therapeutics product pipeline."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "12) Viral Therapeutics - Ebola"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "22.700"
                                            },
                                            "Text": {
                                                "val": "Ebola Response (Title X) funded effort.  Accelerate Ebola Virus countermeasures development in response to the West Africa outbreak.  Initiate pre-clinical research, including optimization, required to submit Investigational New Drug (IND) applications to the Food and Drug Administration (FDA) and conduct Phase I clinical safety studies for near-term candidate products targeting the Ebola virus."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "13) Viral Vaccines"
                                    },
                                    "Description": {
                                        "val": "Evaluates the best vaccine candidates for Alphaviruses and Filoviruses for effectiveness and duration of protective immune response against aerosol challenge in large animal models.  Animal models will be developed to support FDA licensure of mature vaccine candidates."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.212"
                                            },
                                            "Text": {
                                                "val": "Continued development of Alphavirus immunological assays to support product development.  Conducted Good Lab Practices (GLP) animal efficacy studies of the VEE DNA vaccine delivered by in vivo electroporation via intra-muscular or intra-dermal administration.  Continued to conduct pre-clinical studies of the Alphavirus replicon vaccine in coordination with the advanced developer.  Continued the development of animals models for Alphaviruses (EEE and WEE), to fulfill future FDA 'Animal Rule' requirements necessary for vaccine licensure."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.300"
                                            },
                                            "Text": {
                                                "val": "Conduct Good Lab Practices (GLP) animal efficacy studies of the VEE DNA vaccine delivered by in vivo electroporation via intra-muscular or intra-dermal administration.  Continue to conduct pre-clinical studies of the Alphavirus replicon vaccine in coordination with the advanced developer.  Complete GLP natural history studies for Alphaviruses (W\/E\/VEEV).  Continue the development of animals models for Alphaviruses (EEE and WEE), to fulfill future FDA 'Animal Rule' requirements necessary for vaccine licensure.  Begin a Phase 1 clinical trial with a multivalent Alphavirus DNA vaccine candidate."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.971"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.971"
                                            },
                                            "Text": {
                                                "val": "Continue to support Alphavirus and Filovirus vaccine candidates by determining correlates of protective immunity.  Continue natural history studies for Alphaviruses (W\/E\/VEEV) to fulfill future FDA 'Animal Rule' requirements necessary for vaccine licensure.  Demonstrate proof-of-concept safety and immunogenicity with a monovalent Filovirus vaccine candidate.  Develop and evaluate bridging strategies for interim fielding capability readiness."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "14) SBIR\/STTR"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.560"
                                            },
                                            "Text": {
                                                "val": "SBIR\/STTR - FY15 - Small Business Innovative Research."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "MB4"
                                    },
                                    "Title": {
                                        "val": "MEDICAL BIOLOGICAL DEFENSE (ACD&P)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "132.696"
                                        },
                                        "CurrentYear": {
                                            "val": "106.380"
                                        },
                                        "BudgetYearOne": {
                                            "val": "81.916"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "81.916"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "49.207"
                                        },
                                        "BudgetYearThree": {
                                            "val": "28.642"
                                        },
                                        "BudgetYearFour": {
                                            "val": "16.949"
                                        },
                                        "BudgetYearFive": {
                                            "val": "7.710"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MC4"
                                    },
                                    "Title": {
                                        "val": "MEDICAL CHEMICAL DEFENSE (ACD&P)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "1.970"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "1.970"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MB5"
                                    },
                                    "Title": {
                                        "val": "MEDICAL BIOLOGICAL DEFENSE (EMD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "253.748"
                                        },
                                        "CurrentYear": {
                                            "val": "179.497"
                                        },
                                        "BudgetYearOne": {
                                            "val": "117.881"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "117.881"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "170.122"
                                        },
                                        "BudgetYearThree": {
                                            "val": "209.182"
                                        },
                                        "BudgetYearFour": {
                                            "val": "215.905"
                                        },
                                        "BudgetYearFive": {
                                            "val": "208.482"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MC5"
                                    },
                                    "Title": {
                                        "val": "MEDICAL CHEMICAL DEFENSE (EMD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "40.973"
                                        },
                                        "CurrentYear": {
                                            "val": "48.529"
                                        },
                                        "BudgetYearOne": {
                                            "val": "42.913"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "42.913"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "49.322"
                                        },
                                        "BudgetYearThree": {
                                            "val": "38.153"
                                        },
                                        "BudgetYearFour": {
                                            "val": "25.158"
                                        },
                                        "BudgetYearFive": {
                                            "val": "6.371"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MB7"
                                    },
                                    "Title": {
                                        "val": "MEDICAL BIOLOGICAL DEFENSE (OP SYS DEV)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.493"
                                        },
                                        "CurrentYear": {
                                            "val": "13.414"
                                        },
                                        "BudgetYearOne": {
                                            "val": "11.801"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "11.801"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "10.420"
                                        },
                                        "BudgetYearThree": {
                                            "val": "3.137"
                                        },
                                        "BudgetYearFour": {
                                            "val": "13.943"
                                        },
                                        "BudgetYearFive": {
                                            "val": "12.496"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TT3"
                    },
                    "ProjectTitle": {
                        "val": "TECHBASE TECHNOLOGY TRANSITION"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.906"
                        },
                        "CurrentYear": {
                            "val": "5.768"
                        },
                        "BudgetYearOne": {
                            "val": "7.359"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.359"
                        },
                        "BudgetYearTwo": {
                            "val": "11.450"
                        },
                        "BudgetYearThree": {
                            "val": "11.000"
                        },
                        "BudgetYearFour": {
                            "val": "10.499"
                        },
                        "BudgetYearFive": {
                            "val": "11.274"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Project TT3 validates high-risk\/high-payoff technologies, concepts-of-operations, and a new Joint Combat Development concept development and experimentation process that could significantly improve Warfighter capabilities in preparation for transition of mature technologies to advanced development programs requiring chemical and biological (CB) defense technologies.  These programs offer an opportunity to identify and efficiently mature emerging technologies including limited objective experiments, laboratory experiments, risk reduction efforts, engineering and integration.  These demonstrations and programs seek to demonstrate the potential for enhanced military operational capability and\/or cost effectiveness.  This project addresses four family of products areas: Biological Resiliency, Weapons of Mass Destruction (WMD) Elimination, Hazard Mitigation and Facilities Protection.  Biological resiliency efforts are targeted to reduce biological threats.  WMD Elimination addresses detection, identification, verification and baseline assessments in support of expeditionary forces deployed in non-permissive environments.  Hazard Mitigation addresses Chemical, Biological, and Radiological (CBR) remediation and decontamination processes.  Facilities protection transitions mature technologies to improve individual and critical infrastructure protection capabilities for U.S. and coalition Warfighters."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) Experiment & Technology Demonstrations"
                                    },
                                    "Description": {
                                        "val": "Project TT3 validates high-risk\/high-payoff technologies and concepts-of-operations through the use of the Advanced Technology Demonstration (ATD) and Rapid Military Utility Assessment (RMUA) processes.  The RMUA is a development and experimentation process that could significantly improve Warfighter capabilities through the efficient transition of mature technologies to advanced development programs.  This project addresses four family of products areas: Biological Resiliency, to include Biosurveillance; Early Warning and Remote Detection; Small Scale CBW Agent Defeat; and Hazard Mitigation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.906"
                                            },
                                            "Text": {
                                                "val": "Conducted technical and operational demonstrations for persistent and contagious bio agent scenarios in the US European Command Area of Responsibility (EUCOM AOR).  Conducted and completed a series of vignettes addressing sampling and analysis (to include forensics preparation), characterization of a large contaminated area, decontamination approaches and medical\/epidemiological management.  Continued Coalition Warfare Program science and technology (S&T) efforts with Poland aimed at improving biological agent standoff detection.  Established a field experiment process to assess early technology capability contributions, in collaboration with the CBDP Joint Combat Developer and with outcomes to support the creation of an initial capabilities document (ICD).  Demonstrated decontamination technologies for the interior of airframes against bio agents as part of a Joint Capability Technology Demonstration (JCTD) initiative with US Transportation Command (TRANSCOM).  Initiated a demonstration of a dual capability biological agent\/force protection detection system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.685"
                                            },
                                            "Text": {
                                                "val": "Three demonstrations will be ongoing in FY15: Joint Biological Agent Decontamination System (JBADS) JCTD- Demonstration of the operational utility of a interior-exterior airframe decontamination capability; Thermal Imaging Dual-Use for Aerosol Monitoring Alarms and Security (TIDAMAS)- Evaluation of a dual capability that can perform chemical standoff detection and ISR; and Joint Concept Development and Experimentation (JCDE)\/Rapid Military Utility Assessment Initiative - a partnership with Maneuver Support Center of Excellence (MSCOE).  Complete and transition Coalition Warfare Program science and technology (S&T) efforts with Poland aimed at improving biological agent standoff detection.  Conduct extended user evaluation of recently transitioned capabilities for persistent and contagious bio agent scenarios in the US European Command Area of Responsibility (EUCOM AOR).  Initiate bio-resiliency S&T development in additional AORs.  Conduct a rapid military utility assessment and field experiment process to assess early technology capability contributions, in collaboration with the CBDP Joint Combat Developer and with outcomes to support CBDP requirements and capability development.  Complete demonstration of decontamination technologies for airframes against bio agents as part of a JCTD initiative with US TRANSCOM.  Complete and transition dual capability detection system."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.359"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.359"
                                            },
                                            "Text": {
                                                "val": "Develop and demonstrate prototypes and technologies for the expeditionary and disablement ATD.  For the DoD\/DHS collaborative biosurveillance ATD, begin technology and CONOPS\/TTP development and system integration of information systems for the whole of government.  Continue to conduct rapid military utility assessments and field experiments process to assess early technology capability contributions, in collaboration with the CBDP Joint Combat Developer and with outcomes to support CBDP requirements and capability development.  Initiate risk reduction activities for a comprehensive early warning ATD scheduled to commence in FY17.  Focus of activities will be to develop an architecture for the development of sensor and mobile platforms along with methods of information sharing to enable early warning in forward deployed locations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "2) SBIR\/STTR"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.083"
                                            },
                                            "Text": {
                                                "val": "SBIR\/STTR - FY15 - Small Business Innovative Research."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}