{
    "id": "371957a19e4ae380814c39aa073a03f5b801e650",
    "meta": {
        "filename": "dod-2016_RDTE_2016_ARMY_BA3_RDTE_JustificationBook_Army_PB_2016.zzz_unzipped_RDTE_JustificationBook_Army_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603734A"
        },
        "ProgramElementTitle": {
            "val": "Military Engineering Advanced Technology"
        },
        "R1LineNumber": {
            "val": "51"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "23.838"
            },
            "CurrentYear": {
                "val": "17.606"
            },
            "BudgetYearOne": {
                "val": "20.145"
            },
            "BudgetYearOneBase": {
                "val": "20.145"
            },
            "BudgetYearTwo": {
                "val": "20.684"
            },
            "BudgetYearThree": {
                "val": "22.416"
            },
            "BudgetYearFour": {
                "val": "22.817"
            },
            "BudgetYearFive": {
                "val": "23.184"
            }
        },
        "ProgramElementNote": {
            "val": "FY16 increase for Engineered Resilient Systems."
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) demonstrates data and information architectures and software applications, as well as sensing systems, that can be used to provide Warfighters with timely, accurate, easily interpretable data and information for the operational and tactical mission environments, focusing physical and human terrain and weather; methodologies, software applications and hardware for improving ground vehicle mobility and countermobility to support ground force operations, including force projection; components, subsystems, and systems to increase the survivability of personnel, critical assets, and facilities through structures, shields, and barriers to combat highly adaptive and increasingly severe threats; and components, systems, and interoperable systems of systems for detecting threats, assessing situations, defending against threats, and communicating information and warnings for deployable force protection.   \n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nThis work is fully coordinated with and complementary to PE 0602784A (Military Engineering Technology). \nWork in this PE is led, managed or performed by the US Army Engineer Research and Development Center, Vicksburg, MS."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "23.705"
                },
                "CurrentYear": {
                    "val": "17.613"
                },
                "BudgetYearOne": {
                    "val": "15.281"
                },
                "BudgetYearOneBase": {
                    "val": "15.281"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "23.838"
                },
                "CurrentYear": {
                    "val": "17.606"
                },
                "BudgetYearOne": {
                    "val": "20.145"
                },
                "BudgetYearOneBase": {
                    "val": "20.145"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.133"
                },
                "CurrentYear": {
                    "val": "-0.007"
                },
                "BudgetYearOne": {
                    "val": "4.864"
                },
                "BudgetYearOneBase": {
                    "val": "4.864"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.007"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.750"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.617"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "4.864"
                                },
                                "BudgetYearOneBase": {
                                    "val": "4.864"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "T08"
                    },
                    "ProjectTitle": {
                        "val": "Combat Eng Systems"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "23.838"
                        },
                        "CurrentYear": {
                            "val": "17.606"
                        },
                        "BudgetYearOne": {
                            "val": "20.145"
                        },
                        "BudgetYearOneBase": {
                            "val": "20.145"
                        },
                        "BudgetYearTwo": {
                            "val": "20.684"
                        },
                        "BudgetYearThree": {
                            "val": "22.416"
                        },
                        "BudgetYearFour": {
                            "val": "22.817"
                        },
                        "BudgetYearFive": {
                            "val": "23.184"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "not applicable for this item"
                        },
                        "ProjectMissionDescription": {
                            "val": "This project matures and demonstrates software and architectures for geospatial mapping applications and decision aids for the Warfighter; components, systems, system of systems and decision aids to enable ground vehicle mobility (freedom of movement), including force projection, countermobility to impede movement of threat forces; survivability and force protection to protect personnel, facilities and assets through design and reinforcement of structures, and deployable force protection to detect, assess, and defend against threats for troops deployed at smaller bases (such as bases being compromised or overrun). Work is in support of current and future ground force operations. Software and architectures for geospatial projects mature and validate geospatial decision tools in support of operations planning and decision making to advance utility for geospatial capability and techniques across the Army, services and coalition and to advance and mature the information architecture that supports the total Army's discovery and access to data, geospatial information and analytical tool suites. Deployable Force Protection (DFP) activities are focused on filling critical gaps in protecting forces operating at smaller, remote bases and include maturation, integration, and demonstration of components, systems and systems of systems for rapidly deployable threat detection in direct line-of-site and non-line-of-site environments; situation assessment to help reduce false alarms and decrease manpower required to monitor the environment; passive protection to mitigate blasts, direct, and indirect fire effects; and active defense to suppress or eliminate threats and threat systems. Work in survivability and force protection also includes maturing and demonstrating software to characterize blast effects generated from explosive events, such as improvised explosive device detonation in soils, and support design and decision aids. Work in mobility and force projection includes maturing and demonstrating software and hardware to assess and improve freedom of movement for ground forces. Engineered Resilient Systems (ERS) activities focus on developing capabilities for \"upfront engineering\" that will result in more operationally efficient and resilient systems that are more affordable in a more rapid fashion. This effort develops and demonstrates an end-to-end thread involving analysis to inform requirements, reduce risk, and assess lifecycle cost pre-milestone A through tradespace analytics for selected systems of interest. \n\nWork in this project supports the Army S&T Ground Maneuver, Innovation Enablers and Command, Control, Communications and Intelligence (C3I) Portfolios.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.  This work is being fully coordinated and is complementary to the ERS work described in OSD PE 0603832D8Z.\n\nThis work is fully coordinated with and complementary to PE 0602784A (Military Engineering Technology).  Geospatial activities are coordinated with the National Geospatial Intelligence Agency (NGA).\n\nWork in this project is led, managed or performed by the US Army Engineer Research and Development Center, Vicksburg, MS."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Geo-Enabled Mission Command Enterprise"
                                    },
                                    "Description": {
                                        "val": "This effort matures methods and demonstrates data, information, and software tools and architectures to bring physical and human terrain and effects data into decision frameworks for consistent and accurate implementation in the Army Geospatial Enterprise (AGE). This provides ready-access of low-overhead, light-weight, analytic tools to other Services and DoD and increases situational awareness of the operational environment in support of mission planning and operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.162"
                                            },
                                            "Text": {
                                                "val": "Demonstrated software tools for mission command systems to include digital operation order generation and collaborative Course of Action planning; demonstrated use and application of map-based narratives for military applications on the Secure Internet Protocol Router Network and Joint Worldwide Intelligence Communications System with advanced spatial and temporal visualization and collaboration engines; demonstrated geospatially enabled persistent surveillance and analytic capabilities based on mission, threat, terrain and weather to provide synchronization of unattended ground sensors and small unit unattended aerial systems for increased situational awareness of threats at small outposts, convoy operations and key urban locations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.106"
                                            },
                                            "Text": {
                                                "val": "Evaluate and mature methods and techniques to facilitate efficient sharing of common geospatial information within Common Operating Environment and Army Programs of Record through delivery and exchange of geospatial data, information, and analytics between and among computing environments (e.g., Mobile\/Handheld, Mounted, Data Center, Sensor, Command Post) within the Common Operating Environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.505"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.505"
                                            },
                                            "Text": {
                                                "val": "Will enhance digital plans and orders capability to drive course of action (COA) simulation and modeling; evaluate initial plan development and COA development capabilities within Map-based planning testbed environment; evaluate and demonstrate mature geospatial research on the representative computing environment systems within the common operating environment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Deployable Force Protection Technology Integration Demonstrations and Red Teaming"
                                    },
                                    "Description": {
                                        "val": "This effort matures, integrates and demonstrates rapidly deployable threat detection, situation assessment, passive protection and active defensive technology-enabled capabilities to meet critical capability gaps for troops operating remotely at smaller bases or integrated with local communities. The needs at these smaller bases (less than 300 persons, not all U.S. troops) are unique based on constraints in transportability, manpower, organic resources, lack of hardening of structures, resupply, and training for example. Moreover, lack of interoperability and scalability consume manpower and take away from time needed to perform missions. Threats include bases being overrun by hostiles; direct fire; rockets, artillery and mortars; and improvised explosive devices. Force protection challenges at these remote, smaller bases include providing increased standoff detection, blast and ballistic protection, and kinetic technologies subject to the constraints mentioned above.  This effort begins to fill a significant gap in force protection capabilities. This work is fully coordinated with PE0602784A\/T40, Deployable Force Protection; PE 0602786A; PE0603313A\/G03; and PE 0603125A.  Work is performed by Army, Navy, and Air Force labs and centers."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.196"
                                            },
                                            "Text": {
                                                "val": "Developed first-generation, low-logistic reinforcement technologies for indigenous structures typical of conditions in operating environments; demonstrate lightweight vehicle ramming protection kits for base perimeter protection; developed integrated sensor architecture including web and tactical services, with data exchange standards, protocols, and compliance tools for interoperability; demonstrated integrated pre-shot sniper detection and non-line-of-site threat detection capabilities with improved designs for deployed forces; demonstrated light-weight threat assessment tools for predictive capabilities; conducted full-scale demonstrations and user assessments and conducted red and blue team missions in asymmetric and relevant environments to identify further areas for improving robustness of design and implementation and to increase systems effectiveness."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Occupant-Centric Survivability"
                                    },
                                    "Description": {
                                        "val": "This effort develops a comprehensive model of improvised explosive device (IED) detonations in soils that accurately predicts the blast pressure and fragmentation of IEDs on ground vehicle systems in a wide range of operational environments. This work supports PEs 0633005\/221 and 0622601\/C05 in collaboration with the Tank and Automotive Research, Development and Engineering Center (TARDEC)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.724"
                                            },
                                            "Text": {
                                                "val": "Demonstrated a comprehensive model of vehicle responses to mines\/IEDs during Army Occupant Protection Suite Concept Demonstration. This model represented the next generation of Lagrangian Meshfree methods for airblast\/fragmenting buried weapons of various sizes in different soils at a large range of burial depths. This model provided the Army with accurate predictions of the effect of IEDs on vehicles."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Demonstrate live fire full-scale model benchmark tests for evaluation, and model validation under a range of soil and operational threat conditions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Austere Entry and Maneuver Support Demonstrations"
                                    },
                                    "Description": {
                                        "val": "This effort develops improved means for achieving Force Projection in coastal, estuary and riverine environments and an integrated sensing and simulation system for predicting physical conditions in these operational environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.256"
                                            },
                                            "Text": {
                                                "val": "Demonstrated a high performance computing computational testbed that allowed for evaluation of sensor and platform tradeoff studies of potential off-loading platforms and soldiers in the 9-man squad."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "Demonstrate simulation capability to enable rapid remote assessment of real-time structural capacity of infrastructure (airfields, ports, roads), river, estuary, and near shore; demonstrate initial assessment of littoral environment for entry operations; demonstrate initial austere airfield point of debarkation (APOD) assessment geospatial overlay capability to the Instrument Set, Reconnaissance and Surveying (ENFIRE) program; and demonstrate reduced-order hydrodynamic models for an operational littoral environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.886"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.886"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate technologies for planning and conducting anti-access\/area denial entry operations with non-existent, damaged or destroyed infrastructure. Will demonstrate rapidly deployed low-logistics kits for expedient bomb damage repair of airfield runways and terrain surface enhancement for landing of helicopters and Unmanned Aircraft Systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Integrated Base Protection"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates integrated protective technologies to plan and expediently construct Combat Outposts (COPs) and Patrol Bases (PBs)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.500"
                                            },
                                            "Text": {
                                                "val": "Demonstrated the first version of decision support tools for planning of overall basing architecture that integrates and optimizes force protection architectures and basing functions; incorporated user feedback into second version of modeling software; demonstrated, using troops in the field, an initial perimeter barrier for perimeter security of a COP\/PB constructed of advanced, reusable materials; evaluated troop constructability, protection, and retrograde value to optimize life-cycle cost and effectiveness of systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Adaptive Protection Demonstrations"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates protection solutions for critical assets, including fixed and semi-fixed facilities, required to support shifting operational focus. A focus will be on technologies to defeat new advanced weapons threats to include low-logistics protective construction and facility protection, use of indigenous materials, innovative structural hardening and retrofit, and the synergistic use of camouflage, concealment and deception to increase the effectiveness of protection to critical assets. This effort also demonstrates integrated protective technologies for force protection basing to include planning and expedient protective construction for combat outposts."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.000"
                                            },
                                            "Text": {
                                                "val": "Demonstrate the use of indigenous materials from areas of interest in protective construction for critical assets against effects of new advanced weapons threats; demonstrate initial force protection basing planning and protective construction for combat outposts to increase survivability of personnel and equipment against rocket and mortar attack;  demonstrate baseline effectiveness in the use of camouflage, concealment, and deception techniques to increase survivability of fixed and semi-fixed facilities against new threat weapons by decreasing the probability of direct hit on critical assets; and demonstrate capability to construct expedient protection solutions for combat outposts and evaluate manpower requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.754"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.754"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate force protection technologies to reduce manpower and logistics for combat outpost and personnel base  construction and operation and demonstrate life cycle planning tools. Demonstrate advanced material composed of indigenous constituents and conduct structural hardening experiments for mitigation against a wide range of advanced weapon threats."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Engineered Resilient Systems"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates capabilities (tools and methodologies) to: rapidly create high-fidelity environmental data to support the simulation of system performance across varied places in the world for varied Army missions; provide input to\/ obtain output from combat simulations for different echelons pertaining to system performance; and conduct system trades that consider system performance in different operational environments and mission contexts. Engineered Resilient Systems (ERS) initiative has been identified as an S&T emphasis area by the Assistant Secretary of Defense for Research and Engineering, ASD(R&E). This effort focuses on Army systems of interest and on high-fidelity environmental data for the associated battlespace, linkages to force-on-force combat simulations representing the systems of interest, and on tools to explore trades in order to help inform requirements, reduce risk, and assess lifecycle cost pre-milestone A. This work is fully coordinated and is complementary to the ERS work described in Office of Secretary of Defense (OSD) PE 0602251D8Z project P227 and PE 0603832D8Z project PTBD."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "Will mature and demonstrate environmental scenario generation \"tool-set one\" based on a select set of missions within a geographical area and Army system of interest; identify andcraft initial operational scenarios and will conduct functional decomposition to generate a subset of key missions for system(s) of interest in concert with Army collaborators and processes and will use this to prioritize phased development; evolve and mature mission context and implementation tools and methodologies that link to combat simulations based on scenario(s) and mission(s) associated with selected Army system."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}