{
    "id": "37c35dd036f3db1c3e0826e8b3ee5696c4b37954",
    "meta": {
        "filename": "dod-2016_RDTE_2016_OSD_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2016.zzz_unzipped_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604875D8Z"
        },
        "ProgramElementTitle": {
            "val": "Joint Systems Architecture Development"
        },
        "R1LineNumber": {
            "val": "134"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "7.772"
            },
            "PriorYear": {
                "val": "2.389"
            },
            "CurrentYear": {
                "val": "3.087"
            },
            "BudgetYearOne": {
                "val": "3.081"
            },
            "BudgetYearOneBase": {
                "val": "3.081"
            },
            "BudgetYearTwo": {
                "val": "4.634"
            },
            "BudgetYearThree": {
                "val": "5.121"
            },
            "BudgetYearFour": {
                "val": "5.488"
            },
            "BudgetYearFive": {
                "val": "5.563"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "The FY 2016 funding request was reduced by $0.600 million to account for the availability of prior year execution balances."
        },
        "ProgramElementMissionDescription": {
            "val": "Department and acquisition reform initiatives call for top down, national security strategy-driven capabilities-based planning. Department of Defense (DoD) Instruction 5000.02 and Chairman of the Joint Chiefs of Staff Instruction 3170.01 promulgate capabilities-based requirements and acquisition processes. The JSAD program enables collaborative efforts to achieve these goals with a focus on Major Defense Acquisition Programs (MDAPs). These efforts include warfighting capability-based analyses; assessments of joint capability areas and joint integrating concepts; development of system-related data; integrated roadmaps to support acquisition investment decisions; and assessments of MDAPs in a capability area context.  Activities in the JSAD project are divided into three areas:  (1) capability-based analysis; (2) roadmaps; and (3) support tools and guidance. Capability-based analysis provides analysis of the different technology, functionality, and integration impacts of systems on warfighting capability.  Acquisition roadmaps guide systems development and associated investment plans.  JSAD support tools and guidance initiatives develop systems data, and tools, exploit modeling and simulation and architecture efforts to improve DoD’s overall assessment capability.  These efforts guide the development and improve the testing and fielding of integrated systems of systems in order to achieve Joint mission capabilities.  The Department has also undergone an institutional reorientation or shift in emphasis from organization-specific to enterprise-wide approaches. This means:  (1) horizontal integration within the Department and unity of effort through greater interagency collaboration; (2) engaging in a coordinated and portfolio-based approach to planning, programming, budgeting and execution; and (3) significant reforms at the governance, management and execution levels.  To accomplish this direction, there needs to be a focused goal and concerted emphasis on shifting from systems acquisition to capabilities-based portfolio management (or portfolio systems acquisition).  This program enables collaborative efforts to implement the QDR direction outlined above in order to achieve portfolio systems acquisition goals.  The program is broken up into two focus areas (Portfolio Management and Reform Initiatives)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "2.471"
                },
                "CurrentYear": {
                    "val": "3.092"
                },
                "BudgetYearOne": {
                    "val": "3.704"
                },
                "BudgetYearOneBase": {
                    "val": "3.704"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "2.389"
                },
                "CurrentYear": {
                    "val": "3.087"
                },
                "BudgetYearOne": {
                    "val": "3.081"
                },
                "BudgetYearOneBase": {
                    "val": "3.081"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.082"
                },
                "CurrentYear": {
                    "val": "-0.005"
                },
                "BudgetYearOne": {
                    "val": "-0.623"
                },
                "BudgetYearOneBase": {
                    "val": "-0.623"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.011"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.071"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FY 2016 Baseline Adjustment"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.609"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.609"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumptions"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.014"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.014"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "-0.005"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Program baseline realigned by the department for other priorities.\n\nNOTE:  The FY 2016 funding request was reduced by $0.600 million to account for the availability of prior year execution balances."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P876"
                    },
                    "ProjectTitle": {
                        "val": "Portfolio Systems Acquisition (PSA)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "7.772"
                        },
                        "PriorYear": {
                            "val": "2.389"
                        },
                        "CurrentYear": {
                            "val": "3.087"
                        },
                        "BudgetYearOne": {
                            "val": "3.081"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.081"
                        },
                        "BudgetYearTwo": {
                            "val": "4.634"
                        },
                        "BudgetYearThree": {
                            "val": "5.121"
                        },
                        "BudgetYearFour": {
                            "val": "5.488"
                        },
                        "BudgetYearFive": {
                            "val": "5.563"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Departments 2005 Quadrennial Defense Review (QDR) laid out the need for an institutional reorientation or shift in emphasis from organization-specific to enterprise-wide approaches.  This meant:  (1) horizontal integration within the Department and unity of effort through greater interagency collaboration; (2) engaging in a coordinated and portfolio-based approach to planning, programming, budgeting and execution; and (3) significant reforms at the governance, management and execution levels.  The Department’s 2010 QDR report further addressed reforming how we buy, noting that the conventional acquisition process is too long and too cumbersome to fit the needs of the many systems that require continuous changes and upgrades - a challenge that will become only more pressing over time. The Department will improve how it matches requirements with mature technologies, maintains disciplined systems engineering approaches.  To accomplish this direction, there needed to be a focused goal and concerted emphasis on shifting from acquisition of individual systems to portfolio management (or portfolio systems acquisition).  This program enables collaborative efforts to implement the QDR direction outlined above and to achieve portfolio systems acquisition goals and to develop and implement acquisition reform initiatives.  The program is broken up into two focus areas (Portfolio Management and Reform Initiatives) and consolidates work previously performed under various other Program Elements."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Portfolio Systems Acquisition Initiatives"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.389"
                                            },
                                            "Text": {
                                                "val": "-Supported Mission Area Portfolio Assessments and warfare areas to identify portfolio and program synergies, reduce duplication, and identify opportunities for cost savings.\n-Conducted analyses and support implementation of Better Buying Power initiatives.\n-Provided technical expertise in support of warfare area portfolios.\n-Assessed progress of program management initiatives and supported to a variety of certification and qualification standards activities.\n-Continued \"reliability by design\" analyses and support to programs.\n-Developed DoD courses of action and views on homeland defense implementation and compliance issues in multiple bilateral and multilateral fora.\n-Provided analytical support to the Homeland Defense Coordinator function within OUSD(AT&L).\n-Updated roadmaps to guide investments in critical areas (e.g., future vertical lift and Integrated Air And Missile Defense (IAMD)).\n-Continued analytical support for the IAMD portfolio.\n-Initiated the first of an expected series of review of Electronic Warfare related technologies as they apply to current and future weapon systems.  First study area was Millimeter Wave (MMW)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.087"
                                            },
                                            "Text": {
                                                "val": "-Continue to support Mission Area Portfolio Assessments and warfare areas to identify portfolio and program synergies, reduce duplication, and identify opportunities for cost savings.\n-Conduct additional analyses and support implementation of Better Buying Power initiatives.\n-Provide technical expertise in support of warfare area portfolios.\n-Assess progress of program management initiatives and continue support to a variety of certification and qualification standards activities.\n-Continue \"reliability by design\" analyses and support to programs.\n-Develop DoD courses of action and views on homeland defense implementation and compliance issues in multiple bilateral and multilateral fora.\n-Provide analytical support to the Homeland Defense Coordinator function within OUSD(AT&L).\n-Update roadmaps to guide investments in critical areas (e.g., future vertical lift and IAMD).\n-Continue analytical support for the IAMD portfolio.\n-Complete the MMW study and fold results into the FY2016 President's Budget Review.  Initiate another EW-related review."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.081"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.081"
                                            },
                                            "Text": {
                                                "val": "-Continue and expand support Mission Area Portfolio Assessments and warfare areas to identify portfolio and program synergies, reduce duplication, and identify opportunities for cost savings.\n-Conduct additional analyses and support implementation of updated Better Buying Power initiatives.\n-Provide technical expertise in support of warfare area portfolios.\n-Assess progress of program management initiatives and continue support to a variety of certification and qualification standards activities.\n-Continue \"reliability by design\" analyses and support to programs.\n-Develop DoD courses of action and views on homeland defense implementation and compliance issues in multiple bilateral and multilateral fora.\n-Provide analytical support to the Homeland Defense Coordinator function within OUSD(AT&L).\n-Update roadmaps and where appropriate generate new roadmaps to guide investments in critical areas (e.g., future vertical lift and IAMD).\n-Continue analytical support for the IAMD portfolio."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable"
                        },
                        "PerformanceMetrics": {
                            "val": "Not Applicable"
                        }
                    }
                }
            ]
        }
    }
}