{
    "id": "3bd1430bd2317f7577d489ee55ea8c7ffebd2b3b",
    "meta": {
        "filename": "dod-2016_RDTE_2016_ARMY_BA7_RDTE_JustificationBook_Army_PB_2016.zzz_unzipped_RDTE_JustificationBook_Army_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0305208A"
        },
        "ProgramElementTitle": {
            "val": "Distributed Common Ground\/Surface Systems"
        },
        "R1LineNumber": {
            "val": "196"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "27.607"
            },
            "CurrentYear": {
                "val": "20.155"
            },
            "BudgetYearOne": {
                "val": "25.592"
            },
            "BudgetYearOneBase": {
                "val": "25.592"
            },
            "BudgetYearTwo": {
                "val": "25.777"
            },
            "BudgetYearThree": {
                "val": "26.218"
            },
            "BudgetYearFour": {
                "val": "30.498"
            },
            "BudgetYearFive": {
                "val": "31.064"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "Project 956 (DCGS-A Increment 1) is a designated Major Automation Information System (MAIS) program.\n\nProject D07 (Increment 2) was created to clearly delineate between the DCGS-A Project 956 (Increment 1) development efforts beginning in FY15."
        },
        "ProgramElementMissionDescription": {
            "val": "Distributed Common Ground System - Army (DCGS-A) is the Intelligence, Surveillance and Reconnaissance (ISR) System of Systems (SoS) for Joint, Interagency, Allied, Coalition, and National data analysis, sharing and collaboration.  The core functions of DCGS-A are:  the vertical and horizontal synchronization of ISR Processing, Exploitation and Dissemination (PED) efforts; operations in a networked environment at multiple security levels; the control of select Army and joint sensor systems; the fusion of all acquired data and information, and distribution of relevant red (threat), gray (non-aligned), and environmental (weather and terrain) information; and providing the Warfighters' early warning, targeting, and sensor ground station capabilities.  DCGS-A provides a single integrated ISR ground processing system composed of common components that are interoperable with sensors, other information sources, all Warfighting Functions, and the Defense Information & Intelligence Enterprise (DI2E) and Intelligence Community Information Technology Enterprise (ICITE).  DCGS-A is fielded in Fixed, Mobile, and embedded configurations emphasizing the use of reach and split based operations by improving accessibility of data in order to reduce forward deployed footprint.  As enhanced capabilities are developed and tested, a continuing series of software releases will be integrated into Army Common\/commodity hardware and fielded to units IAW the Dynamic Army Resourcing Priority List (DARPL) process.\n\nThe Army Acquisition Executive designated PEO IEW&S and DCGS-A as the Command Post Computing Environment (CPCE) Lead.  As such, DCGS-A is defining the architecture to fit within the Common Operating Environment (COE) as described by the Assistant Secretary of the Army (Acquisition, Logistics, and Technology) (ASA(ALT)) COE Implementation Plan.  This is in accordance with the G-3\/5\/7 priority to align all Army networks, procurements, and enhancements under one COE and one vision leveraging intelligence community investments.\n\nDCGS-A consolidated, enhanced, and modernized the Tasking, Processing, Exploitation, and Dissemination (TPED) capabilities formerly found in nine Army intelligence programs of record (Common Ground Station (CGS), Guardrail Common Sensor (GRCS), Counterintelligence & Interrogation Operations Workstation (CI&I OPS WS), All Source Analysis System (ASAS), Enhanced TrackWolf (ETW), Digital Topographic Support System (DTSS), Integrated Meteorological System (IMETS), Tactical Exploitation System (TES), and Prophet Control) and two Quick Reaction Capabilities (Joint Intelligence Operations Center – Iraq (JIOC-I) and Imagery Work Station(IWS)).  DCGS-A provides these technologically advanced PED capabilities in tailored and scalable mobile, fixed, and embedded configurations in all maneuver and maneuver support units from Company Intelligence Support Team to Army Service Component Command, and in select maneuver sustainment units battalion and above.  The program develops software packages to be embedded in mission command and other select systems to provide required ISR\/analytic capabilities.  DCGS-A is one of the Army's top modernization priorities.\n\nDCGS-A software is tailored by echelon and scalable to each unit's mission.  DCGS-A provides commanders and staffs the ability to maintain an accurate and up to date understanding of the operational environment.  The DCGS-A contribution to commanders' visualization and situational awareness, rapid planning, and the synchronization of all warfighting functions, enable Army units to operate within the enemy's decision cycle.  This capability enhances tactical and operational maneuver and the conduct of full spectrum operations across the range of military operations from humanitarian to major combat operations and campaigns through all phases of the Joint Continuum of Military Operations.\n\nThe DCGS-A configurations range from laptops to systems integrated in tactical shelters and mounted on tactical vehicles to large commodity servers operating in a sanctuary based processing environment.  The fundamental intent and tenet of this approach is to reduce forward deployed equipment\/footprint by co-locating the advanced analytics capabilities within the DCGS-A baseline with the regional data centers, where the data is stored.  This infrastructure consolidation simultaneously reduces processor and communications requirements in tactical units by limiting the number of large data files transported across tactical communications systems.  Following a successful operational assessment and Milestone C in 2QFY12\/Full Deployment Decision in 1QFY13, the program is deploying DCGS-A Increment 1 Release 1 Software Baseline capability throughout the Army.\n\nFY16 Base funding in the amount of $8.923 million for project 956, will be used for the continued development and testing of the DCGS-A Increment 1 Software Release 2 as well as the continued development and testing of the Command Post Computing Environment (CPCE) as it fits into the Army's overarching Common Operating Environment (COE) construct.   The COE has been directed as a priority effort to align all Army networks, procurements, and enhancements under one COE vision.  Funds used for efforts associated with the development of the CPCE\/COE will include the continued merger\/collapse of capabilities across multiple Battlefield Functional Areas (BFAs) and the consolidation of hardware used across the BFAs.  Funds used for efforts associated with the development of the software will include continued advancements in the Standard Sharable Geospatial Foundation to support the Tactical Common Operating Picture, as well as further investment into capabilities and widget development supporting All Source Intelligence, Signals Intelligence (SIGINT), Geospatial Intelligence (GEOINT), emerging architectural and infrastructure enhancements, and software integration efforts.  The FY16 funding will be used for integration of commercial technologies to the latest version(s) and changes due to Information Assurance updates.  Testing activities requiring these funds will include participation in Network Integration Evaluation and Exercises such as: Empire Challenge, ULCHI Freedom Guardian, and Joint Interoperability Certification test(s) for each software release. \n\nFY16 Base funding in the amount of $16.669 million for D07, will continue the iterative DCGS-A software releases that will increase the Processing, Exploitation, and Dissemination capability our Army requires.  Increment 2 of the DCGS-A program will continue critical updates to the Army's ISR PED and multi-intelligence planning, analysis, and production capabilities through the exploitation of Cloud Computing and advanced analytics capabilities.  This approach will achieve Information Technology efficiencies through alignment with the Intelligence Community Information Technology Environment, while developing the incremental software updates required to remain current."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "27.607"
                },
                "CurrentYear": {
                    "val": "20.155"
                },
                "BudgetYearOne": {
                    "val": "25.710"
                },
                "BudgetYearOneBase": {
                    "val": "25.710"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "27.607"
                },
                "CurrentYear": {
                    "val": "20.155"
                },
                "BudgetYearOne": {
                    "val": "25.592"
                },
                "BudgetYearOneBase": {
                    "val": "25.592"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.118"
                },
                "BudgetYearOneBase": {
                    "val": "-0.118"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.118"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.118"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "956"
                    },
                    "ProjectTitle": {
                        "val": "Distributed Common Ground System (MIP)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "27.607"
                        },
                        "CurrentYear": {
                            "val": "9.270"
                        },
                        "BudgetYearOne": {
                            "val": "8.923"
                        },
                        "BudgetYearOneBase": {
                            "val": "8.923"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Project 956 (DCGS-A Increment 1) is a designated Major Automation Information System (MAIS) program.\n\nBeginning in FY16, a portion of the Project 956 funding was shifted to Project D07 (Increment 2) in order to clearly delineate between DCGS-A Increment 1 and Increment 2 development efforts.  DCGS-A development efforts continue on project line (D07) within the same program element."
                        },
                        "ProjectMissionDescription": {
                            "val": "Distributed Common Ground System - Army (DCGS-A) is the Intelligence, Surveillance and Reconnaissance (ISR) System of Systems (SoS) for Joint, Interagency, Allied, Coalition, and National data analysis, sharing and collaboration.  The core functions of DCGS-A are:  the vertical and horizontal synchronization of ISR Processing, Exploitation and Dissemination (PED) efforts; operations in a networked environment at multiple security levels; the control of select Army and joint sensor systems; the fusion of all acquired data and information, and distribution of relevant red (threat), gray (non-aligned), and environmental (weather and terrain) information; and providing the Warfighters' early warning, targeting, and sensor ground station capabilities.  DCGS-A provides a single integrated ISR ground processing system composed of common components that are interoperable with sensors, other information sources, and all Warfighting Functions. DCGS-A is fielded in Fixed, Mobile, and embedded configurations emphasizing the use of reach and split based operations by improving accessibility of data in order to reduce forward deployed footprint.  As enhanced capabilities are developed and tested, a continuing series of software releases will be integrated into Army common\/commodity hardware and fielded to units in accordance with the Dynamic Army Resourcing Priority List (DARPL) process.\n\nThe Army Acquisition Executive designated PEO IEW&S and DCGS-A as the Command Post Computing Environment (CPCE) Lead.  As such, DCGS-A is defining the architecture to fit within the Common Operating Environment (COE) as described by the Assistant Secretary of the Army (Acquisition, Logistics, and Technology) (ASA(ALT)) COE Implementation Plan.  This is in accordance with the G-3\/5\/7 priority to align all Army networks, procurements, and enhancements under one COE and one vision leveraging intelligence community investments.\n\nDCGS-A consolidated, enhanced, and modernized the Tasking, Processing, Exploitation, and Dissemination (TPED) capabilities formerly found in nine Army intelligence programs of records (Common Ground Station (CGS), Guardrail Common Sensor (GRCS), Counterintelligence & Interrogation Operations Workstation (CI&I OPS WS), All Source Analysis System (ASAS), Enhanced TrackWolf (ETW), Digital Topographic Support System (DTSS), Integrated Meteorological System (IMETS), Tactical Exploitation System (TES), and Prophet Control) and two Quick Reaction Capabilities (Joint Intelligence Operations Center – Iraq (JIOC-I) and Imagery Work Station(IWS)).  DCGS-A provides these technologically advanced PED capabilities in tailored and scalable mobile, fixed, and embedded configurations in all maneuver and maneuver support units from Company Intelligence Support Team to Army Service Component Command, and in select maneuver sustainment units battalion and above.  The program also develops software packages to be embedded in mission command and other select systems to provide required ISR\/analytic capabilities.  DCGS-A is one of the Army's top modernization priorities.\n\nDCGS-A software is tailored by echelon and scalable to each unit's mission.  DCGS-A provides commanders and staffs the ability to maintain an accurate and up to date understanding of the operational environment.  The DCGS-A contribution to commanders' visualization and situational awareness, rapid planning, and the synchronization of all warfighting functions, enable Army units to operate within the enemy's decision cycle.  This capability enhances tactical and operational maneuver and the conduct of full spectrum operations across the range of military operations from humanitarian to major combat operations and campaigns through all phases of the Joint Continuum of Military Operations.\n\nThe DCGS-A configurations range from laptops to systems integrated in tactical shelters and mounted on tactical vehicles to large commodity servers operating in a sanctuary based processing environment.  The fundamental intent and tenet of this approach is to reduce forward deployed equipment\/footprint by co-locating the advanced analytics capabilities within the DCGS-A baseline with the regional data centers, where the data is stored.  This infrastructure consolidation simultaneously reduces processor and communications requirements in tactical units by limiting the number of large data files transported across tactical communications systems.  Following a successful operational assessment and Milestone C in 2QFY12\/Full Deployment Decision in 1QFY13, the program is deploying DCGS-A Increment 1 Release 1 Software Baseline capability throughout the Army.\n\nFY16 Base funding in the amount of $8.923 million for 956, will be used for the continued development and testing of the DCGS-A Increment 1 Software Release 2; as well as the continued development and testing of the Command Post Computing Environment (CPCE) as it fits into the Army's overarching Common Operating Environment (COE) construct.   The COE has been directed by the ASA(ALT) and concurred by the Army G3\/5\/7 as a priority effort to align all Army networks, procurements, and enhancements under one COE vision.  Funds used for efforts associated with the development of the CPCE\/COE will include the continued merger\/collapse of capabilities across multiple Battlefield Functional Areas (BFAs) and the consolidation of hardware used across the BFAs.  Funds used for efforts associated with the development of the software will include continued advancements in the Standard Sharable Geospatial Foundation to support the Tactical Common Operating Picture, as well as further investment into capabilities and widget development supporting All Source Intelligence, Signals Intelligence (SIGINT), Geospatial Intelligence (GEOINT), emerging architectural and infrastructure enhancements, and software integration efforts.  The FY16 funding will be used for integration of commercial technologies to the latest version(s) and changes due to Information Assurance updates.  Testing activities requiring these funds will include participation in Network Integration Evaluation and Exercises such as: Empire Challenge, ULCHI Freedom Guardian, and Joint Interoperability Certification test(s) for each software release."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Design and Development of DCGS-A enterprise level net-centric architecture"
                                    },
                                    "Description": {
                                        "val": "Continue design and development of DCGS-A enterprise level net-centric architecture to include: Development & Integration of DCGS-A Software;  DT\/OT, Mobile Basic Contract Deliverables, and Program Management support costs.  Global Unified Data Environment (Cloud) - development - to create direct Data Ingest of varying intelligence data types and development of analytical tools to exploit single -INT data, further enhancing Cloud Enterprise Account Management load distribution of enterprise level complex searches. Development of Cloud to Cloud Data Synchronization technologies and enhanced data management applications between Cloud and Edge nodes."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.964"
                                            },
                                            "Text": {
                                                "val": "Continued to design and develop DCGS-A enterprise level net-centric architecture to include: Development & Integration of DCGS-A Software; DT\/OT and Program Management support costs. Completed DT 1 and 2 and NIE 1."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.530"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.530"
                                            },
                                            "Text": {
                                                "val": "SW Fixes Rel 2, IA updates, Integration, CPCE, Sensor CE."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Matrix Support including SIL S\/W Support"
                                    },
                                    "Description": {
                                        "val": "Matrix Support including SIL S\/W Support"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.082"
                                            },
                                            "Text": {
                                                "val": "Matrix Support including SIL S\/W Support"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.356"
                                            },
                                            "Text": {
                                                "val": "Matrix Support including SIL S\/W Support"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "Matrix Support including SIL S\/W Support"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Army and Joint Testing\/Development\/Operational Test Support\/Software Fixes"
                                    },
                                    "Description": {
                                        "val": "Ongoing Army and Joint interoperability testing and evaluation to include Operational Assessment (Network Integration Evaluation (NIE) Operational Assessment), JITC, and Operational Test and Software Fixes"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.520"
                                            },
                                            "Text": {
                                                "val": "Conducted two developmental tests."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.021"
                                            },
                                            "Text": {
                                                "val": "Will support the LUT at NIE 15.2 and funds software fixes once the LUT is complete."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.500"
                                            },
                                            "Text": {
                                                "val": "Funds fix software issues identified during the LUT at NIE 15.2."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Support Costs and Management Services"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort\/Project Management Support"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.041"
                                            },
                                            "Text": {
                                                "val": "Provide PMO support"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.893"
                                            },
                                            "Text": {
                                                "val": "Provide PMO support."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.893"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.893"
                                            },
                                            "Text": {
                                                "val": "Provide PMO support"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "DCGS-A (MIP) Procurement"
                                    },
                                    "Title": {
                                        "val": "BZ7316 - Procurement"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "137.990"
                                        },
                                        "CurrentYear": {
                                            "val": "192.038"
                                        },
                                        "BudgetYearOne": {
                                            "val": "314.408"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "260.268"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "54.140"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "250.786"
                                        },
                                        "BudgetYearThree": {
                                            "val": "284.177"
                                        },
                                        "BudgetYearFour": {
                                            "val": "311.103"
                                        },
                                        "BudgetYearFive": {
                                            "val": "347.362"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "DCGS-A Increment 2 RDTE"
                                    },
                                    "Title": {
                                        "val": "0305208A \/ D07"
                                    },
                                    "Funding": {
                                        "CurrentYear": {
                                            "val": "10.885"
                                        },
                                        "BudgetYearOne": {
                                            "val": "16.669"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "16.669"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "25.777"
                                        },
                                        "BudgetYearThree": {
                                            "val": "26.218"
                                        },
                                        "BudgetYearFour": {
                                            "val": "30.498"
                                        },
                                        "BudgetYearFive": {
                                            "val": "31.064"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "Theater Net-Centric Geolocation TNG"
                                    },
                                    "Title": {
                                        "val": "Theater Net-Centric Geolocation (TNG) RDTE"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.050"
                                        },
                                        "CurrentYear": {
                                            "val": "0.350"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.166"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.166"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.166"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.410"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.606"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "1.748"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Distributed Common Ground System-Army (DCGS-A) program was created in response to the Department of Defense (DoD) Distributed Common Ground\/Surface System (DCGS) Mission Area Initial Capabilities Document (MA ICD) dated 13 Aug 2004, which captured the overarching requirements for an Intelligence, Surveillance, and Reconnaissance (ISR) Family of Systems (FoS) that will contribute to Joint and combined Warfighter needs. That ICD was updated as the Distributed Common Ground\/Surface System (DCG\/SS) Enterprise ICD, and approved by the Joint Requirements Oversight Council (JROC) 27 Feb 2009. The Army requirements were refined in the DCGS-A Capabilities Development Document (CDD), and approved by the JROC 31 Oct 2005. The DCGS-A program is currently in the Production and Deployment phase and was designated as a Major Automated Information System (MAIS) in OSD (AT&L) Memorandum, 29 Mar 2010. \n\nDCGS-A is following an evolutionary acquisition approach to develop and field system capabilities over time to satisfy the requirements of the DCGS-A Capability Development Document (CDD). Following this approach, the first increment was defined and a Capability Production Document (CPD) was created with full consideration of all of the preceding supporting documents and analysis. As part of its initial staffing, a Cost Benefit Analysis was completed in support of the DCGS-A CPD. This analysis projected a significant cost avoidance\/savings over the life cycle by not limiting the hardware configuration to a one size fits all unit types design but rather integrating the DCGS-A Software capabilities into common servers and other IT components fielded at that echelon. This approach was validated during the Milestone C and Full Deployment Decision process in FY2012 through the Office of the Secretary of Defense (OSD) Cost Assessment and Program Evaluation (CAPE) approval of the Economic Analysis.  This Economic Analysis validated the cost savings achieved utilizing the acquisition approach outlined above. \n\nPM DCGS-A has been designated as the Command Post Computing Environment (CPCE) Lead for PEO IEW&S. As such, DCGS-A is currently aligning it's architecture to fit within the Common Operating Environment (COE) as described by the ASA(ALT) COE Implementation Plan. This alignment is in accordance with the G-3\/5\/7 priority to align all Army networks, procurements, and enhancements under one COE and one vision. Our acquisition strategy supports this initiative as we continue to collapse PORs and reduce footprint following our capability migration path and iterative development of software releases which continue to increase capabilities to satisfy the remaining CPD requirements beyond Initial Minimal Capability. As DCGS-A continues the path through Increment 1 and beyond, each release will focus on the COE and continually align the Command Post activities with POR migration activities.  The program office expects to continue as the DCGS-A System Integrator for software development and hardware integration for Increment 1, and will continue to access multiple vendors by leveraging a variety of competitively awarded contracts."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Project Management"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM, DCGS-A"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "27.841"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.041"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.893"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.893"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.893"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Metadata Catalog"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MITRE,"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "17.865"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Design & Develop DCGS-A Architecture"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Northrup Grumman, Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Linthicum, MD, Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "247.877"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "247.877"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Design & Develop DCGS-A Incr 1 Software"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "13.964"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Secure Common Data Link (SCDL)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CUBIC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Orlando, Fla."
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.788"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Global Unified Data Environment (Cloud) Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CERDEC\/SEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "21.500"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Software Fixes"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.530"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.530"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-05"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.530"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Design & Develop DCGS-A Architecture (CPCE & Sensor CE)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.000"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Matrix Support Government Test & Integration Lab"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CECOM"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "CECOM"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "18.734"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "4.082"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.356"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Operational Test Support for DCGS-A Rel 2"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ATEC, OTC, Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD, EPG, Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "9.245"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "6.904"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Software Integration\/Fixes"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "4.894"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.500"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.500"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "6.394"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Developmental Testing for Sensor CE"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "I2WD, Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD, Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.127"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.127"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "NIE for Rel 2 and CPCE COE V2"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NIE"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Bliss"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "10.287"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.800"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Operational Assessments\/Joint Demo for Inc 1  and CPCE"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Empire Challenge, ULCHI Freedom Guardia, Unified Vision"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "AZ, KO, EU"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.800"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.300"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.100"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Certification Test"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "JITC\/CTSF"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "ATEC"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.100"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.516"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.616"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "76680-77.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Inc 1 Rel 1 - 2 Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Developmental Test\/Operational Test\/Log Demo  Inc 1 Rel 2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Fielding & Training Inc 1 Rel 1 IAW DARPL Rotations"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Fielding & Training Inc 1 Rel 2 IAW DARPL Rotations"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "D07"
                    },
                    "ProjectTitle": {
                        "val": "DCGS-A Common Modules (MIP)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "10.885"
                        },
                        "BudgetYearOne": {
                            "val": "16.669"
                        },
                        "BudgetYearOneBase": {
                            "val": "16.669"
                        },
                        "BudgetYearTwo": {
                            "val": "25.777"
                        },
                        "BudgetYearThree": {
                            "val": "26.218"
                        },
                        "BudgetYearFour": {
                            "val": "30.498"
                        },
                        "BudgetYearFive": {
                            "val": "31.064"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Project D07 (Increment 2) was created to clearly delineate between the DCGS-A Project 956 (Increment 1) development efforts beginning in FY15."
                        },
                        "ProjectMissionDescription": {
                            "val": "Distributed Common Ground System - Army (DCGS-A) is the Intelligence, Surveillance and Reconnaissance (ISR) System of Systems (SoS) for Joint, Interagency, Allied, Coalition, and National data analysis, sharing and collaboration.  The core functions of DCGS-A are:  the vertical and horizontal synchronization of ISR Processing, Exploitation and Dissemination (PED) efforts; operations in a networked environment at multiple security levels; the control of select Army and joint sensor systems; the fusion of all acquired data and information, and distribution of relevant red (threat), gray (non-aligned), and environmental (weather and terrain) information; and providing the Warfighters' early warning, targeting, and sensor ground station capabilities.  DCGS-A provides a single integrated ISR ground processing system composed of common components that are interoperable with sensors, other information sources, all Warfighting Functions, compliant with standards providing the Defense Information & Intelligence Enterprise (DI2E) and Intelligence Community Information Technology Enterprise (ICITE).  DCGS-A is fielded in Fixed, Mobile, and embedded configurations emphasizing the use of reach and split based operations by improving accessibility of data in order to reduce forward deployed footprint.  As enhanced capabilities are developed and tested, a continuing series of software releases will be integrated into Army Common\/commodity hardware and fielded to units IAW the Army Force Generation (ARFORGEN) process.\n\nThe Army Acquisition Executive designated PEO IEW&S and DCGS-A as the Command Post Computing Environment (CPCE) Lead.  As such, DCGS-A is defining the architecture to fit within the Common Operating Environment (COE) as described by the Assistant Secretary of the Army (Acquisition, Logistics, and Technology) (ASA(ALT)) COE Implementation Plan.  This is in accordance with the G-3\/5\/7 priority to align all Army networks, procurements, and enhancements under one COE and one vision leveraging intelligence community investments.\n\nDCGS-A provides technologically advanced Processing, Exploitation, and Dissemination (PED) capabilities through iterative software releases delivered in tailored and scalable mobile, fixed, and embedded configurations in all maneuver and maneuver support units from Company Intelligence Support Team to Army Service Component Command, and in select maneuver sustainment units battalion and above.  The program develops software packages to be embedded in mission command and other select systems to provide required ISR\/analytic capabilities.  DCGS-A is one of the Army's top ten modernization priorities.\n\nFY16 Base funding in the amount of $16.669 million will continue the iterative DCGS-A software releases that will increase the Processing, Exploitation, and Dissemination capability our Army requires.  Increment 2 of the DCGS-A program will continue critical updates to the Army's ISR PED and multi-intelligence planning, analysis, and production capabilities through the exploitation of Cloud Computing and advanced analytics capabilities.  This approach will achieve Information Technology efficiencies through alignment with the Intelligence Community Information Technology Environment, while developing the incremental software updates required to remain current."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Design & Develop DCGS-A Inc 2 Software"
                                    },
                                    "Description": {
                                        "val": "Start efforts to design & develop DCGS-A Inc 2 software. Increment 2 expands on the capabilities provided by Increment 1 by adding capabilities at the Army and below echelons while developing new, enhanced, and leap-ahead Intelligence, Surveillance, and Reconnaissance (ISR) and Standard and Shareable Geospatial Foundation (SSGF) enterprise capabilities to align with the Intelligence Community (IC) and Army's Common Operating Environment (COE) and transformation objectives.  Increment 2 will include capabilities from, and eventually displace, the Space Operations System (SOS) and the Guardrail Ground Baseline (GGB).  Increment 2 and beyond will build upon emerging technologies such as an artificial intelligence system capability, cognitive computing, additional exploitation tools, and capabilities on the explosive growth in unstructured data (social networks and smart devices (both user borne and unattended)), fusion of data collected through Tactical Mesh Sensors and disconnected processing, giant leaps in \"Cloud\" capability, interoperability with the Army's Joint Tactical Ground Station (JTAGS), the Theater Net-centric Geolocation (TNG) system, and On The Move (OTM) capabilities.  These requirements will be defined in future RDP and CD as necessary to ensure DCGS-A provides the data, information, intelligence, situation awareness, and interoperability needed to support the Warfighter."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.836"
                                            },
                                            "Text": {
                                                "val": "Continue to design & develop DCGS-A Inc 2 software."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.085"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.085"
                                            },
                                            "Text": {
                                                "val": "Continue to design & develop DCGS-A Inc 2 software."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "System reconfiguration\/redesign"
                                    },
                                    "Description": {
                                        "val": "System Reconfiguration to enhance the systems to deliver higher performance to leverage industry enhancements in Cloud Technology and Solid State hardware."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.020"
                                            },
                                            "Text": {
                                                "val": "System Reconfiguration to enhance the systems to deliver higher performance to leverage industry enhancements in Cloud Technology and Solid State hardware."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.300"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.300"
                                            },
                                            "Text": {
                                                "val": "System Reconfiguration to enhance the systems to deliver higher performance to leverage industry enhancements in Cloud Technology and Solid State hardware."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Matrix Support Government Test & Integration Lab"
                                    },
                                    "Description": {
                                        "val": "Matrix Support Government Test & Integration Lab support for software integration to the target platforms."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.657"
                                            },
                                            "Text": {
                                                "val": "Matrix Support Government Test & Integration Lab support for software integration to the target platforms."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.148"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.148"
                                            },
                                            "Text": {
                                                "val": "Matrix Support Government Test & Integration Lab support for software integration to the target platforms."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Project Management"
                                    },
                                    "Description": {
                                        "val": "Project Management support to manage the cost, schedule, and performance metrics for the program."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.054"
                                            },
                                            "Text": {
                                                "val": "Project Management support."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.136"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.136"
                                            },
                                            "Text": {
                                                "val": "Project Management support."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Army and Joint Testing\/Development\/Operational Test Support"
                                    },
                                    "Description": {
                                        "val": "Development and Testing of Increment 2"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Will begin development and testing of Increment 2"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Milestone preparation; Activities; AoA"
                                    },
                                    "Description": {
                                        "val": "Milestone preparation; Activities; Analyze, define, and document the acquisition approach and achieve a successful Materiel Development Decision for the Increment 2 program."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.318"
                                            },
                                            "Text": {
                                                "val": "Analyze, define, and document the acquisition approach and achieve a successful Materiel Development Decision for the Increment 2 program."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "956"
                                    },
                                    "Title": {
                                        "val": "DCGS-A (MIP) 0305208A\/956"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "27.607"
                                        },
                                        "CurrentYear": {
                                            "val": "9.270"
                                        },
                                        "BudgetYearOne": {
                                            "val": "8.923"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "8.923"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "BZ7316 - DCGS-A Procurement"
                                    },
                                    "Title": {
                                        "val": "BZ7316 - DCGS-A (MIP)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "137.990"
                                        },
                                        "CurrentYear": {
                                            "val": "192.038"
                                        },
                                        "BudgetYearOne": {
                                            "val": "314.408"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "260.268"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "54.140"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "250.786"
                                        },
                                        "BudgetYearThree": {
                                            "val": "284.177"
                                        },
                                        "BudgetYearFour": {
                                            "val": "311.103"
                                        },
                                        "BudgetYearFive": {
                                            "val": "347.362"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "Theater Net-Centric Geolocation TNG"
                                    },
                                    "Title": {
                                        "val": "Theater Net-Centric Geolocation (TNG) RDTE"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.050"
                                        },
                                        "CurrentYear": {
                                            "val": "0.350"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.166"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.166"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.166"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.410"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.606"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "1.748"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Distributed Common Ground System-Army (DCGS-A) program was created in response to the Department of Defense (DoD) Distributed Common Ground\/Surface System (DCGS) Mission Area Initial Capabilities Document (MA ICD) dated 13 Aug 2004, which captured the overarching requirements for an Intelligence, Surveillance, and Reconnaissance (ISR) Family of Systems (FoS) that will contribute to Joint and combined Warfighter needs. That ICD was updated as the Distributed Common Ground\/Surface System (DCG\/SS) Enterprise ICD, and approved by the Joint Requirements Oversight Council (JROC) 27 Feb 2009. The Army requirements were refined in the DCGS-A Capabilities Development Document (CDD), and approved by the JROC 31 Oct 2005. The DCGS-A program is currently in the Production and Deployment phase and was designated as a Major Automated Information System (MAIS) in OSD (AT&L) Memorandum, 29 Mar 2010.  The Information Systems Capability Development Document (ISCDD), currently in staffing, is an update to the 2005 CDD.\n\nDCGS-A is following an evolutionary acquisition approach to develop and field system capabilities over time to satisfy the requirements of the DCGS-A Capability Development Document (CDD). Following this approach, the first increment was defined and a Capability Production Document (CPD) was created with full consideration of all of the preceding supporting documents and analysis. As part of its initial staffing, a Cost Benefit Analysis was completed in support of the DCGS-A CPD. This analysis projected a significant cost avoidance\/savings over the life cycle by not limiting the hardware configuration to a one size fits all unit types design but rather integrating the DCGS-A Software capabilities into common servers and other IT components fielded at that echelon. This approach was validated during the Milestone C and Full Deployment Decision process in FY2012 through the Office of the Secretary of Defense (OSD) Cost Assessment and Program Evaluation (CAPE) approval of the Economic Analysis.  This Economic Analysis validated the cost savings achieved utilizing the acquisition approach outlined above. \n\nThe DCGS-A Increment 2 Acquisition Strategy will be a competitive contract award for managing the development, integration, documentation, and test for the Increment 2 Releases.  Anticipate RFP release in 1QFY16 and contract award in 3QFY16.\n\nPM DCGS-A has been designated as the Command Post Computing Environment (CPCE) Lead for PEO IEW&S. As such, DCGS-A is currently aligning its architecture to fit within the Common Operating Environment (COE) as described by the ASA(ALT) COE Implementation Plan. This alignment is in accordance with the G-3\/5\/7 priority to align all Army networks, procurements, and enhancements under one COE and one vision. Our acquisition strategy supports this initiative as we continue to collapse PORs and reduce footprint following our capability migration path and iterative development of software releases which continue to increase capabilities to satisfy the remaining CPD requirements beyond Initial Minimal Capability. As DCGS-A continues the path through Increment 2, each release will focus on the COE and continually align the Command Post activities with the DCGS-A platforms.  The program office expects to award a competitive contract for software development and hardware integration."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Project Management"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.054"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.136"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.136"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.190"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Milestone preparation; Activities; Trade Space Analysis (TSA)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.318"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.318"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Design & Develop DCGS-A Inc 2 software"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.836"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-05"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "10.085"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "10.085"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-05"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "System reconfiguration\/redesign"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.020"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.300"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.300"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-05"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "5.320"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Matrix Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.657"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.148"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.148"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.805"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Government Test & Integration Lab"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.000"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "76680-78.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Acquisition Requirements Package Dev, Source Selection, & Risk Reduction Inc 2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Development and Test Inc 2 Rel 1 Software"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Development and Test Inc 2 Rel 2 Software"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Operational Test Inc 2 Rel 1"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Increment 2 MDD"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "RFP Release Increment 2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Development Contract Award Increment 2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Milestone B"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Fielding Inc 2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}