{
    "id": "3d73ae022efff9222654fe88b91be85ce7d15a5e",
    "meta": {
        "filename": "dod-2016_RDTE_2016_DARPA_RDTE_JustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2016.zzz_unzipped_RDTE_JustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0601101E"
        },
        "ProgramElementTitle": {
            "val": "DEFENSE RESEARCH SCIENCES"
        },
        "R1LineNumber": {
            "val": "2"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Basic Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "293.284"
            },
            "CurrentYear": {
                "val": "332.146"
            },
            "BudgetYearOne": {
                "val": "333.119"
            },
            "BudgetYearOneBase": {
                "val": "333.119"
            },
            "BudgetYearTwo": {
                "val": "328.362"
            },
            "BudgetYearThree": {
                "val": "339.350"
            },
            "BudgetYearFour": {
                "val": "343.736"
            },
            "BudgetYearFive": {
                "val": "355.434"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Defense Research Sciences Program Element is budgeted in the Basic Research Budget Activity because it provides the technical foundation for long-term National Security enhancement through the discovery of new phenomena and the exploration of the potential of such phenomena for Defense applications.  It supports the scientific study and experimentation that is the basis for more advanced knowledge and understanding in information, electronic, mathematical, computer, biological and materials sciences.\n\n     The Bio\/Info\/Micro Sciences project will explore and develop potential technological breakthroughs that exist at the intersection of biology, information technology and micro\/physical systems to exploit advances and leverage fundamental discoveries for the development of new technologies, techniques and systems of interest to the DoD.  Programs in this project will draw upon information and physical sciences to discover properties of biological systems that cross multiple scales of biological architecture and function, from the molecular and genetic level through cellular, tissue, organ, and whole organism levels. \n\n     The Math and Computer Sciences project supports long term national security requirements through scientific research and experimentation in new computational models and mechanisms for reasoning and communication in complex, interconnected systems. The project is exploring novel means of leveraging computer capabilities, including: practical, logical, heuristic, and automated reasoning by machines; development of enhanced human-to-computer and computer-to-computer interaction technologies; innovative approaches to the composition of software; innovative computer architectures; mathematical programs and their potential for defense applications; and new learning mechanisms for systematically upgrading and improving these capabilities.\n\n      The Cyber Sciences project supports long term national security requirements through scientific research and experimentation in cybersecurity.  Networked computing systems control virtually everything, from power plants and energy distribution, transportation systems, food and water distribution, financial systems, to defense systems.  Protecting the infrastructure on which these systems rely is a national security issue.   The Cyber Sciences project will ensure DoD cyber-capabilities survive adversary attempts to degrade, disrupt, or deny military computing, communications, and networking systems.  Basic research in cyber security is required to provide a basis for continuing progress in this area. Promising research results will transition to both technology development and system-level projects.\n\n     The Electronic Sciences project explores and demonstrates electronic and optoelectronic devices, circuits and processing concepts that will provide: 1) new technical options for meeting the information gathering, transmission and processing required to maintain near-real time knowledge of the enemy and the ability to communicate decisions based on that knowledge to all forces in near-real time; and 2) provide new means for achieving substantial increases in performance and cost reduction of military systems providing these capabilities.\n\n     The Materials Sciences project provides the fundamental research that underpins the development and assembly of advanced nanoscale and bio-molecular materials, devices, and electronics for DoD applications that greatly enhance soldier awareness, capability, security, and survivability, such as materials with increased strength-to-weight ratio and ultra-low size, devices with ultra-low energy dissipation and power, novel spectroscopic sources, and electronics with persistent intelligence and improved surveillance capabilities.\n\n     The Transformative Sciences project supports research and analysis that leverages converging technological forces and transformational trends in computing and the computing-reliant subareas of the social sciences, life sciences, manufacturing, and commerce.  The project integrates these diverse disciplines to improve military adaptation to sudden changes in requirements, threats, and emerging\/converging trends, especially trends that have the potential to disrupt military operations."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "315.033"
                },
                "CurrentYear": {
                    "val": "312.146"
                },
                "BudgetYearOne": {
                    "val": "322.923"
                },
                "BudgetYearOneBase": {
                    "val": "322.923"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "293.284"
                },
                "CurrentYear": {
                    "val": "332.146"
                },
                "BudgetYearOne": {
                    "val": "333.119"
                },
                "BudgetYearOneBase": {
                    "val": "333.119"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-21.749"
                },
                "CurrentYear": {
                    "val": "20.000"
                },
                "BudgetYearOne": {
                    "val": "10.196"
                },
                "BudgetYearOneBase": {
                    "val": "10.196"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "20.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-12.436"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-9.313"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "10.196"
                                },
                                "BudgetYearOneBase": {
                                    "val": "10.196"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2014:  Decrease reflects below threshold and omnibus reprogrammings and the SBIR\/STTR transfer. \nFY 2015:  Increase reflects congressional adds.\nFY 2016:  Increase reflects expanded focus in Cyber Sciences."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "BLS-01"
                    },
                    "ProjectTitle": {
                        "val": "BIO\/INFO\/MICRO SCIENCES"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "20.355"
                        },
                        "CurrentYear": {
                            "val": "15.036"
                        },
                        "BudgetYearOne": {
                            "val": "6.127"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.127"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project is investigating and developing the intersections of biology, information technology and micro\/physical systems to exploit important technological advances and leverage fundamental discoveries for the development of new technologies, techniques, and systems of interest to the DoD.  This research is critical to the development of rapid responses to engineered biological warfare agents, radically new biomolecular computers, improved training and cognitive rehabilitation.  Programs in this project will draw upon the information and physical sciences to discover properties of biological systems that cross multiple scales of biological architecture and function, from the molecular and genetic level through cellular, tissue, organ, and whole organism levels.  This project will develop the basic research tools in biology that are unique to the application of biological-based solutions to critical Defense problems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Quantitative Models of the Brain"
                                    },
                                    "Description": {
                                        "val": "The Quantitative Models of the Brain program will establish a functional mathematical basis on which to build future advances in cognitive neuroscience, computing capability, and signal processing across the DoD.  An important focus of this program will be determining how information is stored and recalled in the brain and other DoD-relevant signals, developing predictive, quantitative models of learning, memory, and measurement.  Using this understanding, the program will develop powerful new symbolic computational capabilities for the DoD in a mathematical system that will provide the ability to understand complex and evolving signals and tasks while decreasing software and hardware requirements and other measurement resources.  This includes a comprehensive mathematical theory to extract and leverage information in signals at multiple acquisition levels, that would fundamentally generalize compressive sensing for multi-dimensional sources beyond domains typically used.  New insights related to signal priors, task priors, and adaptation will enable these advances.  This program will further exploit advances in the understanding and modeling of brain activity and organization to improve training of individuals and teams as well as identify new therapies for cognitive rehabilitation (e.g., TBI, PTSD).  Critical to success will be the ability to detect cellular and network-level changes produced in the brain during the formation of new, hierarchically organized memories and memory classes, and to correlate those changes with memory function of animals during performance of behavioral tasks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.150"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated hyperspectral imaging using 100x fewer measurements than reconstructed pixels. \n-  Explored the application of compressive sensing concepts to alternate sensing modalities such as x-ray imaging.\n-  Investigated the potential gains available from compressive sensing within multiple video applications. \n-  Leveraged advances in neuroscience and neurological measurements to develop predictive, quantitative models of memory, learning, and neuro-physiologic recovery."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.636"
                                            },
                                            "Text": {
                                                "val": "-  Quantify spatio-temporal patterns of neurochemical activity underlying memory formation. \n-  Extend model and brain regions to account for hierarchical organization of memories (procedural, declarative\/episodic).\n-  Demonstrate model prediction of knowledge and skill-based memory encoding.\n-  Develop model of memory encoding using non-invasively recorded neural signals."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.127"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.127"
                                            },
                                            "Text": {
                                                "val": "-  Build a hippocampal-neocortical model of stimulation-based memory enhancement.\n-  Develop sparse multiple input\/multiple output nonlinear dynamical modeling methodology for real-time application to electrophysiological recordings.\n-  Develop and apply a new set of classification models for the prediction of behavioral outcomes from the spatio-temporal patterns of electrophysiological recordings in the hippocampus."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Bio Interfaces"
                                    },
                                    "Description": {
                                        "val": "The Bio Interfaces program supports scientific study and experimentation, emphasizing the interfaces between biology and the physical and mathematical\/computer sciences.  This unique interaction will develop new mathematical and experimental tools for understanding biology in a way that will allow its application to a myriad of DoD problems.  These tools will help exploit advances in the complex modeling of physical and biological phenomena.  It is also expected that understanding the fundamentals of biology will aid in developing tools to understand complex, non-linear networks.  This program will also explore the fundamental nature of time in biology and medicine.  This will include mapping basic clock circuitry in biological systems from the molecular level up through unique species level activities with a special emphasis on the applicability to human biology."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.705"
                                            },
                                            "Text": {
                                                "val": "-  Experimentally validated canonical spatio-temporal episequences, and developed a minimal dataset for accurate predictions of temporal processes such as cell cycle progression, metabolic cycles, and lifespan.\n-  Refined predictive algorithms of the progression of biological time.\n-  Developed and tested the predictive model or algorithm against a blind panel to predict doubling time, cell cycle progression, metabolism and lifespan metrics."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.400"
                                            },
                                            "Text": {
                                                "val": "-  Investigate alternative strategies for treating disease by targeting clocking systems that drive temporal processes such as cell cycle progression and metabolic cycles.\n-  Test the ability of predictive algorithms of biological time to enable an economical and easily administered test to assess and predict human circadian phase from blood.\n-  Leverage temporally collected data to test the impact of time on drug efficacy.\n-  Discover and test novel compounds that target oscillatory networks to modulate neurodegenerative disease in an animal model."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Physics in Biology"
                                    },
                                    "Description": {
                                        "val": "Understanding the fundamental physical phenomena that underlie biological processes and functions can provide new insights and lead to unique opportunities for exploiting such phenomena.  The Physics in Biology thrust explored the role and impact of quantum effects in biological processes and systems.  This included exploiting manifestly quantum mechanical effects that exist in biological systems at room temperature to develop a revolutionary new class of robust, compact, high sensitivity and high selectivity sensors.  The quantum phenomena uncovered was demonstrated to control the attraction of insects to humans with the potential to significantly reduce insect bites and thus the transmission of parasitic, bacterial or viral pathogens."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.500"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated prototype quantum biological sensors and measured against equivalent state-of-the-art sensors in order to  quantify the increase in sensitivity, selectivity and other performance metrics. \n-  Explored quantum physics-based mechanisms of mosquito bio-sensing related to mosquito attraction to humans for novel, vector-born disease protection against diseases such as malaria or dengue fever."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "CCS-02"
                    },
                    "ProjectTitle": {
                        "val": "MATH AND COMPUTER SCIENCES"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "88.325"
                        },
                        "CurrentYear": {
                            "val": "118.743"
                        },
                        "BudgetYearOne": {
                            "val": "132.336"
                        },
                        "BudgetYearOneBase": {
                            "val": "132.336"
                        },
                        "BudgetYearTwo": {
                            "val": "140.283"
                        },
                        "BudgetYearThree": {
                            "val": "152.116"
                        },
                        "BudgetYearFour": {
                            "val": "162.783"
                        },
                        "BudgetYearFive": {
                            "val": "173.036"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project supports scientific study and experimentation on new computational models and mechanisms in support of long-term national security requirements.  The project is exploring novel means of leveraging computer capabilities, including: practical, logical, heuristic, and automated reasoning by machines; development of enhanced human-to-computer and computer-to-computer interaction technologies; innovative approaches to the composition of software; innovative computer architectures; mathematical programs and their potential for defense applications; and new learning mechanisms for systematically upgrading and improving these capabilities.  Promising techniques will transition to both technology development and system-level projects."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Basic Research Congressional Add"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "5.000"
                                        },
                                        "Text": {
                                            "val": "-  Supports increased efforts in basic research that engage a wider set of universities and commercial research communities."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Big Mechanism"
                                    },
                                    "Description": {
                                        "val": "The Big Mechanism program will create new approaches to automated computational intelligence applicable to diverse domains such as biology, cyber, economics, social science, and intelligence.  Mastering these domains requires the capability to create abstract yet predictive - ideally causal - models from massive volumes of diverse data generated by human actors, physical sensors, and networked devices.  Current modeling approaches are heavily reliant on human insight and expertise, but the complexity of these models is growing exponentially and has now, or will soon, exceed the capacity for human comprehension.  Big Mechanism will create technologies to extract and normalize information for incorporation in flexible knowledge bases readily adapted to novel problem scenarios; powerful reasoning engines that can infer general rules from a collection of observations, apply general rules to specific instances, and generate (and compute the likelihood of) the most plausible explanations for a sequence of events; and knowledge synthesis techniques to derive abstract principles and\/or create models of extreme complexity consistent with huge volumes of data.  Big Mechanism applications will accommodate an operator-in-the-loop by accepting questions posed in human natural language; providing drill-down to reveal the basis for an answer; taking user inputs to improve\/correct derived associations, weightings, and conclusions; and querying the operator to clarify ambiguities and reconcile detected inconsistencies.  Big Mechanism techniques will integrate burgeoning data into causal models and explore these models for precise interventions in critical areas such as cancer modeling, systems biology, epidemiology, cyber attribution, open-source intelligence, and economic indications and warning."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.090"
                                            },
                                            "Text": {
                                                "val": "-  Formulated initial causal-model-based automated computational intelligence techniques applicable to cancer modeling.\n-  Developed novel information-extraction technologies suitable for extracting causal fragments from scientific literature.\n-  Developed initial algorithms for assembling causal fragments into larger models."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop model management techniques for storing, manipulating, and reasoning about tens of thousands of alternative causal models.\n-  Develop techniques to generate plausible causal hypotheses that can be tested in the lab.\n-  Develop tools for operator drill-down, ambiguity clarification, and inconsistency reconciliation.\n-  Develop techniques for automatic query generation given partial\/incomplete knowledge\/models."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "23.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "23.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate prototype technologies in production mode by identifying drug targets and drugs for one or more specific classes of cancer.\n-  Demonstrate automated testing of machine-generated hypotheses.\n-  Create new modes for visualizing and exploring models of huge scope that in their entirety exceed human cognitive capabilities.\n-  Formulate statistical approaches for uncovering causal relationships in numerical data\/time series and categorical data\/symbol sequences.  \n-  Develop and implement scalable algorithms that reveal causality networks in large, complex, heterogeneous datasets."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Unconventional Processing of Signals for Intelligent Data Exploitation (UPSIDE)"
                                    },
                                    "Description": {
                                        "val": "The Unconventional Processing of Signals for Intelligent Data Exploitation (UPSIDE) program will address the open problems facing real-time Intelligence, Surveillance and Reconnaissance (ISR) systems and other power-constrained data-intensive applications.  The objective of the UPSIDE program is to create a high-level, non-Boolean computational model and map it directly to the unique functional properties of new emerging devices to achieve significant increases in power efficiency and performance.  The UPSIDE program will create a new generation of computing structures that will, in turn, enable revolutionary advances in ISR processing, particularly for DoD applications of embedded, real-time sensor data analysis.  Boolean data representations are inherently power-inefficient for many datasets, particularly those produced by noisy analog real-time sensors.  The UPSIDE program will establish an unconventional, non-Boolean, computing paradigm to enable new and needed capabilities in the area of sensor data analysis.\n\nUPSIDE intends to implement this new computing paradigm in the form of a specialized hardware component termed the inference module (IM).  An IM is a computational abstraction, which performs a sophisticated pattern match that maps very efficiently to analog complementary metal-oxide semiconductor (CMOS) circuits and emerging devices.  An IM can leverage the physics of an emerging device to compute a pattern match directly. The IM will be first developed through simulation, and then implemented using mixed-signal CMOS technology, as well as using state of the art emerging (non-CMOS) devices.  Throughout the program, the inference module will be benchmarked using a DoD-relevant image processing pipeline, to verify gains in both computing throughput and power efficiency.  The result will be computing infrastructures and functional implementations that demonstrate three orders of magnitude improvement in processing speed and four orders of magnitude improvement in power efficiency.  These gains will constitute a disruptive new level of embedded computational efficiency for future real-time sensor systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.000"
                                            },
                                            "Text": {
                                                "val": "-  Created conventional image processing pipeline simulation for tracking moving objects in surveillance video for the baseline comparison of UPSIDE image processing metrics.\n-  Demonstrated that new image processing pipelines using UPSIDE IM exceed goals for equivalent accuracy in object tracking.\n-  Performed system analysis showing that UPSIDE image processing pipeline can achieve power and performance goals of the program.\n-  Completed architectural design of a mixed-signal complementary metal-oxide semiconductor (CMOS) chip-based inference module architecture which will be used in the image processing pipeline.\n-  Fabricated and demonstrated first mixed-signal chips for performing inference module processing for object tracking.\n-  Measured emerging device specifications for use in simulations showing power and performance of an emerging-device-based inference module in an image processing pipeline.\n-  Performed initial fabrications of the emerging device(s).\n-  Began design and development of CMOS support chip containing external digital circuitry required for power, communication and control of the emerging device circuits."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "21.500"
                                            },
                                            "Text": {
                                                "val": "-  Simulate the selected image processing pipeline utilizing the previously developed inference methodology.\n-  Develop mixed-signal CMOS based image processing pipeline simulation and validate the simulation of the image processing pipeline using real-time, high-definition video streams.\n-  Design and fabricate mixed-signal CMOS chip implementation of inference module.\n-  Fabricate and demonstrate simple circuits based on emerging devices for future inference module development."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.000"
                                            },
                                            "Text": {
                                                "val": "-  Implement full image processing pipeline system in software and provide to a distributed computing environment for maximum digital performance.\n-  Deliver an inference module based system test bed using the mixed-signal CMOS chip for executing the image processing pipeline with an evaluation in terms of the power, performance and accuracy of the system.\n-  Evaluate the image processing pipeline using the emerging devices showing 1000x performance improvement while reducing power consumption of the processing by 10,000x with no loss in tracking accuracy as compared to the conventional image processing pipeline."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Young Faculty Award (YFA)"
                                    },
                                    "Description": {
                                        "val": "The goal of the Young Faculty Award (YFA) program is to encourage junior faculty at universities and their equivalent at non-profit science and technology research institutions to participate in sponsored research programs that will augment capabilities for future defense systems.  This program focuses on speculative technologies for greatly enhancing microsystems technologies, biological technologies and defense sciences.  The long-term goal for this program is to develop the next generation of scientists, engineers, and mathematicians in key disciplines who will focus a significant portion of their careers on DoD and National Security issues.  The aim is for YFA recipients to receive deep interactions with DARPA program managers, programs, performers, and the user community.  Current activities include research in thirteen topic areas spanning from Quantum Science and Technology to Robotics and Supervised Autonomy, Mathematics, Computing, and the Interface of Engineering and Biology.  A key aspect of the YFA program is DARPA-sponsored military visits; all YFA Principal Investigators are expected to participate in one or more military site visits to help them better understand DoD needs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.306"
                                            },
                                            "Text": {
                                                "val": "-  Exercised the second year options for successful FY 2013 participants to continue research focused on new concepts for microsystem technologies and defense sciences.\n-  Awarded 28 FY 2014 grants for new two-year research efforts across the topic areas.\n-  Identified the top FY 2013 participants as candidates for selection as a Director's Fellow.  During this additional year of funding, researchers further refined their technology to align to DoD needs.\n-  Established approaches to bring appropriate technologies developed through YFA to bear on relevant DoD problems.\n-  Provided awardees mentorship by program managers and engagement with DARPA to encourage future work that focuses on DoD needs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.501"
                                            },
                                            "Text": {
                                                "val": "-  Award Director's Fellowships from top FY 2013 participants.  During this additional year of funding researchers will refine their technology further and align to DoD needs.\n-  Exercise second year options for FY 2014 participants to continue research focused on new concepts for microsystem technologies, biological technologies and defense sciences.\n-  Award FY 2015 grants for new two-year research efforts across the topic areas.\n-  Establish approaches to bring appropriate technologies developed through YFA to bear on relevant DoD problems.\n-  Provide awardees mentorship by program managers and engagement with DARPA to encourage future work that focuses on DoD needs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.248"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.248"
                                            },
                                            "Text": {
                                                "val": "-  Award Director's Fellowships for researchers to refine their technology further and align to DoD needs.\n-  Exercise options for FY 2015 participants to continue research focused on new concepts for microsystem technologies, biological technologies, and defense sciences.\n-  Award FY 2016 grants for new two-year research efforts across the topic areas.\n-  Establish approaches to bring appropriate technologies developed through YFA to bear on relevant DoD problems.\n-  Provide awardees mentorship by program managers and engagement with DARPA to encourage future work that focuses on DoD needs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Probabilistic Programming for Advancing Machine Learning (PPAML)"
                                    },
                                    "Description": {
                                        "val": "The Probabilistic Programming for Advancing Machine Learning (PPAML) program will create an advanced computer programming capability that greatly facilitates the construction of new machine learning applications in a wide range of domains.  This capability will increase the number of people who can effectively contribute, will make experts more productive, and will enable the creation of new tactical applications that are inconceivable given today's tools.  The key enabling technology is a new programming paradigm called probabilistic programming that facilitates the management of uncertain information.  In this approach, developers will use the power of a modern (probabilistic) programming language to quickly build a generative model of the phenomenon of interest as well as queries of interest, which a compiler will convert into an efficient application.  PPAML technologies will be designed for application to a wide range of military domains including ISR exploitation, robotic and autonomous system navigation and control, and medical diagnostics."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.221"
                                            },
                                            "Text": {
                                                "val": "-  Designed and built the front end of a probabilistic programming system that enables users at a range of skill levels to construct concise, useful models.\n-  Designed and built the back end of a probabilistic programming system that takes as input expressive models written in a probabilistic programming language, queries, and prior data and produces as output an efficient implementation with predictable performance.\n-  Identified and developed three challenge problems from various military domains (quad-rotor sensor fusion, autonomous swarm tracking, and wide-area motion imagery tracking), including collecting and making available sample data of appropriate size."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.021"
                                            },
                                            "Text": {
                                                "val": "-  Identify and develop two additional challenge problems from various military domains with increasing levels of complexity and larger data sets.\n-  Evaluate performance of each probabilistic programming system on each challenge problem.\n-  Extend the front end of a probabilistic programming system with additional functionality, including profilers, debuggers, and model verification\/checking tools.\n-  Extend the back end of a probabilistic programming system with additional functionality, such as determining which solver or set of solvers is most appropriate for a given input, improving efficiency of solvers, and compiling inference engines to a range of different hardware targets."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.088"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.088"
                                            },
                                            "Text": {
                                                "val": "-  Identify and develop two additional challenge problems from different military domains with increasing levels of complexity and larger data sets.\n-  Evaluate the performance of each probabilistic programming system on all existing challenge problems both in terms of the quality of the answers and the levels of resources required.\n-  Continue to extend the front end of a probabilistic programming system with more advanced functionality, including profilers, debuggers, and model verification\/checking tools.\n-  Continue to extend the back end of a probabilistic programming system with more advanced functionality, such as determining which solver or set of solvers is most appropriate for a given input, improving efficiency of solvers, and compiling inference engines to a range of different hardware targets.\n-  Evaluate the effectiveness of the developed systems by running a summer school in collaboration with potential transition partners."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mining and Understanding Software Enclaves (MUSE)"
                                    },
                                    "Description": {
                                        "val": "The Mining and Understanding Software Enclaves (MUSE) program will develop program analyses and frameworks for improving the resilience and reliability of complex software applications at scale.  MUSE techniques will apply machine learning algorithms to large software corpora to repair likely defects and vulnerabilities in existing programs and to discover new programs that conform to desired behaviors and specifications.  MUSE frameworks will enable robust execution of large-scale and data-intensive computations.  Specific technical challenges include persistent semantic artifact generation and analysis, defect identification and repair, pattern recognition, and specification inference and synthesis.  MUSE research will improve the security of intelligence-related applications and enhance computational capabilities in areas such as automated code maintenance and revision management, low-level systems implementation, graph processing, entity extraction, link analysis, high-dimensional data analysis, data\/event correlation, and visualization."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.500"
                                            },
                                            "Text": {
                                                "val": "-  Assembled, cataloged, and developed ontologies for an initial multi-lingual corpus of open source software to serve as target data for software analytics.\n-  Developed a number of database schema designs to persistently record program analysis outputs, responsive to the queries necessary to drive synthesis and repair activities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.000"
                                            },
                                            "Text": {
                                                "val": "-  Conceive, design, and implement new static and dynamic program analysis techniques structured to interact with a persistent database of program facts collected from deep semantic analysis of a large software corpus.\n-  Design application programming interfaces and implementations of a mining engine that provides support for the efficient injection, querying, inspection, and optimization of the underlying database that is used as the output of program analyses, and the input to software analytics.\n-  Examine repair and synthesis strategies to automatically discover commonalities and fix anomalies in input programs based on mining semantic patterns in the corpus.\n-  Develop deductive database formulations for logical inference, multi-view query systems for machine learning analytics, and probabilistic query engines that collectively enable the implementation of different analytic back ends.\n-  Extend the corpus with richer semantic ontologies and metadata support to deal with diverse language frameworks, environments, and systems at scale."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.100"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.100"
                                            },
                                            "Text": {
                                                "val": "-  Implement scalable database technologies and mining algorithms that allow the ingestion and analysis of tens of millions of lines of open-source software.\n-  Integrate machine learning algorithms that can direct and assimilate mining activities on analysis artifacts stored in the database.\n-  Evaluate component-level synthesis techniques that automatically construct implementations of complex protocols from discovered specifications.\n-  Identify key challenge problems in automated repair and security analysis, along with novel solutions that directly exploit the latent semantic content in the database."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Graph-theoretical Research in Algorithm Performance & Hardware for Social networks (GRAPHS)"
                                    },
                                    "Description": {
                                        "val": "While the DoD has been extremely effective in deploying rigorous analytical and predictive methods for problems involving continuously valued variables (tracking, signals processing), analytical methods for discrete data such as graphs and networks have not kept pace.  Recent evidence has shown that network analysis can provide critical insight when used in DoD-relevant scenarios.  In this paradigm, nodes represent items of interest and their relationships or interactions are edges; the result forms a network or graph.  Current analysis of large networks, however, is just in its infancy:  the composition of real-world networks is understood only at the most coarse and basic details (diameter, degree distribution).  In order to implement network techniques efficiently and usefully, a better understanding of the finer mathematical structure of these networks is needed.  This includes the development of a comprehensive and minimal mathematical set that characterizes networks of DoD interest and a description of how these quantities vary in both space and time."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.213"
                                            },
                                            "Text": {
                                                "val": "-  Developed mathematical models and demonstrated mechanistic methods on use cases in DoD-relevant scenarios including brain science, decision support tools for health and disease prevention and prediction, massive streaming networks, and gene networks. \n-  Investigated and developed probabilistic graph models, statistical measures, and statistical sampling procedures for various graph models."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.903"
                                            },
                                            "Text": {
                                                "val": "-  Create a suite of systematic network analysis tools that can be applied to static and dynamic network structures and complex use cases. \n-  Develop near real-time scalable algorithms and models with guaranteed accuracy performance for inference, decision support, and understanding macro-phenomena."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.900"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.900"
                                            },
                                            "Text": {
                                                "val": "-  Extend previously developed statistical graph models to enable the modeling of multi-scale graphs, heterogeneous and vector link structures.  \n-  Deliver code for streaming and scalable algorithms (graph matching, similarity, etc.) for large scale networks to be incorporated into software toolkit.  \n-  Deliver data driven graph clustering and analysis methods that allow scientific discovery of complex time varying phenomena."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Knowledge Representation"
                                    },
                                    "Description": {
                                        "val": "The Knowledge Representation thrust, an outgrowth from the Mathematics of Sensing, Exploitation and Evaluation area, will develop much-needed tools to contextualize and analyze heterogeneous scientific data, facilitating field-wide hypothesis generation and testing. This will be accomplished by focusing on two key efforts: the development of domain-agnostic mathematical tools for representing heterogeneous data and domain knowledge in a unified knowledge framework, and domain-specific computational tools to embed observable data within the framework and enable tangible discoveries through computational analysis. To demonstrate the applicability of Knowledge Representation technology to multiple complex systems, the thrust will include validation across multiple disparate scientific and engineering fields. The technology developed under this thrust will revolutionize the process of scientific discovery by efficiently maximizing the potential of large, heterogeneous, multi-scale datasets across numerous complex scientific fields."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop an initial mathematical knowledge framework for representing diverse data types and existing domain knowledge in a domain-agnostic form.  \n-  Establish initial scientific and\/or engineering use case and example data sets that will be used to validate the knowledge representation framework and tools as they are developed.  \n-  Design appropriate tools for ingesting and registering scientific data into a common mathematical representation and demonstrate the tools for example, datasets."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.500"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate data input and information extraction within the mathematical knowledge framework.  \n-  Incorporate domain-specific prior knowledge, such as computational models, into the mathematical knowledge framework.  \n-  Demonstrate the integration of datasets and prior domain knowledge in one or more scientific and engineering use cases."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Communicating With Computers (CWC)*"
                                    },
                                    "Description": {
                                        "val": "*Formerly Human and Computer Symbiosis (HCS)\n\nThe Communicating With Computers (CWC) program will advance the state-of-the-art in human-computer interaction by enabling computers to comprehend language, gesture, facial expression and other communicative modalities in context.  Human communication is the process by which an idea in one person's mind becomes an idea in another's.  Human language is inherently ambiguous and so humans depend strongly on perception of the physical world and context to make language comprehensible.  CWC aims to provide computers with analogous capabilities to sense the physical world; encode the physical world in a perceptual structure; link language to this perceptual encoding; and learn the skills of communication.  To accomplish this, CWC will apply and extend research in language, vision, gesture recognition and interpretation, dialog management, cognitive linguistics, and the psychology of visual encoding: these are essential for human communication in the physical world.  CWC will also work to extend the communication techniques developed for physical contexts to nonphysical contexts such as virtual constructs in the cyber domain; program evaluations will include tests of this sort of transfer.  CWC advances will impact military application areas such as robotics and command and control."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.118"
                                            },
                                            "Text": {
                                                "val": "-  Formulate representations for the physical world that can capture the information in a visual scene in a form amenable to annotation and modification by language-based inputs.\n-  Create a semantic framework for gesture, facial expression and other communicative modalities.\n-  Explore methods for determining whether transmitted communications have been successfully received and, if not, what additional communications are most likely to result in success."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "-  Implement representations for the physical world and develop connectors to large-scale knowledge bases to enable visual-language synergies.\n-  Develop and demonstrate the capability to make computer inputs using gesture, facial expression and other communicative modalities.\n-  Implement initial techniques for confirming that communications have been successfully received and extrapolating to potentially missing information."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Building Resource Adaptive Software from Specifications (BRASS)"
                                    },
                                    "Description": {
                                        "val": "The Building Resource-Adaptive Software from Specifications (BRASS) program seeks to build an automated framework that permits software systems to seamlessly adapt to changing resource conditions in an evolving operational environment.  Effective adaptation is realized through rigorously defined specifications that capture application resource assumptions and resource guarantees made by the environment. Currently, the processes by which applications adapt to environment change via corrective patches is time-consuming, error-prone, and expensive.  Predicting the myriad of possible environment changes that an application may encounter in its lifetime is problematic, and existing reactive approaches are brittle and often incorrect.  The use of specification-based adaptation will allow BRASS applications to be correctly restructured in real time whenever stated assumptions or guarantees break.  This restructuring is optimized to trade off execution fidelity and functionality for continued operation. BRASS will create tools to automatically discover and monitor resource changes, build new analyses to infer deep resource-based specifications, and implement compiler and runtime transformations that can efficiently adapt to resource changes.  BRASS will expand on research encountered in the Mining and Understanding Software Enclaves program."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.500"
                                            },
                                            "Text": {
                                                "val": "-  Formulate specification techniques that allow the high-level expression of resource constraints inferred from a diverse set of sources including test suites, bug databases, and program analyses."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.500"
                                            },
                                            "Text": {
                                                "val": "-  Integrate specifications within an operational environment to monitor resource changes and trigger signals when resource invariants are violated.\n-  Develop compile-time and runtime transformations that ensure survivable operation in the face of unexpected environment changes.\n-  Build validation tools that certify that transformed applications satisfy specification assumptions in the context of new operating environment guarantees."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Quantifying Uncertainty in Physical Systems"
                                    },
                                    "Description": {
                                        "val": "The Quantifying Uncertainty in Physical Systems thrust, an outgrowth of the Mathematics of Sensing, Exploitation and Evaluation area, will create the basic mathematics needed to efficiently quantify, propagate and manage multiple sources of (parametric and model) uncertainty to make accurate predictions about and also design stochastic, complex DoD systems. In particular, this will include new methods for scaling Uncertainty Quantification (UQ) methods to multiscale\/multiphysics DoD systems; techniques for correcting model-form uncertainty and for predicting rare events; and new methods for decision making, control, and design under uncertain conditions."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.200"
                                            },
                                            "Text": {
                                                "val": "-  Initiate development of new dimensional reduction and surrogate model methods with theoretical error bounds for rigorous uncertainty of large-scale, coupled systems.  \n-  Initiate development of a new theoretical framework for optimization in the presence of high dimensional uncertain parameters. \n-  Initiate development of new model-form uncertainty approaches that outperform traditional methods such as the Gaussian Process approach for accurate estimation of Quantities of Interest in physical systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.550"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.550"
                                            },
                                            "Text": {
                                                "val": "-  Develop scalable approximation methods with provable error bounds for optimization in the presence of high dimensional uncertain parameters.  \n-  Develop scalable Bayesian inference algorithms for inverse methods with orders of magnitude speed-up incorporating the known physical properties of DoD systems.  \n-  Implement algorithms for estimation of quantities in physical systems in the presence of uncertainty on emerging high-performance computing platforms.  \n-  Derive proofs and theoretical treatment of rare event detection algorithms within risk-based optimization framework."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Complexity Management Hardware*"
                                    },
                                    "Description": {
                                        "val": "*Formerly Cortical Processor\n\nThe battlefield of the future will certainly have more data generators and sensors that define the information required to execute appropriately.  With networked sensors, the variety and complexity of the information streams will be even further extended.  This project will explore silicon designs which help alleviate the complexity inherent in next generation systems.  These systems will have increasingly large data sets generated by their own multidomain sensors (such as RF and Electro-Optical\/Infrared (EO\/IR) payloads) as well as new inputs from external sensors that may or may not have been planned for initially.  With current programming approaches, there are laborious coding requirements which need to account for new data streams. However, the context provided by these data sets is ever changing, and it is imperative for the integrated electronics to adapt to new information without a prolonged programming cycle.  Providing contextual cues for processing of data streams will alleviate the fusion challenges that are currently faced, and which stress networked battlefield systems.  As opposed to the intuition and future-proofing that is required at the programming stage of a current system, the silicon circuit of the future will be able to use contextual cues to adapt accordingly to new information as it is provided.\n\nThe fundamental aspects of this program will look at various algorithms to explore the ability to use context to adapt to new information.  This will start with exploration of the ability to automatically recognize information within streams of data, and then to extract context from the dataset.  This will extend to exploiting that context to further refine the processing of an orthogonal data set.  Applied research for the program is budgeted in PE 0602303E, Project IT-02."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop a hierarchical temporal memory (HTM) algorithm including new data representations, low precision and ability to adapt and scale.\n-  Perform benchmark calculations on data streams showing accurate pattern recognition with minimal training times in a variety of applications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.450"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.450"
                                            },
                                            "Text": {
                                                "val": "-  Compare various algorithms ability to manage complex data sets.\n-  Quantify the benefits of various architecture approaches to management of large data streams when overlaid with contextual information.\n-  Translate the initial algorithms to high level circuit implementations to show the power and processing requirements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Engage"
                                    },
                                    "Description": {
                                        "val": "The Engage program developed on-line approaches for complex problem solving in real-world settings by analyzing and adapting performance across large numbers of users.  Using unconventional mechanisms and incentives, Engage created an on-line environment for data-driven, interactive, multidisciplinary collaboration among experts and non-experts to address heretofore insolvable challenge problems.  This big-data analysis approach identified optimum training strategies, resulting in the development of software that is highly individualized to the user.  Engage also addressed the difficult problem of assessing performance in the virtual domain to predict performance in the real world and drive the creation of more effective on-line education and training. Engage technology development was coordinated with the Department of Defense Educational Activity (DoDEA)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.815"
                                            },
                                            "Text": {
                                                "val": "-  Developed and released Engage-based software for training additional topics.\n-  Developed novel assessment models for adapting educational technologies to individual users.\n-  Created a collection of research-based technologies that align with national educational standards.\n-  Executed an MOU and pilot with DoDEA to incorporate one or more ENGAGE games into DoDEA curriculum.\n-  ENGAGE robotics games were used in over 16K classrooms by over 276K students.\n-  ENGAGE games have been played by over 5 million players (projected to be 13 million by June 2015).\n-  Developed design and simulation tools that allow students and instructors to determine the operation of a complex electro-mechanical system.   \n-  Demonstrated the linking between design and prototyping tools that will allow for in-field manufacturing of failed components.  \n-  Demonstrated the linking of instructional design and simulation tools with rapid prototyping machines to allow for the troubleshooting and repair of failed components in electro-mechanical systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Strategic Social Interaction Modules (SSIM)"
                                    },
                                    "Description": {
                                        "val": "The Strategic Social Interaction Modules (SSIM) program improved military training to include the social interaction skills and abilities warfighters need for successful engagement with local populations.  In the current and likely future operational environment, it is imperative to develop rapport with local leaders and civilians as their cooperation and consent will be necessary for successful operations.  SSIM emphasized the foundational social skills necessary to achieve cultural understanding in any social setting and the skills necessary for successful interactions across different social groups.  These core skills do not require soldiers to have knowledge of a specific culture prior to contact but emphasizes skills for orienting toward and discovering patterns of meaningful social behavior.  SSIM developed the requisite training technology, including advanced gaming\/simulation techniques, that incorporate new methods for practicing social agility in social encounters, as well as how to discover and adapt to unfamiliar culturally-specific conduct, manners, and practices.  SSIM enhanced military effectiveness by enabling close collaborative relationships with local peoples and leaders."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.777"
                                            },
                                            "Text": {
                                                "val": "-  Refined the curriculum for SSIM-oriented training based on findings regarding effective social interaction.\n-  Completed the assessment of the effectiveness of SSIM-training to determine direct and indirect effects.\n-  Transitioned SSIM-based training and training simulator to transition partners.\n-  Completed field-testing of prototypes and deployed new training technologies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mathematics of Sensing, Exploitation and Evaluation (MSEE)"
                                    },
                                    "Description": {
                                        "val": "The Mathematics of Sensing, Exploitation and Evaluation (MSEE) program sought to create a comprehensive mathematical theory of information processing, strategy formulation and decision determination.  Such a theory  incorporates techniques from diverse mathematical disciplines such as Stochastic Process Theory, Harmonic Analysis, Formal Languages and Theoretical Computer Science to construct a common framework wherein the quantitative value of data acquisition may be assessed relative to dynamically-varying context.  In addition, the structure accommodates the notion that data acquisition and information processing are coupled, requiring some degree of feedback and control, while simultaneously admitting the possibility of different logics, such as those that allow for incomplete and time-varying states of knowledge.  The result of this effort produced advances in fundamental domains of mathematics with the potential to reshape current DoD approaches to managing the battlespace and supervisory controls."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.853"
                                            },
                                            "Text": {
                                                "val": "-  Implemented multiple-modality solutions that demonstrated the effectiveness of a unified approach to sensing. \n-  Created an advanced evaluation test-bed that enabled probative, quantitative assessment of a system's ability to understand scene semantics. \n-  Demonstrated enhanced anomaly detection under varying operating conditions, including production of a single (unified) semantic representation of a scene in the presence of coincident sensor data coming from multiple modalities, some of which comprised electro-optical\/IR."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Computer Science Study Group (CSSG)"
                                    },
                                    "Description": {
                                        "val": "The Computer Science Study Group (CSSG) program supported emerging ideas from the computer science academic community to address the DoD's need for innovative computer and information technologies; introduced a generation of junior researchers to the needs and priorities of the DoD; and enabled the transition of those ideas and applications by promoting joint university, industry, and government projects.  The CSSG project formalized and focused this research for efficiency and greater effectiveness."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.550"
                                            },
                                            "Text": {
                                                "val": "-  Transitioned successful research outcomes from Classes 2010-2011.\n-  Conducted CSSG Continuing Research Series Text and Video Analytics Workshop at Army Research Laboratory.\n-  Conducted a National Security Innovation Workshop at the Institute for Defense Analyses.\n-  Matched funding with government and industry partners for seven Phase 3 technology transition projects."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "CYS-01"
                    },
                    "ProjectTitle": {
                        "val": "CYBER SCIENCES"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "23.720"
                        },
                        "CurrentYear": {
                            "val": "58.462"
                        },
                        "BudgetYearOne": {
                            "val": "53.774"
                        },
                        "BudgetYearOneBase": {
                            "val": "53.774"
                        },
                        "BudgetYearTwo": {
                            "val": "45.000"
                        },
                        "BudgetYearThree": {
                            "val": "47.219"
                        },
                        "BudgetYearFour": {
                            "val": "27.000"
                        },
                        "BudgetYearFive": {
                            "val": "10.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Cyber Sciences project supports long term national security requirements through scientific research and experimentation in cyber security.  During the past decade information technologies have enabled important new military capabilities and driven the productivity gains essential to U.S. economic competitiveness.  Unfortunately, during the same period, cyber threats have grown rapidly in sophistication and number, putting sensitive data, classified computer programs, and mission-critical information systems at risk.  The basic research conducted under the Cyber Sciences project will produce the breakthroughs necessary to ensure the resilience of DoD information systems to current and emerging cyber threats.  Promising research results will be transitioned to both technology development and system-level projects."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Basic Research Congressional Add"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "5.000"
                                        },
                                        "Text": {
                                            "val": "-  Supports increased efforts in basic research that engage a wider set of universities and commercial research communities."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Automated Program Analysis for Cybersecurity (APAC)"
                                    },
                                    "Description": {
                                        "val": "Automated Program Analysis for Cybersecurity (APAC) is developing automated program analysis techniques for mathematically validating specified security properties of mobile applications.  This will involve creating new and improved type-based analysis, abstract interpretation, and flow-based analysis methods with far greater ability to accurately demonstrate security with lower instances of false alarms.  APAC technologies will enable developers and analysts to identify mobile applications that contain hidden malicious functionality and bar those applications from DoD mobile application marketplaces."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "23.720"
                                            },
                                            "Text": {
                                                "val": "-  Improved the effectiveness of prototype tools to enable human analysts charged with curating a DoD app store to keep up with a realistic stream of incoming applications.\n-  Measured the improvement of analyst productivity and effectiveness through further engagements.\n-  Used measurements against the program metrics to identify prototype tools that are likely candidates for technology transition.\n-  Identified transition partners and captured specific user operational needs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "21.318"
                                            },
                                            "Text": {
                                                "val": "-  Assess and select prototype tools for experimentation or transition based on their performance on program metrics: probabilities of false alarm, missed detection and human analysis time.\n-  Conduct further engagements to detect malice hidden in mobile applications, in particular race conditions, complex hidden triggers, and application collusion.\n-  Measure the improvement of analysts ability to bar malware from DoD app stores using the prototype tools."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.016"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.016"
                                            },
                                            "Text": {
                                                "val": "-  Run comparative performance evaluations between program-developed malware detection tools and commercially available tools.\n-  Engage in experiments and pilot deployments of prototype tools with transition partners running DoD application stores.\n-  Based on user feedback, make improvements to prototypes to enhance usability in the context of DoD application stores."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SafeWare"
                                    },
                                    "Description": {
                                        "val": "The SafeWare program will develop new code obfuscation techniques for protecting software from reverse engineering.  At present, adversaries can extract sensitive information from stolen software, which can include cryptographic private keys, special inputs\/failsafe modes, proprietary algorithms and even the software architecture itself.  Today's state of the art in software obfuscation adds junk code (loops that do nothing, renaming of variables, redundant conditions, etc.) which unfortunately does little more than inconvenience the aggressor.  Recent breakthroughs in theoretical cryptography have the potential to make software obfuscation into a mathematically rigorous science, very much like what the Rivest-Shamir-Adleman (RSA) algorithm did for the encryption of messages in the 1970's.  The SafeWare program aims to take this very early-stage theory, which in its present form incurs too much runtime overhead to be practical, and re-tool its mathematical foundations such that one day it will be practical and efficient.  As with RSA, SafeWare methods will require the solution of a computationally hard mathematical problem as a necessary condition for a successful de-obfuscation attack.  SafeWare is addressing basic research issues encountered in Safer Warfighter Computing (SAFER) in PE 0602303E, Project IT-03."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "-  Formulate new cryptographic approaches for protecting software from reverse engineering with mathematically proven security properties that are not substantially diminished in effectiveness even if they are fully understood by the adversary.\n-  Develop cryptographic code obfuscation methods for which the increase in adversary work factor scales exponentially with respect to a polynomial increase in program runtime overhead.\n-  Assess the potential for implementing cryptographic code obfuscation techniques on multiprocessor systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.826"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.826"
                                            },
                                            "Text": {
                                                "val": "-  Explore potentially powerful new primitives for cryptographic program obfuscation such as multilinear maps.\n-  Develop alternate notions and models of obfuscation that accommodate specialized aggressor models.\n-  Optimize domain-specific algorithms for obfuscation efficiency."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space\/Time Analysis for Cybersecurity (STAC)"
                                    },
                                    "Description": {
                                        "val": "The Space\/Time Analysis for Cybersecurity (STAC) program will develop techniques to detect vulnerabilities to algorithmic complexity and side channel attacks in software.  Historically, adversaries have exploited software implementation flaws through buffer and heap overflow attacks.  Advances in operating systems have largely mitigated such attacks, so now cyber adversaries must find new ways of compromising software.  Algorithmic complexity and side channel attacks are emerging as the next generation of attacks since they depend on intrinsic properties of the algorithms themselves rather than flaws in their implementations.  Recent news reports have highlighted the first wave of these attacks (CRIME, BREACH, Hash DoS).  The STAC program seeks to develop new analysis tools and techniques to detect vulnerabilities to these attacks in the software upon which the U.S. government, military, and economy depend. STAC extends work initiated under the Automated Program Analysis for Cybersecurity (APAC) program to address algorithmic complexity and side channel attacks."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.144"
                                            },
                                            "Text": {
                                                "val": "-  Present initial program analysis approaches for identifying vulnerabilities to algorithmic complexity and side channel attacks based on both time and space resource usage.\n-  Develop STAC concept of operations, create example resource usage attack scenarios, and define the rules of engagement for competitive experiments between research and adversarial challenge teams.\n-  Identify the initial infrastructure required to support the development of a sufficient number of challenge programs containing known vulnerabilities to support realistic evaluations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.573"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.573"
                                            },
                                            "Text": {
                                                "val": "-  Define the formal semantics of the runtime environments in which vulnerable software runs and encode these semantics in a form consumable by automated analysis tools.\n-  Produce initial analysis tools capable of reasoning about data and control flow paths in computer programs, identifying inputs adversaries can use to mount algorithmic complexity attacks, and outputs that adversaries can use to mount side channel attacks.\n-  Perform the first competitive experiment using prototype analysis tools to find vulnerabilities to algorithmic complexity and side channel attacks in a corpus of challenge programs and produce measurements of research progress against program metrics."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Transparent Computing*"
                                    },
                                    "Description": {
                                        "val": "*Previously funded in PE 0601101E, Project CCS-02\n\nThe Transparent Computing program will develop technologies to enable the implementation of more effective security policies across distributed systems.  The scale and complexity of modern information systems obscures linkages between security-related events, the result being that detection of attacks and anomalies must rely on narrow contextual information rather than complete knowledge of the event's provenance.  This shortcoming facilitates attacks such as advanced persistent threats.  The Transparent Computing program will address these problems by creating the capability to propagate security-relevant information and ensure component interactions are consistent with established behavior profiles and policies.  Transparent Computing technologies are particularly important for large integrated systems with diverse components such as distributed surveillance systems, autonomous systems, and enterprise information systems."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "-  Formulate approaches for tracking information flows and other causal dependencies, and recovering event provenance to enable more effective detection of attacks, anomalies, and advanced persistent threats.\n-  Develop active\/continuous testing and adaptive security policy schemes that adjust security posture and usage controls in response to information provided by distributed protection components.\n-  Introduce dynamic behavioral attestation techniques, and propose and analyze scalable algorithms and implementations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.359"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.359"
                                            },
                                            "Text": {
                                                "val": "-  Implement adaptive security policy schemes in software prototypes with flexibility and scalability suitable for use on distributed surveillance systems, autonomous systems, and enterprise information systems.\n-  Perform initial assessments of security policy prototypes in simulated laboratory and cloud environments.\n-  Develop and implement behavioral attestation techniques in software prototypes scalable to big data applications.\n-  Develop and implement causal dependency tracking across software\/hardware abstraction layers."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "ES-01"
                    },
                    "ProjectTitle": {
                        "val": "ELECTRONIC SCIENCES"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "35.969"
                        },
                        "CurrentYear": {
                            "val": "37.411"
                        },
                        "BudgetYearOne": {
                            "val": "40.401"
                        },
                        "BudgetYearOneBase": {
                            "val": "40.401"
                        },
                        "BudgetYearTwo": {
                            "val": "44.578"
                        },
                        "BudgetYearThree": {
                            "val": "36.951"
                        },
                        "BudgetYearFour": {
                            "val": "39.796"
                        },
                        "BudgetYearFive": {
                            "val": "44.883"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project seeks to continue the phenomenal progress in microelectronics innovation that has characterized the last decades by exploring and demonstrating electronic and optoelectronic devices, circuits and processing concepts that will: 1) provide new technical options for meeting the information gathering, transmission and processing required to maintain near real-time knowledge of the enemy and the ability to communicate decisions based on that knowledge to all forces in near real-time; and 2) provide new means for achieving substantial increases in performance and cost reduction of military systems providing these capabilities.  Research areas include new electronic and optoelectronic device and circuit concepts, operation of devices at higher frequency and lower power, extension of diode laser operation to new wavelength ranges relevant to military missions, development of uncooled and novel infrared detector materials for night vision and other sensor applications, development of innovative optical and electronic technologies for interconnecting modules in high performance systems, research to realize field portable electronics with reduced power requirements, and system and component level improvements to provide greater affordability and reliability.  Additionally, electronically controlled microinstruments offer the possibility of nanometer-scale probing, sensing and manipulation for ultra-high density information storage \"on-a-chip,\" for nanometer-scale patterning, and for molecular level analysis and synthesis.  These microinstruments may also offer new approaches to integration, testing, controlling, manipulating and manufacturing nanometer-scale structures, molecules and devices."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Basic Research Congressional Add"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "5.000"
                                        },
                                        "Text": {
                                            "val": "- Supports increased efforts in basic research that engage a wider set of universities and commercial research communities."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Arrays at Commercial Timescales (ACT)"
                                    },
                                    "Description": {
                                        "val": "Phased arrays are critical military subsystems with widespread applications in communications, electronic warfare and radar.  The DoD relies heavily on phased arrays to maintain technological superiority in nearly every theater of conflict.  The DoD cannot update these high cost specialized arrays at the pace necessary to effectively counter adversarial threats under development using commercial-of-the-shelf components that can undergo technology refresh far more frequently.  The Arrays at Commercial Timescales (ACT) program will develop adaptive and standardized digital-at-every-element arrays.  New advances in digital circuits at every element in an array panel will allow for ubiquitous phased array technology with heretofore unrealized spectral coverage and capabilities.  This program will take a fundamental look at the role of digital arrays and how commonality and aggregation can be affected by emerging capabilities.  Simultaneously, this effort will focus on the development of arrays which can quickly create different unique RF personalities\/capabilities on top of common digital hardware.  The project will demonstrate levels of diversity in the use of the electromagnetic spectrum which are severely limited by the current approach of hand-designing the array with heavily specialized RF beamformers that are unique to each system.  This program also has related applied research efforts funded under PE 0602716E, Project ELT-01."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.442"
                                            },
                                            "Text": {
                                                "val": "-  Initiated development of fundamental design techniques suited to common hardware components for phased array elements that can be seamlessly integrated into a wide range of platforms.\n-  Initiated development of fundamental components and sub-systems enabling common array modules, including active interference mitigation technology, analog processing or beamforming techniques, novel channelization techniques, and filter-less transceiver topologies.\n-Demonstrated energy efficient bit-stream beamforming with 64% power savings and 68% reduction in chip size."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.811"
                                            },
                                            "Text": {
                                                "val": "-  Develop very high speed analog-to-digital (ADC) and digital-to-analog (DAC) converters enabling elemental level digital beamforming of wide bandwidth RF signals, approaching an instantaneous bandwidth of 1GHz.\n- Develop sample clocking architectures and dithering techniques that enable decorrelation of quantization noise across a phased array antenna.\n-  Develop very high bandwidth switch and switch array technologies that can be toggled from an electrically large standoff distance to enable frequency reconfigurable radiating elements for phased array antennas.\n-  Complete a study with simulation results to showcase performance tradeoffs in the ACT common module as the line of commonality moves closer toward the aperture interface.\n-  Investigate transition paths for fundamental technologies into array systems and common modules under development in the applied research portion of this project."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.301"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.301"
                                            },
                                            "Text": {
                                                "val": "-  Continue to develop fundamental technologies and techniques for enabling common array modules.\n-  Develop a module that combines N-path filtering and active interference cancellation for testing with commercial off-the-shelf components.\n-  Investigate transition paths for fundamental technologies into array systems and common modules under development in the applied research portion of this project."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Semiconductor Technology Advanced Research Network (STARNet)"
                                    },
                                    "Description": {
                                        "val": "The Semiconductor Technology Advanced Research Network (STARNet) program is a government-industry partnership combining the expertise and resources from select defense, semiconductor, and information companies with those of DARPA to sponsor an external set of academic research teams that are focused on specific technology needs set by experts in industry and government.  Efforts under this program will remove the roadblocks to achieving performance needed for future sensing, communication, computing, and memory applications.  The program involves close collaboration between these experts and the academic base with industry providing 60% of program funding matched by 40% from DARPA.  For both industrial and government participants, leveraging shared research funding for high risk, pre-competitive technology explorations for shared technical hurdles is very attractive.\n\nResearch in STARNet is divided into a discovery thrust (ACCEL) and an integration thrust (NEXT) executed by virtual academic centers and focused on combining current or emerging technologies to provide new capabilities.  ACCEL seeks to discover new material systems, devices, and novel computing\/sensing architectures.  NEXT involves projects on advanced analog and mixed signal circuitry, complex system design tools, and alternative computing architectures.  As the projects in ACCEL mature, it is expected that they will replace the efforts in NEXT that are based on current standard technologies for integrated circuits.\n\nThe STARNet program is unique.  It creates a community where industry and government participate as co-sponsors to guide and learn from a large academic research base (including approximately 41 universities, 170 faculty researchers, 605 students, and more than 111 industry associate personnel), with DoD shaping the goals to have direct impact on important long-range DoD needs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.000"
                                            },
                                            "Text": {
                                                "val": "-  Showed proof-of-concept of novel transistor devices with extremely steep turn-on characteristics, allowing the potential for substantial reductions in operating voltage with correspondingly large reductions in power consumption of military electronics.\n-  Progressed towards achieving the ultimate scalability of silicon-based computing systems with novel data-centric architectures and innovative parallelism strategies.\n-  Established a fundamental understanding of multifunctional and spintronics materials, interfaces, architectures and demonstrated primary material synthesis approaches and device concepts towards logic and memory applications.\n-  Satisfied rapidly increasing DoD need for information processing speed and scalability by designing new strategies using non-deterministic computing paradigms and novel nanodevices to compensate for the increasing unreliability of scaled complementary metal-oxide semiconductor (CMOS) very-large-scale integration (VLSI).\n-  Established an integrated, networked swarm of pervasive smart sensors and actuators to monitor and control environments such as buildings, cities and ultimately battlefield spaces.\n-  Demonstrated simulators for accelerator-rich computing architecture, identified the novel communication and storage architecture for power efficient data movement, and explored robust and secure computation architecture.\n-  Monitored and assessed progress towards technical goals proposed by Centers, including reductions of 100 times in the power consumption of devices, 100 - 10,000 times lower energy consumption in logic switches, 10 - 100 times higher computational energy efficiency, scalability of technologies to sub-10 nanometer dimensions, development of novel computing architectures, and highly energy-efficient information processing systems inspired in the nervous system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.000"
                                            },
                                            "Text": {
                                                "val": "-  Investigate the feasibility of advanced two-dimensional semiconductor materials for extremely low power devices and develop the nanofabrication methods as well as establish the theory, modeling and simulation tools.\n-  Research fundamental limitations of scaling multifunctional and spintronics materials and examine device characteristics as well as demonstrate the advanced devices.\n-  Develop the scalable silicon-based computing system architecture by exploring the benefits of heterogeneously integrating emerging nano-technologies into silicon-based designs.\n-  Develop statistical foundations of information processing via machine learning frameworks, process-scalable foundations of analog mixed-signal systems using information-based design metrics, neuro-principled information processing architectures for Beyond-CMOS and CMOS fabrics, and accelerate the deployment of beyond-CMOS and CMOS nanoscale fabrics via nanofunctions and nanoprimitives.\n-  Develop components, architecture, data control, and tools for sensor swarm applications such as building energy efficiency, health care delivery, manufacturing and agriculture, and warfighter situational awareness."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.000"
                                            },
                                            "Text": {
                                                "val": "-  Design VLSI and analog circuits based on novel steep-turn-on transistor devices for applications such as lower power imagers, pattern recognition, and scavenging self-powered electronics with extremely low energy-delay product.\n-  Develop multifunctional and spintronics devices and fabrication techniques to enable logic and memory circuits with increased complexity.\n-  Develop the scalability of silicon-based computing system concepts into the 2020-2030 timeframe to meet the performance, power and cost demands for DoD applications.\n-  Discover, develop, and demonstrate bio- and neuro-inspired information processing architectures that approach the efficiency of brain computation, while aligning well with emerging beyond-CMOS nanoscale fabrics.\n-  Demonstrate sensor swarm applications for Defense requirements such as warfighter situational awareness and assess system characteristics and potential advantages."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Direct On-Chip Digital Optical Synthesis (DODOS)"
                                    },
                                    "Description": {
                                        "val": "The development of techniques for precise frequency control of RF and microwave radiation in the 1940's revolutionized modern warfare.  Frequency control is the enabling technology for RADAR, satellite and terrestrial communications, and positioning and navigation technology, among many other core DoD capabilities.  By comparison, frequency control at optical frequencies is relatively immature, comparable to the state-of-the-art of microwave control in the 1930's.  The first practical demonstration of optical frequency synthesis, utilizing a self-referenced optical comb, was performed in 1999 and, since that time, the precision and accuracy of optical measurements has improved by four orders of magnitude, including the demonstration of atomic clocks utilizing optical-frequency atomic transitions that far outperform existing technology based on microwave transitions.  To date, however, optical frequency control has been constrained to laboratory experiments due to the large size, relative fragility, and high cost of optical comb-based synthesizers.  Recent developments in self-referenced optical frequency combs in microscale resonators enable the development of a fully-integrated chip-scale optical frequency synthesizer.  Ubiquitous low-cost robust optical frequency synthesis is expected to create a similar disruptive capability in optical technology as microwave frequency synthesis did in the 1940's, enabling high-bandwidth coherent optical communications, coherent synthesized-aperture LiDAR, portable high-accuracy atomic clocks, high-resolution standoff gas\/toxin detection, and intrusion detection, among other foreseen applications.\n\nThe Direct On-chip Digital Optical Synthesis (DODOS) program will investigate high-performance photonic components for creating a microscale high-accuracy optical frequency synthesizer in a compact robust package, suitable for deployment in a wide variety of mission-critical DoD applications.  Significant challenges in the program include reducing the power threshold and stabilizing microresonator optical combs, developing efficient devices for on-chip second harmonic generation, and characterizing the frequency stability and phase noise of a slave laser locked to the stabilized comb.  Applied research for this program is funded within PE 0602716E, Project ELT-01."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.100"
                                            },
                                            "Text": {
                                                "val": "-  Optimize wavelength dispersion and low-threshold operation of microresonator based combs.\n-  Explore materials and novel devices for efficient on-chip second harmonic generation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate low-threshold octave-spanning microresonator combs suitable for DODOS integration.\n-  Demonstrate methods for stabilizing the phase coherence of a microresonator comb across a broad optical bandwidth.\n-  Characterize the output of a slave laser locked to a stabilized microresonator comb and evaluate the performance relative to promising DoD applications for DODOS technology."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Next Generation Atomic Clock (NGAC)"
                                    },
                                    "Description": {
                                        "val": "Atomic clock technology provides the high-performance backbone of timing and synchronization for DoD navigation, communications, Intelligence Surveillance and Reconnaissance (ISR), and Electronic Warfare (EW) systems.  Prior DARPA investment in Chip-Scale Atomic Clock (CSAC) technology has led to recent demonstrations of enhanced DoD capabilities, enabled by the wide availability of atomic-quality timing in portable battery-powered applications.  The Next-Generation Atomic Clock (NGAC) program will develop a next-generation chip-scale atomic clock, with 100X-1000X improvement in key performance parameters, by employing alternative approaches to atomic confinement and interrogation, with particular focus on developing the component technologies necessary to enable low-cost manufacturing and robust deployment in harsh DoD environments.\nThe NGAC program will develop a Chip-Scale Atomic Clock achieving temperature coefficient of frequency of <10^-15\/degrees Celsius and frequency drift < 10^-12\/month.  This will enable precise timing on low-CSWaP platforms with extended mission duration.  In order to achieve these performance metrics, novel approaches to atomic confinement and interrogation will be explored and new enabling components will be developed.  Applied research for this program is funded within PE 0602716E, Project ELT-01."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.600"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.600"
                                            },
                                            "Text": {
                                                "val": "-  Develop low-CSWaP application-specific laser devices, optical modulators, shutters, and isolators.\n-  Demonstrate integration of application-specific optical components into robust photonic integrated circuits.\n-  Develop techniques for alkali metal vapor pressure control over the full DoD temperature range.\n-  Develop low-CSWaP ultra-high vacuum technology operating without perturbative magnetic fields.\n-  Demonstrate clock operation with integrated enabling component devices."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Near Zero Energy RF and Sensor Operations (N-ZERO)"
                                    },
                                    "Description": {
                                        "val": "The DoD has an unfilled need for a persistent, event driven sensing capability, where physical, electromagnetic and other sensors can be pre-placed and remain dormant until awoken by an external trigger or stimulus.  State-of-the-art (SOA) sensors use active electronics to monitor the environment for the external trigger.  The power consumed by these electronic circuits limits the sensor lifetime to durations of weeks to months.  The Near Zero Power RF and Sensor Operations (N-ZERO) program will extend the lifetime of remotely deployed sensors from months to years. N-ZERO will develop the underlying technologies and demonstrate the capability to continuously and passively monitor the environment and wake-up an electronic circuit upon detection of a specific signature or trigger. Thereafter, sensor lifetime will be limited only by processing and communications of confirmed events or ultimately by the battery self-discharge.\n\nThis program will investigate emerging materials and devices and quantify their impact on system performance.  In particular, a fundamental understanding of the trade space that simultaneously minimizes power consumption, the minimum detectable signal, and the probability of false detection will be explored.  This program also has related applied research efforts funded under PE 0602716E, Project ELT-01."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.500"
                                            },
                                            "Text": {
                                                "val": "-  Develop fundamental materials, devices, and techniques for low energy collection, processing and detection of sensor and communications signals.\n-  Investigate transition paths for fundamental technologies into radio frequency communications and physical sensor systems under development in the applied research portion of this project."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Electronic Globalization"
                                    },
                                    "Description": {
                                        "val": "Approximately 66% of all installed semiconductor wafer capacity is in Asia.  This creates a significant risk as off-shore manufacturing of microelectronic components could introduce various vulnerabilities to DoD systems that utilize these non-U.S. fabricated electronic components.  As the DoD is faced with this globalization reality, it is essential to prevent potential consequences such as reverse engineering, theft of U.S. intellectual property, and non-authorized use of these electronic components in adversary defense systems.\nThe Electronic Globalization program will examine various approaches for trusting circuits in an untrusted environment.  It will develop the abilities to design circuits with functionality that is benign in an untrusted environment.  Basic Research activity will focus on the characterization of materials and structures which enable the trust of circuitry.  This trust will be provided by the ability to create back end of line processing, or other similar mechanisms, to complete or personalize a circuit after it has been through the majority of the traditional supply chain.  Applied research for the program is budgeted in PE 0602303E, Project IT-02."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "-  Define the value proposition offered by the proposed material, identifying a specific Concepts of Operations (CONOPS).\n-  First pass intrinsic physics-level modeling and simulation of structures and materials.\n-  Design of proof-of-concept test sites.\n-  Fabricate test coupons and characterization of new morphological materials and structures.\n-  Characterization of experimental hardware."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Microscale Plasma Devices (MPD)"
                                    },
                                    "Description": {
                                        "val": "The goal of the Microscale Plasma Devices (MPD) program is to design, develop, and characterize MPD technologies, circuits, and substrates.  The MPD program will focus on development of fast, small, reliable, high carrier-density, micro-plasma switches capable of operating in extreme conditions, such as high-radiation and high-temperature environments.  Specific focus will be given to methods that provide efficient generation of ions that can perform robust signal processing of radio frequency (RF) through light electromagnetic energy over a range of gas pressures.  Applications for such devices are far reaching, including the construction of complete high-frequency plasma-based circuits, and microsystems with superior resistance to radiation and extreme temperature environments.  It is envisaged that both two- and multi-terminal devices consisting of various architectures will be developed and optimized under the scope of this program.  MPDs will be developed in various circuits and substrates to demonstrate the efficacy of different approaches.  MPD-based microsystems are demonstrated in DoD applications where electronic systems must survive in extreme environments.\n\nThe Basic Research part of this effort is focused on fundamental MPD research and will advance scientific knowledge based on the study of several key MPD design parameters.  These parameters include ultra-high pressure and high carrier density regimes.  MPD will focus on expanding the design space for plasma devices enabling revolutionary advances in micro-plasma device performance.  It is expected that MPD will develop innovative concepts and technologies that are clearly disruptive with respect to the current state of the art in terms of switching speed (less than 100 picoseconds), carrier density (exceeding 1E18 per cubic centimeter), and capable of operation and robustness in extreme high-radiation or high-temperature (600degC) environments.  Fundamental scientific knowledge derived from MPD is also expected to drive developments in commercialization of MPD technology developed and funded in PE 0602716E, Project ELT-01."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Completed optimized microcavity designs achieving parameters and uniformity necessary for < 100 picosecond device switching speeds needed for robust survivability in high power electromagnetic fields.\n-  Finalized studies of plasma in extreme environments (radiation and temperature) to demonstrate robust electronics capable of surviving in harsh environments orders of magnitude longer than current state of art silicon Complementary Metal-Oxide Semiconductor (CMOS).\n-  Determined feasibility of controlling infrared and light via manipulation, absorption and switching utilizing microscale plasmas.\n-  Completed device modeling based on characterization of fabricated microscale plasma devices and provided results to circuit and microsystem integrators for use in DoD system designs.\n-  Continued studies of fundamental frequency, efficiency and power limitations of generating high-power microwave through terahertz (THz) frequency signals, utilizing plasma as a robust, non-linear up-conversion medium."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "- Complete investigations examining scaling properties for plasma devices in terms of size, density, robustness and switching speed.\n-  Finalize studies on fundamental frequency, efficiency and power limitations of generating high-power microwave through terahertz (THz) frequency signals utilizing plasma as a robust, non-linear up-conversion medium.\n-  Complete the optimization of devices that perform from RF through light frequencies.\n-  Transition fundamental research findings into improved commercial modeling simulation and design tool capabilities, enabling DoD relevant applications that require survivability in extreme radiation and temperature environments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Micro-coolers for Focal Plane Arrays (MC-FPA)"
                                    },
                                    "Description": {
                                        "val": "The Micro-coolers for Focal Plane Arrays (MC-FPA) program will develop low size, weight, power, and cost (SWaP-C) cryogenic coolers for application in high-performance infrared (IR) cameras.  It is well known that the sensitivity of an IR focal-plane array (FPA) is improved by cooling its detectors to cryogenic temperatures.  The disadvantages of state-of-the-art cryo-coolers are their large size, high power and high cost.  On the other hand, thermoelectric (TE) coolers used in low performance IR cameras are relatively small, but are inefficient, and it is difficult to achieve temperatures below 200 Kelvin (K).\n\nTo reduce IR camera SWaP-C, innovations in cooler technology are needed.  This program will exploit the Joule-Thomson (J-T) cooling principle, in a silicon-based Micro Electro-Mechanical Systems (MEMS) technology, to develop and demonstrate wafer-scale integrated micro-cryogenic IR FPA coolers with very low SWaP-C.  MEMS microfluidics, piezoelectric MEMS, and complementary metal-oxide semiconductor (CMOS) electronics will be used to demonstrate an integrated cold head and compressor, all in a semiconductor chip.  This program has related applied research efforts funded under PE 0602716E, Project ELT-01."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.500"
                                            },
                                            "Text": {
                                                "val": "-   Designed the cold stage with significantly reduced processing steps (from 20 down to 13) and optimized the design of the J-T valve for 100 mW cooling.\n-  Completed the mask layout for the compressors (5.5 mm X 5.5 mm) and individual inlet and outlet valves.\n-  Finalized the selection of all the parts for the year-1 single-stage micro-cryogenic cooler demonstration.\n-  Completed the cold stage fabrication and 50% for the compressor.\n-  Designed a novel coupling approach between the cold stage and the compressor using a Polydimethylsiloxane (PDMS) coupler.\n-  Developed a model for a two-phase heat transfer and fluid flow in the cold stage.\n-  Demonstrated atomic layer deposition (ALD)-based, nano-scaled compression chamber.\n-  Designed a chip-scale, J-T cold-head for a 640 x 480 extended shortwave infrared (e-SWIR, 1-2.4 micrometer cutoff) FPA with 4-6 micrometer unit cell size.\n-  Developed all the critical technologies for the demonstration of a single-stage micro-cooler with an integrated piezoelectric compressor and cold-head with following metric: 30mm x 20mm x 10mm; 50 g.\n-  Developed an alternative system configuration requiring a pressure ratio of 2:1 instead of 4:1."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.500"
                                            },
                                            "Text": {
                                                "val": "- Demonstrate a single-stage micro-cooler with an integrated piezoelectric compressor and cold-head with the following metric: 30 mm x 20 mm x 10 mm; 50 g.\n- Finalize design and demonstrate a three stage J-T micro-cooler operating down to 195 K.\n- Finalize design of a five-stage J-T micro-cooler operating down to 150 K with 350 mW heat lift.\n- Improve the reconfigurable fluid interconnect developed above and apply such a scheme to improve the fabrication yield of the wafer-scale integrated micro-cryogenic cooler.\n- Integrate the MEMS compressors and the cold stages into a five-stage wafer-scale integrated micro-cryogenic cooler for the final demonstration.\t\n- Demonstrate J-T micro-cooler operating down to 150 K with 350 mW heat lift."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Diverse & Accessible Heterogeneous Integration (DAHI)"
                                    },
                                    "Description": {
                                        "val": "Prior DARPA efforts have demonstrated the ability to monolithically integrate a limited set of different semiconductor types to achieve near-ideal \"mix-and-match\" capability for DoD circuit designers.  Specifically, one such program was the Compound Semiconductor Materials On Silicon (COSMOS) program, in which transistors of Indium Phosphide (InP) could be freely mixed with silicon Complementary Metal Oxide Semiconductor (CMOS) circuits to obtain the benefits of both technologies (very high speed and very high circuit complexity\/density, respectively).  The Diverse & Accessible Heterogeneous Integration (DAHI) program took this capability to the next level, ultimately offering the seamless co-integration of a variety of semiconductor devices (for example, Gallium Nitride, Indium Phosphide, Gallium Arsenide, Antimonide-Based Compound Semiconductors), micro-electromechanical (MEMS) sensors and actuators, photonic devices (e.g., lasers, photo-detectors) and thermal management structures.  This capability revolutionized our ability to build true \"systems on a chip\" (SoCs) and allowed dramatic size, weight and volume reductions for a wide array of system applications.\n\nThe Basic Research part of this program focused on the development of new hetero-integration processes and capabilities that were demonstrated in application-specific circuits and transferred into the manufacturing flow.  This program has applied research efforts funded in PE 0602716E, Project ELT-01, and advanced technology development efforts funded in PE 0603739E, Project MT-15."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.027"
                                            },
                                            "Text": {
                                                "val": "-  Developed new CMOS-compatible processes to achieve heterogeneous integration with diverse types of compound semiconductor transistors, MEMS, and non-silicon photonic devices.\n-  Fabricated and tested heterogeneously integrated ultra-low-noise laser sources and on-chip laser radar systems.\n-  Developed noise measurement methodology with sensitivity beyond state-of-the-art in order to test the advanced lasers and optoelectronic signal sources being developed within DAHI."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MS-01"
                    },
                    "ProjectTitle": {
                        "val": "MATERIALS SCIENCES"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "93.010"
                        },
                        "CurrentYear": {
                            "val": "73.077"
                        },
                        "BudgetYearOne": {
                            "val": "70.368"
                        },
                        "BudgetYearOneBase": {
                            "val": "70.368"
                        },
                        "BudgetYearTwo": {
                            "val": "69.966"
                        },
                        "BudgetYearThree": {
                            "val": "72.233"
                        },
                        "BudgetYearFour": {
                            "val": "73.780"
                        },
                        "BudgetYearFive": {
                            "val": "85.138"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project provides the fundamental research that underpins the development and assembly of advanced nanoscale and bio-molecular materials, devices, and electronics for DoD applications that greatly enhance soldier awareness, capability, security, and survivability, such as materials with increased strength-to-weight ratio and ultra-low size, devices with ultra-low energy dissipation and power, novel spectroscopic sources, and electronics with persistent intelligence and improved surveillance capabilities."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Basic Research Congressional Add"
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "5.000"
                                        },
                                        "Text": {
                                            "val": "- Supports increased efforts in basic research that engage a wider set of universities and commercial research communities."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Nanoscale\/Bio-inspired and MetaMaterials"
                                    },
                                    "Description": {
                                        "val": "The research in this thrust area exploits advances in nano\/micro-scale and bio-inspired materials, including computationally based materials science, in order to develop unique microstructures, material properties, and functionalities.  This area also includes efforts to develop the underlying science for the behavior of materials whose properties have been engineered at the nano\/micro-scale level, including metamaterials, bio-inspired materials for sensing and actuation, and materials that are designed to mimic biological materials from molecular to macroscopic function.  Specific examples of areas of interest include materials that can self-repair, adapt, and respond for soldier protection against chemical and biological threats and optical based metamaterial imaging systems capable of detecting objects in cluttered environments and around or through structural obscurants."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.205"
                                            },
                                            "Text": {
                                                "val": "-  Designed materials with decoupled property combinations (e.g., strength\/density, stiffness\/thermal expansion) using architecture-to-property trade space capability. \n-  Demonstrated fabrication methods amenable to scaling and that permit architectural control capable of maintaining decoupled properties. \n-  Demonstrated targeted enhancement to material properties (e.g., tailored coefficient of thermal expansion (CTE)\/energy dissipation and load bearing stiffness). \n-  Established manufacturability and amenability to scale up and provided fabrication and characterization data package. \n-  Initiated development of synthetic methods for preparing large sequence controlled polymer libraries."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.500"
                                            },
                                            "Text": {
                                                "val": "-  Develop a method for screening non-natural polymer libraries for designed properties such as binding to target molecules. \n-  Develop a method for sequencing non-natural polymers at low concentrations. \n-  Explore and develop modeling tools for the physics of scattering in metamaterials and the application of using ultra-short laser pulses to see and detect objects through various obscurants."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.750"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.750"
                                            },
                                            "Text": {
                                                "val": "-  Use non-natural polymer synthesis and screening system to create affinity reagents against DARPA defined targets. \n-  Develop strategy to adapt the non-natural polymer synthesis and screening system to generate catalysts. \n-  Investigate engineered optical metamaterials for manipulating optical fields in spatial, spectral and temporal domains to enable a single optical device to simultaneously perform multiple functions in different domains. \n-  Investigate linear refraction metamaterials for minimizing optical aberrations and improving performance of imaging and non-imaging optics over wide angles of light incidence, while minimizing optics size and weight."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Fundamentals of Nanoscale and Emergent Effects and Engineered Devices"
                                    },
                                    "Description": {
                                        "val": "The Fundamentals of Nanoscale and Emergent Effects and Engineered Devices program seeks to understand and exploit a broad range of physical properties and new physics that emerge as a result of material and\/or device structure and organization at nano-scale dimensions and\/or at extreme temperature and pressure.  There are a wide variety of material properties that currently exist only at the nanoscale including quantized current-voltage behavior, very low melting points, high specific heats, large surface to volume ratio, high efficiency catalysis, enhanced radiative heat transfer, and correlated electron effects that arise in low dimensional systems.  In addition, extreme high pressure conditions can lead to new material polymorphs or phases with dramatically enhanced physical, mechanical and functional properties.  The focus of this thrust is to further characterize these emergent properties and to identify new synthesis approaches to enable access to these properties in stable, bulk material systems suitable for a wide range of DoD applications.  The insights gained from research performed under this thrust will enable new, more efficient, and powerful material and device architectures that will benefit many DoD applications including controllable photonic devices that operate over multiple wavelengths, ultra-high sensitivity magnetic sensors, high-throughput biochemical sensors for known and unknown (engineered) molecules, advanced armor, ultra-precision air and water purification systems, and advanced armor protection."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.500"
                                            },
                                            "Text": {
                                                "val": "-  Validated computational tools against known high-pressure materials and developed multistep pathways to selected extended solids. \n-  Applied synthesis techniques to, and initiated synthesis of, intermediates projected to lead to selected extended solids. \n-  Initiated development of methods to stabilize extended solids at ambient temperatures and pressures."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.300"
                                            },
                                            "Text": {
                                                "val": "-  Continue synthesis of suites of intermediates to lead to selected extended solids. \n-  Characterize the physical, structural, and chemical properties of intermediates synthesized. \n-  Further the development of methods to stabilize extended solids at ambient temperatures and pressures. \n-  Based on computational analysis and experimental results, initiate design retrosynthetic pathways that are synthetically achievable for multistep reaction schemes to fabricate extended solids at reduced pressures. \n-  Identify novel approaches for enabling 3 dimensional (3D) assemblies of nanoscale material constructs into micron-scale structures while preserving desirable nanoscale material properties.\n-  Select candidate nanoscale material systems with superior material properties that are amenable to 3D assembly processes.   \n-  Identify promising \"pick and place\" technologies for assembling 3D micron-scale constructs into cm-scale structures."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.503"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.503"
                                            },
                                            "Text": {
                                                "val": "-  Continue development of methods to stabilize extended solids at ambient temperatures and pressures. \n-  Demonstrate synthesis and stability to ambient temperature and pressure of high density extended carbon based materials (e.g., clathrates, allotropes, and oxides) at the multimilligram scale. \n-  Demonstrate methods to synthesize bulk cubic boron nitride at reduced pressure with purities of >50%.  \n-  Refine and implement development of retrosynthetic pathways that are synthetically achievable for multistep reaction schemes to fabricate extended solids at reduced pressures based on computational analysis and stabilization results. \n-  Demonstrate the ability to assemble micron-scale, 3D, multiple material structures from nanoscale material constructs while preserving desirable nanoscale material properties. \n-  Demonstrate pick and place assembly of cm-scale materials from micron-scale constructs while preserving desirable nanoscale material properties."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Basic Photon Science"
                                    },
                                    "Description": {
                                        "val": "The Basic Photon Science thrust is examining the fundamental science of photons, and their interactions in integrated devices, from their inherent information-carrying capability (both quantum mechanically and classically), to novel modulation techniques using not only amplitude and phase, but also orbital angular momentum.  The new capabilities driven by this science will impact DoD through novel approaches to communications, signal processing, spectroscopic sensing, and imaging applications.  For example, fully exploiting the computational imaging paradigm and associated emerging technologies will ultimately yield ultra-low size, weight, and power persistent\/multi-functional intelligence, surveillance, and reconnaissance systems that greatly enhance soldier awareness, capability, security, and survivability.  One focus of this thrust is to explore approaches for optical frequency division and harmonic generation for applications such as time distribution from ultrastable optical clocks, ultra-low phase noise microwaves, frequency references, and table-top sources of coherent X-rays, isolated attosecond pulses, and intense neutron sources for medical and non-medical applications.  In addition, this thrust will pursue novel, chip-scale optical frequency comb sources and associated technologies throughout the electromagnetic spectrum for spectroscopic sensing and demonstrate their performance with proof-of-concept studies in targeted applications.  These sources will enable and spawn entirely new fields in simultaneous remote sensing, identification, and quantification of multiple trace materials in spectrally cluttered backgrounds."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.889"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated quantum mechanically secure communications at a secure key information rate greater than 50 Mb\/s and 5 bits per received photon. \n-  Demonstrated a 30 gigahertz (GHz) oscillator using optical frequency division with a micro-frequency comb. \n-  Demonstrated continuous wave operation of a monolithic solid-state laser with milliwatt average output power for integration into a rack mountable ultra-low noise microwave source. \n-  Fabricated silicon nitride microresonators and bulk electro-optically generated frequency comb sources with multiple comb lines for pulse shaping applications including RF photonic filtering. \n-  Designed pump and seed lasers for optical parametric chirped pulse amplification for improved X-ray generation efficiency in the water window spectral region. \n-  Demonstrated pump lasers with pulse energies of 2 joules at 800 nanometers and 1 millijoule at 1.8 micron wavelengths for efficient extreme ultraviolet and soft X-ray attosecond pulse generation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.400"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate 30 (GHz) microwave output from a silica disk microresonator-based optical frequency comb and high power photodiodes for chip-based, ultra-low phase noise microwave generation. \n-  Demonstrate on-chip frequency comb and pulse shaping components utilizing indium phosphide based photonic integrated circuit technology and evaluate with bulk scale reference combs. \n-  Demonstrate high flux soft X-ray production in the biologically critical water window spectral region and use this source for preliminary X-ray imaging demonstrations on the nanometer scale in the water window.\n-  Demonstrate high efficiency-per-shot laser driven neutron production and construct increased repetition rate sample target inserter and laser amplifiers to improve overall neutron flux for radiography applications. \n-  Demonstrate and control ultra-high intensity, long wavelength lasers, which can be used to generate high average power, high energy isolated attosecond (the timescale of electron dynamics in atoms and molecules) optical pulses. \n-  Develop and control micro-resonator based frequency comb sources in the visible and mid-infrared spectral region. \n-  Demonstrate proof-of-concept studies of coherent control concepts for frequency comb based spectroscopic sensing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "22.100"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "22.100"
                                            },
                                            "Text": {
                                                "val": "-  Design a rack mounted package for mode-locked laser based optical frequency division microwave source. \n-  Demonstrate RF photonic bandpass filtering with micro-resonator optical frequency combs.\n-  Demonstrate a remotely operating quartz microwave oscillator slaved via optical frequency comb based free-space (wireless) time and frequency transfer.  \n-  Demonstrate femtosecond time-resolved imaging at the nanometer scale with soft X-rays generated via high harmonic generation (tabletop scale X-ray source).  \n-  Finalize laser design and optimize neutron generation source for laser-driven neutron generation.\n-  Demonstrate stability and characterization capabilities of EUV\/Soft X-ray attosecond end-station by measuring and characterizing isolated attosecond (10^-18 seconds) pulses. \n-  Demonstrate proof-of-concept for micro-resonator based comb sources in the ultraviolet spectral region. \n-  Demonstrate proof-of-concept for micro-resonator based comb sources in the far-infrared and THz spectral regions. \n-  Demonstrate massively parallel spectroscopy for the detection of multiple trace species using micro-resonator based optical frequency combs in multiple spectral regions in a lab setting."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enabling Quantum Technologies"
                                    },
                                    "Description": {
                                        "val": "This thrust emphasizes a quantum focus on technology capabilities including significantly improved single photon sources, detectors, and associated devices useful for quantum metrology, communications, and imaging applications.  It will also exploit novel optical nonlinearities that can be used to combine quantum systems with classical coherent pulses to enable secure quantum communications over conventional fiber at rates compatible with commercial telecommunications.  In addition, this thrust will examine other novel classes of materials and phenomena such as plasmons or Bose-Einstein Condensates (BEC) that have the potential to provide novel capabilities in the quantum regime, such as GPS-independent navigation via atom interferometry and communications, and ultrafast laser technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "30.543"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated a single diamond nitrogen vacancy magnetometer with < 10 nm resolution that is compatible with imaging biological systems. \n-  Validated the performance of a compact (< 10 liters) portable optical clock with a timing accuracy 10 times better than satellite GPS clocks. \n-  Demonstrated prototypes for macroscopic quantum communications systems at secure long haul communications distances. \n-  Derived optimal decoupling between secure bit rate and loss in long-haul quantum communications. \n-  Implemented macroscopic quantum communications testbed capable of simulating realistic conditions (loss, noise, and decoherence) through the modern fiber-optic telecommunications grid."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.877"
                                            },
                                            "Text": {
                                                "val": "-   Develop compact optomechanical gyroscopes. \n-   Demonstrate 50 nm resolution for magnetic imaging of living cells.\n-  Sense functional changes of electronic spin labels in biomolecules (e.g., proteins, lipids) with high spatial and temporal resolution. \n-  Validate optimized performance of slow-beam-optical-clock.\n-  Integrate prototype macroscopic quantum communications system into quantum communications testbed. \n-  Quantify performance of prototype macroscopic quantum communications system under realistic conditions (loss, noise, decoherence) and over secure long haul communications distances. \n-  Develop an initial mathematical modeling framework for predicting the emergence of quantum behavior in complex systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.015"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.015"
                                            },
                                            "Text": {
                                                "val": "-  Explore analytical techniques for characterizing the emergence of quantum effects in complex systems across scales of time and space.\n-  Design an open source, agent based hardware\/software platform for evaluating algorithms for modeling quantum effects in complex systems across multiple scales."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Fundamentals of Physical Phenomena"
                                    },
                                    "Description": {
                                        "val": "The thrust obtained insights into physical aspects of natural phenomena such as magnetospheric sub-storms, fire, lightning, and geo-physical phenomena.  New fundamental understandings of these phenomena have enabled the ability to predict and exploit these physical processes.  A major emphasis of this thrust was to provide predictive models for the interactions between plasmas and electromagnetic waves across a range of energy and length scales, and into new regimes.  Specific efforts that fell under this heading were foundational studies on the initiation, propagation, and attachment of lightning, and their associated emissions; the critical factors affecting magnetospheric sub-storms; and understanding and quantifying the interaction of electromagnetic and acoustic waves with the plasma in flames."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.873"
                                            },
                                            "Text": {
                                                "val": "-  Gathered in-situ measurements of oceanic lightning e-fields, current and X-rays using synchronized unmanned air vehicle (UAV), balloon, buoy and lighting mapping array.  \n-  Measured electron density within the D region of the ionosphere by measuring the aperiodic irregularities (API) structures formed by high frequency (HF) standing waves from the upward and downward propagating heater beam. \n-  Experimentally measured plasma outflow by HF heating, lower hybrid and Whistler waves generation, very low frequency (VLF) waves generation and propagation into space."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MesoDynamical Architectures (Meso)"
                                    },
                                    "Description": {
                                        "val": "The Meso program exploited recently discovered physics at small scales to demonstrate transformative communication, sensing, and computing technologies for the DoD.  The length scale targeted was between the nanoscale and macroscale, known as mesoscale, and is an important intersection between classical and quantum mechanical effects where new combined phenomenon has emerged.  The program was divided into four thrusts: nonlinearity and noise, coherent collective dynamics, information transduction, and coherent feedback control.  In each of these thrusts, performers focused on demonstrating specific technologies that have significant impact on DoD capabilities.  Technologies included high-performance frequency sources, transistors operating at 100 times lower power than current state-of-the-art, a hand-held biotoxin detector, and attojoule optical switches."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.000"
                                            },
                                            "Text": {
                                                "val": "-  Produced the only topological insulator thin (less than 100 nm) materials in the world with topological surface state dominated conduction up to room temperature.  This had previously been observed only at cryogenic temperatures, paving the way for fabrication of practical devices to advance DoD's mission.\n-  Discovered spin torque in topological insulator materials over 10 times larger in magnitude than state-of-art at room temperature, highly promising for advanced memory devices with over 10 times lower power required for switching at the same speed of state-of-art, or switching 10 times faster than state-of-art at the same power.\n-  Demonstrated chip-scale, wavelength insensitive second order Silicon Radio Frequency (RF) photonic filters with ~3 GHz pass-band center frequency, >70 dB of rejection over 66% of the center frequency of operation, and undistorted filter response over high optical powers exceeding 100 mW.  This eliminates fabrication, design and stabilization constraints of state-of-art RF filtering schemes and dramatically reduces size, weight, power and cost to enable dense integration of RF\/Microwave and complementary metal-oxide semiconductor (CMOS) on-chip for nano-Unmanned Aerial Vehicle.\n-  Integrated microfluidic platform and CMOS electronics into the bio-molecular sensor interface by a heterogeneous integration process with demonstrated capability of detecting 1 pM concentration of a toxin in 100 mM background liquid substance without probes or labels.  Detected single mass isotope substitutions in amino acids, and sub-10 pM concentration of a neurotoxin in 500nl of blood serum.  Extended the scientific knowledge developed in the project to quantum-tunneling-based platforms capable of enabling multi-functional memory devices and on-chip clocks.\n-  Fabricated the first piezoelectronic transistor with a promising path toward achieving >10,000 ON\/OFF ratio at 0.1 volts and better processing efficiency than conventional CMOS.  Scaled piezoelectric films with full functionality to 300 nm thickness.  Invented a new micrometer-scale Radio Frequency switch application of the piezoelectronic transistor with the promise of superior performance than alternate hardware implementations.\n-  Demonstrated planar, chip-scale single-photon conversion between near-visible and telecommunication optical bands with high efficiency for microWatts drive power levels.\n-  Designed new coherent nano-photonic circuit architectures capable of tolerating large error rates per individual components, using substantial coherent feedback to prevent quantum fluctuation noise buildup through multiple logic stages.\n-  Fabricated robust nano-photonic circuits with multiple components switching at 100s of picoseconds and femto-Joule energy (or about 100 photons).\n-  Reduced the phase noise of truly Micro Electro-Mechanical Systems (MEMS)\/Nano Electro-Mechanical Systems (NEMS) frequency sources to produce the next generation (Phase 3) of devices with better temperature and acceleration stability in a compact package."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TRS-01"
                    },
                    "ProjectTitle": {
                        "val": "TRANSFORMATIVE SCIENCES"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "31.905"
                        },
                        "CurrentYear": {
                            "val": "29.417"
                        },
                        "BudgetYearOne": {
                            "val": "30.113"
                        },
                        "BudgetYearOneBase": {
                            "val": "30.113"
                        },
                        "BudgetYearTwo": {
                            "val": "28.535"
                        },
                        "BudgetYearThree": {
                            "val": "30.831"
                        },
                        "BudgetYearFour": {
                            "val": "40.377"
                        },
                        "BudgetYearFive": {
                            "val": "42.377"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Transformative Sciences project supports research and analysis that leverages converging technological forces and transformational trends in information-intensive subareas of the social sciences, life sciences, manufacturing, and commerce.  The project integrates these diverse disciplines to improve military adaptation to sudden changes in requirements, threats, and emerging\/converging trends, especially trends that have the potential to disrupt military operations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Living Foundries"
                                    },
                                    "Description": {
                                        "val": "The goal of the Living Foundries program is to create a revolutionary, biologically-based manufacturing platform to provide new materials, capabilities, and manufacturing paradigms for the DoD and the Nation.  With its ability to perform complex chemistries, be flexibly programmed through DNA code, scale, adapt to changing environments and self-repair, biology represents one of the most powerful manufacturing platforms known.  However, the DoD's ability to harness this platform is rudimentary.  Living Foundries seeks to develop the foundational technological infrastructure to transform biology into an engineering practice, speeding the biological design-build-test-learn cycle and expanding the complexity of systems that can be engineered.  The program will enable the rapid and scalable development of previously unattainable technologies and products (i.e., those that cannot be accessed using known, synthetic mechanisms) leveraging biology to solve challenges associated with production of new materials (e.g., fluoropolymers, enzymes, lubricants, coatings and materials for harsh environments), novel functions (e.g., self-repairing and self-regenerating systems), biological reporting systems, and therapeutics to facilitate new solutions and enhancements to military needs and capabilities.  Ultimately, Living Foundries aims to provide game-changing manufacturing paradigms for the DoD, enabling distributed, adaptable, on-demand production of critical and high-value materials, devices and capabilities in the field or on base.  Such a capability will decrease the DoD's dependence on tenuous material supply chains that are vulnerable to political change, targeted attack, or environmental accident.\n\nIf successful, Living Foundries will do for biology what very-large-scale integration (VLSI) did for the semiconductor device industry: enable the design and engineering of increasingly complex systems to address and enhance military needs and capabilities.  Living Foundries will develop and apply an engineering framework to biology that decouples biological design from fabrication, develops and yields design rules and tools, and manages biological complexity through simplification, abstraction, and standardization of both processes and components.  The result will be rapid design, construction, implementation and testing of complex, higher-order genetic networks with programmable functionality and DoD applicability.  Research thrusts include developing the fundamental tools, capabilities and methodologies to accelerate the biological design-build-test cycle, thereby reducing the extensive cost and time it takes to engineer new systems and expanding the complexity and accuracy of designs that can be built.  Specific tools and capabilities include: interoperable tools for design and modeling; automated, modular and standardized fabrication and genome-scale engineering processes; modular regulatory elements, devices and circuits for hierarchical and scalable engineering; standardized test platforms and chassis; and novel approaches to process measurement, validation, and debugging.  Applied research for this program is budgeted in PE 0602715E, Project MBT-02."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.973"
                                            },
                                            "Text": {
                                                "val": "-  Began research and development on incorporation of new, non-natural components into bio-manufactured materials (including non-natural amino acids and an expanded set of atomic elements) to broaden the set of new materials and functions.\n-  Began initial demonstration of automated, genome-scale cellular engineering process platforms that simultaneously increase the scale and complexity of experimentation and decrease the cost and time to engineer a new production system.\n-  Continued research and development of tools and methodologies to program, reprogram, and enable spatio-temporal control and feedback for engineered systems.\n-  Continued to design and assess production pathways for novel materials.\n-  Developed novel algorithms and software that link the design of genetic systems to their assembly and characterization data to begin integrating the design of systems with their construction and ultimate testing\/debugging.\n-  Began development and demonstration of tools to enable engineering of currently intractable chassis for novel and enhanced functionalities and materials production."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.644"
                                            },
                                            "Text": {
                                                "val": "-  Examine design tool innovations to enable forward engineering of novel genetic systems.\n-  Investigate design evaluation tools to enable massively parallel testing, validation, and verification of engineered systems.\n-  Continue development of automated and scalable, large-scale DNA assembly and editing tools and processes.\n-  Research new methods for integrated feedback to exploit high volume data generation and inform future designs and processes."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.750"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.750"
                                            },
                                            "Text": {
                                                "val": "-  Begin demonstrating forward engineering of novel genetic systems using innovative computational design tools. \n-  Implement design evaluation tools for high-throughput testing, validation, and verification of engineered systems. \n-  Implement novel learning systems that enable iterative design of engineered systems using integrated feedback of results to inform subsequent designs. \n-  Incorporate automated and scalable, large-scale DNA assembly, editing tools and processes into automated, integrated design-build-test-learn technologies for engineering novel biological systems.\n-  Develop new chassis for engineering biology for improved metabolic flux for bioproduction."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Open Manufacturing"
                                    },
                                    "Description": {
                                        "val": "The Open Manufacturing program will reduce barriers to manufacturing innovation, speed, and affordability of materials, components, and structures.  This will be achieved by investing in technologies to enable affordable, rapid, adaptable, and energy-efficient manufacturing, to promote comprehensive design, simulation and performance-prediction tools, and exposure to best practices.  The applied research component of this program is funded in PE 0602715E, Project MBT-01 under Materials Processing and Manufacturing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.200"
                                            },
                                            "Text": {
                                                "val": "-  Developed a fundamental understanding of the impact on quality features and parameters to establish process windows for new rapid process technologies.\n-  Developed metrology methods to support probabilistic process modeling in metals additive manufacturing and bonded composite processing.\n-  Developed a fundamental understanding of the interaction between electromagnetic fields and refractory metals and metal matrix composites based on particle size and material."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.197"
                                            },
                                            "Text": {
                                                "val": "-  Develop basic architecture and statistical environment to enable rapid qualification and certification approaches through the interaction and use of probabilistic models for process, design, and materials.\n-  Demonstrate Micro-Induction Sintering (MIS) method for additive manufacture of metal and\/or ceramic materials in complex geometries.\n-  Demonstrate approach to verifying, validating, and quantifying uncertainty in the developed rapid qualification frameworks."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.538"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.538"
                                            },
                                            "Text": {
                                                "val": "-  Characterize material properties of refractory and metal matrix composites produced using micro-induction sintering process.\n-  Develop fundamental process modeling tools for micro-induction sintering process.\n-  Demonstrate approach to integrate the Open Manufacturing rapid qualification frameworks into a comprehensive computational tool."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Biological Robustness in Complex Settings (BRICS)*"
                                    },
                                    "Description": {
                                        "val": "*Formerly ACE (Advanced Capabilities in Engineering Biology)\n\nThe Biological Robustness in Complex Settings (BRICS) program will leverage newly developed technologies for engineering biology towards enabling radical new approaches to solving National Security challenges.  Engineering biology is emerging as a new field focused on developing the tools to harness the powerful synthetic and functional capabilities of biology.  These tools will facilitate design and biological production of new chemicals and materials, sensing capabilities, therapeutics, and numerous other applications.  This rapidly developing technological capability opens the door to new national security applications that have heretofore been out of reach, and offers substantial potential advantages in terms of cost and novel functionality. \n \nFundamental work in this area will focus on understanding the underlying principles of engineering robust and safe microbes and microbial communities that perform as designed over the long-term.  This program has applied research efforts funded in PE 0602715E, Project MBT-02."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.000"
                                            },
                                            "Text": {
                                                "val": "-  Investigate methods to engineer microorganisms that are stable over long time periods under complex growth conditions.\n-  Investigate methods to engineer communities of microorganisms with reliably controlled population dynamics.\n-  Explore methods to rationally engineer functional microbial communities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.825"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.825"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate methods to engineer organisms that are functionally stable over time in changing growth conditions.\n-  Demonstrate methods to engineer complex communities of microorganisms with reliably controlled population dynamics.\n-  Demonstrate methods to rationally engineer functional microbial communities of increasing complexity."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Applying Biological Complexity at Scale"
                                    },
                                    "Description": {
                                        "val": "Applying Biological Complexity at Scale will pursue new insights derived from biological complexity and living-system dynamics to develop applications to enhance global-scale stability, transform hostile environments, and ensure human well-being.  Biological systems operate over an enormous range of spatial, physical, and temporal scales and span individual cells to multi-organism systems.  Enhanced understanding of the basic processes associated with biological network interactions and communication will enable novel approaches and technology development to enhance national security, ranging from infectious disease mitigation or prevention, to predicting and leveraging behavior of microbial populations or even distributed human networks.  Key advances expected from this research will include the identification of stable, scalable features and mechanisms of biological networks.  Such information will allow the determination of a bio-system's state and enable the prediction of state, as well as where there are inflection points that can either be exploited, or that must be preserved in order to maintain equilibrium (e.g., microbial community dynamics and their applications)."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "-  Investigate dynamics and thresholds for transgene stability\/instability in systems of infectious disease vectors.\n-  Study methods for achieving transient phenotypes in infectious disease vectors.\n-  Investigate predictive design rules and engineering approaches for integrated biosystems.\n-  Investigate microbial community evolution and communication as it applies to their application (e.g., microbiome impacts on health or catabolism).\n-  Research large-scale biological system responses to threats and understand defining characteristics of varying ecological states."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Social Media in Strategic Communication (SMISC)"
                                    },
                                    "Description": {
                                        "val": "The Social Media in Strategic Communication (SMISC) program is developing techniques to detect, classify, measure, and track the formation, development, and spread of ideas and concepts (memes) in social media.  These techniques will provide warfighters and intelligence analysts with indications and warnings of adversary efforts to propagate purposefully deceptive messaging and misinformation.  Social media creates vulnerabilities that can be exploited to threaten national security and has become a key operating environment for a broad range of extremists.  SMISC will develop technology and a new supporting foundational science of social networks that will enable warfighters to defend against malevolent use of social media and to counter extremist influence operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.620"
                                            },
                                            "Text": {
                                                "val": "-  Refined algorithms for real-time detection and tracking of memes at scale.\n-  Improved specialized algorithms to recognize purposeful or deceptive messaging and misinformation, persuasion campaigns, and influence operations across social media.\n-  Designed algorithms to identify the minimum set of sensors for a given social system based on models used to predict the social dynamics stability distribution and impact on link characteristics.\n-  Designed scalable, efficient, and accurate social malware detection algorithms.\n-  Extended algorithms developed for text-centric social media and micro-blogging to new social multi-media platforms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.076"
                                            },
                                            "Text": {
                                                "val": "-  Integrate algorithms for meme detection and tracking with algorithms for detecting deception, persuasion, and influence operations.\n-  Develop high fidelity diffusion models for messages, narratives, and information across social media.\n-  Combine integrated algorithms with diffusion models to create predictive simulations for the spread of given messages, narratives, and information.\n-  Refine algorithms for sentiment analysis of content on developing social multi-media platforms."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Vanishing Programmable Resources (VAPR)"
                                    },
                                    "Description": {
                                        "val": "The Vanishing Programmable Resources (VAPR) program will create microelectronic systems capable of physically disappearing (either in whole or in part) in a controlled, triggerable manner.  The program will develop and establish an initial set of materials and components along with integration and manufacturing capabilities to undergird a fundamentally new class of electronics defined by their performance and transience.  These transient electronics ideally should perform in a manner comparable to Commercial Off-The-Shelf (COTS) systems, but with limited device persistence that can be programmed, adjusted in real-time, triggered, and\/or sensitive to the deployment environment.  Applications include sensors for conventional indoor\/outdoor environments (buildings, transportation, and materiel), environmental monitoring over large areas, and simplified diagnosis, treatment, and health monitoring in the field.  VAPR will explore transience characteristics of electronic devices and materials as well as build out an initial capability to make transient electronics a deployable technology for the DoD and Nation.  The technological capability developed through VAPR will be demonstrated through a final test vehicle of a transient sensor with RF link.\n\nA basis set of transient materials and electronic components with sufficient electronic and transience performance is needed to realize transient electronic systems for environmental sensing and biomedical applications.  Research and development of novel materials for implementing basic transient electronic components (actives and passives), power supply strategies, substrates and encapsulants as well as development of modes and triggers for transience will form the core of fundamental research activities.  Transient components and devices developed in this technical area will form the basis for advanced functional circuit blocks and test systems to be developed in PE 0602716E, Project ELT-01."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.112"
                                            },
                                            "Text": {
                                                "val": "-  Characterized transience of alternative semiconductors and other electronic materials for device components.\n-  Began developing multiple transience mechanisms, including demonstrating mechanically, electrically, and optically triggered transience.\n-  Began developing electronic materials that exhibit a useful combination of transience and the necessary physical characteristics required for sufficient electronic performance.\n-  Developed polycarbonate-based materials, stress-engineered substrates, hydrogels, and Complementary-Metal-Oxide-Semiconductor (CMOS) process-comparable thin films to allow fast etching, dissolution, sublimation, and fragmentation mechanisms for control of transience effects.\n-  Developed mechanical, stress, corrosion rate modeling tools to predict transience effects.\n-  Initiated the systematic study of novel transient packaging materials."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.500"
                                            },
                                            "Text": {
                                                "val": "-  Establish electronic materials that exhibit a useful combination of transience and the necessary physical characteristics required for sufficient electronic performance.\n-  Enhance device modeling tools that incorporate transience effects."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                }
            ]
        }
    }
}