{
    "id": "3f21d153de7683e0353879ec6c8502396fa38e9b",
    "meta": {
        "filename": "dod-2016_RDTE_2016_DTRA_RDTE_JustificationBook_Defense_Threat_Reduction_Agency_PB_2016.zzz_unzipped_RDTE_JustificationBook_Defense_Threat_Reduction_Agency_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Defense Threat Reduction Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605000BR"
        },
        "ProgramElementTitle": {
            "val": "WMD Defeat Capabilities"
        },
        "R1LineNumber": {
            "val": "121"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Threat Reduction Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "58.555"
            },
            "PriorYear": {
                "val": "12.511"
            },
            "CurrentYear": {
                "val": "6.887"
            },
            "BudgetYearOne": {
                "val": "7.156"
            },
            "BudgetYearOneBase": {
                "val": "7.156"
            },
            "BudgetYearTwo": {
                "val": "7.340"
            },
            "BudgetYearThree": {
                "val": "7.437"
            },
            "BudgetYearFour": {
                "val": "7.563"
            },
            "BudgetYearFive": {
                "val": "7.715"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "*Project RF-Detection and Forensics Technologies subdivides into projects RD-Detection Technologies and RF-Forensics Technologies beginning in FY 2016.  This impacts these projects in PE 0602718BR and PE 0603160BR.  See C. Other Program Funding Summary below.\n*Integrated Weapons of Mass Destruction Toolset investments are to be completed in FY 2014."
        },
        "ProgramElementMissionDescription": {
            "val": "The mission of the Defense Threat Reduction Agency is to safeguard the United States and its allies from global weapons of mass destruction (WMD) threats by integrating, synchronizing, and providing responsive expertise, technologies, and capabilities.  This mission directly aligns with several National and Department of Defense (DoD) level guidance\/vision documents. For Research, Development, Test & Evaluation, these documents include the National Security Strategy, Defense Strategic Guidance (Sustaining U.S. Global Leadership: Priorities for 21st Century Defense), Quadrennial Defense Review, National Strategy for Combating Terrorism, 2014 DoD Strategy for Countering WMD, National Strategy to Combat WMD, Defense Planning Guidance, Guidance for Employment of the Force, National Military Strategic Plan for the War on Terrorism, and Joint Strategic Capabilities Plan (including the Nuclear Annex).  To achieve this mission, DTRA established strategies and tasks to meet their principal objectives.  These objectives are: 1) Ensure a safe, secure, and effective nuclear deterrent; 2) Anticipate emerging WMD threats; 3) Provide Combating WMD situational awareness; 4) Assess infrastructure and personnel vulnerabilities; 5) Prevent proliferation and use of WMD; 6) Defend against WMD threats; 7) Defeat WMD threats; 8) Recover from WMD consequences; and 9) Synchronize countering WMD activities. \n\nThis program element supports the development of system capabilities for the countering weapons of mass destruction (CWMD) mission.  This funding specifically supports technologies to meet International Monitoring System technology requirements in support of nuclear arms control activities under the Nuclear Arms Control Technology program. Through FY 2014, funding also supported the development of collaborative CWMD analysis capabilities between the DoD and key interagency and international partners through a globally accessible net-centric framework in the form of the Integrated Weapons of Mass Destruction Toolset."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "12.901"
                },
                "CurrentYear": {
                    "val": "6.887"
                },
                "BudgetYearOne": {
                    "val": "7.156"
                },
                "BudgetYearOneBase": {
                    "val": "7.156"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "12.511"
                },
                "CurrentYear": {
                    "val": "6.887"
                },
                "BudgetYearOne": {
                    "val": "7.156"
                },
                "BudgetYearOneBase": {
                    "val": "7.156"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.390"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.390"
                    }
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "RF"
                    },
                    "ProjectTitle": {
                        "val": "Forensics Technologies"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "6.867"
                        },
                        "CurrentYear": {
                            "val": "6.887"
                        },
                        "BudgetYearOne": {
                            "val": "7.156"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.156"
                        },
                        "BudgetYearTwo": {
                            "val": "7.340"
                        },
                        "BudgetYearThree": {
                            "val": "7.437"
                        },
                        "BudgetYearFour": {
                            "val": "7.563"
                        },
                        "BudgetYearFive": {
                            "val": "7.715"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "*Project RF-Detection and Forensics Technologies subdivides into projects RD-Detection Technologies and RF-Forensics Technologies beginning in FY 2016."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project supports the development of verification and monitoring capabilities for the Defense Threat Reduction Agency (DTRA) to counter proliferation and weapons of mass destruction (WMD).  DTRA’s Nuclear Arms Control Technologies (NACT) program performs Research, Development, Test, and Evaluation (RDT&E) to improve the sustainability, reliability, and effectiveness of capabilities related to its operational mission to install, operate, maintain, and sustain the waveform and radionuclide nuclear detonation detection stations comprising the U.S. portion of the International Monitoring System (IMS).  This delivers data to the U.S. monitoring and verification community and enables U.S. compliance with the Comprehensive Nuclear-Test-Ban Treaty (CTBT) in support of U.S. and Department of Defense (DoD) nonproliferation objectives.  \n  \nThe project addresses WMD monitoring, implementation of, and compliance with arms control agreement requirements validated by the Office of the Under Secretary of Defense, Acquisition, Technology, and Logistics.  This project conforms to the administration’s research and development priorities related to WMD arms control and disablement.  Technical assessments are made against CTBT implementation requirements and U.S. objectives to provide the basis for sound project development, evaluate existing programs, provide data required to inform compliance assessments and support U.S. monitoring policy, decision-makers, and negotiation teams. \n \nThe primary RDT&E program emphasis is on improvements that enable the installation of treaty-specific stations, which reduce costs and increase the reliability in diverse and often harsh environments; improve efficiency, performance, reliability, and sustainability of existing stations and treaty-specified verification capabilities; and improve capabilities to detect, characterize, and enable discrimination of, nuclear weapons tests.  The NACT program directly supports U.S. and allied warfighter and national technical monitoring requirements and provides vital data used by the treaty monitoring community, warfighter planners, DoD, other U.S. Government agencies, and international agencies.  \n\nThe increase from FY 2015 to FY 2016 is for an enhanced level of investment in research on radionuclide sampling and analytical capabilities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RF -  Forensics Technologies"
                                    },
                                    "Description": {
                                        "val": "Project RF supports the NACT Program, conducting RDT&E to meet IMS technology requirements in support of CTBT implementation, compliance, monitoring, inspection, and other emerging nuclear arms control activities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.867"
                                            },
                                            "Text": {
                                                "val": "- Supported Office of the Secretary of Defense (OSD) treaty management objectives and participation in joint U.S.-International Comprehensive Test Ban Office Provisional Technical Secretariat sponsored technology development exchanges and developmental exercises in support of technology development and IMS operations and maintenance objectives.  \n- Developed prototype sensor, station calibration, and metrology planning. \n- Developed monitoring station array element calibration with focus on developing in-situ array calibration and performance monitoring capabilities.  \n- Conducted signal capture and identification studies to reduce signal clutter and false alarms; and improve noise rejection methods and algorithms.\n- Continued radio-xenon gas detection system development and research.  Studied and evaluated atmospheric and subsurface xenon backgrounds and transport phenomenon.  \n- Continued a study of baseline noble gas detection schemes.  Selected the pathway for future radio-xenon detection options providing enhanced detection and operational capabilities and reliability.  \n- Completed infrasound information system enhancements and development of infrasound propagation models to improve detection, identification, and discrimination of sources and signatures of interest.\n- Conducted field experiments to collect data required to constrain and validate models.  Models will include fine-scale atmospheric conditions, topography, 3-D winds and effects of non-linear propagation.\n- Continued to develop a portable\/rapid deployable infrasound array and standard sound source for calibrating infrasound stations\/arrays.\n- Continued research and development on support system to collect and prioritize station operator requirements to inform required design-build-test activities across the monitoring system.  \n- Continued U.S. IMS sensor event signal identification technique research and development of the transportable xenon laboratory (TXL) and associated xenon detection system and prepare for international deployment exercises and demonstrations.  Work performed in advance of the TXL foreign deployment will establish a baseline for this xenon monitoring capability and provide unique opportunities to diagnose and resolve remaining technical concerns and issues, including investigating the “memory effect” recently encountered in these systems as a result of the unintended radio-xenon releases from the Fukushima reactors.  Continued infrasound event clutter and false alarm reduction and noise mitigation analyses.  \n- Drove improvements in radionuclide detection and measurement, including xenon gas collection\/analysis systems research.  Evaluate detection limits, and yields.  Technical requirements continue to dictate that the U.S. radionuclide laboratory (RL-16) gas system requires additional capability to meet required detection thresholds.  \n- Develop test methods to increase xenon gas yields, improve detection efficiencies, and decrease dead volume.  To ensure RL-16 is making a high precision measurement, analysis samples will be peer reviewed and calibrated at certified laboratories."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.887"
                                            },
                                            "Text": {
                                                "val": "- Continue to improve the sustainability, reliability, and effectiveness of the 36 IMS stations\n- Complete Provisional Technical Secretariat certification of U.S. IMS Infrasound monitoring station on Wake Island and Auxiliary Seismic monitoring station on Shemya Island, Alaska.\n- Continue to improve U.S. IMS operations efficiency, capabilities, and quality of monitoring data and decrease false alarms. \n- Continue support of OSD treaty management objectives. \n- Continue participating in International Comprehensive Test Ban Office Provisional Technical Secretariat sponsored technology development exchanges and field exercises. \n- Continue research and development to inform required design-build-test activities across the monitoring system.    \n- Continue IMS prototype sensor and station calibration capabilities development.\n- Continue development of monitoring station in-situ calibration and performance monitoring capabilities.\n- Continue performing experiments or field demonstrations to evaluate monitoring system performance. \n- Continue to enhance baseline radionuclide particulate and noble gas detection capabilities, efficiency, and reliability.  \n- Continue development and calibration of infrasound and seismic propagation models. \n- Continue field experiments to collect data required to calibrate and constrain and validate IMS relevant propagation models.  \n- Continue U.S. IMS sensor event signal identification technique research and development of the transportable xenon laboratory."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.156"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.156"
                                            },
                                            "Text": {
                                                "val": "- Continue support of OSD Threat Reduction and Arms Control treaty management objectives. \n- Continue development and implementation of IMS sensor and station calibration capabilities.\n- Continue development and implementation of in-situ calibration concepts.\n- Participate in CTBT Organization Provisional Technical Secretariat sponsored technology development exchanges.\n- Sponsor U.S. specific technology development exchanges.\n- Develop and implement U.S. IMS specific life-cycle management software to enable costs effective and efficient spare part replacement and long-range recapitalization.\n- Develop and implement concepts to improve the reliability of the radionuclide stations.\n- Develop and implement concepts to improve radionuclide and infrasound signal to noise.\n- Improve and develop system of health monitoring software."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "23\/0602718BR"
                                    },
                                    "Title": {
                                        "val": "WMD Defeat Technologies"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "34.595"
                                        },
                                        "CurrentYear": {
                                            "val": "35.061"
                                        },
                                        "BudgetYearOne": {
                                            "val": "9.547"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "9.547"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "10.128"
                                        },
                                        "BudgetYearThree": {
                                            "val": "10.443"
                                        },
                                        "BudgetYearFour": {
                                            "val": "10.684"
                                        },
                                        "BudgetYearFive": {
                                            "val": "10.899"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "30\/0603160BR"
                                    },
                                    "Title": {
                                        "val": "Proliferation Prevention and Defeat"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "73.919"
                                        },
                                        "CurrentYear": {
                                            "val": "66.707"
                                        },
                                        "BudgetYearOne": {
                                            "val": "38.427"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "38.427"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "39.725"
                                        },
                                        "BudgetYearThree": {
                                            "val": "40.219"
                                        },
                                        "BudgetYearFour": {
                                            "val": "41.414"
                                        },
                                        "BudgetYearFive": {
                                            "val": "42.242"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Assess government, academic, and industrial performers and make selections based upon a \"best fit for task\" criteria.   Common government awardees include DoD Service Laboratories and the Department of Energy National Laboratories."
                        },
                        "PerformanceMetrics": {
                            "val": "The goal of the NACT RDT&E program is to enable full compliance of all emerging data quality requirements and other requirements as documented in CTBT treaty language, CTBT-issued Radionuclide and Waveform Operations Manuals, and other CTBT Organization communications.  RDT&E is conducted in support of NACT’s operational mission to operate, maintain, and sustain the Provisional Technical Secretariat certified waveform and radionuclide CTBT monitoring stations in accordance with CTBT requirements. CTBT IMS data availability\/timeliness performance specifications\/requirements are currently 98% data availability for IMS waveform and 95% for IMS radionuclide systems.  Data quality metrics continue to evolve as the entire CTBT IMS capability is exercised and tested."
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "The Defense Threat Reduction Agency (DTRA) Nuclear Arms Control program installs, operates, maintains, and sustains the waveform and radionuclide nuclear detonation detection stations comprising the U.S. portion of the International Monitoring Systems (IMS) in order to deliver data to the U.S. monitoring and verification community and to enable U.S. compliance to the terms of the Comprehensive Nuclear-Test-Ban Treaty (CTBT) in support of U.S. and Department of Defense (DOD) nonproliferation objectives.  The project addresses weapons of mass destruction (WMD) monitoring requirements validated by the Office of the Under Secretary of Defense, Acquisition, Technology, and Logistics.  This project conforms to the administration’s research and development priorities as related to WMD arms control and disablement. Technical assessments are made against CTBT implementation requirements and U.S. objectives to provide the basis for sound project development, evaluate existing programs, and provide the data required to inform compliance assessments, and support U.S. monitoring policy and decision-makers, and negotiation teams.  NOTE:  As this program and its requirements mature and legacy contract vehicles expire, the composition of the performer base under DTRA program management will be dynamic."
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Radionuclide Analysis Technology"
                                                },
                                                "FundingVehicle": {
                                                    "val": "FFRDC"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Pacific Northwest National Laboratory"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Richland, WA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.317"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-06"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-06"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-06"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "4.480"
                                                    },
                                                    "TotalCost": {
                                                        "val": "8.797"
                                                    },
                                                    "TargetValue": {
                                                        "val": "8.797"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Waveform Analysis Technology"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Space and Missile Defense Labs"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Huntsville, AL"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.669"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-08"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.669"
                                                    },
                                                    "TargetValue": {
                                                        "val": "1.669"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Radionuclide Analysis Improvements"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "General Dynamics"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Fairfax, VA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-06"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.500"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "2.240"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.740"
                                                    },
                                                    "TargetValue": {
                                                        "val": "3.740"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Waveform Analysis Improvements"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-04"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.500"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-04"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "2.240"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.240"
                                                    },
                                                    "TargetValue": {
                                                        "val": "3.240"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Waveform Testing and Analysis"
                                                },
                                                "FundingVehicle": {
                                                    "val": "FFRDC"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Sandia National Laboratory"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Albuquerque, NM"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.506"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.506"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.506"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.506"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "2.267"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.785"
                                                    },
                                                    "TargetValue": {
                                                        "val": "3.785"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Sample Analysis"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Air Force Technical Application Center"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Patrick AFB, FL"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.800"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-08"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.800"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-08"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.800"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.800"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-08"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "3.552"
                                                    },
                                                    "TotalCost": {
                                                        "val": "5.952"
                                                    },
                                                    "TargetValue": {
                                                        "val": "5.952"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Infrasound Standards and Improvements"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "4.480"
                                                    },
                                                    "TotalCost": {
                                                        "val": "6.480"
                                                    },
                                                    "TargetValue": {
                                                        "val": "6.480"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Deficiency Improvement Research & Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.481"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.750"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.750"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "5.880"
                                                    },
                                                    "TotalCost": {
                                                        "val": "9.111"
                                                    },
                                                    "TargetValue": {
                                                        "val": "9.111"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering & Technical Services"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TASC, Inc."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Chantilly, VA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.800"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.800"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.800"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.800"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "3.584"
                                                    },
                                                    "TotalCost": {
                                                        "val": "5.984"
                                                    },
                                                    "TargetValue": {
                                                        "val": "5.984"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "A&AS Support to Program Office"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TASC, Inc."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Chantilly, VA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.200"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2015-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.888"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.488"
                                                    },
                                                    "TargetValue": {
                                                        "val": "1.488"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Travel"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.075"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.100"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.100"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.100"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.444"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.719"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.719"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Nuclear Arms Control Technology (NACT)"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Waveform and radionuclide monitoring capability enhancements"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "System reliability and availability enhancements"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "System operations and efficiency improvements"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "RL"
                    },
                    "ProjectTitle": {
                        "val": "Nuclear & Radiological Effects"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "58.555"
                        },
                        "PriorYear": {
                            "val": "5.644"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "64.199"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Efforts in this Project were completed in FY 2014. Under Project RL, the Net-Centric Architecture program integrated legacy capabilities and facilitated data sharing through a net-centric framework. It provided near-real time collaborative analysis capabilities between the Department of Defense (DoD) and key interagency and international partners through a globally accessible net-centric framework known as the Integrated Weapons of Mass Destruction Toolset.  This toolset migrated the Defense Threat Reduction Agency's (DTRA's) chemical, biological, radiological, and nuclear modeling and simulation codes to provide an integrated suite of Combating WMD decision support capabilities. The framework was the only operational chemical, biological, radiological, nuclear, and high-yield explosives (CBRNE) framework in the world that provided capabilities through web applications, net-centric web services, and stand-alone mobile deployments which are validated and accredited for operational use by international, National, state, and local authorities.  \n\nThe decrease in FY 2015 is due to the completion of Integrated Weapons of Mass Destruction Toolset investments."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RL: Nuclear & Radiological Effects"
                                    },
                                    "Description": {
                                        "val": "Project RL develops and provides a real-time globally accessible net-centric framework which migrates the DTRA CBRNE modeling and simulation codes to provide an integrated suite of Combating WMD decision support capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.644"
                                            },
                                            "Text": {
                                                "val": "- Installed Integrated Weapons of Mass Destruction Toolset version 3.32 (Joint Collaborative Analysis Model specific components only) at Ministry of National Defense, Republic of China for joint operational training and planning collaboration between U.S. forces and the Republic of China forces.\n- Fielded Integrated Weapons of Mass Destruction Toolset version 3.32 to United States Strategic Command, United Kingdom, Supreme Headquarters Allied Powers Europe, Office of the Secretary of Defense, U.S. Army Nuclear and Combating WMD Agency, and DTRA's Technical Reachback.\n- Broadly deployed Integrated Weapons of Mass Destruction Toolset First Responder Tool (FiRST) iOS and Android application to Department of Homeland Security and DTRA users with consequence assessment mission requirements."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "23\/0602718BR"
                                    },
                                    "Title": {
                                        "val": "WMD Defeat Technologies"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "31.754"
                                        },
                                        "CurrentYear": {
                                            "val": "32.352"
                                        },
                                        "BudgetYearOne": {
                                            "val": "23.053"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "23.053"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "23.769"
                                        },
                                        "BudgetYearThree": {
                                            "val": "23.899"
                                        },
                                        "BudgetYearFour": {
                                            "val": "24.308"
                                        },
                                        "BudgetYearFive": {
                                            "val": "24.794"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The program for Integrated Weapons of Mass Destruction Toolset is executed through a competed cost plus fixed-fee contract.  This contract is a 3-year effort for software development, test, and integration."
                        },
                        "PerformanceMetrics": {
                            "val": "Demonstrate and provide over 80% of the customer-required CBRN modeling and simulation capabilities over networks, e.g., DoD Global Information Grid.  Integrate mission-required legacy DTRA CBRNE codes into a net-centric architecture through a process-controlled verification, validation, and accreditation standards-based method necessary to promote the National Strategy for Countering Biological Threats."
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "All prior year costs and activities for Integrated Weapons of Mass Destruction Toolset (IWMDT), Nuclear Capability Server (NuCS), and Consequence of Execution (COE) were assigned under Project BD of PE 0602716BR.  IWMDT was funded in 2004 by a competitive Cost Plus Award Fee (CPAF) contract for $12.425M over a 3-year period.  At end of FY 2006, its follow-on contract was awarded with an initial $0.300M increment.  IWMDT efforts continued into FY 2013 with $58.555M applied.  The Joint Collaborative Analysis Model, a subcomponent within IWMDT will be openly competed under one of the new DTRA Indefinite Delivery\/Indefinite Quantity contracts for approximately $2.500M for FY  2014."
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "System Development - IWMDT"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Leidos"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Diego, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "20.209"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.071"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-05"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "21.280"
                                                    },
                                                    "TargetValue": {
                                                        "val": "21.280"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "System Development - NuCS"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Applied Research Associates"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Raleigh, NC"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "4.930"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.950"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-06"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "5.880"
                                                    },
                                                    "TargetValue": {
                                                        "val": "5.880"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "System Development - COE"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Titan"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Kingstowne, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "5.533"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "5.533"
                                                    },
                                                    "TargetValue": {
                                                        "val": "5.533"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "System Development - Component Contracts"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "5.073"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "5.073"
                                                    },
                                                    "TargetValue": {
                                                        "val": "5.073"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Configuration Management"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Leidos"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Diego, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.401"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.540"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-05"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.941"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.941"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Software Integration"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Leidos"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Diego, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "6.810"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.740"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-05"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "7.550"
                                                    },
                                                    "TargetValue": {
                                                        "val": "7.550"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Technical Data"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Leidos"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Diego, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.674"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.065"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-05"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.739"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.739"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Engineering Services"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Leidos"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Diego, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.372"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.229"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-05"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.601"
                                                    },
                                                    "TargetValue": {
                                                        "val": "2.601"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Accreditation & Certification"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Leidos"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Diego, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.075"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.312"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-05"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.387"
                                                    },
                                                    "TargetValue": {
                                                        "val": "1.387"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Developmental Test & Evaluation"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Leidos"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Diego, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.410"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.574"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-05"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.984"
                                                    },
                                                    "TargetValue": {
                                                        "val": "2.984"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Operational Test & Evaluation"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFPLOE"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Leidos"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Diego, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.023"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.398"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-05"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.421"
                                                    },
                                                    "TargetValue": {
                                                        "val": "2.421"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TASC, Inc."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Lorton, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.662"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.727"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2014-04"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.389"
                                                    },
                                                    "TargetValue": {
                                                        "val": "3.389"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Travel"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.580"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.038"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2013-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.618"
                                                    },
                                                    "TargetValue": {
                                                        "val": "1.618"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Overhead"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.803"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.803"
                                                    },
                                                    "TargetValue": {
                                                        "val": "2.803"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Integrated Weapons of Mass Destruction Toolset (IWMDT)"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "IWMDT-System Development, Test, and Integration-Phase III"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}