{
    "id": "43a5514271348e5d8fcf1d9c79f7a7d07cbf19fd",
    "meta": {
        "filename": "dod-2016_RDTE_2016_OSD_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2016.zzz_unzipped_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603833D8Z"
        },
        "ProgramElementTitle": {
            "val": "Engineering Science and Technology (S&T)"
        },
        "R1LineNumber": {
            "val": "66"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "18.377"
            },
            "BudgetYearOneBase": {
                "val": "18.377"
            },
            "BudgetYearTwo": {
                "val": "8.761"
            },
            "BudgetYearThree": {
                "val": "9.370"
            },
            "BudgetYearFour": {
                "val": "9.897"
            },
            "BudgetYearFive": {
                "val": "9.964"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This new Program Element (PE) was created to better align the following efforts previously funded in other PE’s: (1) the Modeling and Simulation Management Office project was transferred from PE 0603832D8Z; (2) the Systems Engineering Research Center (SERC), previously funded in PE 0605142D8Z; and (3) the Engineered Resilient Systems effort, previously funded in PE 0602251D8Z, Applied Research for the Advancement of S&T Priorities.  These three activities have been re-aligned to this new PE, Engineering Science and Technology, in order to address Defense Research and Engineering priorities to advance engineering state of the practice, and address complex defense systems challenges through development of engineering capabilities to improve acquisition quality.  Engineering science and technology, including modeling and simulation (M&S), systems engineering (SE) research, and engineering capabilities for resilience, supports the cost-effective acquisition of complex systems in support of the full range and scope of Department of Defense (DoD) missions and operations.\n\nM&S is a key enabler of DoD capabilities; underpins innovative solutions meeting real-world national security challenges; acts as a force multiplier; saves resources; and saves lives.  The DoD Modeling and Simulation Management Office (MSMO), designated by the Under Secretary of Defense for Acquisition, Technology, and Logistics (USD(AT&L)) to be the focal point and advocate for DoD M&S, enhances the DoD M&S Enterprise by (1) enabling cooperation and collaboration in identifying, developing and sustaining modeling and simulation solutions; and (2) promoting technology solutions, including common M&S architectures, standards, and services that improve interoperability, reuse, and cost effectiveness of DoD M&S.\n\nSERC is a University Affiliated Research Center (UARC) established in 2008 as a strategic resource to further systems research and increase its impact on the Department’s ability to meet its mission.  Greatly improved SE methods, processes and tools are essential to the DoD strategy to field systems that are agile, affordably sustainable, flexible, and ready for a full range of contingencies in the face of declining budgets and a shrinking workforce.  The SERC consists of a network of 23 research universities from across the U.S. that work collaboratively to bring the best talent in the nation to bear on DoD’s systems engineering research problems.\n\nEngineered Resilient Systems (ERS) addresses the need for achieving more affordable and mission-resilient warfighting systems designed within a shorter time frame by conducting research and development and new concepts for implementing an integrated suite of modern computational engineering tools, modeling capabilities, and tradespace assessment and visualization tools within an architecture aligned with acquisition and operational business processes.  These integrated tools will operate within a framework that supports data-driven decision-making in an innovative environment that enables advanced knowledge management and multi-community collaboration, including data retention and lessons learned."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "3.520"
                },
                "BudgetYearOneBase": {
                    "val": "3.520"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "18.377"
                },
                "BudgetYearOneBase": {
                    "val": "18.377"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "14.857"
                },
                "BudgetYearOneBase": {
                    "val": "14.857"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Realignment for Higher Priority Programs"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "14.881"
                                },
                                "BudgetYearOneBase": {
                                    "val": "14.881"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumptions"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.024"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.024"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "$10.000 million add in FY 2016 is for Engineering Resilient Systems to focus on mission-relevant trade-space analysis and cost reduction pre-milestone B."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P401"
                    },
                    "ProjectTitle": {
                        "val": "DoD Modeling and Simulation Management Office"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "3.377"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.377"
                        },
                        "BudgetYearTwo": {
                            "val": "3.761"
                        },
                        "BudgetYearThree": {
                            "val": "4.370"
                        },
                        "BudgetYearFour": {
                            "val": "4.897"
                        },
                        "BudgetYearFive": {
                            "val": "4.964"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Modeling and Simulation (M&S) supports the full range and scope of Department of Defense (DoD) missions and operations.  M&S is a key enabler of DoD capabilities; underpins innovative solutions meeting real-world national security challenges, and saves resources. The Under Secretary of Defense for Acquisition, Technology, and Logistics (USD(AT&L)), under the authority of DoD Directive 5134.01, designated the DoD Modeling and Simulation Management Office (MSMO) to be the focal point and advocate for Defense M&S to enhance the Defense M&S Enterprise by (1) enabling cooperation and collaboration in identifying, developing and sustaining modeling and simulation solutions; and (2) promoting technology solutions, including common M&S architectures, standards, and services that improve interoperability, reuse, and cost effectiveness of DoD M&S.  MSMO executes its efforts in accordance with the USD(AT&L)-promulgated DoD Directive 5000.59, “Management of Modeling and Simulation” and DoD Instruction 5000.70, “Management of DoD Modeling and Simulation (M&S) Activities;” and other DoD Issuances, including DoD 4120.24-M, “DoD Standardization Program (DSP) Policies and Procedures” and DoD Instruction 3200.14, “Principles and Operational Parameters of the DoD Scientific and Technical Information Program.”\n\nMSMO is responsible for:\n• Planning, coordinating, and managing funds to support enterprise-level M&S activities that guide the Defense M&S Community to achieve the DoD Strategic Vision for M&S.\n• Bringing together M&S stakeholders to advise and assist on finding solutions for removing the barriers to interoperability, reuse, commonality, efficiency, and effectiveness.\n• Developing, coordinating, and advocating for, with advice and assistance from the DoD M&S Steering Committee, policy\/guidance, technology, standards, best practices, and strategic planning processes that promote interoperability and reuse across the Department.\n \nMSMO also serves as DoD’s:\n• Focal point and advocate for coordinating M&S information exchanges and interactions within DoD, with other U.S. Government departments and agencies, international allies, industry and academia.\n• Lead Standardization Activity (LSA) for managing M&S standards and methodologies."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "DoD Modeling and Simulation Management Office (MSMO)"
                                    },
                                    "Description": {
                                        "val": "MSMO, as the USD(AT&L)-designated focal point for Defense modeling and simulation (M&S), is responsible for maintaining and enhancing policies, standards, technology, and collaboration to ensure the efficiency and effectiveness of the M&S that supports the full range and scope of Defense missions and operations."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.377"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.377"
                                            },
                                            "Text": {
                                                "val": "FY 2016 Plans: \nIn FY 2016, MSMO will:  (1) conduct management and technical support for the Department’s current and long-term M&S needs; (2) respond to opportunities to leverage relevant DoD Information Technology (IT) enterprise capabilities and DoD-, Industry-, and Academia-developed M&S technologies; and (3) continue to advocate an enterprise approach for the future of DoD M&S, maintaining strong engagement and ties with Defense and external community stakeholders.  \n\n Policy and Guidance:\n• Issue updated AT&L-promulgated M&S Issuances and technical guidance.\n\nStandards:\n• Serve as the Lead Standardization Activity for M&S Standards and Methodologies, and\/or lead and participate in relevant DoD and International standards activities.\n\nTechnology:\n• Develop, enhance, and advocate the M&S enterprise suite of tools.\n• Chair M&S Community of Interest.\n\nCollaboration:\n• Represent the U.S. interests in International M&S activities:\n   – Chair TTCP Technical Panel Two (M&S).\n   – Serve as the US Principal Voting Member for NATO M&S Group (NMSG) and participate in NMSG task groups.\n   – Simulation Interoperability Standards Organization.\n• Collaborate with interagency organizations.\n• Continue development and enhancement of the M&S Catalog."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Performance in this program is monitored in the following ways:\n\n- Number of instances where M&S standards, technical best practices, or tools have been adopted or employed. \n- Number of M&S resources (tools, data, and services) made visible or updated in the DoD M&S Enterprise Catalog for reuse and the completeness of each record according to DoD discovery metadata standards. \n- Number of users accessing and completing DoD-sponsored training venues for educating the M&S workforce."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P402"
                    },
                    "ProjectTitle": {
                        "val": "Systems Engineering Research Center"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "5.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.000"
                        },
                        "BudgetYearTwo": {
                            "val": "5.000"
                        },
                        "BudgetYearThree": {
                            "val": "5.000"
                        },
                        "BudgetYearFour": {
                            "val": "5.000"
                        },
                        "BudgetYearFive": {
                            "val": "5.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Systems Engineering Research Center (SERC) is a University Affiliated Research Center (UARC) established in 2008 as a strategic resource to further systems research and increases its impact on the Department’s ability to meet its mission.  Greatly improved SE is essential to fielding  Department's strategy field systems that are agile, affordably sustainable, flexible, and ready for a full range of contingencies in the face of declining budgets and a shrinking workforce.  \n\nThe SERC's network of universities is led by the Stevens Institute of Technology, and includes the Air Force Institute of Technology, Auburn University, Carnegie Mellon University, Georgetown University, Georgia Institute of Technology, Massachusetts Institute of Technology, Missouri University of Science and Technology, Naval Postgraduate School, North Carolina Agricultural and Technical State University, Pennsylvania State University, Purdue University, Southern Methodist University, Texas A&M University, Texas Tech University, University of Alabama, University of California, University of Maryland, University of Massachusetts, University of Southern California, University of Virginia, and Wayne State University.  These Universities work collaboratively to bring the best talent in the nation to bear on DoD’s systems engineering research problems. \n\nThis effort continues execution of the SERC program previously funded in PE 0605104D8Z and PE 0605142D8Z."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Systems Engineering Research Center"
                                    },
                                    "Description": {
                                        "val": "The SERC is a DoD UARC which conducts University-based research that directly supports DoD’s Strategic Plan through development of new systems engineering methods, processes and tools."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "Enhance engineering methods, processes and tools (MPTs) to improve in the following areas:\n\n(1) Systems Engineering Transformation: transform current systems engineering methods to enable rapid, concurrent and scalable definition and affordable development of flexible systems that are responsive to changing threats and missions;\n\n(2) Enterprises and Systems of Systems: create foundational methods to develop and design enterprises and system of systems to provide an overwhelming competitive advantage over our adversaries;\n\n(3) Trusted Systems: secure defense systems from cyber and other threats through systemic security approaches that complement incomplete current perimeter\/network defense methods; and\n\n(4) Human Capital Development: speed the professional development of highly capable systems engineers and technical leaders in the Department and the Defense Industrial Base."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Develop and extend fundamental knowledge, advanced methods, processes and tools and cutting edge techniques for systems engineering of complex designs of relevance to the DoD mission.\n\n    • Promulgation of advanced System Engineering approaches through research publications, presentations and monographs.\n    • Adoption of SERC methods, processes, and tools into DoD component activities."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P403"
                    },
                    "ProjectTitle": {
                        "val": "Engineered Resilient Systems"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "10.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "10.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Engineered Resilient Systems (ERS) addresses the need for achieving more affordable and mission-resilient warfighting systems designed within a shorter time frame.  ERS research and development focuses on new concepts for implementing an integrated suite of modern computational engineering tools, models, simulations and related capabilities, and tradespace assessment and visualization tools within an architecture aligned with acquisition and operational business processes.  These integrated tools will operate within a framework that supports data-driven decision-making in an innovative environment that provides advanced knowledge management, including data retention and lessons-learned, and enables multi-community collaboration.  ERS leverages multi-fidelity physics-based models developed by the S&T community to inform the acquisition decision process (e.g., increased\/easier utilization of High Performance Computing, web-based analysis with large data sets, and lifecycle cost sensitivity analysis).  These new computational and model-based frameworks adapt advanced design and modeling approaches from Government, industry, and academia to enable our Nation to affordably deliver warfighting capability.\n\nThis effort continues execution of the ERS efforts previously funded in PE 0602251D8Z, Applied Research for the Advancement of S&T Priorities and builds upon earlier initial work for the purpose of achieving the goals set forth in the ERS DoD Community of Interest Roadmap.  It is also fully coordinated and aligned with the work in Army PE 0603734A, Military Engineering Advanced Technology (Project T08)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Engineered Resilient Systems (ERS)"
                                    },
                                    "Description": {
                                        "val": "ERS research and development focuses on new concepts for implementing an integrated suite of modern computational engineering tools, models, simulations and related capabilities, and tradespace assessment and visualization tools within an architecture aligned with acquisition and operational business processes.  These integrated tools will operate within a framework that supports data-driven decision-making in an innovative environment that provides advanced knowledge management, including data retention and lessons-learned, and enables multi-community collaboration.  ERS leverages multi-fidelity physics-based models developed by the S&T community to inform the acquisition decision process (e.g., increased\/easier utilization of High Performance Computing, web-based analysis with large data sets, and lifecycle cost sensitivity analysis).  These new computational and model-based frameworks adapt advanced design and modeling approaches from Government, industry, and academia to enable our Nation to affordably deliver warfighting capability."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "Conceptual, Computational, and World-wide Environmental Representation.  Implement surface water and watershed modeling capability to represent effects of hydrological impacts on systems of interest.  Translate and utilize National Geospatial Intelligence Agency Geospatial Information System (GIS) data and common data production standards sponsored by the Modeling and Simulation Management (MSM) Office to build synthetic computational environments.  This effort will be expanded to additional domains of the environment further in the development term.\n\nMission-Relevant Engineering Tradespace Analysis.  Develop next-generation tradespace tools that allow generation of multitudes of designs with many design parameters; within this data-rich space, analytically examine trades in design parameters and system performance across a range of military missions; provide means to visualize results in order to efficiently identify promising designs and key parameters; and incorporate lifecycle cost.  Utilize High Performance Computing (HPC) capability for physics-based modeling of system performance with initial focus on select systems, such as ship platforms.\n\nCollaborative Engineering Analysis and Engineering Decision Making.  Demonstrate and analyze conceptual workflow methods using open standards to link mission-relevant tradespaces and systems engineering tools with operational simulations.  Design and implement initial knowledge management environment for information sharing across DoD networks in preparation for service, agency, and industry use.\n\nCapability Integration and Demonstration.  Conduct a series of focused evaluations across the services, academia, and industry to integrate components of synthetic environments, high-fidelity computational models, and tradespace analysis tools into the ERS architecture. Integrate and demonstrate tools with acquisition community partners.  Identify lessons learned and improve the associated workflows and ERS components."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "• Development of a technological capability for DoD Science and Technology, academia, industry, and the requirements\/acquisition communities to collaborate and provide an innovative and more effective means for tradespace analysis.\n  • Demonstration and evaluation of next-generation tradespace collaboration and analysis tools, documented in analyses and technical reports.\n  • Use of Engineered Resilient Systems tradespace architecture and tools."
                        }
                    }
                }
            ]
        }
    }
}