{
    "id": "44cb0d1903b87badbef2b2f798b5ef446fd2da6e",
    "meta": {
        "filename": "dod-2016_RDTE_2016_DARPA_RDTE_JustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2016.zzz_unzipped_RDTE_JustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0602383E"
        },
        "ProgramElementTitle": {
            "val": "BIOLOGICAL WARFARE DEFENSE"
        },
        "R1LineNumber": {
            "val": "14"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "25.648"
            },
            "CurrentYear": {
                "val": "43.780"
            },
            "BudgetYearOne": {
                "val": "29.265"
            },
            "BudgetYearOneBase": {
                "val": "29.265"
            },
            "BudgetYearTwo": {
                "val": "18.250"
            },
            "BudgetYearThree": {
                "val": "14.014"
            },
            "BudgetYearFour": {
                "val": "13.469"
            },
            "BudgetYearFive": {
                "val": "14.346"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "24.537"
                },
                "CurrentYear": {
                    "val": "44.825"
                },
                "BudgetYearOne": {
                    "val": "52.560"
                },
                "BudgetYearOneBase": {
                    "val": "52.560"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "25.648"
                },
                "CurrentYear": {
                    "val": "43.780"
                },
                "BudgetYearOne": {
                    "val": "29.265"
                },
                "BudgetYearOneBase": {
                    "val": "29.265"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "1.111"
                },
                "CurrentYear": {
                    "val": "-1.045"
                },
                "BudgetYearOne": {
                    "val": "-23.295"
                },
                "BudgetYearOneBase": {
                    "val": "-23.295"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "-1.045"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "1.836"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.725"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-23.295"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-23.295"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2014:  Increase reflects reprogrammings offset by the SBIR\/STTR transfer. \nFY 2015:  Decrease reflects congressional reduction for Section 8024, FFRDC.\nFY 2016:  Decrease reflects termination of chemical weapons defense program."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "BW-01"
                    },
                    "ProjectTitle": {
                        "val": "BIOLOGICAL WARFARE DEFENSE"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "25.648"
                        },
                        "CurrentYear": {
                            "val": "43.780"
                        },
                        "BudgetYearOne": {
                            "val": "29.265"
                        },
                        "BudgetYearOneBase": {
                            "val": "29.265"
                        },
                        "BudgetYearTwo": {
                            "val": "18.250"
                        },
                        "BudgetYearThree": {
                            "val": "14.014"
                        },
                        "BudgetYearFour": {
                            "val": "13.469"
                        },
                        "BudgetYearFive": {
                            "val": "14.346"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Biological Warfare Defense project is budgeted in the Applied Research Budget Activity because its focus is on the underlying technologies associated with the detection, prevention, treatment and remediation of biological, chemical, and radionuclide threats.\n\nEfforts to counter existing and emerging biological, chemical and radiological threats include countermeasures to stop the pathophysiologic processes that occur as a consequence of an attack, host immune response enhancers, medical diagnostics for the most virulent pathogens and their molecular mechanisms, collection of environmental trace constituents to support chemical mapping, tactical and strategic biological, chemical, and radiological sensors, and integrated defense systems.  This program also includes development of a unique set of platform technologies and medical countermeasures synthesis that will dramatically decrease the timeline from military threat detection to countermeasure availability."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Medical Countermeasures"
                                    },
                                    "Description": {
                                        "val": "To further develop an expedited medical countermeasure capability, emerging technologies will be integrated to address the safety and efficacy considerations in the risk\/benefit package necessary to successfully counter naturally emerging or engineered biological warfare threats and new emerging chemical and radiological threats.  These technologies will also be focused on reduction of time, risk, and cost associated with new therapeutic development.  For example, this program will develop in vitro tissue constructs (IVTC) that will emulate human response to therapeutic compounds, thereby significantly reducing the cost and time for evaluating safety and efficacy of therapeutics."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "25.648"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated that the modular platform can be used to predict the kinetics of metabolism and elimination that test compounds are known to exhibit in human physiological systems. \n-  Initiated design and construction of additional modules that are compatible with the expanded set of IVTCs and enable the platform to sustain the integrated IVTCs for two weeks. \n-  Demonstrated that two IVTCs individually responded and reacted to test compounds in a manner consistent with the known effects of those compounds on the corresponding human tissues. \n-  Demonstrated that a modular arrangement of the expanded set of two IVTCs can be used to predict the kinetics of metabolism and elimination that the test compounds are known to exhibit in human physiological systems. \n-  Investigated novel radiation dosimeter approach to mitigate exposure."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "25.780"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate an expanded set of IVTCs able to reproduce the function of four human physiological systems. \n-  Demonstrate an automated prototype system for monitoring the health and response of IVTCs to test compounds. \n-  Design and build additional modules that are compatible with the expanded set of IVTCs and enable the platform to sustain the integrated IVTCs for two weeks. \n-  Demonstrate that the expanded set of four IVTCs individually respond and react to test compounds in a manner consistent with the known effects of those compounds on the corresponding human tissues. \n-  Demonstrate that a modular arrangement of the expanded set of four IVTCs can be used to predict the absorption, distribution, metabolism, and elimination that the test compounds are known to exhibit in human physiological systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.750"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.750"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate an expanded set of IVTCs able to reproduce the function of seven human physiological systems. \n-  Design and build additional modules that are compatible with the expanded set of IVTCs and enable the platform to sustain the integrated IVTCs for three weeks. \n-  Demonstrate that the expanded set of seven IVTCs individually respond and react to test compounds in a manner consistent with the known effects of those compounds on the corresponding human tissues. \n-  Demonstrate that a modular arrangement of the expanded set of seven IVTCs can be used to predict the absorption, distribution, metabolism, and elimination that the test compounds are known to exhibit in human physiological systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Defense Against Mass Terror Threats"
                                    },
                                    "Description": {
                                        "val": "The objective of the Defense Against Mass Terror Threats program is to identify and develop technologies that have the potential to significantly improve U.S. ability to reduce the risk of mass casualties in the wake of a nuclear attack.  Challenges in reducing U.S. vulnerability to a nuclear attack include monitoring radiation levels and exposure in urban areas and mitigating the lethal short and long term effects of ionizing radiation.  A major goal of this program is to develop new sensors and sensing networks that can economically and reliably provide wide area monitoring of radionuclide signatures."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop the requirements for a low cost, pervasive detection network for wide area monitoring of radionuclide exposure. \n-  Demonstrate novel manufacturing approaches that can lower the cost of radiation detectors without compromising performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.515"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.515"
                                            },
                                            "Text": {
                                                "val": "-  Develop high performance radiation detectors for wide-area monitoring and implement novel manufacturing approaches for low cost production. \n-  Develop and study concepts-of-operations for wide-area radiation monitoring networks."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                }
            ]
        }
    }
}