{
    "id": "495fc1e96bc65bb50de4110e368f3265ed28add3",
    "meta": {
        "filename": "dod-2016_RDTE_2016_OSD_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2016.zzz_unzipped_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603941D8Z"
        },
        "ProgramElementTitle": {
            "val": "Test and Evaluation\/Science and Technology"
        },
        "R1LineNumber": {
            "val": "67"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "180.734"
            },
            "PriorYear": {
                "val": "81.247"
            },
            "CurrentYear": {
                "val": "81.033"
            },
            "BudgetYearOne": {
                "val": "82.589"
            },
            "BudgetYearOneBase": {
                "val": "82.589"
            },
            "BudgetYearTwo": {
                "val": "85.514"
            },
            "BudgetYearThree": {
                "val": "90.291"
            },
            "BudgetYearFour": {
                "val": "97.886"
            },
            "BudgetYearFive": {
                "val": "99.210"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Test and Evaluation\/Science and Technology (T&E\/S&T) Program seeks out and develops test technologies to stay in pace with evolving weapons technologies.  This program is critical to ensure that the Department of Defense (DoD) has the ability to adequately test the advanced systems that will be fielded in the future.  To meet this objective, the T&E\/S&T Program performs the following activities:\n• Exploits new technologies and processes to meet important test and evaluation (T&E) requirements.\n• Expedites the transition of new technologies from the laboratory environment to the T&E community.\n• Leverages industry advances in equipment, modeling and simulation, and networking to support T&E.\nAdditionally, the T&E\/S&T Program examines emerging T&E requirements resulting from Joint Service initiatives to identify T&E technology needs and develop a long-range roadmap for technology insertion.  The program leverages and employs applicable applied research efforts from the highly developed technology base in DoD laboratories and test centers, other government agencies, industry, and academia to accelerate development of new test capabilities.  This program provides travel funds for T&E\/S&T program oversight, special studies, analyses, and strategic planning related to test capabilities and infrastructure.\nThe T&E\/S&T Program aligns with the S&T Communities of Interest (COI) to prepare the T&E community to test warfighting capabilities that emerge from priority S&T investments.  The T&E\/S&T Program is funded within the Advanced Technology Development Budget Activity because it develops and demonstrates high payoff technologies for current and future DoD test capabilities."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "83.255"
                },
                "CurrentYear": {
                    "val": "81.148"
                },
                "BudgetYearOne": {
                    "val": "83.117"
                },
                "BudgetYearOneBase": {
                    "val": "83.117"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "81.247"
                },
                "CurrentYear": {
                    "val": "81.033"
                },
                "BudgetYearOne": {
                    "val": "82.589"
                },
                "BudgetYearOneBase": {
                    "val": "82.589"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.008"
                },
                "CurrentYear": {
                    "val": "-0.115"
                },
                "BudgetYearOne": {
                    "val": "-0.528"
                },
                "BudgetYearOneBase": {
                    "val": "-0.528"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.115"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.973"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Internal Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.035"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.528"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.528"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "•  FY 2016 baseline adjustments:  Strategic efficiency reductions in management headquarters funding and staffing for better alignment and to provide support to a smaller military force."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "1"
                    },
                    "ProjectTitle": {
                        "val": "High Speed Systems Test"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "35.631"
                        },
                        "PriorYear": {
                            "val": "17.979"
                        },
                        "CurrentYear": {
                            "val": "24.043"
                        },
                        "BudgetYearOne": {
                            "val": "21.583"
                        },
                        "BudgetYearOneBase": {
                            "val": "21.583"
                        },
                        "BudgetYearTwo": {
                            "val": "16.903"
                        },
                        "BudgetYearThree": {
                            "val": "12.544"
                        },
                        "BudgetYearFour": {
                            "val": "13.900"
                        },
                        "BudgetYearFive": {
                            "val": "14.112"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "High-speed\/hypersonic weapons are being developed to ensure the continued military superiority and strike capability of the United States including freedom of movement and freedom of action in areas protected by anti-access\/area denial defenses.  Current weapon system demonstrations and technology development programs include high-speed and hypersonic air-breathing missiles, maneuvering reentry and boost-glide weapons, hypersonic gun-launched projectiles, and air-breathing space access vehicles.  These systems require development of conventional and high-speed turbine, ramjet, scramjet, and combined cycle engines; high temperature materials; thermal protection systems (TPS); and thermal management systems.  \n  The High Speed Systems Test (HSST) project addresses test technology needs including propulsion, aerodynamic and aerothermal testing, so the test community has the technology to support the required test scenarios for concepts under development in the science and technology (S&T) community.  The technology developments within the HSST project align with the Department of Defense (DoD) S&T priority investments.  As such, the HSST project is developing, validating and transitioning advanced test and evaluation (T&E) technologies for ground test, open-air range flight test, and advanced computational tools, along with instrumentation and diagnostics systems for use in both ground tests and flight tests of high speed systems.\n  The HSST project develops technologies to enable robust, accurate, and timely T&E of these future weapon systems.  DoD acquisition regulations require weapon systems to undergo a thorough T&E process to detect deficiencies early and to ensure system suitability and survivability.  However, the extreme environments in which these weapons operate preclude accurate determination of their performance and operability with today’s T&E assets.  Current national test capabilities have deficiencies in data accuracy, flight condition replication and simulation, test methods, productivity, modeling and simulation (M&S) fidelity, and range safety.\n  The HSST mission is to address these national test capability gaps by providing test technology solutions that will enable high-speed and hypersonic weapon systems to be successfully developed through accurate, robust, and efficient T&E."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "High Speed Systems Test"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.979"
                                            },
                                            "Text": {
                                                "val": "The HSST project continued to advance ground and flight test technologies, techniques, instrumentation and modeling and simulation capabilities required for the development of high speed air-breathing propulsion and boost-glide weapons.\n\n  In FY 2014, progress was made toward addressing the two most significant technology shortfalls in current hypersonic aero propulsion ground test capabilities: clean air heat addition (i.e. non-vitiated air) and variable Mach number test capability.  Current production ground test facilities create the high temperature propulsion system inlet conditions necessary for air-breathing scramjet engine testing by burning fuel in the facility airflow supplied to the engine inlet for operation.  As demonstrated by an HSST FY 2011 test, the resulting vitiated air has different gas properties than clean air found in the atmosphere and thus is not representative of what the vehicle would experience during flight.  This significantly affects the engine’s performance and operability in the test environment resulting in erroneous flight performance predictions.  Variable Mach number capability is required to “fly the mission” and determine the critical transient operability effects throughout the flight envelope.  Incorporation of component technologies, previously developed by the T&E\/S&T program, were initiated into a small-scale, clean air, true temperature, variable Mach number 4.5-7.5 aero propulsion test facility, called the Hypersonic Aeropropulsion Clean Air Testbed (HAPCAT).  Completion of this facility will demonstrate that component technologies have reached Technology Readiness Level (TRL) 6, provide an on-going test asset to the DoD, and reduce risk for construction of a full-scale facility.  Significant progress was made this year in Phase I of the facility development including design enhancements and fabrication of the combustion cooler, installation, checkout and activation of the clean air regenerative storage heater, associated support systems, instrumentation and controls required for facility operation. The exhaust air ejector system was activated to provide longer facility run times. Design efforts for subsequent phases progressed including the critical design of the air delivery system. Another FY 2014 effort examined the incorporation of advanced morphing ceramic components for hypersonic ground test facilities into the design of common facility nozzle and ducting hardware to achieve a variable Mach number capability and variable inlet distortion patterns representative of flight-like inlet systems.  Critical design of the morphing ceramic components direct-connect nozzle and distortion generator components and integrated system was completed. Fabrication of the direct-connect component fabrication was started and freejet nozzle design concepts were evaluated. This technology promises to provide a significant advantage over current rigid, stationary facility hardware by providing a “first-ever” realistic variable Mach flight distortion simulation test capability, while reducing costs and increasing productivity.\n  Large scale scramjet engine test techniques accomplishments included continued progress in determining the capability of existing ground test facilities and methodologies to evaluate and develop large-scale hypersonic propulsion systems.  Following the successful completion of the benchmark HSST freejet test series utilizing an advanced hydrocarbon fueled missile scale scramjet in a larger facility, the semi-freejet test configuration testing was initiated in a smaller facility. Upon completion of the final direct connect phase of the project, the resulting analysis comparing tests between the larger and smaller facilities will allow the optimized utilization of existing facilities and define the size and type of investments needed for future large-scale scramjet vehicle development and reduction of flight test and acquisition risks.  Another task, that researched improved high speed test techniques, examined the unique and extensive set of ground and flight test data collected by the X-51 program for use in the development of advanced techniques for high speed engine design, development and testing. This effort documented the test techniques used and analyzed how the test data was utilized in the engine development process so that lessons learned and important test technology gaps could be identified. The work resulted in completion of the first ever in-flight mass capture and thrust uncertainty assessment conforming to the U.S. National Uncertainty Standard. \n  An arc heater flow quality aerothermal test technology development made significant progress toward independently-powered spin-coil technologies to control the physical characteristics of the spinning arc column, and its attachment location and duration on electrode surfaces.  This effort will improve the service lives of the electrodes and improve hypersonic nozzle flow quality.  The conceptual design of the spin coil was completed, and spin coil power supply requirements were specified. Improved computational and numerical simulation models were completed involving magnetic field and arc column interactions with the air flow in the heater necessary to investigate advanced designs and allow for efficient parallel computing of the simulations.  The HSST project initiated research that will provide better determination of surface heating, viscous drag, and boundary layer growth and transition effects upon hypersonic vehicle performance.  Experimental results will be used to validate state of the art prediction tools and measurements of boundary layer transition (BLT) mechanisms. Design and fabrication of hypersonic vehicle models were completed for the BLT efforts.\n  An autonomous flight safety system test technology developed by HSST to assure destruction of an errant hypersonic vehicle under test was transitioned to the Operationally Responsive Space (ORS) Office. The first prototype successfully flew onboard the ORS-3\/Minotaur I rocket.  Compared to traditional man-in-the-loop systems, autonomous flight safety system provides wider flight corridors, over the horizon flight coverage, reduced infrastructure, remote launch site capability, and improved mission assurance; thereby maximizing safety while reducing flight test costs.  Another HSST flight test technology transitioned, demonstrating advanced parameter identification maneuvers during the fourth X-51 flight.  Post-test analysis confirmed that this proven optimization technique enables the acquisition of much more vehicle aero performance data in less time and fewer flights than traditional techniques, thus reducing the costs for future development systems.  Progress continued toward the development of a ground based, portable high altitude light detection and ranging (LIDAR) atmospheric sensing system to measure atmospheric conditions (density, temperature, pressure, wind speed\/direction, O2 content) along a hypersonic vehicle’s flight path.  Design, fabrication, and implementation of all components into a portable system were completed.  Calibration, system validation testing, and a full demonstration in support of the Advanced Hypersonic Weapon flight test were accomplished. This technology will be a significant advancement over current technologies, improving the accuracy of determining atmospheric conditions at high altitudes needed for assessing the performance and operability of air-breathing missiles and boost-glide vehicles during development.\n  Progress was made in advanced high speed system ground and flight test instrumentation.  A prototype real gas force measurement balance system with high stiffness and frequency response to make measurements in hypervelocity flows with test times of 1-2 milliseconds was developed. The balance system was calibrated and a rigorous uncertainty analysis was performed.  This will substantially increase the accuracy of high Mach force measurements that are required to evaluate and improve models of air chemistry in design and prediction codes. Development of an advanced system to measure gas properties in high speed flows was completed utilizing lasers operating in the mid-infrared spectrum along with advanced transmit and receive optical fiber systems.  Two of the non-intrusive flow measurements developments for hypersonic test facilities systems, which significantly lower gas property measurement uncertainty, were fabricated and transitioned to DoD facilities.  The calibration and measurement uncertainty analysis of the HSST-developed non-intrusive laser hygrometer system was completed.  A high temperature shear stress sensor was successfully tested in a DoD hypervelocity wind tunnel and on a scramjet engine forebody inlet ramp.  A mid-infrared thermal imaging technique effort was initiated.  This technique will permit quantitative thermal imaging of hypersonic model surface flow for high enthalpies without capturing flow field emissivity effects that can shroud surface temperature imaging.  \n  Advances were achieved in the development of state-of-the-art modeling and simulation tools.  Beta testing by a broad spectrum of the hypersonic community continues for an advanced three-dimensional stability and transition analysis for hypersonic boundary layer code and hypersonic nozzle characteristics based grid generation code.  The code was used to support the design of a DoD hypersonic wind tunnel nozzle and a Graphical User Interface (GUI) was developed. The code was also used for development of the HSST variable Mach number nozzle and distortion generator. The advanced code was used during a hypervelocity test at Arnold Engineering Development Center (AEDC) to analyze and predict the characteristics and extent of boundary layer transition on the test article surface resulting from variations in nose bluntness, unit Reynolds number, and angle of attack. An improved Computed Tomography Method (CTM) algorithm capable of constructing more complex flow field patterns for optical absorption measurements was developed.  The algorithm creates two-dimensional spatial maps of exhaust gas properties from multi-line-of-sight tunable diode laser absorption spectroscopy measurements for verifying code predictions and for determining combustion efficiency for turbine and scramjet engines.  This development takes advantage of increased processing speed, higher accuracy and increased computational efficiency to greatly increase the diagnostic value of measurements from miniature, robust tunable diode laser absorption spectroscopy gas diagnostic sensor systems, which are now used for engine ground and flight testing. A project was initiated to develop a transient thermal analysis software toolset to support T&E of hypersonic vehicle Thermal Protection System (TPS) aerothermal and ablation response to high speed, high temperature flow in ground and flight test environments. A real-gas model capability was incorporated into the software flow field solver.  The vitiation effects computational fluid dynamics study was completed. The study determined the ability of the Wind-US 3.0 computational fluid dynamics code to aid in the developmental test and evaluation of complex high speed\/hypersonic propulsion systems and facilities utilizing existing HSST scramjet engine test data sets."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "24.043"
                                            },
                                            "Text": {
                                                "val": "New test technology efforts will be initiated addressing: test technologies, techniques, and methodologies to determine full-scale propulsion system performance and operability from subscale tests; technology for improved TPS ablation and weather effects characterization; further development of M&S codes for accurate prediction of flow fields, boundary layer transition, and heat transfer in high-speed flow; new and more accurate instrumentation systems; and application of advanced test technologies to meet other needs such as gas turbine engines and electromagnetic railguns.\n  The clean-air, variable Mach number demonstration facility, HAPCAT, project will continue to develop and demonstrate air delivery system technologies to provide uniform flow with variable pressure and temperature from multiple air sources through a fixed nozzle up to Mach 7.5 conditions.  The project activities will include initiation of Phase 2 to begin fabrication of the final air delivery system and design of the variable Mach nozzle.\n  Scramjet ground tests in semi-free jet, and direct connect test modes will be concluded and compared to free-jet test results to quantify their respective accuracies and identify optimal test methods for larger, next generation scramjet engines.  Vitiation effects data will be collected to increase the high speed systems community’s knowledge base to apply in using legacy tunnels.  \n  Direct-connect hardware validation testing of a ceramic morphing direct connect facility nozzle and distortion generator suitable for missile-scale high speed ground test facilities will be completed.  This effort will aid in demonstrating the ability to maintain well-conditioned flow while continuously varying the flight Mach number and inlet distortion levels.\n  Improved arc jet facility spin coil power control designs will be finalized and fabricated, and the spin coil system will be demonstrated proceeding toward the goal of improved T&E of maneuvering reentry and boost\/glide vehicles. The BLT development will conduct testing in tunnel facilities to provide a basis for comparative analysis in different test configurations, and to provide comprehensive code validation test cases regarding 3D boundary layer stability and transition.\n  Testing and demonstration activities of high altitude LIDAR atmospheric sensing will be completed and the mobile system will be transitioned and available to support test programs at multiple flight test ranges. \n  Phase 2 of the real gas force measurement load balance project will design, fabricate, calibrate, and demonstrate an advanced balance system, resulting in the first ever force and moment measurements including real gas effects on hypersonic vehicles at high Mach test conditions.  Optimization of the mid-infrared thermal imaging signal-to-noise ratio as a function of test enthalpy technique will be completed.  Measurement of thermal emissions from the surface of typical boost-glide type vehicle in an impulse test facility will be demonstrated. Fabrication and calibration of a miniaturized fiber optic heat flux gauge will be completed. Transition of laser hygrometer humidity sensors to AEDC engine test cells and wind tunnels, replacing less accurate and unreliable traditional hygrometers, will complete. \n  Verification and improvement of computational fluid dynamics codes will continue, making use of the unique data sets obtained from the HSST scramjet engines tests and BLT experiments described above.  A characteristics based grid generation advanced code with GUI will be released to the hypersonic community. A validated STABL-3D\/Wind-US 3.0 transition prediction tool will be released allowing for application to complex, 3-dimensional boost-glide vehicle geometries. The transient thermal analysis software effort will complete integration of a flow field solver, aerothermal code and a structural heating code.  Aero-optic distortion models will be incorporated into the transient thermal analysis software capability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "21.583"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "21.583"
                                            },
                                            "Text": {
                                                "val": "FY 2016 will see continued efforts to improve hypersonic ground and flight test capabilities to levels required for acquisition programs.  Efforts will include demonstration of new flight test techniques, improvements in instrumentation, and continued validation and improvement of computational fluid dynamics codes.\n  Progress will continue toward final integration and operation of the HAPCAT clean-air, variable Mach number aeropropulsion facility, including completion of the variable Mach number nozzle design and preparations to demonstrate the capability to simultaneously vary stagnation pressure, temperature and Mach number from 4.5-7.5. \n  Independent spin coil and arc heater power control capability demonstration as part of the arc heater flow quality project will enable more reliable and accurate arc control, longer electrode life, and reduced copper contamination in the airstream and on the test article.  \n  Completion of BLT efforts will establish a new baseline protocol for hypersonic aero performance predictions utilizing testing and M&S. The integrated and validated transient thermal analysis software code will be released to the hypersonic T&E community."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Percentage of T&E\/S&T projects progressing satisfactorily toward technical, financial, schedule, and risk mitigation goals."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2"
                    },
                    "ProjectTitle": {
                        "val": "Spectrum Efficient Technology"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "18.057"
                        },
                        "PriorYear": {
                            "val": "7.314"
                        },
                        "CurrentYear": {
                            "val": "5.353"
                        },
                        "BudgetYearOne": {
                            "val": "7.229"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.229"
                        },
                        "BudgetYearTwo": {
                            "val": "8.374"
                        },
                        "BudgetYearThree": {
                            "val": "9.039"
                        },
                        "BudgetYearFour": {
                            "val": "9.740"
                        },
                        "BudgetYearFive": {
                            "val": "9.873"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Weapon systems have become increasingly complex in recent years, resulting in the need for significantly more data to be passed among these systems, and between the systems and our test infrastructure.  A vast amount of data must be collected, transmitted, and analyzed, which requires a large amount of radio frequency (RF) spectrum resources.  However, the amount of RF spectrum designated to support test and evaluation (T&E) is decreasing, most notably due to reallocation of spectrum for commercial use.  The combination of decreasing RF spectrum and increasing data requirements results in an urgent need to develop test technologies that maximize the use of spectrum resources for Department of Defense (DoD) T&E operations.\n  The L and S frequency bands are the traditional spectrum allotted for military T&E use.  The explosive need for spectrum in the commercial sector has resulted in reallocation of portions of these bands to industry.  To compensate, DoD is now authorized to use the C-Band spectrum which offers numerous benefits, including a three-fold increase in available bandwidth, but C-Band comes with technical challenges.  Most notably, our current test infrastructure for telemetry is not designed to accommodate C-Band.  Technologies are required to implement innovative techniques that efficiently facilitate our use of C-Band without a major overhaul to our national test infrastructure.  For instance, commercial telemetry transmitters operate in C-Band but do not have the form factor (size and weight) or rugged packaging to survive airborne test applications.\n  Traditional telemetry applications employ streaming telemetry where data is moved one-way from the instrumented system under test to our test infrastructure.  Modern network based telemetry capabilities, like those being developed by the Central Test and Evaluation Investment Program (CTEIP) integrated Network Enhanced Telemetry (iNET) effort, enable more robust, efficient bidirectional transfer of data.  DoD’s strategy is to create technologies for streaming telemetry capability in C-Band, opening up legacy L- and S-Bands for networked telemetry, and researching the feasibility of using higher frequency bands to augment telemetry operations.\n  The Spectrum Efficient Technology (SET) project is developing test technologies that enable more efficient use of legacy telemetry bands and expansion into non-traditional areas of the RF and optical spectra at DoD test ranges.  The technology development efforts within the SET project have been prioritized to align with Department of Defense guidance on science and technology priority investments. As such, the SET project is focusing on growing data requirements of warfighting systems and the limited availability of spectrum for testing.  The SET project is structured to develop test technologies to advance range communications, networked telemetry capabilities, and enhanced management of spectrum at DoD test ranges."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Spectrum Efficient Technology"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.314"
                                            },
                                            "Text": {
                                                "val": "The SET project developed technologies to meet networked telemetry requirements and performed risk reduction for CTEIP telemetry improvement projects. A networked data recorder was developed to provide risk reduction in support of the CTEIP iNET development and subsequently tested in the CTEIP iNET Integration Laboratory.  Technology enabling the dynamic reconfiguration of transmitted test data over a telemetry network was further matured.  Technology to improve the efficiency of a telemetry network utilizing the advanced Shaped Offset Quadrature Phase Shift Keying (SOQPSK) modulation scheme continued.  Development of a multi-band transceiver operating in the L\/S\/C-Band spectrum employing multiple advanced waveforms continued.  SET continued an effort to autonomously analyze collected telemetry data and based on priority, select which data to transmit over the telemetry network.  Additionally, SET matured several efforts to improve the performance of telemetry data links.  SET continued efforts to improve the performance of a serial streaming telemetry link in a multipath environment by developing a sync marker for the telemetry data.  This technology will enable analysis of the data in the event of a data dropout and permit filling in of gaps in transmitted data.  Development of a telemetry transceiver capable of dynamically reconfiguring the data modulation scheme based on telemetry link conditions continued.  \n  Development of a non-blocking Ethernet switch for airborne platforms was completed, demonstrated, and transitioned to support the deployment of a networked telemetry system. This technology will serve as the network backbone which will tie all onboard instrumentation together with the onboard test data transmitter.\n  The SET project investigated techniques to expand telemetry operations into non-traditional spectrum bands by characterizing multipath effects in a range of terrestrial and atmospheric environments. A technical investigation into the telemetry link performance of the C-Band versus S-Band spectrum for a missile test mission was completed and the performance results transitioned to the test ranges.  The C-Band telemetry antenna technology developed under this effort was initially transitioned to Naval Air Warfare Center – Weapons Division, China Lake; however, the technology is extensible, enabling its widespread use across the Major Range and Test Facility Base.  SET continued efforts to develop airborne phased array antenna technology to enable flexible scheduling of the T&E spectrum by incorporating both the traditional L\/S bands and recently permitted C-Band frequencies.  Some of these technologies will reduce the technical risk associated with beam steering in the C-Band frequencies, reduce the amount of infrastructure modifications needed to implement a C-Band telemetry capability, and provide over-the-horizon data connectivity to test large-footprint weapons, such as long range missiles.\n  The SET project completed the development of a three dimensional channel model tool for modeling and simulation of telemetry channels in various environments.  This tool provides higher fidelity simulations for use in researching the effects of terrain, environments, and various other factors on telemetry channels.  This tool was transitioned to the Edwards Air Force Flight Test Center to support pretest analysis of mission flight profiles.  \n  The SET project initiated an effort to develop digital beam forming and steering technologies for an airborne phased array antenna. This technology will significantly reduce the system complexity for an airborne phased array antenna, providing savings in terms of size, weight, power consumption, and airframe modifications on the test platform.  Additionally, SET initiated several technical investigations to expand telemetry operations into non-traditional spectrum bands.  SET initiated an effort to investigate the use of the higher frequency Ka-Band and Ku-Band for telemetry links.  This investigation will determine the performance characteristics of the bands and determine the ideal operating frequencies for telemetry purposes.  Additionally, SET initiated a technical investigation to explore the use of directional optical links for telemetry purposes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.353"
                                            },
                                            "Text": {
                                                "val": "The SET project will further advance development of technologies required for network telemetry.  Efforts to develop a multiband L\/S\/C-Band transceiver will continue. Technologies to develop advanced waveforms designed to increase bandwidth efficiency will be matured.  Technology to improve efficiency of a telemetry network utilizing the SOQPSK modulation scheme will be matured.  Development of a telemetry transceiver capable of dynamically reconfiguring the data modulation scheme based on telemetry link conditions will continue.  \n  Phased array antenna technology utilizing the L\/S\/C-Band frequencies will continue to be matured to enable flexible spectrum scheduling and alleviate technical risk associated with tracking and beam steering in the C-Band. An effort to develop digital beam forming and steering technologies for an airborne phased array antenna will be completed, tested, and transitioned to the CTEIP program to support the development of an over-the-horizon telemetry capability. Additionally, SET will initiate efforts to develop phased array technology for use on the ground as well as in airborne applications.  The high directionality of phased array antenna technologies will enable spectrum spatial reuse techniques for more effective spectrum scheduling.  The SET project will initiate efforts to develop an airborne multiband transceiver to support networked telemetry, increase spectrum scheduling efficiency, improve efficiency in ground telemetry and antenna systems, and support data transmission in L\/S\/C-bands. \n  Several technical investigations to expand telemetry operations into non-traditional spectrum bands will be completed and the results provided to the test ranges.  The technical investigation into the use of the higher frequency Ka\/Ku-Bands for telemetry operations will be completed, providing analysis and recommendations on ideal operating frequencies within those spectrum bands. The technical investigation into the use of optical links to support telemetry operations will be completed. \n  SET will initiate efforts to develop schemes to manage and provide access to telemetry links that are comprised of both contiguous and non-contiguous blocks of spectrum in the upper C-band.  This portion of spectrum allocated for T&E is highly non-contiguous due to sharing with satellite and television uplinks in the spectrum band.  SET will initiate an effort to develop spectrum management tools to optimize use of the available RF spectrum bands."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.229"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.229"
                                            },
                                            "Text": {
                                                "val": "The SET project will initiate development of radio technology that can utilize alternate spectrum in the upper frequency bands.  These efforts will determine the feasibility of some of the upper bands for use in telemetry.  Additionally, the SET project will complete work to mature technologies in optimization and management of the telemetry networks through spectrum management tools."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Percentage of T&E\/S&T projects progressing satisfactorily toward technical, financial, schedule, and risk mitigation goals."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3"
                    },
                    "ProjectTitle": {
                        "val": "Electronic Warfare Test"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "37.954"
                        },
                        "PriorYear": {
                            "val": "11.355"
                        },
                        "CurrentYear": {
                            "val": "12.614"
                        },
                        "BudgetYearOne": {
                            "val": "12.939"
                        },
                        "BudgetYearOneBase": {
                            "val": "12.939"
                        },
                        "BudgetYearTwo": {
                            "val": "14.528"
                        },
                        "BudgetYearThree": {
                            "val": "16.758"
                        },
                        "BudgetYearFour": {
                            "val": "16.095"
                        },
                        "BudgetYearFive": {
                            "val": "16.310"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "In order to establish dominance in the modern battlespace, our offensive and defensive electronic warfare systems must be capable against advanced radio frequency (RF) directed threats and electro-optic (EO) guided threats, which include infrared (IR) guidance.  Ensured dominance in these areas requires more robust test and evaluation (T&E) with technologies that are rapidly adaptable to changing threats. \n  Readily available, IR seeking, man-portable air defense systems (MANPADS) are difficult to detect and pose an imminent and lethal threat to military aircraft of all types.  Our ability to counter such threats is essential to owning the battlespace in theater.  Therefore, the ability to test missile warning systems (MWS), hostile fire indicators, IR countermeasures (IRCM), and advanced threat sensors is critical to our national defense. Additionally, a new generation of enemy RF missile seekers is both currently fielded and in further development, requiring a correspondingly new generation of test technologies to test the latest countermeasures.  The T&E community is required to test IRCM and RF countermeasure systems in a repeatable manner with ground-truth data before and after integration into warfighting systems.  Without new test technologies, the Department of Defense (DoD) will be unable to perform adequate T&E of advanced warning and countermeasure systems.\n  The technology development efforts within the Electronic Warfare Test (EWT) project have been prioritized to align with DoD guidance on science and technology priority investments.  As such, the EWT project is focusing on the test needs in both the EO, including IR, and the RF threat domains.  Additionally, development of core test technologies in this area can be leveraged to meet other EO and RF test requirements, such as in fire control systems; intelligence, surveillance and reconnaissance (ISR) sensors, and weapon seekers.\n  The EWT project develops test technologies to stimulate IRCM and RF system sensors through the high-fidelity simulation of scenes viewed by the sensors.  Stimulation can be as simple as testing to see if a system under test responds to an image or as complex as simulating complex battle space phenomena to measure the response of a system under test in a more relevant, cluttered scenario.  Simulations and stimulations are used at open air ranges and in installed system test facilities (ISTF), and in hardware-in-the-loop (HWIL) test beds."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Electronic Warfare Test"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.355"
                                            },
                                            "Text": {
                                                "val": "The EWT project completed work on a gimbaled IR sensor optomechanical interface for use on testing of IR countermeasure systems.  A parallel effort using a dynamic IR optical coupler continued.  Static testing and signature collection of the boost sustain motor for a surrogate missile system for testing of MANPADS IRCM scenarios completed.  Hardware and software development for a 3D tracking system for testing of hostile fire indicator systems completed. The EWT project completed the design of a wideband multi-beam klystron to be used as a simulator for next-generation surface-to-air-missile systems.  EWT completed a field programmable gate array design and developed and tested control hardware for a system to generate virtual radar targets using digital RF memory (DRFM) technology. EWT completed a critical design review for a new prototype real-time air-to-surface simulator for testing of semi-active radar surveillance, automatic target recognition, and bomb damage assessment radar modes.  The EWT project completed a design trade study for tiling of high temperature emitter arrays to enable IR scene projectors of larger formats required to test advanced ISR sensors and weapon seekers. A 1-color 100 Hz scene projector system using a superlattice light emitting diode (LED) array, meeting radiance and spectral goals was demonstrated. EWT completed the final optics assembly for a laser based mid-wave IR (MWIR) two–color simulator source. The EWT project continued development of a hyperspectral imaging projector, which will allow characterization and testing of hyperspectral imaging cameras used for ISR.\n  The EWT project continued an effort to develop a breadboard technology to produce high-fidelity electronic counter-countermeasures (ECCM) radar signal processing techniques that employ sophisticated waveforms with algorithms, such as adaptive filtering.  This test technology development addresses a need, which is identified by the CTEIP-sponsored Tri-Service Electronic Warfare Test Capabilities Study.  The technology will improve testing against modern surface-to-air missile threats. Moreover, EWT continued efforts to develop a surrogate missile technology for testing of missile warning sensors."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.614"
                                            },
                                            "Text": {
                                                "val": "The EWT project will continue to develop an IR scene projector using digital micromirrors with long wave IR and MWIR channels. EWT will continue to develop a system for testing directed IRCM (DIRCM) systems in a high clutter environment that will additionally be used for common IRCM (CIRCM) testing. EWT will complete and demonstrate a two-color IR scene projector.  Work on multistatic radar trackers for testing of hostile fire indicator systems will complete with demonstration of this technology.  Additionally, EWT will demonstrate a prototype of a reconfigurable threat signal processor allowing rapid configuration of threat radar test simulators.  Based on the design completed in FY 2014, EWT will continue development of a wideband multi-beam klystron transmitter for high fidelity threat simulation of next generation surface-to-air missiles, completing the electron gun fabrication and the output cavity design, and culminating in the demonstration of a laboratory breadboard system. Development of DRFM algorithms for generation of virtual radar targets will continue with completion of bench testing of hardware and software. Work will continue on using DRFMs to enable chamber testing of operational communications data between aircraft.  An air-to-surface radar imaging stimulator will be demonstrated. The EWT project will complete the Sensor and Seeker Test Requirements Study Roadmap effort and initiate an update of the Tri-Service Electronic Warfare Test Capabilities Study Roadmap. New efforts related to these roadmaps, along with the IRCM Test Resource\nRequirements Study Roadmap will be initiated."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.939"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.939"
                                            },
                                            "Text": {
                                                "val": "A prototype MWIR scene projector with apparent temperatures in excess of 1500K will complete as will a 1kHz, two-color scene generator. EWT will demonstrate a prototype wideband multi-beam klystron transmitter for high fidelity threat simulation of next generation surface-to-air missile radars. The EWT project will complete development of DRFM algorithms with bench testing of hardware and software for generation of virtual radar targets. EWT will complete development for using DRFMs to enable chamber testing of operational communications data between aircraft. The EWT project will invest in new technologies related to improving the electronic warfare T&E infrastructure.  These new technologies will be identified by the Tri-Service EWT Working Group formed in FY 2011, and further address test needs identified in the IRCM Test Resource Requirements Study Roadmap, the Tri-Service Electronic Warfare Test Capabilities Roadmap, and the Sensors and Seekers Test Requirements Study."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Percentage of T&E\/S&T projects progressing satisfactorily toward technical, financial, schedule, and risk mitigation goals."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "4"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Instrumentation Systems Technology"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "18.595"
                        },
                        "PriorYear": {
                            "val": "11.786"
                        },
                        "CurrentYear": {
                            "val": "11.494"
                        },
                        "BudgetYearOne": {
                            "val": "10.378"
                        },
                        "BudgetYearOneBase": {
                            "val": "10.378"
                        },
                        "BudgetYearTwo": {
                            "val": "10.435"
                        },
                        "BudgetYearThree": {
                            "val": "11.257"
                        },
                        "BudgetYearFour": {
                            "val": "13.358"
                        },
                        "BudgetYearFive": {
                            "val": "13.540"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Advanced Instrumentation Systems Technology (AIST) project addresses the test technology gaps resulting from emerging weapon systems that need to be tested at Department of Defense (DoD) open air ranges, undersea ranges, installed systems test facilities, hardware-in-the-loop laboratories, and measurement test facilities.  Instrumentation requirements for systems under test are increasing exponentially for new weapons systems.  Vehicle-borne and warfighter-wearable instrumentation packages are required.  This instrumentation is for sensing and collecting critical performance data; determining accurate time, space, position information (TSPI)and attitude information; interfacing with command and control data links; monitoring and reporting system-wide communications; recording human operator physical and cognitive performance; and storing and transmitting data.\n  The technology development efforts within the AIST project have been prioritized to align with DoD guidance on science and technology (S&T) priority investments, particularly in support of human systems, engineered resilient systems, and countering weapons of mass destruction.  The AIST project is focused on supporting technology developments for advanced TSPI instrumentation (especially with limited or no availability of the Global Positioning System (GPS)), advanced sensors, advanced energy and power systems for instrumentation, non-intrusive instrumentation, mitigating range encroachment issues, and measuring warfighter physical and cognitive performance.  \n  The AIST project addresses requirements for miniaturized, non-intrusive instrumentation suites with increased survivability in harsh environments.  Such instrumentation is an urgent need because minimal space is available to add instrumentation to new or existing weapon systems subsequent to their development; furthermore, additional weight and power draw for instrumentation can adversely affect weapon system signature and performance.  Instrumentation for humans-in-the-loop, such as dismounted warfighters, must not adversely affect performance, induce artificiality in the test environment, nor create operational burden.  New technologies can be exploited to integrate small, non-intrusive instrumentation into emerging platforms during design and development, and, in some cases, into existing platforms.  This class of instrumentation will provide critical system performance data during test and continuous assessment throughout a system’s lifecycle.  Technology developed under AIST can also benefit training and combat missions by enabling a continual feedback loop between the developer, training staff, operators and commanders."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Instrumentation Systems Technology"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.786"
                                            },
                                            "Text": {
                                                "val": "The warfighter must conduct military operations in diverse environments to include urban, mountainous, and densely forested locations.  Consequently, a continued major thrust for FY 2014 included the development of test technologies to support collection of TSPI for warfighter systems (manned or unmanned), particularly in GPS-denied or degraded environments, such as in urban canyons and tunnels.  Efforts to test systems that operate in a GPS-denied environment included technology that employs a layered system of sensors leveraging collaborative navigation, existing radio frequency (RF) ranging technology, and a Doppler velocimeter to achieve more precise TSPI under GPS-impaired conditions.  Development has been completed and a user demonstration conducted at an urban training site, achieving sub-meter accuracy (~0.6 meter), both indoor and outdoor. \n  An inertial tracking system for dismounted warfighters continued in development; the system employs boot-mounted sensors to provide sub-meter geolocation over GPS-denied durations of greater than 2 hours.  A re-design of the distance measuring radios was completed; algorithms were implemented; and the ability to geolocate a dismounted warfighter conducting activities over two hours of free movement in the absence of GPS was demonstrated.  \n  Efforts continued to develop technology to measure projectile position and attitude (six degrees of freedom) of high-velocity, spinning projectiles (at accuracies that significantly exceed the system under test guidance system).  This technology will provide continuous estimation of the state description of a projectile (three components of position and orientation) through the duration of projectile flight via accurate and rapid RF range observations between the projectile and ground-based components.  Successful shock and spin testing have been completed; synchronization and scheduling are being optimized.  The AIST project continued to develop a system to measure warfighter indoor location (GPS-denied environment) at sub-meter accuracies using ambient amplitude modulation (AM) radio broadcast signals.  AM signal propagation during day and night was evaluated at an urban training range; data was collected at a variety of urban range structures noting centimeter accuracy within a prison structure.  Efforts continued to develop technology that provides a seamless transition between outdoor and indoor environments to accurately track systems under test using modified GPS receivers, relayed GPS signals, and multilateration; this included work on reducing multipath effects.  Results to date indicate that other filters and other sensors e.g., an inertial measurement unit (IMU) integrated into the system can potentially provide an overall TSPI solution with sub-meter accuracies. \n  In support of other instrumentation solutions, an electro-releasable attachment technology development effort continued.  This included investigation of new adhesive formulations that employ an electrically releasing foil patch to allow attachment of sensors to non-conductive, painted surfaces of aircraft and other combat vehicles.  Such technology would significantly reduce the time to restore the system under test to its operational configuration.  Development of the foil patch focused on improving operating temperature range and adhesion strength in preparation for environmental testing (e.g., resistance to lightning strike) and end-to-end field testing at air and ground test activities.  \n  The AIST project continued development of a fiber-optic instrumentation suite to integrate into test projectiles for measurement of magnetic field strength in the harsh environment of the Navy electromagnetic railgun (EMRG). Full-up testing with three EMRG shots at the Naval Surface Warfare Center-Dahlgren Division was conducted, achieving a significant benchmark by successfully measuring, for the first time, magnetic field strengths in an EMRG-launched projectile at 15-20 kG forces.  Additional tests are planned at higher energy levels. \n  The AIST project developed algorithms and methods for automated detection and classification of marine mammal vocalizations from ocean floor range sensors (e.g., hydrophones) to allow the Navy to conduct critical test and evaluation (T&E) events without adversely impacting marine mammal populations. Testing has been successfully conducted at undersea ranges and a baseline classifier for 6 marine mammal species is currently running real-time, range-wide at the Atlantic Undersea Test and Evaluation Center, Pacific Range Missile Facility, and the Southern California Offshore Range.  This test technology supports the Navy’s Integrated Comprehensive Monitoring Program (ICMP) ensuring adherence to the Endangered Species Act (ESA) and the Marine Mammal Protection Act (MMPA). Additional classifiers have been developed or improved and will be integrated into marine mammal monitoring nodes and transitioned to the Navy’s major undersea ranges.\n  To support the needs of test ranges that conduct arena testing for weapon systems, AIST continued developing technology that uses passive imaging to characterize munition warhead fragment size, velocity, and distribution.  This technology will significantly reduce set-up times and data analysis costs of current warhead arena test techniques.  \n  The AIST project continued to develop technology that accurately provides dynamic measurements of warfighter body posture, and head and weapon orientation using fiber optic shape sensing integrated into a body suit to be worn under the uniform Shape accuracies for component and system measurements were over 99 percent accurate in laboratory testing; angle accuracies were well within 1 degree of the truth.  A single channel breadboard system was demonstrated, displaying real-time dynamic shape data on a human test subject, producing similar accuracy results observed in laboratory settings.  \n  Development of technology to assess warfighter cognitive states continued.  Accomplishments included developing an integrated dry electroencephalogram (EEG) and functional near infrared (fNIR) sensor system capable of simultaneous measurement of brain electrical activity and blood oxygen level; an unobtrusive headset for test subjects; mental workload assessment software; and verification of system functionality.\n  An effort continued to investigate means to mitigate the impacts of wind energy system interference on test range radars.  AIST evaluated four mitigation approaches to minimize the effects of wind turbines with the goal of reducing their effects by 60-70dB; a combination of the top three mitigation approaches is estimated to provide approximately 63dB performance improvement of T&E range radars in the presence of wind turbine interference.  Efforts continued to assess and leverage microsystems technology under development at universities, the Defense Advanced Research Projects Agency (DARPA), and government laboratories.  These efforts will provide significant advances to T&E of modern war fighting systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.494"
                                            },
                                            "Text": {
                                                "val": "Major thrusts for FY 2015 include continuing efforts in advanced sensors, TSPI instrumentation, warfighter physical and cognitive assessment under various workloads, and test range encroachment mitigation.  Additionally, AIST will continue to pursue test technologies for non-intrusive, advanced data acquisition and transformation that operate on reduced power along with the development of advanced power sources for test instrumentation.  \n  The AIST project will complete:  the development of an inertial tracking system with boot-mounted sensors for dismounted Warfighters; a tracking technology that provides a seamless transition between outdoor and indoor environments; and technology to achieve real-time undersea situational awareness of undersea vehicles relative to another.  The AIST project will continue: the development and testing of classifiers to identify specific sea mammals (e.g., various dolphin and whale species) found at undersea ranges; the development and testing of magnetic field sensors for the harsh environment of EMRG test firings; an attachment technology that does not require any solvents to restore test articles to operational condition; several efforts for collecting TSPI on dismounted warfighters and related systems in GPS-denied or degraded environments such as those found in urban and subterranean operations; and the investigations and resulting recommendations to mitigate wind turbine effects on the nation’s tests ranges."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.378"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.378"
                                            },
                                            "Text": {
                                                "val": "The AIST project will initiate efforts to develop advanced TSPI technologies for non-intrusive applications using wireless systems and optical, infrared, and\/or acoustic techniques.  TSPI technologies will be further developed to support: data collection in GPS-denied environments, TSPI on high dynamic systems such as missiles and projectiles, Real Time Casualty Assessment (RTCA) and TSPI on non-cooperative undersea weapon systems.\n  Advanced sensor initiatives for non-intrusive applications will include multimodal transducers, and self-registering\/self-calibrating sensors.  Sensing applications will include weapon system orientation, body armor blunt trauma evaluation, air launched stores separation, angle of incidence measurement, and non-destructive radiographic defect evaluation for warheads and other weapons structures.\n  Advanced data transformation initiatives will develop technologies for adaptive computing, virtual\/synthetic instrumentation, data compression, wireless on-board data transport and improved data storage density.  Other areas of investigation will include advanced data management techniques; decreased size, weight, and power; and micro-miniaturization of electronic components for non-intrusive applications.  AIST will continue to investigate technologies for reducing or eliminating range environmental encroachment issues such as electromagnetic and alternative energy interference with range tracking systems.  Additional efforts will include human performance measurement and assessment; specifically human interaction with unmanned systems and the evaluation of the interaction of the warfighter and weapons\/equipment and interactions between individual warfighters in team-based holistic assessments.\n  The AIST project will complete:  technology to measure position and attitude of high-velocity, spinning projectiles; fiber optic shape sensing technology for warfighter body posture, head and weapon orientation; warfighter cognitive assessment technology; and signal-of-opportunity location devices."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Percentage of T&E\/S&T projects progressing satisfactorily toward technical, financial, schedule, and risk mitigation goals."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "5"
                    },
                    "ProjectTitle": {
                        "val": "Directed Energy Test"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "22.519"
                        },
                        "PriorYear": {
                            "val": "8.243"
                        },
                        "CurrentYear": {
                            "val": "5.443"
                        },
                        "BudgetYearOne": {
                            "val": "5.525"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.525"
                        },
                        "BudgetYearTwo": {
                            "val": "7.050"
                        },
                        "BudgetYearThree": {
                            "val": "7.728"
                        },
                        "BudgetYearFour": {
                            "val": "8.078"
                        },
                        "BudgetYearFive": {
                            "val": "8.188"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Department of Defense (DoD) is exploring the military utility, safety, and suitability of directed energy weapons.  A robust test capability to assess directed energy weapons is essential to understanding their effectiveness and limitations, including determining their effectiveness in performing counter improvised explosive device (C-IED) operations.  Such assessments will depend upon knowledge acquired through the test and evaluation (T&E) of directed energy technologies and testing of operational concepts.  Directed energy weapon technologies, primarily consisting of high energy lasers (HEL) and high powered microwaves (HPM), are outpacing available test capabilities.  Traditional test techniques for evaluating conventional munitions (with flight times ranging from seconds to minutes) are not sufficient for the T&E of directed energy weapons that place energy on target instantaneously.  Consequently, new test technology solutions are needed to ensure that adequate developmental, live-fire, and operational test capabilities are available when directed energy programs are ready to test.\n  Directed energy system and component testing requires three principal assessments:  (1) energy or power on target; (2) the effects on the target; and (3) the propagation of the directed energy to the target through the atmosphere.  In addition, the vulnerabilities of DoD systems to directed energy threats are required to be characterized, such as those requirements captured in Military Standard (MIL-STD)-464C.  Equally as important, current test capabilities do not provide the detailed data required to understand U.S. directed energy system performance and effects.\n  The technology development efforts within the Directed Energy Test (DET) project have been prioritized to align with DoD guidance on science and technology priority investments.  As such, the DET project is developing the technologies necessary for quantitative assessment of United States (U.S.) HEL and HPM performance, as well as the vulnerability of DoD weapon systems to enemy directed energy threats."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Directed Energy Test"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.243"
                                            },
                                            "Text": {
                                                "val": "The DET project completed development of target board sensors to assess HEL energy on large targets.  Similar work on HEL energy sensors for small targets such as mortars and rockets continued under two parallel efforts, with preliminary design completed.  The system components were shocked tested.\n  The DET project completed two efforts to develop an HEL test planning tool providing a probabilistic based glint hazard analysis tool for assessing risks to personnel, aircraft, and sensors. \n  Fabrication continued on a prototype adaptive optics system designed to be readily adaptable to telescopes at DoD test facilities.  The test technology will allow improved imaging of an HEL spot on a remote target.  Regarding HEL atmospheric propagation, development of a light detection and ranging system (LIDAR) to measure atmospheric profiles along a slant path adjacent to the HEL beam propagation path continued.  The laboratory demonstration and testing of the sub-systems completed. This technology simultaneously measured profiles for three parameters: optical turbulence, water vapor content, and aerosol attenuation.  Measuring these profiles will enable understanding of how atmospheric effects distort HEL beam propagation.  A maritime version of this technology continued with completion of a preliminary design review.\n  Testing of electric and magnetic field sensors continued in support of electromagnetic railgun (EMRG) T&E with development of new techniques to reduce noise on these measurements; these techniques increased the quality of data obtained to benchmark railgun development codes.  DET developed a prototype miniature differential current measurement system that measures the current at nodes in a target circuit, allowing analysis of HPM effects at sub-component level. DET also developed a proof-of-concept voltage probe with bandwidths up to 100 MHz, allowing non-intrusive voltage measurements in HPM engagements.  These probes are also useful for C-IED applications. \n  The DET project completed design of an advanced radome that will allow more reliable operation of the White Sands Missile Range (WSMR) HPM Wide Band Threat Source over all 5 bands of operation, enabling more robust, cost effective testing of U.S. systems against HPM threats. Development of a compact hard tube vircator (CHTV) to cover two frequency bands of interest continued.  The CHTV development will result in an HPM source for testing in-chamber HPM effects, which at certain frequencies, is a gap in current MIL-STD-464C testing.\n  The DET project initiated a study of options for technology replacement of the WSMR fast burst reactor for sources that simulate nuclear weapon prompt radiation output (neutron radiation) for survivability testing of U.S. systems.  The driver of this effort is a more cost effective means of creating neutron radiation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.443"
                                            },
                                            "Text": {
                                                "val": "Within the HEL area, efforts will focus on continuing technology developments for measuring energy on target and characterizing effects on small targets using onboard sensing.  DET will continue efforts to characterize beam propagation through the atmosphere including those in the maritime environment to support emerging needs of the Navy. \n  Initiatives to achieve very small, non-intrusive current and voltage sensors to measure HPM effects inside a target will be continued.  These technologies will be transitioned to at least two locations to demonstrate the flexibility of these approaches.  A small, minimally intrusive data acquisition device with a wide bandwidth to complement that of the non-intrusive electric and magnetic field sensors will be completed.\n  An effort to develop an HPM source for use in a chamber to address survivability of munitions in an HPM environment will be continued.\n  The new study investigating technologically viable, more cost effective alternatives to provide the neutron radiation required for nuclear survivability testing will be continued."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.525"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.525"
                                            },
                                            "Text": {
                                                "val": "Investments in HEL test technologies will be initiated to assess the changes in HEL effects due to the shift of HELs to shorter wavelengths near 1 micron.  This includes efforts to characterize the performance of HEL systems as they test against small targets such as rockets, missiles, artillery, and unmanned aerial vehicles.\n  In the HPM area, measuring the actual cause of HPM effects on electronics will be addressed by measurement of electrical currents within the wires and chips of the electronic targets. DET will also look at new technologies to further address gaps in the availability of sources for MIL-STD-464C testing."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Percentage of T&E\/S&T projects progressing satisfactorily toward technical, financial, schedule, and risk mitigation goals."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "6"
                    },
                    "ProjectTitle": {
                        "val": "Netcentric Systems Test"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "36.662"
                        },
                        "PriorYear": {
                            "val": "15.204"
                        },
                        "CurrentYear": {
                            "val": "13.298"
                        },
                        "BudgetYearOne": {
                            "val": "11.877"
                        },
                        "BudgetYearOneBase": {
                            "val": "11.877"
                        },
                        "BudgetYearTwo": {
                            "val": "10.783"
                        },
                        "BudgetYearThree": {
                            "val": "10.777"
                        },
                        "BudgetYearFour": {
                            "val": "10.442"
                        },
                        "BudgetYearFive": {
                            "val": "10.584"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Net-Centric Systems Test (NST) project is pursuing test technologies to emulate multi-Service, Joint, and coalition net-centric operations in a system of systems test and evaluation (T&E) environment.  Additionally, the NST project develops technologies to analyze and evaluate the increasingly massive amounts of structured and unstructured data generated by complex net-centric tests.  The technology to conduct T&E on net-centric systems is challenged by sensor platforms, command and control systems and weapon platforms that support the kill chain in a Joint operation.  These systems must be evaluated for their ability to provide an accurate, timely transfer of data (e.g., target tracks, weapons allocation, mission tasking and situational awareness) as the data passes among different systems of Service and coalition participants.  \n  The NST technologies advance test automation (test planning, test execution, test control, and analysis) that enable the virtual integration of Department of Defense (DoD) weapon laboratories and open air ranges.  Using models and simulations along with hardware-in-the-loop laboratories, the effectiveness of Joint missions can be assessed in terms of system-of-systems interoperability and effectiveness in executing Joint mission operations, including testing of weapons and command and control systems accessing and providing information to the Global Information Grid. Furthermore, many of the warfighting capabilities being developed to support net-centric military operations are software-intensive and test technologies must be developed to fully characterize these systems. \n  Also included are technologies to support the testing and agile environment associated with Engineering Resilience Systems, a high-priority S&T area for the Department. The technology development efforts within the NST project have been prioritized to align with DoD guidance on science and technology (S&T) priority investments, particularly in measuring “Data to Decision” techniques in warfighting capabilities.  Ultimately, the NST portfolio enables the T&E community to “test like we fight” by replicating net-enabled, Joint mission operations within a T&E environment."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Netcentric Systems Test"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.204"
                                            },
                                            "Text": {
                                                "val": "The NST project focused on efforts that enabled the Test and Training Enabling Architecture (TENA) to utilize remote methods of authentication and privilege management to distributed users.  The resulting technologies will support DoD remote authentication T&E needs and next generation multi-level security T&E capabilities.  Additionally, the NST project developed technologies to support the measurement and analysis of the net-centric test environment including technologies that support enterprise level test execution assessment and control. The NST project developed an architecture-driven mission effectiveness planning and visualization technology to support Design of Experiments-based end-to-end assessments. Moreover, NST developed an effectiveness measures framework that includes new TENA object model definitions that enable automated T&E planning and a real-time analysis tool.  Development of a distributed policy-based access control capability for the TENA middleware completed.  This technology showcased end user authentication, enforcement of the defined access control policy prior to joining the TENA execution, and the automatic distribution of the required certificates, keys, and login tokens. The NST project began development of technologies that apply automated analysis of large net-centric systems data sets using cloud computing technologies. \n  Development began on technologies that will provide an acoustic propagation model to provide sufficient fidelity to test torpedo performance operating in a range dependent propagation environment.  This technology will provide a real-time simulation\/emulation system for testing torpedo sonar systems in multiple bathometry, biological and threat environments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.298"
                                            },
                                            "Text": {
                                                "val": "Development will continue on technologies to support the use of TENA over a broad range of networks and to provide a common interoperability test architecture.  Modeling and simulation technologies to support emulation and stimulation of networks for conducting T&E along with simulation fidelity assessments in the T&E context will be investigated.  Technology developments will focus on semantic analysis of large data sets, including structured and unstructured data sets. These technology developments will include the ability to process unstructured test data into a structured format for use by data-to-decision algorithms.\n  The NST project will develop technologies that mitigate data biases introduced by the test infrastructure.  Multi-Level Security (MLS) and Cross Domain Solution (CDS) technologies will be investigated with the goals of improving the automation of preparing test data for analysis as well as facilitating automated sharing of information across all security enclaves. The NST project will investigate technologies that assess DoD platforms employing big data techniques and facilitate T&E of warfighter systems in an agile communication environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.877"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.877"
                                            },
                                            "Text": {
                                                "val": "Work started in FY 2015 will continue.  The NST project will invest in developing CDS\/MLS, assessing DoD platform’s employing big data techniques and T&E of warfighting systems in a net-enabled agile environment. Developments will include verification and validation across integrations and aggregation techniques for systems evaluation."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Percentage of T&E\/S&T projects progressing satisfactorily toward technical, financial, schedule, and risk mitigation goals."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "7"
                    },
                    "ProjectTitle": {
                        "val": "Unmanned and Autonomous System Test"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "8.432"
                        },
                        "PriorYear": {
                            "val": "5.589"
                        },
                        "CurrentYear": {
                            "val": "4.285"
                        },
                        "BudgetYearOne": {
                            "val": "6.218"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.218"
                        },
                        "BudgetYearTwo": {
                            "val": "8.640"
                        },
                        "BudgetYearThree": {
                            "val": "10.658"
                        },
                        "BudgetYearFour": {
                            "val": "11.359"
                        },
                        "BudgetYearFive": {
                            "val": "11.513"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Unmanned and Autonomous Systems (UAS) support every domain of warfare.  They operate in space, in air, on land, on the sea surface, undersea and in subterranean conditions to support a vast variety of missions.  The emergence of unmanned systems brings a host of revolutionary capabilities that will profoundly influence warfare.  The Unmanned and Autonomous Systems Test (UAST) project addresses current and emerging challenges associated with the test and evaluation (T&E) of these critical warfighting capabilities.  The technology developments within the UAST portfolio have been prioritized to align with Department of Defense (DoD) guidance on science and technology priority investments, particularly in assessing autonomy.  As such, the UAST project is developing test technologies to simulate, stimulate, instrument, measure, and assess autonomous systems’ ability to perceive its environment, process information, adapt to dynamic conditions, make decisions, and effectively act on those decisions in the context of mission execution.\n  The UAST project will provide the test technologies to effectively measure performance and characterize risk, thereby increasing warfighter trust in autonomous systems.  Current DoD test capabilities and methodologies are insufficient to address the testing of increasingly autonomous units and teams of unmanned systems operating in unstructured, dynamic, battlespace environments.  Furthermore, advancements are being made in developing collaborating system-of-autonomous-systems, working in concert as a swarm or pack and in close proximity with humans.  New test technologies are needed to stress the collective set of autonomous systems under realistic conditions, predict emergent behavior of autonomous systems, emulate the complex environment, and assess mission performance of these highly coupled and intelligent systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Unmanned and Autonomous System Test"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.589"
                                            },
                                            "Text": {
                                                "val": "The UAST project focused on predicting and assessing the autonomy functions of unmanned and autonomous systems through ongoing technology developments.  Efforts continued to develop technology to virtualize test sites into ultra-high-fidelity, real-time simulators. The goal is to facilitate verification, assessment, and evaluation of UASs in a realistic, risk free, highly measureable, statistically significant manner prior to field test.  The UAST project built automated tools to test the robustness of black-box UASs in unexpected operating scenarios. The technology feeds inputs that trigger software bugs to find vulnerabilities without costly field testing.  The test technology was developed and implemented as a prototype to enable black box system automated autonomy architecture stress testing, with a focus on UAS software and the interfaces of the core components without requiring source code.  The approach is agnostic to the specific component interface.  This technology provided testers with a perspective of system performance and a previously unavailable prediction of behavior. This automated stress testing tool was initially transitioned and integrated into the development and T&E processes for the Autonomous Mobility Appliqué System (AMAS), a multiplatform kit that integrates low-cost sensors and control systems onto U.S. Army and Marine Corps tactical vehicles to assist drivers or enable autonomous operation in convoys. Additionally, the UAS stress test tool was used on the Autonomous Aerial Cargo\/Utility System (AACUS), an Naval prototype that explores advanced autonomous capabilities for reliable resupply\/retrograde and, in the long term, casualty evacuation. In both cases, the UAST project stress testing technology identified failure modes before they were triggered in the field. Development continued on technology for test infrastructure that combines synthetic and actual forces to produce a realistic, real-time, interactive autonomous vehicle test environment. This technology is also being developed to provide safe testing assurances via on-board safety monitoring.\nFY 2015 Plans: \nWork on virtualizing test sites will complete and transition to T&E agencies as will the stress testing tool.  Development of technology that combines synthetic and actual forces to produce a realistic, real-time, interactive autonomous vehicle test environment will continue.  New efforts will focus on investing in test technologies supporting the near term challenges identified in the 2013 – 2038 DoD Unmanned Systems Integrated Roadmap, such as, integrating DoD unmanned systems within the National Airspace and safely operating unmanned aerial systems within our national ranges.  The UAST project will further explore test technologies to meet the challenges of testing autonomy by leveraging advances made in the standardization of UAS architectures, functional components, and interfaces. UAST will initiate research in the area of autonomous system test planning to develop technologies which develop the most salient test plans for maritime, air, and ground-based autonomous systems and enable test ranges to identify the degree of regression testing required for autonomous systems upon changes to the hardware and software."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.285"
                                            },
                                            "Text": {
                                                "val": "Work on virtualizing test sites will complete and transition to T&E agencies as will the stress testing tool.  Development of technology that combines synthetic and actual forces to produce a realistic, real-time, interactive autonomous vehicle test environment will continue.  New efforts will focus on investing in test technologies supporting the near term challenges identified in the 2013 – 2038 DoD Unmanned Systems Integrated Roadmap, such as, integrating DoD unmanned systems within the National Airspace and safely operating unmanned aerial systems within our national ranges.  The UAST project will further explore test technologies to meet the challenges of testing autonomy by leveraging advances made in the standardization of UAS architectures, functional components, and interfaces. UAST will initiate research in the area of autonomous system test planning to develop technologies which develop the most salient test plans for maritime, air, and ground-based autonomous systems and enable test ranges to identify the degree of regression testing required for autonomous systems upon changes to the hardware and software."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.218"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.218"
                                            },
                                            "Text": {
                                                "val": "Technology that combines synthetic and actual forces to produce a realistic, real-time, interactive autonomous vehicle test environment will complete and transition. The UAST project will continue to develop test technology that addresses mid-term UAS test challenges associated with autonomy and initiate efforts to explore the far term challenges of testing system intelligence.  These efforts will include an examination of test technologies that measure the logical flow of sensing data, to perception, decisions, and action.  Additionally, the UAST project will focus on enhancing the test environment to assess unmanned threat systems.  The UAST project will initiate efforts to enable dynamic construction, control, measurement of complex systems-of-autonomous-systems and tactically meaningful counter-unmanned systems analysis.  The UAST project will invest in complementary tools to predict UAS behavior by monitoring how autonomous systems process data in response to environmental changes.  The UAST project will investigate technologies for T&E of UAS-to-UAS and human-to-UAS interactions."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Percentage of T&E\/S&T projects progressing satisfactorily toward technical, financial, schedule, and risk mitigation goals."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "8"
                    },
                    "ProjectTitle": {
                        "val": "Cyberspace Test"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "2.884"
                        },
                        "PriorYear": {
                            "val": "3.777"
                        },
                        "CurrentYear": {
                            "val": "4.503"
                        },
                        "BudgetYearOne": {
                            "val": "6.840"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.840"
                        },
                        "BudgetYearTwo": {
                            "val": "8.801"
                        },
                        "BudgetYearThree": {
                            "val": "11.530"
                        },
                        "BudgetYearFour": {
                            "val": "14.914"
                        },
                        "BudgetYearFive": {
                            "val": "15.090"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Department of Defense (DoD) ability to use cyberspace for rapid communication and information sharing in support of operations is a critical enabler of DoD military missions.  Advancements in utilizing cyberspace are outpacing the technologies needed for test and evaluation (T&E).  The Cyberspace Test Technology (CTT) project develops advanced technologies and methodologies to test and evaluate DoD capabilities and information networks to defend and conduct full-spectrum military operations across cyberspace.  Current cyberspace T&E capabilities are insufficient to support the continual experimental, contractor, developmental, operational, and live-fire testing requirements of warfighter systems operating in cyberspace.  Many of the test tools and infrastructure items required for systems in cyberspace will need advancement and maturation of various nascent test technologies.  The CTT project will address test technology shortfalls in cyberspace testing, including planning cyberspace tests, creating representative cyberspace threats and test environments, executing cyberspace tests, and performing cyberspace test analysis and evaluation."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Cyberspace Test"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.777"
                                            },
                                            "Text": {
                                                "val": "The CTT project continued threat intelligence gathering, analysis, and design which resulted in successful demonstration of threat traffic generation and automated attack. The CTT project also successfully demonstrated the initial framework for automated and verified sanitization processes on commodity information technology (IT) assets and began risk reduction for sanitization of candidate specialized IT assets.  This technology will eliminate traces of contaminating cyber attacks between tests, an important step in the cyberspace test execution process.\n  The baseline CTT roadmap was completed, mapping technologies to needs that synchronize with overall Department cyberspace plans."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.503"
                                            },
                                            "Text": {
                                                "val": "The threat and sanitization technology development will continue. The threat effort will focus on maturing cyberspace threat representation and instrumentation technologies required to assess cyberspace vulnerabilities and to improve the agility of cyberspace test capabilities.\n  The sanitization technology development will focus on maturing test technologies to develop a reliable, fast, automated, and cost-effective sanitization approach for militarized electronic systems.  This will allow the rapid repurposing of equipment between different tests to meet the expanding requirements for cyber testing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.840"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.840"
                                            },
                                            "Text": {
                                                "val": "The threat work and sanitization technology will finish and transition to cyber test organizations.  The CTT project will continue to seek out and mature technology developments addressing the need to provide automated cyberspace test planning, create representative cyberspace threats and test environments, execute cyberspace tests, and perform cyberspace test analysis and evaluation.  These efforts will support defensive and offensive cyberspace weapon systems testing, as well as, cyber resiliency testing."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Percentage of T&E\/S&T projects progressing satisfactorily toward technical, financial, schedule, and risk mitigation goals."
                        }
                    }
                }
            ]
        }
    }
}