{
    "id": "4c113a2d5e545847ef219ec84d0993f921bd9000",
    "meta": {
        "filename": "dod-2016_RDTE_2016_NAVY_BA1_3_RDTE_JustificationBook_Navy_PB_2016.zzz_unzipped_RDTE_JustificationBook_Navy_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603747N"
        },
        "ProgramElementTitle": {
            "val": "Undersea Warfare Advanced Tech"
        },
        "R1LineNumber": {
            "val": "23"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "9.985"
            },
            "BudgetYearOne": {
                "val": "13.748"
            },
            "BudgetYearOneBase": {
                "val": "13.748"
            },
            "BudgetYearTwo": {
                "val": "22.592"
            },
            "BudgetYearThree": {
                "val": "37.760"
            },
            "BudgetYearFour": {
                "val": "54.167"
            },
            "BudgetYearFive": {
                "val": "75.975"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The efforts described in this Program Element (PE) are based on investment directions as defined in the Naval S&T Strategic Plan approved by the S&T Corporate Board (Sep 2011).  This strategy is based on needs and capabilities from Navy and Marine Corps guidance and input from the Naval Research Enterprise (NRE) stakeholders (including the Naval enterprises, the combatant commands, the Chief of Naval Operations (CNO), and Headquarters Marine Corps).  It provides the vision and key objectives for the essential science and technology efforts that will enable the continued supremacy of U.S. Naval forces in the 21st century.  The Strategy focuses and aligns Naval S&T with Naval missions and future capability needs that address the complex challenges presented by both rising peer competitors and irregular\/asymmetric warfare.\n\nAll Navy advanced technology development in undersea target detection, classification, localization, tracking and neutralization is funded through this PE.  The related technologies being developed are aimed at enabling Sea Shield, one of the three core operational concepts detailed in the Naval Transformational Roadmap.  Associated efforts focus on new Anti-Submarine Warfare (ASW) operational concepts that promise to improve wide-area surveillance, detection, localization, tracking and attack capabilities against quiet adversary submarines operating in noisy and cluttered shallow water environments.  The focus is on leveraging technologies that will protect the country's current capital investment in surveillance, submarine, surface ship and air ASW assets.\n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "9.985"
                },
                "BudgetYearOne": {
                    "val": "14.983"
                },
                "BudgetYearOneBase": {
                    "val": "14.983"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "9.985"
                },
                "BudgetYearOne": {
                    "val": "13.748"
                },
                "BudgetYearOneBase": {
                    "val": "13.748"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-1.235"
                },
                "BudgetYearOneBase": {
                    "val": "-1.235"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.386"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.386"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.849"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.849"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Not applicable.\n\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "2916"
                    },
                    "ProjectTitle": {
                        "val": "Undersea Warfare Advanced Technology"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "9.985"
                        },
                        "BudgetYearOne": {
                            "val": "13.748"
                        },
                        "BudgetYearOneBase": {
                            "val": "13.748"
                        },
                        "BudgetYearTwo": {
                            "val": "22.592"
                        },
                        "BudgetYearThree": {
                            "val": "37.760"
                        },
                        "BudgetYearFour": {
                            "val": "54.167"
                        },
                        "BudgetYearFive": {
                            "val": "75.975"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "All Navy advanced technology developments in undersea target detection, classification, localization, tracking and neutralization are funded through this project.  Technologies being developed within this project are aimed at enabling Sea Shield, one of the three core operational concepts detailed in the Naval Transformational Roadmap. Associated efforts focus on new ASW operational concepts that promise to improve wide-area surveillance, detection, localization, tracking and attack capabilities against quiet adversary submarines operating in noisy and cluttered shallow water environments. Related efforts are aimed at leveraging technologies that will protect the country's current capital investment in surveillance, submarine, surface ship and air ASW assets."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Naval Forces UUV Development"
                                    },
                                    "Description": {
                                        "val": "Develop critical technology for Long Endurance LDUUV to meet 30+ days.  Critical technology includes Energy, Autonomy, and Endurance. INP - Large Displacement UUV (LD UUV)\n\nFunding Increases for FY 2015 to FY 2016 due to an increased development of reliable technology for 30 days for LDUUV."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.985"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Initiate the development and demonstrate Autonomy technology that will provide the ability to avoid undersea static obstacles, operate in a variety of currents, and adapt to local environment to maintain station.\n- Initiate Endurance technology that will develop and demonstrate endurance technology that will investigate new reliability strategy to operate for 30 days."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.748"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.748"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts from FY 2015 less those noted as completed above.\n- Initiate Select UUV for ASW mission and measure it's characteristics.\n- Initiate design and construction at sea test article for Virtual Acoustic Senor Array."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Improve target detection, localization, and tracking and increase attack capabilities by providing the following capabilities:\n- Localization of 85% or more of enemy submarines in far forward or contested waters with false locations of less than 10% of total calls.\n- Effective cueing of an attack from a distance of up to 200nm.\n- Improvement of the Lightweight Torpedo (Mk 54). Specific improvements are classified.\n- Extending deep water active distributed system lifetime to a few months with a probability of detection (Pd) of 90% within 4 hours (field configuration) or 90% per crossing (barrier configuration), with a False Alarm Rate (FAR) of no more than 4\/day.\n- Delivery from a Vertical Takeoff Unmanned Air Vehicle (VTUAV) and\/or a long-range, high-speed Unmanned Air Vehicle (UAV) a compact undersea weapon capable of a high Probability of Kill (PK) given precise target localization.\n- Detection and localization performance with a single-line vector sensor array nominally equivalent or superior to that of two coherently processed TB-29A arrays. Acquisition costs to be competitive with the cost of a current TB-29A and at least 30% less than the cost of two arrays. Sensor and telemetry packaging will be adequate to achieve neutral buoyancy in an existing TB-29A form factor with array power efficiency greater than 75%. Array handling will be compatible with the existing TB-29 handling system.\n\nIncrease sensor to shooter performance and the effective lifetime of distributed ASW search systems by:\n- Achieving a drifting active distributed system lifetime of at least two days in areas of tactical significance while maintaining required system performance with a minimum number of sensor nodes.\n- Maintaining an effective lifetime of a month for mobile active distributed systems when subjected to the action of eddies from a major ocean current.\n- Predicting reseed 6 hours before performance degrades.\n- Holding the Area of Uncertainty (AOU) to no larger than 10 nm2 for an hour after initial detection through the control of the coherent sources.\n\nThrough a combination of better Anti-Submarine Warfare (ASW) command-level training and improved operator training provide the following:\n- Improve the ability of active sonar operators to detect targets and reject potential false alarms compared to current simulation based training.\n- Increase Pd by 50%.\n- Provide a decrease in FAR by a factor of two.\n- Provide a reduction in the probability of a hit on a High Value Unit (HVU) by a factor of two.\n- Improve the ability of the ASW Commander to position assets to increase coverage, reduce active system interference and deal effectively with competing missions.\n- Reduce training cost by greater than 80% and increase the frequency of training opportunities by greater than 600% relative to live training."
                        }
                    }
                }
            ]
        }
    }
}