{
    "id": "5108d3eeb61f2557766928d9c04849f597ef8ff7",
    "meta": {
        "filename": "dod-2016_RDTE_2016_ARMY_BA2_RDTE_JustificationBook_Army_PB_2016.zzz_unzipped_RDTE_JustificationBook_Army_PB_2016.xml",
        "budget_year": "2016",
        "budget_cycle": "PB",
        "submission_date": "2015-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602787A"
        },
        "ProgramElementTitle": {
            "val": "Medical Technology"
        },
        "R1LineNumber": {
            "val": "28"
        },
        "BudgetYear": {
            "val": "2016"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2015-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "81.386"
            },
            "CurrentYear": {
                "val": "76.044"
            },
            "BudgetYearOne": {
                "val": "76.853"
            },
            "BudgetYearOneBase": {
                "val": "76.853"
            },
            "BudgetYearTwo": {
                "val": "77.111"
            },
            "BudgetYearThree": {
                "val": "82.334"
            },
            "BudgetYearFour": {
                "val": "82.912"
            },
            "BudgetYearFive": {
                "val": "84.549"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) supports application of knowledge gained through basic research to refine drugs, vaccines, medical devices, diagnostics, medical practices\/procedures, and other preventive measures essential to the protection and sustainment of Warfighter health. Research is conducted in five principal areas: Combat Casualty Care; Military Operational Medicine; Military Relevant Infectious Diseases Clinical and Rehabilitative Medicine; and Systems Biology\/Network Sciences. Research is funded in six projects.  \n\nProject 869 refines knowledge and technologies on screening tools and preventive measures for post-traumatic stress disorder and mild traumatic brain injuries, physiological monitors, and interventions to protect Warfighter's from injuries resulting from operational stress, and exposure to hazardous environments and materials.  Also conducts research on medically valid testing devices (i.e. the test mannequins that are true to the human form and physiologically and anatomically accurate) and predictive models used for the refinement of Warfighter protective equipment. This project is being coordinated with the Defense Health Program.  \n\nProject 870 designs and refines medical diagnostic assays\/tests, drugs, and vaccines for protection from and treatment of naturally occurring diseases, wound infections of military importance, as identified by worldwide medical surveillance and military threat analysis. This project is being coordinated with the Defense Health Program.  \n\nProject 874 identifies and evaluates drugs, biologics (products derived from living organisms), medical devices, and diagnostics for field trauma care systems, resuscitation, life support, and post-evacuation restorative and rehabilitative care. Focus is identifying more effective critical care technologies and protocols to treat severe bleeding, traumatic brain injury and other blast related injuries, and treatments for ocular (eye) injury and visual system dysfunction.  Additional focus areas are laboratory and animal studies of regenerating skin, muscle, nerves, and bone tissue for the care and treatment of combat trauma casualties. This project is being coordinated with the Defense Health Program. \n\nProject FH2 conducts applied research focused on sustainment of a healthy Warfighters throughout the entire deployment life cycle.\n\nProject VB4 includes applied research in systems biology of military-relevant diseases such as Post Traumatic Stress Disorder (PTSD), coagulopathy (blood clotting disorders), suicide, and chronic pain. Another focus is environmental exposure toxicology (study of the biology of harm from toxic substances in the environment). The goals are to understand mechanisms (processes and pathways), develop molecular and physiological markers (biological molecules as indicators of the body's functions such as immune response) for future diagnostic systems, and identify therapeutic interventions supporting early decisions for therapeutic strategies. The core capability is a data system that integrates iterative (successively building upon data and results) biological tests, computer simulations, and animal studies, providing powerful analyses in support of research across United States Army Medical Research & Materiel Command. This project is being coordinated with the Defense Health Program. \n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology, focus areas and the Army Modernization Strategy.\n\nAll medical applied research is conducted in compliance with U.S. Food and Drug Administration (FDA) or Environmental Protection Agency (EPA) regulations. The FDA requires thorough testing in animals (preclinical testing) to ensure safety and, where possible, effectiveness prior to evaluation in controlled human clinical trials (upon transition to 6.3 Advanced Technology Development). This PE focuses on research and refinement of technologies such as product formulation and purification and laboratory test refinement with the aim of identifying candidate solutions. This work often involves testing in animal models. The EPA also requires thorough testing of products, such as sterilants, disinfectants, repellents, and insecticides to ensure the environment is adequately protected before these products are licensed for use.\n\nProgram refinement and execution is externally peer-reviewed and fully coordinated with all Services as well as other agencies through the Joint Technology Coordinating Groups of the Armed Services Biomedical Research Evaluation and Management (ASBREM) Community of Interest (COI). The ASBREM COI, formed under the authority of the Assistant Secretary of Defense for Research and Engineering, serves to facilitate coordination and prevent unnecessary duplication of effort within the Department of Defenses (DoD) biomedical research and refinement community, as well as their associated enabling research areas.\n\nWork funded in this project PE is fully coordinated with efforts undertaken in PE 0603002A and the Defense Health Program.\n\nWork in this PE is performed by the Walter Reed Army Institute of Research (WRAIR), Silver Spring, MD and its overseas laboratories; U.S. Army Medical Research Institute of Infectious Diseases (USAMRIID) and the Armed Forces Institute of Regenerative Medicine (AFIRM), Fort Detrick, MD; U.S. Army Center for Environmental Health Research (USACEHR), Fort Detrick, MD; U.S. Army Research Institute of Environmental Medicine (USARIEM), Natick, MA; the U.S. Army Dental Trauma Research Detachment and the U.S. Army Institute of Surgical Research (USAISR), Joint Base San Antonio-Fort Sam Houston, TX; U.S. Army Aeromedical Research Laboratory (USAARL), Fort Rucker, AL; and the Naval Medical Research Center (NMRC), Silver Spring, MD."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "93.290"
                },
                "CurrentYear": {
                    "val": "76.068"
                },
                "BudgetYearOne": {
                    "val": "77.330"
                },
                "BudgetYearOneBase": {
                    "val": "77.330"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "81.386"
                },
                "CurrentYear": {
                    "val": "76.044"
                },
                "BudgetYearOne": {
                    "val": "76.853"
                },
                "BudgetYearOneBase": {
                    "val": "76.853"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-11.904"
                },
                "CurrentYear": {
                    "val": "-0.024"
                },
                "BudgetYearOne": {
                    "val": "-0.477"
                },
                "BudgetYearOneBase": {
                    "val": "-0.477"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "CurrentYear": {
                        "val": "-0.024"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-9.773"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.131"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.477"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.477"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "869"
                    },
                    "ProjectTitle": {
                        "val": "Warfighter Health Prot & Perf Stnds"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "34.032"
                        },
                        "CurrentYear": {
                            "val": "31.594"
                        },
                        "BudgetYearOne": {
                            "val": "30.043"
                        },
                        "BudgetYearOneBase": {
                            "val": "30.043"
                        },
                        "BudgetYearTwo": {
                            "val": "27.052"
                        },
                        "BudgetYearThree": {
                            "val": "29.771"
                        },
                        "BudgetYearFour": {
                            "val": "29.988"
                        },
                        "BudgetYearFive": {
                            "val": "30.580"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project conducts research to prevent and protect Warfighers from training and operational injuries, refine mechanisms for detection of physiological (human physical and biochemical function) and psychological (mental) health problems, evaluate hazards to head, neck, spine, eyes, and ears, set the standards for rapid return-to-duty, and determine new methods to sustain and enhance performance across the operational spectrum. This research provides medical information important to the design and operational use of military systems, and this work forms the basis for behavioral, training, pharmacological (drug actions), and nutritional interventions. \n\nThe four main areas of study are: \n(1) Environmental Health and Protection \n(2) Physiological Health\n(3) Injury Prevention and Reduction\n(4) Psychological Health and Resilience\n\nAdditionally the Warfigher Systems Engineering Architecture task advances medical S&T in the areas of injury prevention and performance sustainment in the context of human interaction with new Soldier systems and provide greater insight into informing new research in development of Warfigher systems and the interactions between Warfighers and the systems they employ.  \n\nPromising efforts identified in this project are further matured under PE 0603002A, project MM3.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology, focus areas and the Army Modernization Strategy.   \n\nWork in this project is performed by the Walter Reed Army Institute of Research (WRAIR), Silver Spring, MD; the U.S. Army Research Institute of Environmental Medicine (USARIEM), Natick, MA; U.S. Institute of Surgical Research (USAISR), Joint Base Sant Antonio-Fort Sam Houston, TX; and the U.S. Army Aeromedical Research Laboratory (USAARL), Fort Rucker, AL. \n\nEfforts in this project support the Soldier Portfolio and the principal areas of Combat Casualty Care and Military Operational Medicine."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Physiological Health - Nutritional Sustainment and Fatigue Interventions"
                                    },
                                    "Description": {
                                        "val": "This effort evaluates methods for managing and controlling the effects of nutrition and fatigue on Warfighter operational performance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.984"
                                            },
                                            "Text": {
                                                "val": "Established the nutritional requirements for optimizing Warfighter re-fueling; Military Dining Facility serving practices that promote healthy food choices; nutritional requirements for optimizing bone health; and developed dietary support interventions that accelerate cognitive recovery after operational stress.   These interventions optimize Warfighter recovery from demanding missions through nutrition.  Developed mathematical models and algorithms for prediction of cognitive resilience based on physiological factors identified in laboratory studies, which allowed resilience training to be personally optimized; compared the effectiveness and post-awakening performance profile of novel sleep-inducers against that of currently available pharmaceuticals, which determined the most efficient intervention for sleep induction; developed a mathematical method for estimating thermal-work strain from non-invasive measures such as heart rate, skin temperature, heat flux, without the use of thermometer pills, which allowed for the optimization of Warfighter load distribution and energy expenditure."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.610"
                                            },
                                            "Text": {
                                                "val": "Establish nutrition approaches that promoting resistance to physical, cognitive and environmental stressors and promote muscle and bone recovery. Develop next generation predictive algorithms that estimate overheating for incorporation into wearable sensor systems. Establish sensors and bio-mathematical models capable of predicting cognitive status and likelihood of risk for musculoskeletal (muscle, bone, tendons, and ligaments) injury. Determine patterns of physiological (human mechanical, physical, and biochemical functions), behavioral, and cognitive-affective responses in individuals during exposure to multiple stressors and develop a working operational definition of physiological resilience and algorithms to predict individualized resilience."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.617"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.617"
                                            },
                                            "Text": {
                                                "val": "Will determine the role of eating rate in energy balance. Will establish the effects of nutritional interventions on the localized immune response during wound healing. Will determine the effectiveness of novel feeding platforms (dining facility organization) for the improvement of dietary quality during garrison feeding. Will determine relevant predictors, moderators and outcome metrics that enhance the ability to predict a Warfighters capacity to recover quickly, both mentally and physically. Will establish a capability to sense and predict physiological responses in individual Warfighters following exposure to environmental stressors or during operational missions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Environmental Health and Protection - Physiological ( human physical and biochemical functions) Awareness Tools and Warrior Sustainment in Extreme Environments"
                                    },
                                    "Description": {
                                        "val": "This effort evaluates remote monitoring of Soldier physiological (human physical and biochemical functions) status and mitigating\/eliminating the effects of heat, cold, altitude, and other environmental stressors on Soldier performance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.892"
                                            },
                                            "Text": {
                                                "val": "Conducted studies to determine whether physiological fatigue in cold environments increases susceptibility to non-freezing cold injury, such as trenchfoot and hypothermia, and developed screening procedures to identify Warfighters most at risk for non-freezing cold injury. Continued studies to determine the impact of hypoxia (oxygen depletion) on peripheral blood flow responses and susceptibility to non-freezing cold injury."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.337"
                                            },
                                            "Text": {
                                                "val": "Identify physiological reflexes that improve hand and finger dexterity during cold exposure and refine localized heating strategies to improve dexterity  in cold weather operations. Develop decision aids for trade-off analyses of the impact of body armor protection and load on aerobic performance capabilities in temperate and hot environments. Determine if thermoregulatory (ability of an organism to keep its body temperature within certain boundaries) fatigue and altitude exposure increase susceptibility for non-freezing cold injury symptoms including numbness. Identify biomarkers (biologically derived indicator of a process, event or condition, e.g. protein) predictive of individual risk for developing acute mountain sickness at high altitude operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.446"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.446"
                                            },
                                            "Text": {
                                                "val": "Will perform laboratory and field studies to refine predictive models of altitude sickness, acclimatization status, and work performance at high altitude. Will develop a mobile application for a PC-based Altitude Readiness Management System decision aid, and automated altitude acclimatization monitor for a rapid ascent to high altitudes. Will determine if thermoregulatory (ability of an organism to keep its body temperature within certain boundaries) fatigue or high altitude exposures increase susceptibility of non-freezing cold injury and hypothermia. Will determine if localized warming that will improve peripheral blood circulation will also decrease susceptibility to non-freezing cold injury. Will establish the effectiveness of novel pharmaceutical treatments for heat injury in an animal model to inform the development of promising drug interventions proposed to reduce the severity or alleviate organ damage and enhance recovery."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Injury Prevention and Reduction - Neurosensory Injury Prevention"
                                    },
                                    "Description": {
                                        "val": "The Warrior Injury Assessment Manikin analyzes and models the effects of mechanical and operational stressors on Warfighter neurosensory and spine health. It also can models the effects of s acoustic and impact trauma, vibration, and jolt as stressors on the brain, spine, eyes, and hearing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.006"
                                            },
                                            "Text": {
                                                "val": "Developed improved eye protection standards and ophthalmic (pertaining to the eye) guidelines for protective eyewear that serves the various Warfighter occupations and developed hearing protection strategies for optimized active noise-reduction protection. Developed novel assessment methods to detect impulse noise exposures. Developed a computational fluid dynamic model of the eye to evaluate the effects of blast exposures to ocular tissue."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.489"
                                            },
                                            "Text": {
                                                "val": "Develop spinal injury criteria and protection assessment methodologies for military vehicle occupants.  Develop methods for assessing the effectiveness of prevention strategies against hearing and vestibular (sensory system supporting movement and sense of balance, located in the inner ear) injuries. Develop assessment criteria for prediction of eye injury resulting from blunt, ballistic, and blast-wave forces, and determine injury prevention criteria for eye injury induced by repetitive blast exposures."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.463"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.463"
                                            },
                                            "Text": {
                                                "val": "Will perform crash and blast relevant vertical acceleration experiments to determine improved predictions and diagnostics of spinal injury. Will characterize middle ear function under impulse (sudden loud) noise for improvement of current hearing injury models. Will validate test criteria, and develop predictive ocular (eye) injury algorithm to evaluate protective eyewear."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Injury Prevention and Reduction - Musculoskeletal Injury Prevention"
                                    },
                                    "Description": {
                                        "val": "This effort evaluates and assesses the effects of repetitive motion during military operations and training on the human body; will provide mathematical models to predict the likelihood of physical injuries following continuous operations and muscle fatigue; evaluates current standards for return-to-duty; and establishes improved medical test methods with the goal of rapid return to duty of Warfighters following injury."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.058"
                                            },
                                            "Text": {
                                                "val": "Developed a quantitative computational model that can predict physical performance and risk of injury of individual Warfighters and developed training strategies and\/or dietary interventions to improve recovery following intense physical exercise."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.075"
                                            },
                                            "Text": {
                                                "val": "Develop mathematical models of functional neuromuscular adaptation following muscle injury and determine the effect of inflammatory processes on muscle repair and regeneration.  These models will predict the relative risk of re-injury, and incomplete healing. Determine the modifiable and non-modifiable risk hazards for musculoskeletal injuries."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.054"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.054"
                                            },
                                            "Text": {
                                                "val": "Will utilize mathematical models of neuromuscular processes (central nervous system control of muscle functioning) to develop interventions that promote repair and regeneration following muscle injury and modify the inflammatory response and reduce the risk of incomplete healing or subsequent re-injury. Will utilize knowledge of risk factors obtained from basic studies to develop interventions to prevent and mitigate risks in the training and operational environments that could lead to musculoskeletal (muscle, bone, tendons, and ligaments) injuries."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Injury Prevention and Reduction - Injury Return-to-Duty (RTD) Standards:"
                                    },
                                    "Description": {
                                        "val": "This effort evaluates current standards for rapid RTD and establishes improved and validated medical standards and test methods with the goal of more rapid and safe RTD of injured Warfighters."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.624"
                                            },
                                            "Text": {
                                                "val": "Compared varying treatment protocols for their ability to positively affect RTD after injury and developed a toolkit for assessment that includes testing vision, hearing, and vestibular (sensory system supporting movement and sense of balance) function; developed models that predict and prevent auditory (process of hearing) injury; and developed criteria to improve hearing conservation and guide development of hearing protection equipment for Warfighters."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.015"
                                            },
                                            "Text": {
                                                "val": "Characterize current Warfighter injury trends in training and operations contributing to lost duty days, reduced mission effectiveness, and occupational disability. Determine the effects of physical, auditory, and visual system injury on military occupational performance and define minimal pre-RTD performance standards Warfighter. Evaluate Warfighters with traumatic brain injury and co-morbid auditory or vision deficits."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.636"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.636"
                                            },
                                            "Text": {
                                                "val": "Will develop standards based on current Warfighter trends of Warfighter injuries contributing to lost duty days, reduced mission effectiveness and occupational disability, specific to Military Occupational Specialties. Will perform studies to update the neurosensory (sensory activity or functions of the nervous system) performance return to duty toolkit previously transitioned to the Defense Center of Excellence for Psychological health and Traumatic Brain Injury. Will determine the effects of physical injury on military occupational performance and define minimal standards for Warfighter performance prior to returning to duty."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Psychological Health - Psychological Resilience"
                                    },
                                    "Description": {
                                        "val": "This effort refines, validates, and disseminates early interventions to prevent and reduce combat-related behavioral health problems, including symptoms of post-traumatic stress disorder (PTSD), depression, anger problems, anxiety, substance abuse, post-concussive symptoms, and other health risk behaviors.  Also assesses and refines interventions to enhance and sustain psychological resilience throughout the Warfighter's career."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.272"
                                            },
                                            "Text": {
                                                "val": "Evaluated and determined optimal interventions for preventing and treating deployment-related PTSD and co-morbidities (more than one concurrent illness) to include medications, psychotherapy and medication combinations, and alternative therapy protocols, including internet- based cognitive (mental processes) therapy.  These intervention strategies were used to optimize treatment outcomes and to implement more effective, efficient, and economical treatment regimens; benchmarked emerging behavioral health trends through rapid fielding assessment teams which informed resilience training modifications. This  ensured rapid response to Warfighter needs and determined evidence-based recommendations for Warfighter reintegration strategies into their units and society; developed and refined evidence-based resilience training strategies for the deployment cycle; developed best practice recommendations to facilitate Warfighters receiving the best possible training and provider care; and assessed factors that contribute to return-to-duty decisions and  researched  criteria and tools to inform return-to-duty decisions following psychological injury and instilling confidence in the Warfighter and provider."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.493"
                                            },
                                            "Text": {
                                                "val": "Develop and disseminate validated strategies and early interventions to enhance and sustain mental health and well-being throughout service member's careers and determine evidence-based recommendations for reintegration strategies. Benchmark behavioral health problems, risk, and resilience physiological biomarkers in Warfighters and their Families. Conduct analyses of neurocognitive (relating to or involving the central nervous system and cognitive abilities) test scores associated with a wide variety of psychological return-to-duty (RTD) outcomes. Conduct studies that explore the utility of sleep monitors and neurocognitive tools for psychological RTD decision making. Assess various mechanisms and interventions for reducing deployment-related anxiety. Develop and validate unit-based, post-deployment resilience training for Warfighters. Conduct trials with active duty Warfighters assessing optimal intervention methods for PTSD, including medications. Determine the correlation between levels of individual biomarkers and PTSD interventions, i.e. supplementing the current standard of care with extended exposure to surrogate traumatic events and virtual reality, to recreate the context of the original traumatic exposure."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.960"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.960"
                                            },
                                            "Text": {
                                                "val": "Will explore the effectiveness of improved sleep quality and quantity on the recovery from concussion.  Will perform studies to improve a Mindfulness training package to develop recommendations for Comprehensive Warfighter and Family Fitness (CSF2). Will analyze data from previous studies to determine if an alcohol use screening questionnaire can be effectively used in Warfighters. Will perform studies to revise Family resilience training across the deployment cycle. Will develop evidence-based recommendations for identifying and addressing difficulties with post-combat adjustment. Will conduct studies to verify whether a computer-based tool can help Warfighters deal with occupational stress and have more positive post-deployment outcomes, to include a reduction in anger symptoms. Will perform studies to improve and validate unit-based resilience training for Reserve Components. Will begin to evaluate evidence-based behavioral health leader training. Will provide recommendations for provider toolkit using sleep quality parameters to inform return-to-duty decisions. Will conduct studies to understand how to best increase Warfighter use of DoD provided behavioral health care. Will extend the Systems Biology Enterprise (SBE) PTSD biomarker research to identify biomarker differences, based on gender; will biomarkers to aid in distinguishing PTSD from frequently co-occurring or co-morbidities i.e. Mild Traumatic Brain Injury and Major Depressive Disorder.  Through pre- and post-deployment specimen collection, identify alterations in gastrointestinal and immune response systems signaling PTSD onset. Will continue studies to determine if a diet formulated with a blend of omega-3 fatty acids, glutamine, Vitamin D3 and zinc provides enhanced resiliency against psychological stressors and acute head trauma, in a small animal model."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Psychological Health & Resilience - Suicide Prevention"
                                    },
                                    "Description": {
                                        "val": "This effort supports methods to identify causative and preventive factors in military suicides."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.994"
                                            },
                                            "Text": {
                                                "val": "Tested the effectiveness of a brief, telephone-based intervention to increase behavioral health treatment-seeking among Service members at high risk of suicide; learned about the type and range of decisions made by behavioral healthcare providers, chaplains, and leaders to address suicide-related events that occur during deployment, the process for making those decisions, and the lessons learned; assessed how suicide-related events were managed and what could be improved; and developed guidelines and decision aids for use in deployed settings when suicide-related events occur."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Determine risk and protective factors associated with suicide behavior and intent.  Determine effective risk assessment and management methods for suicide prevention. Deliver interventions to unit leaders and unit members following suicide events in a combat environment including interventions to manage grief and bereavement, and suicide prevention strategies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.865"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.865"
                                            },
                                            "Text": {
                                                "val": "Will continue to advance the study from FY15 efforts to determine whether a brief cognitive behavioral intervention can encourage Warfighters to seek treatment. Will continue to develop evidence-based guidelines for leaders to manage suicide events."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Psychological Health & Resilience - Concussion\/Mild Traumatic Brain Injury (mTBI) Interventions"
                                    },
                                    "Description": {
                                        "val": "This effort refines and evaluates methods to detect and treat concussion as well as identify and evaluate the effects of cognitive deficits (decreases in the ability of individuals to acquire knowledge and understanding through thought experience and the senses) in Warfighters during operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.202"
                                            },
                                            "Text": {
                                                "val": "Conducted research to evaluate the utility of magnetoencephalography (MEG), (technique for mapping brain activity by recording magnetic fields produced by electrical currents occurring naturally in the brain), as a tool for differentiating PTSD from the brain injury, following a post-concussion event; compared two imaging techniques (MEG and functional magnetic resonance imaging) for effectively assessing brain injury following a post-concussion event. These efforts lead to more effective assessment of Warriors brain injury post-concussion and facilitate appropriate care."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.076"
                                            },
                                            "Text": {
                                                "val": "Characterize sleep duration, timing, and continuity on post-concussive symptoms using objective sleep measures.  Determine the relative utility of existing neurocognitive tools for assessment of post-concussive symptoms.  Develop algorithms to predict concussion likelihood based on post-exposure symptoms and brain injury"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.876"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.876"
                                            },
                                            "Text": {
                                                "val": "Will conduct studies to inform development of a concussion dosimeter (hardware sensor embedded with an injury prediction algorithm) working prototype to predict the likelihood of concussion based on measurements collected with sensors."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier Systems Engineering Architecture"
                                    },
                                    "Description": {
                                        "val": "This effort will advance medical S&T in the areas of injury prevention and performance sustainment."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.499"
                                            },
                                            "Text": {
                                                "val": "Advance medical S&T in the areas of injury prevention and performance sustainment in the context of human interaction with new Warfighter systems.  Provide greater insight into informing new research across the S&T community (medical and non-medical) in development of Warfighter systems and the interactions between Warfighters and the systems they employ.  Leverages the work being done in Physiological Health, Injury Prevention & Reduction, both musculoskeletal (muscle, bone, tendons, and ligaments) and neurosensory, Psychological Health and Resilience and Environmental Health to inform the Warfighter Systems Engineering Architecture initiative."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.126"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.126"
                                            },
                                            "Text": {
                                                "val": "Will advance medical research in the areas of injury prevention and performance optimization in the context of human interaction with new Warfighter systems and provide greater insight into informing new research across the research and development community (medical and non-medical) in development of optimized Warfighter systems and the interactions between Warfighters and the systems they employ. This effort will leverage research conducted in Physiological Health, Injury Prevention & Reduction, both musculoskeletal and neurosensory, (the sensory activity or functions of the nervous system), sensory activity or functions of the nervous system. Psychological Health and Resilience and Environmental Health and Protection to inform the Warfighter Systems Engineering Architecture initiative."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "870"
                    },
                    "ProjectTitle": {
                        "val": "Dod Med Def Ag Inf Dis"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "18.732"
                        },
                        "CurrentYear": {
                            "val": "17.741"
                        },
                        "BudgetYearOne": {
                            "val": "19.245"
                        },
                        "BudgetYearOneBase": {
                            "val": "19.245"
                        },
                        "BudgetYearTwo": {
                            "val": "20.650"
                        },
                        "BudgetYearThree": {
                            "val": "22.323"
                        },
                        "BudgetYearFour": {
                            "val": "22.791"
                        },
                        "BudgetYearFive": {
                            "val": "23.237"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project conducts applied research for medical countermeasures to naturally occurring infectious diseases that pose a significant threat to the operational effectiveness of forces deployed outside the United States. Effective preventive countermeasures (protective\/therapeutic drugs and vaccines and insect repellents and traps) protect the Force from disease and sustain operations by avoiding the need for evacuations from the theater of operations. Diseases of military importance are malaria, bacterial diarrhea, and viral diseases (e.g., dengue fever and hantavirus). In addition to countermeasures, this project funds refinement of improved diagnostic tools to facilitate early identification of infectious disease threats in an operational environment, informing Commanders of the need to institute preventive actions and improve medical care. Major goals are to integrate genomics (DNA-based) and proteomics (protein-based) as well as other new biotechnologies into the refinement of new concepts for new vaccine, drug, and diagnostics candidates.\n\nResearch conducted in this project focuses on the following five areas:\n\n(1) Drugs to Prevent\/Treat Parasitic (organisms living in or on another organisms) Diseases\n(2) Vaccines for Prevention of Malaria\n(3) Diagnostics and Disease Transmission Control\n(4) Bacterial Disease Threats (diseases caused by bacteria)\n(5) Viral Disease Threats (diseases caused by viruses)\n\nFor the refinement of drugs and biological products, studies in the laboratory and in animal models provide a proof-of-concept for these candidate products, including safety, toxicity (degree to which a substance can damage an organism), and effectiveness, and are necessary to provide evidence to the U.S. Food and Drug Administration (FDA) to justify approval for a product to enter into future human subject testing. Additional non-clinical studies are often needed in applied research even after candidate products enter into human testing during advanced technology development, usually at the direction of the FDA, to assess potential safety issues. Drug and vaccine refinement bears high technical risk. Of those candidates identified as promising in initial screens, the vast majority are eliminated after additional safety, toxicity, and\/or effectiveness testing. Similarly, vaccine candidates have a high failure rate, because animal testing may not be a good predictor of human response, and therefore candidate technologies\/products are often eliminated after going into human trials. Because of this high failure rate, a continuing effort to identify other potential candidates to sustain a working pipeline of countermeasures is critical for replacing those products that fail in testing.  \n\nWork is managed by the U.S. Army Medical Research and Materiel Command (USAMRMC) in coordination with the Naval Medical Research Center (NMRC). The Army is responsible for programming and funding all Department of Defense (DoD) naturally occurring infectious disease research requirements, thereby precluding duplication of effort within the Military Departments.   \n\nPromising medical countermeasures identified in this project are further matured under PE 0603002A, project 810.\n \nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology, focus areas and the Army Modernization Strategy.   \n \nWork in this project is performed by the Walter Reed Army Institute of Research (WRAIR), Silver Spring, MD, and its overseas laboratories; the U.S. Army Medical Research Institute of Infectious Disease (USAMRIID), Fort Detrick, MD; and the Naval Medical Research Center (NMRC), Silver Spring, MD, and its overseas laboratories."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Drugs to Prevent\/Treat Parasitic Diseases"
                                    },
                                    "Description": {
                                        "val": "This effort conducts assessments on and improves candidate drugs coming from the DoD discovery program and from other collaborations for prevention and treatment of malaria to counter the continuing spread of drug resistance to current drugs; conducts assessments in animal models of currently available drugs for use against cutaneous leishmaniasis (a skin-based disease transmitted by sand flies); and selects the most effective and safe candidates for continued refinement and possible clinical testing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.386"
                                            },
                                            "Text": {
                                                "val": "Tested new refined anti-malaria and anti-leishmania candidate drug treatments in animal models for safety and effectiveness"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.359"
                                            },
                                            "Text": {
                                                "val": "Continue to optimize candidate drugs and drug combinations to stay ahead of emerging drug resistance in malaria parasite(s)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.304"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.304"
                                            },
                                            "Text": {
                                                "val": "Will use small animal and non-human primate testing to down-select lead candidate malaria prophylaxis (measures taken to prevent health problems) drugs based on the Triazine (six-sided ring molecule composed of 3 carbon and 3 nitrogen atoms) class of compounds.  Will evaluate safety and effectiveness of lead curative drugs (Primaquine and Tafenoquine) in small animal models of malarias (persons getting sick a second time after drug treatment due to re-growth of parasites not eliminated during initial treatment)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Vaccines for Prevention of Malaria"
                                    },
                                    "Description": {
                                        "val": "This effort conducts studies to investigate new candidate vaccines for preventing malaria and selects the best candidate(s) for continued refinement.  A highly effective vaccine would reduce or eliminate the use of anti-malarial drugs and would minimize the progression and impact of drug resistance to current\/future drugs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.126"
                                            },
                                            "Text": {
                                                "val": "Assessed immune responses of candidate antigens (substance, usually a protein, that stimulates an immune response generating an antibody that recognizes the antigen) and adjuvant (agent that enhances the immune response, usually used with a vaccine antigen) formulations to optimize immunogenicity (a substances ability to provoke an immune response) and effectiveness in animal challenge models."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.829"
                                            },
                                            "Text": {
                                                "val": ": Complete the development of a human challenge model for malaria; volunteers vaccinated with a malaria vaccine candidate are deliberately infected with a malarial parasite through the bite of malaria-infected mosquitoes to assess whether or not the candidate vaccine can prevent or delay malaria infection. Test individual novel Plasmodium falciparum (causes severe form of malaria) antigens and antigen combinations in small animals."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.025"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.025"
                                            },
                                            "Text": {
                                                "val": "Will assess mechanisms of protective immunity of new malaria protein-based vaccine candidates in small animals. Will evaluate immune response of human volunteers successfully protected from infection by weakened sporozoite s (infective stage of malaria parasite transmitted by mosquitoes), to discriminate protective from non-protective immune responses."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Diagnostics and Disease Transmission Control:"
                                    },
                                    "Description": {
                                        "val": "This effort designs and prototypes new medical diagnostic and surveillance tools for the field, focusing on bedside and field-deployable diagnostic systems and refines interventions that protect Warfighters from biting insects such as sand flies (transmit leishmaniasis) and mosquitoes (transmit dengue, Japanese encephalitis, malaria, etc.)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.005"
                                            },
                                            "Text": {
                                                "val": "Incorporated the methods and assays for detecting & identifying the vector(s) (organisms that transmit infections) of interest and assays for detecting pathogens into the next-generation diagnostic system (NGDS) managed by Joint Program Executive Office for Chemical Biological Defense. Completed the dengue assay for use on mosquito samples determine if they are carrying Dengue virus."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.679"
                                            },
                                            "Text": {
                                                "val": "Research and develop pathogen specific assays for selected disease causing pathogens to expand the capability of the fielded and commercially available Rapid Human Diagnostic Devices (RHDDs). Refine pathogen detection assays and field test surveillance devices developed to detect pathogens in medically important arthropods (e.g., ticks, mosquitoes and sandflies). Test new vector repellent compounds\/formulations for application to personal protection measures i.e. uniform treatment or bednets."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.244"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.244"
                                            },
                                            "Text": {
                                                "val": "Will develop tests to detect arthropod-borne pathogens for use on field deployable detection platform. Will develop a multiplex assay (capable of detecting multiple pathogens at the same time). Will conduct field evaluations for the rapid surveillance test to detect Chikungunya virus."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Viral Threats Research"
                                    },
                                    "Description": {
                                        "val": "This effort designs and laboratory tests new vaccine candidates against hemorrhagic fever viruses, i.e. Dengue Virus, Hantaviruses Lassa fever Virus  and Crimean-Congo hemorrhagic fever virus, and assesses other non-vaccine technologies to protect against hemorrhagic fever viruses. Efforts also include establishing and maintaining of clinical trial sites worldwide."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.706"
                                            },
                                            "Text": {
                                                "val": "Identified and developed reagents, assays, and animal models to test the immunogenicity and protective effectiveness of candidate vaccines and other medical countermeasures against hemorrhagic fever viruses of military interest."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.744"
                                            },
                                            "Text": {
                                                "val": "Identify and maintain vaccine test site infrastructure for evaluation of dengue vaccine candidates in human clinical trials. Assess vaccination safety and immunogenicity data, applying this data as down selection criteria to identify superior performing vaccine candidates or administration strategies for advancement to testing of hantavirus and dengue vaccine candidates in human volunteers. Test research strategies to develop novel assays to rapidly measure hantavirus neutralizing antibodies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.241"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.241"
                                            },
                                            "Text": {
                                                "val": "Will assess host immune responses against dengue virus antigens among experimental vaccine recipients. Will expand vaccine test site infrastructure in selected communities at risk for dengue virus exposure. Will improve methods for identification and characterization of protective antibodies. Will assess immune vaccinated or un-vaccinated and exposure risk factors among human population groups in areas where dengue exposure is historically prevalent. Will assess alternative vaccine (e.g. DNA) delivery strategies such as muscle and skin electroporation (introduction of a substance into skin and muscle by electric current), needle-free jet injection for Hantavirus vaccine. Upon success with the DNA vaccine approach, will further develop additional DNA vaccines and combination vaccines against viruses-of-interest, e.g. Crimean Congo Hemorrhagic Fever) Will continue investigation of DNA vaccines to produce antibody products that could be used as post-exposure prophylactics (given after a subject is exposed to the disease pathogen to prevent further disease progression)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Bacterial Threats"
                                    },
                                    "Description": {
                                        "val": "This effort conducts studies to refine bacterial countermeasures, including vaccine candidates, to prevent diarrhea (most commonly caused by E. coli, Campylobacter and Shigella), wound infection and scrub typhus (a debilitating mite-borne disease)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.509"
                                            },
                                            "Text": {
                                                "val": "Evaluated new anti-diarrhea vaccine candidates, for Shigella, Campylobacter and E. coli, in animal models.  Evaluated safety and toxicity of selected vaccine antigens in small animals to further down-select best candidates for future human testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.130"
                                            },
                                            "Text": {
                                                "val": "Refine and evaluate vaccine candidates for Shigella and enterotoxigenic E. coli. Study clinical grade prototype diarrheal disease vaccine candidates for animal testing. Identify and prepare vaccination field trial sites.  Maintain chigger (mite) colony used as the challenge model to evaluate current Scrub typhus vaccine candidates. Identify and characterize mechanisms of antibiotic resistance occurring in scrub typhus infections."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.431"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.431"
                                            },
                                            "Text": {
                                                "val": "Based on down-selection from FY15vaccine formulations, will refine and evaluate vaccine candidates against each of the three major bacterial causes of diarrhea (Shigella, enterotoxigenic E. coli and Campylobacter). Will study clinical grade (suitable for injection into human volunteers) diarrheal disease vaccine candidates in small animals for safety and effectiveness. Will identify and prepare clinical trial field sites for evaluation of candidate vaccines. Will maintain a chigger colony used as the challenge model to evaluate the effectiveness of Scrub typhus vaccine candidates. Will study the mechanisms of immune protection to scrub typhus."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "874"
                    },
                    "ProjectTitle": {
                        "val": "Cbt Casualty Care Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "17.761"
                        },
                        "CurrentYear": {
                            "val": "15.855"
                        },
                        "BudgetYearOne": {
                            "val": "17.005"
                        },
                        "BudgetYearOneBase": {
                            "val": "17.005"
                        },
                        "BudgetYearTwo": {
                            "val": "17.416"
                        },
                        "BudgetYearThree": {
                            "val": "19.089"
                        },
                        "BudgetYearFour": {
                            "val": "18.929"
                        },
                        "BudgetYearFive": {
                            "val": "19.306"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project refines and assesses concepts, techniques, and materiel that improve survivability and ensure better medical treatment outcomes for Warfighters wounded in combat and other military operations. Combat casualty care research addresses control of severe bleeding, revival and stabilization, predictive indicators and decision aids for life support systems , treatment of burns, and traumatic brain injury (TBI). Clinical and rehabilitative medicine research addresses tissue repair including transplant technologies, orthopedic injuries, eye injuries, genitourinary (reproductive and excretory organs) injury, and face trauma.\n\nResearch involves extensive collaboration with multiple academic institutions to refine treatments for combat wounds through Armed Forces Institute of Regenerative Medicine (AFIRM). This project is coordinated with the Military Departments and other government organizations to avoid duplication.\n\nResearch conducted in this project focuses on the following five areas:\n(1) Damage Control Resuscitation\n(2) Combat Trauma Therapies\n(3) Combat Critical Care Engineering\n(4) Clinical and Rehabilitative Medicine\n(5) Traumatic Brain Injury\n\nAll drugs, biological products, and medical devices are refined in accordance with FDA regulations, which govern testing in animals to assess safety, toxicity, and effectiveness and subsequent human subject clinical trials.  \n\nPromising efforts identified in this project are further matured under PE 0603002A, project 840.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology, focus areas and the Army Modernization Strategy.\n\nWork on this project is performed by U.S. Army Institute of Surgical Research (USAISR), the U.S. Army Dental Trauma Research Detachment (USADTRD), Joint Base San Antonio-Fort Sam Houston, TX; the Walter Reed Army Institute of Research (WRAIR), Silver Spring, MD; and the AFIRM, Fort Detrick, MD. \n\nEfforts in this project support the Soldier Portfolio and the principal areas of Combat Casualty Care and Clinical and Rehabilitative Medicine."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Damage Control Resuscitation"
                                    },
                                    "Description": {
                                        "val": "This effort develops and refines knowledge products (such as clinical practice guidelines, manuals, protocols, studies, and media), materials, and systems for control of internal bleeding; minimizing the effects of traumatic blood loss; preserving, storing, and transporting blood and blood products; and resuscitation following trauma."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.100"
                                            },
                                            "Text": {
                                                "val": "Continued validation studies of portable, rapid, point-of-care devices that provide care givers information on clotting ability to guide resuscitation. Performed studies on blood product storage using technologies suitable for use under battlefield conditions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.675"
                                            },
                                            "Text": {
                                                "val": "Conduct studies to determine effective means to control bleeding when clotting ability is been impaired due to trauma.  Conduct animal studies into how plasma (fluid component of blood) in combination with other blood products and\/or drugs may stop trauma induced bleeding, reverse blood clotting problems and minimize inflammation.  These studies will improve soldier trauma survival and improve longer term treatment \/ recovery."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.903"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.903"
                                            },
                                            "Text": {
                                                "val": "Will start animal studies to explore clinical consequences of long-term application of hemorrhage (bleeding) control products and devices. Will perform animal studies leveraging FY15 work, evaluating the effectiveness of drug\/blood product \/ fluid combinations in stopping life-threatening bleeding while maximizing the potential survival of tissues surrounding the trauma \/ wound site."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Combat Trauma Therapies"
                                    },
                                    "Description": {
                                        "val": "This effort conducts research to enhance the ability to diagnose, stabilize, and accelerate wound healing and repair of damaged tissue for casualties with severe wounds to the face, mouth and extremities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.592"
                                            },
                                            "Text": {
                                                "val": "Formulated an anti-biofilm (an aggregate of microorganisms in which cells adhere to each other on a surface) gel to combat wound infections, prevent chronic infections, and hasten wound healing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.245"
                                            },
                                            "Text": {
                                                "val": "Continue development of anti-biofilm gel.  Perform studies to determine means to alleviate persistent wound inflammation subsequently preventing tissue destruction and excessive scarring."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.395"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.395"
                                            },
                                            "Text": {
                                                "val": "Will establish a quantifiable animal model of acutely (sudden onset) inflamed wounds to provide means to evaluate ability of anti-biofilm wound gel developed in FY15 along with novel products to reduce inflammation, preserve normal tissue, and prevent excessive scarring. Will start animal wound healing studies using combinations of skin components to evaluate effects on wound contraction and scarring."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Combat Critical Care Engineering"
                                    },
                                    "Description": {
                                        "val": "This effort refines diagnostic and therapeutic medical devices as well as associated algorithms, software, and data-processing systems for resuscitation, stabilization, life support, surgical support and preservation of vital organ function that can be applied across the pre-hospital, operational field setting, and initial definitive care facilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.779"
                                            },
                                            "Text": {
                                                "val": "Worked to optimize algorithms to improve fluid resuscitation and prevent hemorrhagic shock and developed decision support algorithms to guide provision of critical care to casualties at the point of injury, during transport, and in field hospital."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.369"
                                            },
                                            "Text": {
                                                "val": "Conduct studies to identify the physiological effects of optimizing blood flow returning to the heart, as a fluidless resuscitation strategy.  Continue research to optimize algorithms to improve fluid resuscitation, prevent hemorrhagic shock, and to develop decision support algorithms to guide provision of critical care to casualties at point of injury, during transport, and in field hospitals."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.993"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.993"
                                            },
                                            "Text": {
                                                "val": "Will continue studies from FY15 to identify the physiological effects of optimizing blood flow returning to the heart, as a fluidless resuscitation strategy. Will complete development of first generation patient monitors using light-based sensors and integration of blood-loss prediction algorithm. Will start retrospective analysis of trauma registry data to define doctrine for telehealth direction of triage and advanced resuscitation efforts by medics, and facilitate clinical practice guideline development supporting the Committee on Tactical Combat Casualty research requirements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Clinical and Rehabilitative Medicine"
                                    },
                                    "Description": {
                                        "val": "This effort conducts laboratory and animal studies on regenerating skin, muscle, nerve, bone tissue, and soft tissue (e.g. skin and muscle, including the genitalia and abdomen) as well as studies regarding ocular (eye) and visual system traumatic injury for the care and treatment of battle-injured casualties."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.333"
                                            },
                                            "Text": {
                                                "val": ": Down-selected novel drug delivery, diagnostic, tissue repair, and treatment strategies including drug and stem cell therapies for eye trauma. Refined and developed novel drug delivery, diagnostic, reconstructive, and regenerative strategies. Utilized and refined cell-based therapies (including stem cells; primitive cells that give rise to more specialized cell types as they develop) and tissue scaffolds (tissue-engineered grafts) in animal models to assess soft and hard tissue (e.g. bone) repair and regeneration. Exploited FY13 work evaluated burn and wound- healing bone and soft tissue repair candidate strategies and strategies to repair extremities (arms and legs), craniomaxillofacial (head, neck, face and jaw), genital, and abdominal regions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.552"
                                            },
                                            "Text": {
                                                "val": "Down-select and further develop drug delivery, diagnostic, tissue repair, and treatment strategies including drugs and stem cell therapies for eye trauma.  Based on FY14 work, evaluate candidate strategies for burn and wound-healing bone and soft tissue repair and strategies to repair extremities, craniomaxillofacial, genital, and abdominal regions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.522"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.522"
                                            },
                                            "Text": {
                                                "val": "Will down-select and further develop drug delivery, diagnostic, tissue repair, and treatment strategies including drugs and stem cell therapies for eye trauma. Will evaluate candidate strategies for burn injury, bone and soft tissue repair, and strategies to address injury to the extremities, craniomaxillofacial, genital, and abdominal regions. Studies to determine the applicability of using stem cells to repair or restore skin, testicular, muscle, and bone tissues will advance to preclinical safety and efficacy studies. Will continue studies in animal models of improved life support technologies for treatment of single and multiple organ failure."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Traumatic Brain Injury"
                                    },
                                    "Description": {
                                        "val": "This effort supports refinement of drug (includes mature drug technologies; FDA approved for other indications) and therapeutic (i.e. novel use of stem cells or selective brain cooling) strategies to manage brain injury resulting from battlefield trauma."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.957"
                                            },
                                            "Text": {
                                                "val": "Developed selective brain cooling and nerve stem cell transplantation as non-traditional therapies for Traumatic Brain Injury (TBI) and combat-relevant animal model of repeated mild TBI (mTBI) \/ concussion."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.014"
                                            },
                                            "Text": {
                                                "val": "Continue to screen and evaluate drugs and other treatment strategies (including brain cooling, stem cell constructs, sleep enhancement, and nutraceuticals (products derived from food sources that provide extra health benefits)) for treatment of TBI."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.192"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.192"
                                            },
                                            "Text": {
                                                "val": "Will down-select candidate drugs and other treatment strategies for treatment of TBI. Will characterize polytrauma (multiple trauma injuries)\/TBI animal models to develop potential TBI drug treatments. Will characterize the brain tissue neuroplasticity (ability of the nervous system to adapt to injury) to enhance and exploit that potential in treatment strategies for greater functional recovery from TBI."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "FH2"
                    },
                    "ProjectTitle": {
                        "val": "Force Health Protection - Applied Research"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.128"
                        },
                        "CurrentYear": {
                            "val": "6.058"
                        },
                        "BudgetYearOne": {
                            "val": "5.278"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.278"
                        },
                        "BudgetYearTwo": {
                            "val": "6.626"
                        },
                        "BudgetYearThree": {
                            "val": "5.688"
                        },
                        "BudgetYearFour": {
                            "val": "5.688"
                        },
                        "BudgetYearFive": {
                            "val": "5.801"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project conducts research to support applied research directed toward the sustainment of a healthy Warfighters from accession through retirement.  This research focuses on enhanced protection of Warfighters against health threats in military operations and training. Stressors that adversely affect individual Warfighter health readiness are identified and studied to refine interventions that will protect Soldiers and improve their health and performance in stressful environments. This is follow-on research that extends and applies findings from over a decade of research on Gulf War Illnesses and other chronic multi-symptom illnesses that have suspected nerve and behavioral alterations caused by environmental contaminants and deployment stressors. Key databases include the Millennium Cohort Study and the Total Army Injury and Health Outcomes Database. These databases allow us to evaluate interactions of psychological stress and other deployment and occupational stressors that affect Warfighter health behaviors.\n\nForce Health Protection applied research is conducted in close coordination with the Department of Veterans Affairs. This project contains no duplication with any effort within the Military Departments and includes direct participation by other Services working on Army projects.\n\nResearch conducted in this project focuses on the following three areas:\n(1) Millennium Cohort Research\n(2) Biomarkers of Exposure and Environmental Biomonitoring\n(3) Physiological Response and Blast and Blunt Trauma Models of Thoracic (Chest) and Pulmonary (Lung) Injuries\n \nPromising efforts identified in this project are further matured under PE 0603002A, project FH4.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology, focus areas and the Army Modernization Strategy.    \n \nWork in this project is performed by the U.S. Army Center for Environmental Health Research (USACEHR), Fort Detrick, MD; the Naval Health Research Center (NHRC), San Diego, CA; and the U.S. Army Research Institute of Environmental Medicine (USARIEM), Natick, MA. \n\nEfforts in this project support the Soldier Portfolio and the principal area of Combat Casualty Care."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Millennium Cohort Research"
                                    },
                                    "Description": {
                                        "val": "This effort supports a long-term study of Warfighters that includes psychological, physical and spiritual impacts of military service throughout their lifetime. The Millennium Cohort and Deployment Health Task area employs prospective epidemiological (study of health-event patterns in a society) surveillance research designed to address mental health and comorbid (multiple concurrent) disorders, including neurological and other chronic degenerative disorders, fitness and readiness performance outcomes, and longer-term physical and mental health illnesses and disease over the life cycle of military Servicemen and women."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.385"
                                            },
                                            "Text": {
                                                "val": "Determined the long-term and ongoing functional, physical, and mental health issues of Service members (including injury and respiratory\/environmental exposures) after military experiences including deployments, training, and other exposures of concern and characterize emerging or high-profile health threats among Service members through longitudinal assessment. These results informed preventive and intervention strategies to ensure a healthy and fit force and aided providers and leadership in mitigating adverse health outcomes associated with military experiences."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.585"
                                            },
                                            "Text": {
                                                "val": "Will evaluate the impact of child health on Family functioning and Service Member health outcome and investigate the impact of the Family's response to deployment on the mental health of the deployed Service Member."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.796"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.796"
                                            },
                                            "Text": {
                                                "val": "Will continue the FY15 evaluation of the impact of child health on Family functioning and Service Member health outcomes and investigate the impact of the Family's response to deployment on the mental health of the deployed Service Member.  Will finalize survey data collection on new and follow-up Millennium Cohort enrollees, and begin the process of detecting, correcting and removing corrupt entries in the survey data (2014-2015 survey cycle).  Will evaluate long-term functional and physical health of early cohort deployed Service Member.  Will assess negative coping behaviors such as misuse of alcohol and tobacco use in Service Member cohorts and likelihood of utilizing Department of Veterans Affairs (VA) health services."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Biomarkers of Exposure and Environmental Biomonitoring (measurement of the body’s response to toxic chemical compounds, elements, or their metabolites, in biological substances)"
                                    },
                                    "Description": {
                                        "val": "This effort supports refinement and evaluation of methods to detect environmental contamination and toxic exposure during military operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.698"
                                            },
                                            "Text": {
                                                "val": "Applied a risk ranking system to provide a screening-level assessment for hazardous exposures to the identified Army nanomaterials (materials smaller than a one tenth of a micrometer in at least one dimension). These studies identified Army nanomaterials associated with having the highest initial risk rankings of potential exposures to Warfighters."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Physiological Response and Blast and Blunt Trauma Models of Thoracic (Chest) and Pulmonary (Lung) Injury"
                                    },
                                    "Description": {
                                        "val": "This effort supports modeling and assessment of the combined effects of blast, impact, and ballistic trauma on the chest and lung system. ."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.045"
                                            },
                                            "Text": {
                                                "val": "Developed musculoskeletal models for predicting individualized physical performance outcomes of military-relevant tasks following blast or blunt impacts.  This research showed the physical decrement associated with blast or blunt impact exposure."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.473"
                                            },
                                            "Text": {
                                                "val": "Develop models to assess endurance for military relevant tasks including algorithm development to predict musculoskeletal adaptations to fatigue.  Expand biomechanical (application of mechanical principles to living organism) performance modeling to incorporate relevant tasks, such as lifting and marksmanship that use the upper body and core."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.482"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.482"
                                            },
                                            "Text": {
                                                "val": "Will refine performance models developed in FY15, that assessed endurance for military relevant tasks including algorithm development to predict musculoskeletal adaptations to fatigue. Will refine biomechanical performance models developed in FY15, to incorporate military relevant tasks, such as lifting and marksmanship that use the upper body and core."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "VB4"
                    },
                    "ProjectTitle": {
                        "val": "System  Biology And Network Science Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.733"
                        },
                        "CurrentYear": {
                            "val": "4.796"
                        },
                        "BudgetYearOne": {
                            "val": "5.282"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.282"
                        },
                        "BudgetYearTwo": {
                            "val": "5.367"
                        },
                        "BudgetYearThree": {
                            "val": "5.463"
                        },
                        "BudgetYearFour": {
                            "val": "5.516"
                        },
                        "BudgetYearFive": {
                            "val": "5.625"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This projects efforts support applied research. The primary capability of systems biology (field of study that focuses on complex interactions within biological systems, using a holistic approach) is to integration and analysis of complex human and animal study data and development of computational disease models, providing a method to discriminate unique combinations of biological molecules corresponding to clinical conditions, supporting transition of research to clinical applications.  This capability applies a systematic integrated approach to trace progression of illnesses and diseases and has already shown that the approach significantly reduces time, funds and effort invested in medical product development and refinement.  An application of systems biology is to characterize physiological pathways altered by toxic substances enabling identification of the causative toxic substances as well as to understand the injury mechanisms.  The detection\/identification of physiological markers of exposure to toxic substances can then be used to support medical countermeasure decisions or development of targeted therapeutic drugs. \n\nThese examples of more complex, yet integrated approaches to projects studying biological systems (PTSD project) have been shown to reduce both the time and expense of medical product development for the Army\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology, focus areas and the Army Modernization Strategy.   \n \nWork in this project is performed by the US Army Medical Research and Materiel Command (USAMRMC), Fort Detrick, MD \/ US Army Center for Environmental Health Research (USACEHR).\n\nEfforts in this project support the Soldier Portfolio and the principal area of Systems Biology\/Network Sciences."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Systems Biology"
                                    },
                                    "Description": {
                                        "val": "The core capability for multidisciplinary applied research in systems biology  enables integration and analysis of complex data from human and animal studies and development of computational network models, allowing us to differentiate among molecular signatures (unique combinations of biological molecules corresponding to clinical conditions) of disease, and supports transition of research to clinical applications.  Conduct applied research to identify and characterize (the substance itself and how it causes harm) toxic substances, e.g. Toxic Industrial Chemicals.  The molecular and physiological markers of intoxication are then applied to support diagnostic tools development of medical countermeasures.  Current studies are addressing exposures to industrial chemicals, toxicogenomics (study of what genes are involved with responding to a toxic substance and those genes associated with susceptibility to the toxic substance) of metals, health surveillance with assessment of micro-biome, metabolomics of heat injury, and modeling toxicity pathways."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.733"
                                            },
                                            "Text": {
                                                "val": "Continued to adapt novel state-of-the-art approaches to enable use of clinical samples from illness or diseases of military relevance, including the technology of the SysBioCube database, (data management and analytic system) to further the aims of clinical data integration with the massive datasets from multi-omic (interrelated \"omic\" fields such as proteomics, genomics, and others) approaches and other physiologic findings. Via computer analysis evaluated high-content data sets from environmental exposures to identify physiological responses-specific to the exposure to toxic substances.  Screened \/ down-selected candidate PTSD and coagulopathy (abnormal blood clotting) biomarkers for further analysis and validation of the reproducibility of diagnostic results."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.796"
                                            },
                                            "Text": {
                                                "val": "Design and utilize new tools to solve problems that arise in the course of extracting signatures (distinctive and unique characteristics of a condition or event) related to suicide, coagulopathy and chronic pain in Warfighters.  Evaluate and integrate computer modeling with high-content global molecular data sets from PTSD clinical studies and utilize PTSD animal models to further therapeutic studies \/ Follow the successful pattern of combining clinical trials with animal models, applying this to study coagulopathy and mechanisms of chronic pain. Develop and enhance capabilities to support transition of research to advanced development by incorporating newly emerging digital FDA-approved approaches.  Evaluate high-content data sets from environmental exposures using computational platforms to identify biomarkers altered in physiological pathways and develop a panel of biomarkers to evaluate adverse reactions from exposure to environmental health hazards with a focus on toxicity markers of a specific organ system.  Verify the pathway(s) (through tissues\/cells) that a toxic substance exerts its effects and validate biomarkers of that effect in the rodent model."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.282"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.282"
                                            },
                                            "Text": {
                                                "val": "Will improve and apply tools in the SysBioCube to begin to define unique molecular patterns \/ signatures related to suicidality (the likelihood of someone attempting vs. completing suicide), coagulopathy, and chronic pain.  Will evaluate and model molecular data from PTSD clinical studies to further define signatures within PTSD sufferers into distinct subgroups.  Will further refine PTSD diagnostic biomarkers, to improve therapeutic drug effectiveness and support therapeutic drug discovery. Will use PTSD biomarker in animal models to verify new therapeutic drug targeting. Will construct a Laboratory Developed test for PTSD using commercial off-the-shelf technology, and evaluate it in selected medical treatment facilities; will continue to advance tests for identification of subgroups of PTSD to aid in informing appropriate therapeutic approaches and pursue FDA approval. Will begin the design of tests for future diagnostic capabilities that would permit simultaneous measurement of multiple organ specific biomarkers indicative of exposure to a toxic substance."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}